{
    "title": "How does the design argument prove the existence of God? - Quora",
    "tags": [
        "Proof of God",
        "Existence",
        "Theology",
        "God"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lanre Olokunola",
                "href": "/profile/Lanre-Olokunola"
            },
            "answer_text": "It does not prove the existence of god in any way. E.G: A house. So, humans as can be observed have specific parts and systems arranged in highly specific intricate ways (arguably more intricate and precise than any of our designs) that performs specific functions - therefore, is more likely to be designed than not. The popular one I see here is that “ have you ever seen an iPhone come by a random process?” I took a look into the history of the intelligent design and one of its popular proponents was William paley who talked about the watchmaker argument . Some people might use the example of the eyes because it is very complex and if you remove any part of the eyes, it won’t function properly again. First and first and foremost they commit a special pleading fallacy. Special pleading is an informal fallacy wherein one cites something as an exception to a general or universal principleIf were to accept the human eye is complex and it was created by an ID, then the force behind the creation of the eye must be created by another ID. Secondly they commit a straw-man fallacyThis is just another religious argument from ignorance. Let’s assume that most biological organ couldn’t evolve by natural selection. The only thing this does is to only discredit natural selection and it doesn’t give any evidence for any ID Thirdly they misrepresent natural selectionMost of all the ID proponents misrepresent evolution by natural selection and this is actually annoying . Most creationist claim that complex organs like the eye can’t come from natural selection. But the truth is we know a lot about the eye and you can read on types of eyes1) eye-spot2) cup eyes3)pin eyes4)lens eyes The last but not the least flaw the ID proponents commit is the personal incredulity fallacy. Now most creationist don’t understand evolution by natural selection. And because you do not understand it is not an evidence for god it is an evidence of lack of understanding ",
            "date": "Answered May 4, 2020",
            "views": "126",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Freya Andrea Balinas",
                    "user_href": "/profile/Freya-Andrea-Balinas"
                },
                {
                    "user_id": "Gwyn McVay",
                    "user_href": "/profile/Gwyn-McVay"
                },
                {
                    "user_id": "Don Weingarten",
                    "user_href": "/profile/Don-Weingarten"
                },
                {
                    "user_id": "Adedamola Ayodeji Sode",
                    "user_href": "/profile/Adedamola-Ayodeji-Sode"
                },
                {
                    "user_id": "Roy Tressler",
                    "user_href": "/profile/Roy-Tressler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Johnson",
                "href": "/profile/Christopher-Johnson-604"
            },
            "answer_text": "How does the design argument prove the existence of God? The argument from design essentially holds that things that appear to be designed to us must be designed, and, since nature looks designed to some of us (which is not the case with me and many others), it must be designed. Personally, I find a distinction between human designs and what is found in nature, and note that a Samsung Smartwatch would stick out like a sore thumb sitting in the woods in a natural environment, unlike a naturally occurring thing, such as a tree or mushroom. The closest to the appearance of design that I can see in nature is certain biological life, but that order and complexity has been fully explained by evolutionary biology, in which order and complexity, as well as function, arises as the result of the non-random process of evolution. Scientists have not only observed evolution in controlled and uncontrolled conditions in the lab and field, the theory is supported by all the evidence, observations, predictions, experiments, and relevant facts, and is unanimously supported by the global scientific community. Evolution is classified as both a fact and a well-substantiated theory, and is as certain as the fact that the Earth is not flat. It is enough to disprove the argument from design, that the appearance of design in nature requires an intelligent designer. We’ve watched an unintelligent process produce new species, new ‘designs’, if you will. The problem with saying that anything with the impression of design must be designed, is that the God theists credit with design looks far more designed than anything else I can think of, and, unlike anything in nature, he is utterly perfect to boot, so he absolutely must be designed, if we follow theist apologist reasoning. If God can simply exist, looking so designed he is literally perfect, I see no reason why we, who are imperfect and far less orderly and complex, cannot exist without being designed. As it is, arguments don’t prove things. Proof is something that exists in mathematics, and we must otherwise rely on evidence and logic to get to the bottom of things. Arguments are not evidence. One can use an argument to reach a conclusion, but then the conclusion has to be supported directly by evidence. You cannot just leave it at the conclusion. There is more to it. So far, there is no evidence for the existence of God, or any superhuman intelligent designer, and humans have had thousands of years to cough it up. It’s about time we just move on, and hope that God, if he exists, will do what humans have failed to, which is to show that he exists. ",
            "date": "Answered May 10, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Don Weingarten",
                "href": "/profile/Don-Weingarten"
            },
            "answer_text": "It doesn’t. The “design argument.” otherwise known as “intelligent design” is the claim, in essence, that that which we don’t understand and/or can’t explain is so complex that it must have had a creator. It proves nothing except that we can’t explain it through our ignorance of the explanation. Theists are always frantically searching for ways to prove their fantasy is real. They will desperately try to find ways of convincing people, because their religion is a defense against fear, and they defend it fiercely. Why is it so important to them to believe in god? Here’s my opinion on that: Why do people believe in god? I believe the biggest reason is fear. It is to avoid the existential terror of living in an uncaring, unfeeling, non-sentient universe in which death is final, in which bad things can happen without warning to good people, in which good things can happen to bad people, in which there is no protection and very limited control over our fates. At any moment, things can go wrong: We can fall seriously ill, be attacked and mugged, raped, or killed, hit by a train, etc. This feeling of helplessness is difficult to live with. Now religion, illogical though it may be, is carefully constructed to protect believers from this harsh reality. It provides the concept of an afterlife to insulate us from the finality of death, and to reassure us that pains and problems of this life will be “made up for” by some glorious fantasy future of eternity in heaven. It helps keep some people in line by threatening them with eternal torture in hell. It provides a theoretically loving “Sky-Daddy” who can do miracles and magically extricate us from trouble. Some people find great comfort in this belief. Therefore, they are willing to overlook a lot. The self-contradictions in the bible. The need for ‘faith,’ or in other words, the willingness to believe with neither scientific evidence nor proof. The embarrassing fact that, for example, the churches have a long history of repression and oppression of people. When they are totally immersed in the fantasy, they develop a strong dependency upon it. This is called religious faith. The “Design Argument” is just one more rationalization. Arthur C. Clarke, the scientist and science writer, once famously said, “Any sufficiently advanced technology is indistinguishable from magic.” The fact that we can’t (yet) explain something doesn’t mean god exists and did it, it means we haven’t figured it out yet. That’s ALL it means. ",
            "date": "Answered May 4, 2020",
            "views": "78",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christopher Johnson",
                    "user_href": "/profile/Christopher-Johnson-604"
                },
                {
                    "user_id": "Gwyn McVay",
                    "user_href": "/profile/Gwyn-McVay"
                },
                {
                    "user_id": "Emmanuel Vitulano",
                    "user_href": "/profile/Emmanuel-Vitulano"
                },
                {
                    "user_id": "Rod Horning",
                    "user_href": "/profile/Rod-Horning"
                },
                {
                    "user_id": "Carlos A. Sardá Sardá",
                    "user_href": "/profile/Carlos-A-Sardá-Sardá"
                },
                {
                    "user_id": "Chuck Sears",
                    "user_href": "/profile/Chuck-Sears-3"
                },
                {
                    "user_id": "Rudy Wittshirk",
                    "user_href": "/profile/Rudy-Wittshirk"
                },
                {
                    "user_id": "Kevin Breen",
                    "user_href": "/profile/Kevin-Breen-54"
                },
                {
                    "user_id": "Mark Morris",
                    "user_href": "/profile/Mark-Morris-79"
                },
                {
                    "user_id": "Edward Cherlin",
                    "user_href": "/profile/Edward-Cherlin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donn Carter",
                "href": "/profile/Donn-Carter-1"
            },
            "answer_text": "How does the design argument prove the existence of God? A~~~~~~Not only does the D.A. NOT prove it—but it doesn’t even result in a reasonable conclusion that a god does, indeed, exist. The only way to get to that “conclusion” is to misunderstand the presentation of evidence. Something that’s very common among humans. Which is why so many arguments fro God are accepted. The logical flaws are not easily spotted by laymen. It takes a bit of effort. The design argument states that everything is designed. But the missing part is the part that demonstrates that everything is, indeed, designed. They just TELL us everything is designed—with no demonstration that everything is—in fact—designed. And if you’re already religiously superstitious, that part doesn’t jump out at you. Clear thinkers, on the other hand, recognize this highly problematic flaw in the argument. So not only does the DA not demonstrate any gods real—it doesn’t even demonstrate that everything is designed. Which is the starting premise. This is a MASSIVE failure. The DA argument is no better than a prosecutor TELLING the jury up front, “the defendant is guilty! You must find the defendant guilty!” Meanwhile, the jury sits there thinking, “Wait—where’s the evidence he’s actually guilty? Did that just TELL us the defendant is guilty with no presentation of evidence?! Is that lawyer out of his effing mind?!” ",
            "date": "Answered May 5, 2020",
            "views": "31",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gwyn McVay",
                    "user_href": "/profile/Gwyn-McVay"
                },
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Braga da Silva",
                "href": "/profile/Daniel-Braga-da-Silva"
            },
            "answer_text": "It doesn't. Arguments don't prove anything. I can make you the most elegant, most flowery, most compelling argument for why there is a 10m tall statue of Woody Woodpecker somewhere on the surface of Titan, but until I can find the statue and show that it exists, I cannot prove that it's there. You'd just have to take my word. The design argument is not the most elegant, flowery or compelling argument for the existence of a god. It is, in fact, a silly argument that flies in the face of evidence and does not really prove the existence of any deities, but rather just suggests that there should (more on that little word in a moment) be some sort of “designer”, because the proponents of the argument cannot fathom how a complex system can arise from simpler processes. Now, about that “should” - there's a popular quote that you often see here on Quora: the universe is under no obligation to make sense to you. It doesn't matter how you think the world should work. It works however it works, and all we can do is observe the universe and deduce its workings based on what we find. There is no “should” - the universe is what it is. And for fuck's sake, either stop capitalizing the word “god” or specify which of the thousands of deities you are talking about. ",
            "date": "Answered May 7, 2020",
            "views": "25",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gwyn McVay",
                    "user_href": "/profile/Gwyn-McVay"
                },
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karl Broberg",
                "href": "/profile/Karl-Broberg"
            },
            "answer_text": "It’s called “argument from design.” Teleology means that things have purpose, (also, order, harmony, intelligence, and design), proving a Supreme Mind or Intelligence. If you found a watch in the forest (the famous watchmaker argument) you’d suspect it was designed by an intelligent being and not just some accident or fluke of nature. This intelligent design of nature (ID) is see in signs of intelligence in all life forms in the form of DNA (the fingerprint or language of God). The so-called Anthropic Principle which shows earth as a privileged planet is another sign of intellgence, thus a Supreme Mind at work. In this vein, design must imply a Designer; as plans imply a Planner; art, an Artist; purpose a Purposer; order, and Orderer; and intelligence must imply a Mind at work. Teleology is an unwelcome word to Secularists who refuse to see design or purpose in nature but attribute it to “adaptation.” They fail to account for where this ability to adapt came from—God gave all creatures some adaptive abilities. ",
            "date": "Answered May 4, 2020",
            "views": "75",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Darcie Pompui",
                    "user_href": "/profile/Darcie-Pompui"
                },
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                },
                {
                    "user_id": "Michael Hart",
                    "user_href": "/profile/Michael-Hart-327"
                },
                {
                    "user_id": "Scott Mitchell",
                    "user_href": "/profile/Scott-Mitchell-438"
                }
            ]
        },
        {
            "author_info": {
                "name": "Toby Wilson",
                "href": "/profile/Toby-Wilson-10"
            },
            "answer_text": "Q: Have you ever thanked God for not believing in him? A: It doesn't, it proves the close mindedness of people who are interested only in arguing for the existence of a particular god, while ignoring millions of equally unlikely gods. It's also arrogant and ignorant, while accusing unbelievers of being arrogant and ignorant for not accepting its claims without evidence. I've heard plenty from creationists pretending that “intelligent design” isn't a religion, but a science, but it doesn't take much to uncover the religious beliefs behind it. It's creationism until genuine evidence is found and passes peer review. ",
            "date": "Answered May 5, 2020",
            "views": "26",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gwyn McVay",
                    "user_href": "/profile/Gwyn-McVay"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Jack",
                "href": "/profile/Charles-Jack-3"
            },
            "answer_text": "How does the design argument prove the existence of God? Arguments do not demonstrate the existence of things. Evidence demonstrates the existence of things. There is no evidence that any gods are real. The “design argument” proves nothing. It is just sloppy thinking. “I don’t see how this could have come about unless it was consciously designed - so it must have been designed. Therefore a designer (my favorite god!) must exist.” ",
            "date": "Answered May 4, 2020",
            "views": "81",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Christopher Johnson",
                    "user_href": "/profile/Christopher-Johnson-604"
                },
                {
                    "user_id": "Gwyn McVay",
                    "user_href": "/profile/Gwyn-McVay"
                },
                {
                    "user_id": "Rod Horning",
                    "user_href": "/profile/Rod-Horning"
                },
                {
                    "user_id": "Carlos A. Sardá Sardá",
                    "user_href": "/profile/Carlos-A-Sardá-Sardá"
                },
                {
                    "user_id": "Rudy Wittshirk",
                    "user_href": "/profile/Rudy-Wittshirk"
                },
                {
                    "user_id": "Kevin Breen",
                    "user_href": "/profile/Kevin-Breen-54"
                },
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                },
                {
                    "user_id": "Don Weingarten",
                    "user_href": "/profile/Don-Weingarten"
                },
                {
                    "user_id": "Edward Cherlin",
                    "user_href": "/profile/Edward-Cherlin"
                },
                {
                    "user_id": "Nicholas Peterman",
                    "user_href": "/profile/Nicholas-Peterman-1"
                },
                {
                    "user_id": "David Black",
                    "user_href": "/profile/David-Black-487"
                },
                {
                    "user_id": "Roy Tressler",
                    "user_href": "/profile/Roy-Tressler"
                },
                {
                    "user_id": "Dean Jay Smith",
                    "user_href": "/profile/Dean-Jay-Smith"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aryeh Rosenzweig",
                "href": "/profile/Aryeh-Rosenzweig"
            },
            "answer_text": "The same way that a watch points to a watchmaker. Just like the intricacy of all the moving watch parts working together in collective harmony can only be achieved through the input of an intelligent designer, so too the intricacy of all the elements in nature working together in collective harmony could only be achieved through the input of an intelligent designer. Apparent injustices in the world do not diminish this truth, it only means there remains a lot to reality that we do not understand. ",
            "date": "Answered May 6, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Hitchens",
                "href": "/profile/Christopher-Hitchens-8"
            },
            "answer_text": "It doesn’t. There is no argument that can prove the existence of any gods, leprechauns, gremlins or any other supernatural being Who designed the mold on your bread? Just like the universe, there is no evidence the mold was designed ",
            "date": "Answered May 4, 2020",
            "views": "51",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gwyn McVay",
                    "user_href": "/profile/Gwyn-McVay"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Brocklehurst",
                "href": "/profile/Paul-Brocklehurst-2"
            },
            "answer_text": "How does the design argument prove the existence of God? No it doesn’t but don’t take that on faith (why take any claim on faith when any baseless claim could be?) See with your own two eyes how we can know this for sure:  ",
            "date": "Answered May 4, 2020",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gwyn McVay",
                    "user_href": "/profile/Gwyn-McVay"
                },
                {
                    "user_id": "Carlos A. Sardá Sardá",
                    "user_href": "/profile/Carlos-A-Sardá-Sardá"
                },
                {
                    "user_id": "Don Weingarten",
                    "user_href": "/profile/Don-Weingarten"
                }
            ]
        },
        {
            "author_info": {
                "name": "Russell Child",
                "href": "/profile/Russell-Child-2"
            },
            "answer_text": "It doesn’t! Intelligent design is a christian scam peddled by religious fanatics as an alternative to Biological Evolution! There is ZERO evidence for any one of the four thousand plus hypothetical fake gods’ and that includes the christian hypothetical fake god thing! ",
            "date": "Answered May 5, 2020",
            "views": "29",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paula Grade",
                "href": "/profile/Paul-Graden-3"
            },
            "answer_text": "Design implies thinking and thinking implies intelligence and thinking and intelligence implies personality and that implies a person. And if that person is not a human. Than what is ",
            "date": "Answered May 4, 2020",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aaron Schafer",
                "href": "/profile/Aaron-Schafer-9"
            },
            "answer_text": "It doesn’t. I think it makes people feel good. We weren’t put together in a workshop like Pinocchio or stitched together like Frankenstein in some lab. ",
            "date": "Answered May 4, 2020",
            "views": "8",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Heinz",
                "href": "/profile/Mark-Heinz-6"
            },
            "answer_text": "It doesn’t. It provides something intriguing to think about. But, “design,” or lack thereof, can be completely in the eye of the beholder. ",
            "date": "Answered May 8, 2020",
            "views": "15",
            "upvotes": "0"
        }
    ]
}