{
    "title": "How to stop being a nihilist - Quora",
    "tags": [
        "Nihilism in Popular Culture",
        "Nihilism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Les Matheson",
                "href": "/profile/Les-Matheson-1"
            },
            "answer_text": "Presumably you’ve heard that you’re supposed to “make your own meaning”, right? I hope that letter got out to everyone by now. But when people hear that, they’re often not impressed. Let’s explore why that is — why is it that “make your own meaning” seems so unsatisfying as a solution to the problem of “oops. I realized that there’s no objective meaning to things!”? A crisis of meaning occurs because humans go along making meaning, but not realizing that they’re making it. They think that they are perceiving reality as it is, when in fact they’re making up significance, value, narrative, etc. as they go along. The meaning is their own product, and then one day they start to notice and confront this — “damn! All this time I thought life was meaningful but it was just me making stuff up or believing things that others made up! Damn!” Why is that upsetting? Because it means, in effect, that you’ve been wrong about everything you had based your choices and actions on. You thought there was some meaning underlying your choices and guiding your actions, and you thought that meaning was something bigger than you that you owed respect to. That meaning was the foundation of your existence, and then one day… poof! Gone. So then who are you and why are you bothering to do anything or try to be good or whatever? Crisis, yes? Your sense of self can come apart because it was unconsciously grounded on an untruth which has now been exposed. So this is a threat to the ego, it’s scary — and it’s depressing because the reasons that you’re used to having for doing things no longer make sense and the future collapses, as it was based on the values and beliefs that you no longer trust. This is a door with two sides. One side is labeled “despair and nothingness”, and the other side is labeled “freedom and possibility.” The trick is to be able to see why the door has two sides and then promote yourself to Head Chooser. The despair-and-nothingness side of the door is what you get if you consider that the meaning that you make is meaningless. Note how we use “meaning” twice in that sentence, you have to stop and think clearly here: is the meaning that you make devoid of value and truth and significance? If it is, then you’re right to be depressed — because that means that not only is objective reality meaningless, but YOU are also meaningless to yourself. There is literally no possibility of meaning whatsoever, because even you-making-meaning is meaningless, to you. But the other side of that door is equally valid: if you are the meaning-maker, then nothing has meaning without your permission. But… can’t you give your permission? What is stopping you from granting meaning to the meaning that you make? You were doing it for years, but you were not aware that you were the source of the meaning that you perceived. Now, you are aware. But is the meaning you make, in fact, actually significant and valuable? Who should we ask? How could there be any authority “out there” who can solve that question? How could there be any Oracle who answers the riddle about whether your meaning is significant and valuable? I’m sort of hoping that the resolution of this is obvious now, or at least you can smell it coming around the corner: it is up to you to choose whether or not you have the power to make meaning that’s meaningful. If you take the view that your meaning is meaningless, then that is the absolute truth, because you are the only possible arbiter of this truth, and you say it’s meaningless. So be it. And of course the contrary is also true: if you hold as valuable the meaning you make, then it is absolutely valuable because the only authority in existence has so deemed it. In that case, you’re utterly free to express yourself — you are the source of meaning, and you have empowered yourself to live as that and express that, and you have nobody to answer to on this topic. You’re free and fully able to put ground under your own existence, because you hold the keys to the existence of meaning. That side of the door says ‘freedom and possibility’ because it becomes clear that there’s no rules or walls holding you back. If there are rules and walls, you made them, and you don’t have to keep making them, because you accept and choose your role as the source of all such things. In general, if someone gets this clearly, it tends to produce a “lightening up.” A lighting up. An enlightening upness. Freedom and possibility are just not all that shitty. ",
            "date": "Answered June 7, 2019",
            "views": "630",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jenna K",
                    "user_href": "/profile/Jenna-K-115"
                },
                {
                    "user_id": "Javiera Fernández",
                    "user_href": "/profile/Javiera-Fernández"
                },
                {
                    "user_id": "Kat Park",
                    "user_href": "/profile/Kat-Park-9"
                },
                {
                    "user_id": "David Scotland",
                    "user_href": "/profile/David-Scotland-1"
                },
                {
                    "user_id": "Gun Nidhi Dalmia",
                    "user_href": "/profile/Gun-Nidhi-Dalmia"
                },
                {
                    "user_id": "Rakesh Nanda",
                    "user_href": "/profile/Rakesh-Nanda"
                },
                {
                    "user_id": "Roosevelt Belton Jr.",
                    "user_href": "/profile/Roosevelt-Belton-Jr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chet Hawkins",
                "href": "/profile/Chet-Hawkins"
            },
            "answer_text": "I find nihilism to be an expression of the enneatype 5 virtue. It is a component of fear, a quintessential denial of existence to relieve the self of the burden of being. This is an attempt to deflect fear. The solution is always the same to any emotive problem on one level and totally different depending of course on the specifics of that problem. Understanding truth is an aid in dealing with the problem. So, fear is always properly balanced with anger and desire. Those are the only three emotions at one level. Love is a meta-emotion comprising all three of those. Love is the source of all meaning and happiness. So nihilism is a product of facing the awe-inspiring majesty of the universe and wishing to be small enough to avoid notice, wishing in effect to not exist, except on the mental plane, as an observer. This disconnected wish is actually immoral in some ways, so I respectfully disagree with the assertion that Nihilism is acceptable. It is not. One must morally stand to life as an existing entity. The anger or spine to stand is not easy. Anger is a holding force demanding its own space and showing its presence in an effort to hold it. Invoke anger within yourself, your right to exist, a primal component of love, derived from compassion. You are equal to all and a part of all. You have a right to be here. You belong and cannot be made to unbelong. That which says otherwise is immoral. Further, as mentioned by several others that answered, desire must be used. Will to power is a means of balancing fear. You have to want to live. There are many directions you can go, or behaviors you can show. Which one will it be ? To navigate the chaos, requires desire, passion. Use it. Amid presence and the right to exist coupled with passion, nihilism is deflected properly. These tasks are not easy at all. A moral act, a true act is the single hardest thing any entity can do. Yet it remains moral duty to do so. It remains the only route to happiness. Good luck and get busy! ",
            "date": "Answered October 20, 2018",
            "views": "303",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alan Richardson",
                "href": "/profile/Alan-Richardson-18"
            },
            "answer_text": "Unless you think you can overtly deceive yourself into disbelieving something that you currently have conviction in, then the only real way is in fact to understand its falsity. As a former moral nihilist and epistemological skeptic, I can relate to such a frame of reference. The only model I have found capable of logically destroying nihilism (and thus enabling you to stop being a philosophical nihilist), is negative utilitarianism but only if arrived at via the bases briefly outlined below:  “On Efilism [Re: Jeremy Peril II]” video:  ",
            "date": "Answered October 18, 2018",
            "views": "270",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Craig",
                    "user_href": "/profile/Michael-Craig-6"
                },
                {
                    "user_id": "Javiera Fernández",
                    "user_href": "/profile/Javiera-Fernández"
                },
                {
                    "user_id": "Lawrence Bloom",
                    "user_href": "/profile/Lawrence-Bloom-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brennan Trask",
                "href": "/profile/Brennan-Trask"
            },
            "answer_text": "Hmm… how to stop thinking that any one thought, moral position or worldview has more value than another? Pretend like you care about something… liiiiiike….. not being a nihilist. Congratulations!!!! You're not a nihilist. Great job! Now, what does have value? Your life? I think it does. Your friends life? Learning? Art? Sports? Whatever you value, whatever gives you meaning, is proof that nihilism is an impossible position to live by without contradicting yourself. So the question is why? Is it all just personal taste? Are humans more valuable than a cockroach because society says so or is it something above society? And now you are a philosopher. Congratulations! Big progress today, you should be proud of yourself! I am. Philosopher Congress from the Greek meaning something like “love of wisdom”. If you like this sort of thing, you're not a nihilist. Good day!!! ",
            "date": "Answered October 18, 2018",
            "views": "227",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sheetal Deshpande",
                    "user_href": "/profile/Sheetal-Deshpande-26"
                },
                {
                    "user_id": "Dorothy Javier",
                    "user_href": "/profile/Dorothy-Javier"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Morgan",
                "href": "/profile/Joe-Morgan-99"
            },
            "answer_text": "What form of nihilism? I would say that, given that nihilism is true, you shouldn't combat it. You should work with it. Since there is no inherent meaning to life (cosmic nihilism): you are free to make your own (I would suggest meaningfulness). Since there is no objective morality (moral nihilism): you are free to make your own (I would suggest social contact theory). Since we cannot know what is true outside the fact that I exist in some form (epistemic nihilism): move forward with useful assumptions (I would suggest pragmatism). If nihilism is true, which I have found that it is, we should only work with it. Never fight the truth. ",
            "date": "Answered August 9, 2019",
            "views": "90",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mason Boyi",
                "href": "/profile/Mason-Boyi"
            },
            "answer_text": "What … is your definition of nihilism? Wisdom Vs AwakenReality Vs IntelligenceAwareness Vs Enlighten.Religions Vs The Way.Nihilism Va RealizationWho should be getting rid of their flaws or wrong interpretation of the doctrines? Who are the hoaxes? What is the whole message from Messiah, Buddhism, God's Truth? If You know the answer, you know who should be get rid, their term that wrongly define and interpreted. ",
            "date": "Answered June 9, 2019",
            "views": "96",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Krishnamoorthi Esakkymuthu",
                "href": "/profile/Krishnamoorthi-Esakkymuthu"
            },
            "answer_text": "As people evolve to become aware of the reality, nihilism will be the order of the day. The moment one realizes that the purpose of the life is nothing other than copying and pasting their life, they will do something which will make everyone happier (including themselves). See the following video by Professor Robert Sapolosky  ",
            "date": "Answered February 1, 2020",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Keyser",
                "href": "/profile/Jim-Keyser"
            },
            "answer_text": "If you mean rid yourself of unwelcome nihilistic thoughts, you would probably need to consider professional counseling. If you mean rid the world of the very concept, you can't. Nihilism exists as an alternative to every value system ever conceived. If there is belief, there is necessarily unbelief. ",
            "date": "Answered June 9, 2019",
            "views": "141",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "David Azad",
                    "user_href": "/profile/David-Azad-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Trejo",
                "href": "/profile/Paul-Trejo-1"
            },
            "answer_text": "Tackle it head-on and don't run away from it. Study it deeply and carefully formulate your responses. Finally, speak out clear and strong. ",
            "date": "Answered July 9, 2019",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Denis Fitzpatrick",
                "href": "/profile/Denis-Fitzpatrick-3"
            },
            "answer_text": "Hmmmmm…  ",
            "date": "Answered October 18, 2018",
            "views": "64",
            "upvotes": "0"
        }
    ]
}