{
    "title": "How important is it that we determine whether something will be a blessing or a curse by the way we choose to see it? - Quora",
    "tags": [
        "Inspiration",
        "Meditation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pragnajit Datta Roy",
                "href": "/profile/Pragnajit-Datta-Roy"
            },
            "answer_text": "First of all, let us try to understand the meaning of blessings or a curse, if you look at it, our life is a series of events, some events are not very pleasant or may be not what we want in life, those events we call it a curse...and then there are events that are according to our expectations or may be more.., these events we call it as blessings. Please try and understand that in reality ,no-one's life is perfect ,even if the person is the president of USA or a saint , his life would be full of ups and downs.  A person's life cannot be full of curses neither can it be only full of blessings.. so the wise person chose to focus on the blessings(good events) and downplay curses(bad events) in order to be happier. Moreover, every curse can be in a way blessing in disguise, as it can give you more insight into life and can give more depth . Now, if you are asking how do we determine whether something is a curse or a blessing, then I would say that it depends on the situation, one rule of thumb is ( there's a disclaimer here, it might not be true in all the situation, please use your wisdom), before taking a decision, check what is the long term impact of your decision , if you feel that there is a short term pain but long term gain then you have your work cut out :-). I hope I have answered your question. ",
            "date": "Answered March 14, 2016",
            "views": "194",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sanjay Choudhry",
                    "user_href": "/profile/Sanjay-Choudhry-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prateeksha Sharma, Ph.D.",
                "href": "/profile/Prateeksha-Sharma-Ph-D"
            },
            "answer_text": "I do not understand the reason for passing everything through that filter. If you just accept things the way they are and not keep colouring everything as blessing or curse- even mistakes will eventually turn out to be blessings, even failures will be learning and every person who connects with you will be a teacher. Just be centered and at ease- do not judge everything for it keeps you tense at all times and judgmental too. ",
            "date": "Answered October 30, 2014",
            "views": "83",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sanjay Choudhry",
                    "user_href": "/profile/Sanjay-Choudhry-1"
                }
            ]
        }
    ]
}