{
    "title": "How does one know if they have an artistic mind? - Quora",
    "tags": [
        "Artists and Creative Professions",
        "The Mind"
    ],
    "response": [
        {
            "author_info": {
                "name": "Faiza Aftab",
                "href": "/profile/Faiza-Aftab"
            },
            "answer_text": "Thanks for A2A Avik Paul (অভীক) An artistic personality type person uses creativity and imagination in any surprise situation. If you have the following traits then you should consider yourself as artistic- Sensitive to color,shapes , sounds and feelings in a positive way.Artistic people go in their own zone while creating some artwork and dont care about others.They solve problems by creating something new.They find peace whenever they are indulged in creating something or when they are near their supplies and working station.They take criticism in a positive way.Artistic minds are impulsive and independent.P.S.- Even if any of these points dont match to your personality ,never stop creating your artworks if you love making them… no one can decide whether you have artistic mind or not , you should always introspect about it and ask your inner self about it. ~FYI :) ",
            "date": "Answered May 7, 2019",
            "views": "908",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alexander Litty",
                    "user_href": "/profile/Alexander-Litty"
                },
                {
                    "user_id": "Aftab Alam",
                    "user_href": "/profile/Aftab-Alam-1887"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mahika Sharma",
                "href": "/profile/Mahika-Sharma-7"
            },
            "answer_text": "Yes I guess …if you spend some time with artistic people you start realising how obvious it is to spot them …..mostly if you ask people they might tell you that artistic people are messy or don't have much sense in fashion but from my expert it's not always the case …artists can be messy but some just have a rare taste in stuff which others find weird and this extends futhur to weird food habits and stuff but I feel we can never specifically point an artist by such conceptions …you need to spend some time and you start realising it youself…..the way a sunset is not merely a sunset for them..they may write a poem about it there and then or may paint the same when they reach home…..they find pleasure in the plainest stuff ….you never know ,you and I, we both may be artistic too…maybe we have not realised it yet ",
            "date": "Answered May 14, 2019",
            "views": "360",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Asimendrakumar Dhirendrakumar Dechaudhari",
                "href": "/profile/Asimendrakumar-Dhirendrakumar-Dechaudhari"
            },
            "answer_text": "Artistic mind : Sometimes it is realized by oneself, on one's own and sometimes it is detected by others like parents, teachers, friends and promoted or encouraged. Generally, society tries to brand us as general human being who leads a routine life. It imposes fixed ideas into our mind. Religions also do the same. As a child we have no alternative but to accept the tradition. But an artistic mind questions everything and tries to find out the inner meaning of everything or everything in his field of interest. He does not mind giving lot of time to his interest, even though, it may not be so remunerative. He likes what he does. He wants to go deeper and deeper into his persuit. He may like to interpret it afresh. He may try to improve upon it. All these characteristics show that you have an artistic mind. ",
            "date": "Answered May 8, 2019",
            "views": "235",
            "upvotes": " Answer requested by Avik Paul",
            "upvoters": [
                {
                    "user_id": "Avik Paul",
                    "user_href": "/profile/Avik-Paul-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam.",
                "href": "/profile/Sam-4594"
            },
            "answer_text": "Artistic mind or creative mind? well about the both you will come to know through small small day to day daily life activities. Do you like to purchase/see/ be around the aesthetically pleasing, beautiful, fine, attractive, decorative, ornamental, things? Do you always prefer and practice emotional, tasteful, graceful, stylish, elegant, subtle, exquisite, expressive people/gadgets/activities/discussions? Then you have an artistic bend of mind. You don't need to be an artist to have an artistic mind you just need to to observe your tastes and likings from the daily life to know what you are. ",
            "date": "Answered May 8, 2019",
            "views": "366",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rebecca Woods",
                    "user_href": "/profile/Rebecca-Woods-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wei Shen",
                "href": "/profile/Wei-Shen-4"
            },
            "answer_text": "Look at how differently you choose to solve a problem. Do you tackle a problem by lining up facts pros and cons in a linear fashion? Or do you make balloon circles with major categories and then draw points off them each category?( mind mapping) Or do you just write down words with lines draw all over the page to connect them.(scatter method)  All of these are viable problem solving methods.  The artistic mind will chose latter two methods. The factual linear mind will chose the first two.  All methods will get you to the solution of the problem. Might not be all at the same time. Linear does tend to be faster. But there are times when you need to use mind mapping and scatter methods at the start of a project. Then linear becomes much more useful when you are working for a timeline and details with in the timeline.  This way you are using both sides of the brain and utilizing everyone on your committee or group. Nothing is ever straight forward but is a mix of everything.  Makes it much more interesting and keeps a happier company or group. ",
            "date": "Answered November 1, 2014",
            "views": "981",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Renard Leblanc",
                "href": "/profile/Renard-Leblanc"
            },
            "answer_text": "An artist… is someone who makes art. That’s literally it. What is art? don’t ask this question, for that way lies only madness, confusion, and great gnashing of teeth… the answer will probably change by tomorrow anyway. That being said, I feel that an artist is not someone who is competent at making art, or who does so with great ease. Rather, an artist is someone who is miserable if they are not making art. Art isn’t fun, it isn’t easy, it’s a relief. At least, that’s my take. Everyone has their opinions on the subject. ",
            "date": "Answered May 7, 2019",
            "views": "138",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cheryl Noland",
                "href": "/profile/Cheryl-Noland-4"
            },
            "answer_text": "Artists come in all shapes, sizes & personalities. There isn’t one description if an artistic person. An artist isn’t always flamboyantly uninhibited or wear a beret. I attended a lecture by a very, very successful portrait artist who wore an expensive 3 piece suit, comported himself as a businessman & saw art as a business. As all artists should. Is that what you were asking? ",
            "date": "Answered April 28, 2019",
            "views": "134",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rob Menes",
                "href": "/profile/Rob-Menes"
            },
            "answer_text": "Everyone does. This is how you know: I told you. As human beings, we all have the capacity for creativity and beauty, the essence of art. However, many of us are stopped in the realization of our artistic abilities by labeling ourselves as being not artistic.  Some people have a picture of what an \"artistic mind\" might be: less logical,  less linear? Nonsense. Creativity comes from many ways to approach the world - we simply have to let ourselves explore those ways. ",
            "date": "Answered November 1, 2014",
            "views": "597",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joni West",
                    "user_href": "/profile/Joni-West"
                },
                {
                    "user_id": "Roderick House",
                    "user_href": "/profile/Roderick-House"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Lamb",
                "href": "/profile/Greg-Lamb-9"
            },
            "answer_text": "I would assume by my own experience that one would have to attend an accredited college or university and take a number of art classes. You would have to be able to show promise I.e. you like to make art and you Express talent and/or be able to take direction. Then be able to make a portfolio of work. Show your art in one group show and you are an artist. ",
            "date": "Answered April 28, 2019",
            "views": "127",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rebecca Woods",
                "href": "/profile/Rebecca-Woods-10"
            },
            "answer_text": "We are all born with innate and very creative talents. Have fun exploring what ignites your passion and Joy. I recommend a book by Julia Cameron called The Artists Way.  We are all unique artists whom have something to share with this world.  Tune in and have some fun exploring! Life is an ever so changing adventure full of growth and experience :) ",
            "date": "Answered November 14, 2014",
            "views": "423",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Avik Paul",
                    "user_href": "/profile/Avik-Paul-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Ballai",
                "href": "/profile/Michael-Ballai"
            },
            "answer_text": "Someone who regularly creates art is an artist. This doesn’t have to be gallery art, but it often is considered such. Artists are intentional about what they create and that distinguishes them from someone who just plays at the creation of art. In all likelihood, they prefer to busy about their work than talk about it, ",
            "date": "Answered May 5, 2019",
            "views": "98",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Greta Madline",
                "href": "/profile/Greta-Madline"
            },
            "answer_text": "Artistic or Creative? Being an artist includes skill and talent for creating a piece of art (sculpture, painting, music…) that expresses a certain point of view (usually the artists pov) while being creative is an ability and can be expressed in many different forms and professions. ",
            "date": "Answered December 27, 2018",
            "views": "130",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kavita Chavda",
                "href": "/profile/Kavita-Chavda"
            },
            "answer_text": "An artistic mind has an ability to think out of box, uncommon thinking from the crowd and a unique perception. If you have this, you’ve an artistic mind. ",
            "date": "Answered September 17, 2019",
            "views": "31",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Lup Ma",
                "href": "/profile/Lup-Ma"
            },
            "answer_text": "One surefire way is to produce something visual and demonstrate it to a wide diversity of viewers (not just friends & family out to *not hurt your feelings + support you). Try an uninviting crowd.  If there's some inkling, you may have some level of artist in you. Good luck! ",
            "date": "Answered November 1, 2014",
            "views": "358",
            "upvotes": "0"
        }
    ]
}