{
    "title": "How can neurology explain qualia? - Quora",
    "tags": [
        "Qualia (philosophy)",
        "Neurology",
        "Consciousness"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben Kuebrich",
                "href": "/profile/Ben-Kuebrich"
            },
            "answer_text": " Neurology cannot directly explain the emergence of qualia (subjective experience), but it can study the circuitry that might be necessary for it's emergence by using case studies of people who have experience brain damage and also techniques such as Transcranial Magnetic Stimulation (TMS) that can reversibly disrupt brain areas. For example a patient that has brain damage to the visual cortex may experience blind sight, a condition where the subject reports no subjective experience of vision, no vision-related qualia, but automatic behaviors may still have access to visual information processed by other circuits like the Lateral Geniculate Nucleus. For example a patient with blind sight may change his path walking through a room to avoid tripping on something on the floor, despite a lack of conscious awareness that something is there.  Afterwards this kins of finding can be experimentally replicated with double-blind controls using TMS to temporarily disrupt the function of the visual cortex. From this kind of condition we may conclude that the visual cortical circuitry may be important or even necessary for generating visual qualia. (More strictly it could also just be conveying this information to our linguistic circuitry that we use to report experiences.) Regardless, neurological conditions such as blind sight are important for showing that information processing alone isn't s sufficient for creating qualia, and help us get closer to understanding how qualia are generated, and therefore maybe about what qualia truly are. ",
            "date": "Answered July 6, 2016",
            "views": "521",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Soso",
                    "user_href": "/profile/Michael-Soso"
                },
                {
                    "user_id": "Ben Kuebrich",
                    "user_href": "/profile/Ben-Kuebrich-1"
                },
                {
                    "user_id": "Travis S. Allen",
                    "user_href": "/profile/Travis-S-Allen"
                },
                {
                    "user_id": "Josh Estep",
                    "user_href": "/profile/Josh-Estep-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Milton Steinberg",
                "href": "/profile/Milton-Steinberg"
            },
            "answer_text": "Although we have excellent evidence that all subjective human experiences are generated by the human brain, we have no idea how that happens. In our present mode of thinking, there is a serious disconnect between the physical brain and the behavior it generates on the one hand and the subjective experiences we have on the other. With more evidence arising that animals (fish? insects?) may also have subjective experiences, it seems possible that subjective experiences are generated by a wide variety of brains. ",
            "date": "Answered July 4, 2016",
            "views": "257",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Soso",
                    "user_href": "/profile/Michael-Soso"
                },
                {
                    "user_id": "Josh Estep",
                    "user_href": "/profile/Josh-Estep-1"
                },
                {
                    "user_id": "Bramhatanu Banerjee",
                    "user_href": "/profile/Bramhatanu-Banerjee"
                }
            ]
        }
    ]
}