{
    "title": "How to change my moral values and ethics codes - Quora",
    "tags": [
        "Ethics and Morality",
        "Values and Principles",
        "Ethics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Robert Prieto",
                "href": "/profile/Daniel-Robert-Prieto"
            },
            "answer_text": "Very few can because first you need to understand the new value which is difficult and second, you need to internalise the new value and that is really really hard. I assume you are an adult so you already have internalised morals. For example, if you were to see a thief robbing a woman at gun-point you will immediately know it is wrong and feel the need to help the woman and punish the man. You wouldn’t have to think about how and why it is wrong, you would just know. Your moral reaction would be instinctual. Practical morals come as an instinctive reaction to everything you do or as Nietzsche said, morals are like glasses that make you see everything in terms of abstract good and bad. If you understand new values that are different from the ones you already have and you want to use them in real life, you need to exercise them until they become instinctual. You need to use the new glasses until you forget you have them on. Think about using new morals as learning a new language. You can read how German grammar works and understand it rationally in an hour but, you would not have internalised it. No matter how well you know German rationally, you will not be able to talk or understand German until you know it by heart, that is until it becomes instinctual. Morality in everyday life operates like a language. Morality has an internal logic but you can it without understating the logic. For example, kids can “learn” a language but ask them about grammar and they wouldn’t know how to answer. That is, rationality helps but it is not required to use morality or language in everyday life. If you want a new morality, you need to train and practice just like you would with a new language. That being said, there are limits to what new morality you can internalise. If a new morality is too alien to your human instincts, no matter how logical it is or how hard you try, you will get nowhere. Ask every communist how far they got building a new man without personal ambition! Morality is a mix of culture and instincts and it stands in a middle point between Locke and Rousseau. Think about the right morals as the right stance to food. You know if you were to leave it to your instincts you would eat sugar and fat everyday and that would not be good. But you also know that if it was for your rationality, you would eat protein paste everyday and that wouldn’t be good either. Follow your instincts but use rationality to steer them a bit but not too much. Treat your instincts like your own impulsive and short sighted king that nonetheless you love and respect, that always works ;-) ",
            "date": "Answered December 30, 2017",
            "views": "674",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edgars Bukovskis",
                    "user_href": "/profile/Edgars-Bukovskis-1"
                },
                {
                    "user_id": "Riah Biradar",
                    "user_href": "/profile/Riah-Biradar-1"
                },
                {
                    "user_id": "Melissa Gonzalez Gaitanos",
                    "user_href": "/profile/Melissa-Gonzalez-Gaitanos"
                },
                {
                    "user_id": "Ajinkya Kulkarni",
                    "user_href": "/profile/Ajinkya-Kulkarni-7"
                }
            ]
        }
    ]
}