{
    "title": "How to solve a natural deduction problem (logic, natural deduction, math) - Quora",
    "tags": [
        "Logic",
        "Deductions",
        "Logic (thinking)",
        "Logical Reasoning",
        "Logic (mathematics)",
        "Logic (philosophy)",
        "Mathematics Education",
        "Problem Solving"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter March",
                "href": "/profile/Peter-March-3"
            },
            "answer_text": "Best bet is. not to think! Logic and maths are surrounded with the medieval delusion of the power of human reason Made worse, only worse, by the confusions of Kant. We do maths and logic by exercising well-practiced routines which are best supported by dextrous finger movements as in the abacus, the use of pencils, by long memorized series of sounds, sing songs … all the obvious things at which modernity sneers. The sneering is the poison which activates mathematical panic, block, and humiliation. A modern tragedy. The Easterners who come to our universities are notoriously competent mathematically but they were initiated into the sacred rights by flicking beads on strings. We the too proud idiots. And we actually know the precise point where the myths of reason break down. Maths as reason requires sets of identical objects which are countable. There’s no such thing since countables must be distinct or they can’t be counted. Russell’s discovery par excellence. And then Goedel’s (the spelling is in dispute so I alternate) further coup de gras that any adequate set of premises for mathematics (speaking roughly) must lead to a contradiction. My memory of the actual theorem is, disgracefully, rather woozy! Check it up before you quote. You’d think such public intellectual and public disasters would have cowed the mysterians who talk about ‘reason’, and ‘logical thought’’ like a bunch of churchy (boozy) old prelates. Even of ‘thought’ in this day and age! School for scandal. ",
            "date": "Answered September 29, 2020",
            "views": "66",
            "upvotes": "0"
        }
    ]
}