{
    "title": "How to read thought-based books (like philosophy) faster - Quora",
    "tags": [
        "Fast Reading",
        "Reading Advice",
        "Philosophy",
        "Reading",
        "Book Recommendations",
        "Self-Improvement",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nisarg Sojitra",
                "href": "/profile/Nisarg-Sojitra"
            },
            "answer_text": "There is a critical point in your question which I would like to point out. That is the word “faster”. Certain topics are there in studies that require critical thinking at its highest level. One such topic is “Philosophy”. As far philosophy is concerned, the way you want to read the book is, by reading it in parts and not in just ONE SITTING. How I like to read these books is by reading a few pages, thinking about the content from the author’s view, my view, etc. and try to summarize it. Writing is one of the best ways to understand the content. However, if you want to read thought based books faster, you can do it by summarizing important points and moving ahead as you finish. Also, by connecting the events from your life or the surroundings, you can understand the content better and move faster. In the end, remember, these aren’t romance or adventure books that you can read and understand on its face. The language may be understood by your brain bt the ‘underlying matter and the meaning’ maybe lost in lack of patience. ",
            "date": "Answered September 5, 2020",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Norman Astrin",
                "href": "/profile/Norman-Astrin"
            },
            "answer_text": "With out thinking. All you have to do is mime what’s said and take notes for counter arguments. I would prefer that you take a deep breathe and inhale any argument with out personal prejudice and limit yourself to trying to understand the person fully as you would if you were communicating with someone you would meet in the flesh. Ideas are formed wholly by humans who have spent a great time and effort to write down and give you conclusions as they see to be truth. It is easy to take on attitudes and biases; it is difficult to find the germ of truth often obtained by the time, place and condition of the observer. If you really wish to read philosophy faster, then become a philosopher. The same would apply to other subjects. Why do you have to speed as when you do, you miss the landscape. If you are doing this to obtain some sort af academic credit there are plenty of idiot books out there; not that you are one but you may remain conversant on a subject but really not be able to feel it. Good luck on your endeavor and at best read quick and yellow mark those things which you think explains best; use other colors for what you do not understand and words/expressions/capital lettered stuff which is part of the subject you are studying. I am sorry to say unless you you are eidetic there is no quick way. ",
            "date": "Answered September 4, 2020",
            "views": "24",
            "upvotes": "0"
        }
    ]
}