{
    "title": "How to not be a part of this world - Quora",
    "tags": [
        "Hypothetical Scenarios",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kane Tao",
                "href": "/profile/Kane-Tao"
            },
            "answer_text": "There is an implication in this question that should not be ignored. The definition of “this world” implies that “this world” is not “my world”. Not being part of “this world” implies you want your own world (or non-existence). For those of us who find interacting with “this world” to be a chore and stressful, our coping strategy is to create a personal space and time that gives us time to de-stress and not be interrupted by ”this world”. That can be a simple as finding a quiet corner, making sure someone else has volunteered to help with the worldly chores (e.g. minding the children) and reading a book. Personally, computer games are “my world” and so is being on a ladder working on the house (not a big fan of the neighbors wanting to talk, but hey, sometimes you gotta be peaceable and friendly like). Just know you are not alone in not wanting to be a part of “this world”. ",
            "date": "Answered October 16, 2017",
            "views": "171",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Katherine Mahon",
                "href": "/profile/Katherine-Mahon-2"
            },
            "answer_text": "You can't not be a part of the planet you live on. You can try to not be in conformity with the parts of the culture you don't agree with. But that puts you into conformity with some group. No one can live and not be part of the world. Try to live within your convictions of what is right. It is a worldly sense of morals and ethics that relies on greed, dishonesty, selfishness, love of self, lust, hate, jealousy ; that part of the world I avoid. But I have to be part of this world I occupy a space here. ",
            "date": "Answered October 16, 2017",
            "views": "78",
            "upvotes": "0"
        }
    ]
}