{
    "title": "How to become a positive-minded person - Quora",
    "tags": [
        "Open-Mindedness",
        "Optimism",
        "The Mind",
        "Understanding Self-Improvement",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Antony Lehmann",
                "href": "/profile/Antony-Lehmann"
            },
            "answer_text": "I would begin by noticing that a judgemental entity is present and may be telling you off for not ‘being a positive minded person’ and telling you that you should be able to stop it. This judge is very keen for you to keep it alive by engaging with it. By having you believe the thought “I don’t want to be a non-positive minded person’ it keeps you on a roller-coaster where you oscillate from being a positive-minded person (as a behaviour to win approval from the judge) to being a non-positive-minded person (as an act of rebellion to the judge). The whole thing is a like a game in which the judge keeps itself hidden and under-the-radar. It has moved in and disguised itself as you. You may believe you are having a dialogue with yourself but in actual fact you are having a dialogue with the judge. The judge will first have you believe that you need to control your mind and ‘be a positive minded person’. When you agree with that then it can first praise you for taking a first step; then later it can tell you off for not doing it very well; then you can rebel against it; then it can tell you off again; then you forget about it; then it reminds you; then you try harder - and so it goes on. This can go on for a lifetime. The judge is quite happy being engaged this way as it is kept alive. The way out is to recognise the judge and disengage. There are many ways of disengaging and it helps to know how you engage with it first. For example, do you engage by debating with the judge? or surrendering to it and saying it’s hopeless and becoming depressed? or do you attack it and go to war with the judge? When you come to realise it is not in your interest to engage (this may require some self-inquiry) you may be honestly able to say: “It’s OK - I am willing to be a non-positive minded person - if that is what is happening - I even look forward to being a non-positive minded person.” Why would you say this? Not as some kind of trick (which wouldn’t work anyway) but rather because it is true for you - you have recognised it is in your interest to be willing to do what your judge says you should not be willing to do. It is in your interest because you have finally disengaged and stepped off the roller-coaster. You have begun to realise who you are – you are not the judge you have been talking to all your life and thinking was you. ",
            "date": "Answered October 14, 2020",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeremy Hodges",
                    "user_href": "/profile/Jeremy-Hodges-40"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nader Labib",
                "href": "/profile/Nader-Labib-2"
            },
            "answer_text": "Think of what makes you negative (if it’s the case)! We make choices, of what to focus on, and what to ignore! The problem with the “Negative zone” , that it drags you… it keeps you inside… it creates a comfort zone! Fear has a big role to play in negativity… Start with being fully aware that you have a choice… either to think of things that are totally out of control / things that makes you feel down / things that sucks your inner energy…. or to think of what gives you power / the bright side of your life! There is always two sides … dark vs light! it’s your choice to pick one “Filter” and see the world through it… First you have to re-evaluate all the existing thoughts … your current reservoir of info… your mind’s interpretation of what you’ve experienced … once you manage to clear your head from 80% of the virtual obstacles that your mind has created.. then you can start to think positive… but your choice will remain ! so you have to be careful of what enters your mind … inspect the givens that might have bad influence on your decisions / vision / goals ! It’s a long journey, but everything starts with a single small step.. First step needs a positive thought… that “You Can”! ",
            "date": "Answered October 14, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeremy Hodges",
                    "user_href": "/profile/Jeremy-Hodges-40"
                }
            ]
        }
    ]
}