{
    "title": "How does cultural relativism imply ethical relativism? - Quora",
    "tags": [
        "Cultural Relativism",
        "Relativism"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Connelly",
                "href": "/profile/David-Connelly-10"
            },
            "answer_text": "Cultural relativism implies ethical relativism only for people who believe morality is a cultural construct. But that is not a popular view among moral philosophers since it leads to odd conclusions. Among them is that a person from one culture would have no more business evaluating the moral habits of another culture, even when it’s about torturing innocent people or genocide, than she would evaluating its table manners. If morality is only cultural, also, then it would be fruitless for people of different cultures to discuss moral issues, yet they at least think they do it fruitfully, as they do at the United Nations. That isn’t to say there aren’t moral differences that do have cultural dimensions, such as the Hindu prohibitions on harming cattle. But, even then, the difference boils down to a Hindu belief that a cow is sacred and may well be one’s descendant. There are probably fewer moral disparities among peoples than non-moral cultural disparities among them. All the world’s peoples proscribe harming innocent humans, though they may define innocence differently. All the world’s major religions prescribe some form of the Golden Rule. ",
            "date": "Answered May 17, 2018",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rex Styzens",
                    "user_href": "/profile/Rex-Styzens"
                },
                {
                    "user_id": "Daniel Delos",
                    "user_href": "/profile/Daniel-Delos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lou Reich",
                "href": "/profile/Lou-Reich"
            },
            "answer_text": "Cultural relativism does not Necessarily ( deductively) imply ethical relativism, although it suggests ethical relativism to many people. But to argue from the premise that values and practices vary from culture to culture to the conclusion that all ethical values are “relative” is to give an Inductive, probabilistic argument, where the conclusion can be well supported but not Necessarily true. ",
            "date": "Answered May 22, 2018",
            "views": "298",
            "upvotes": "0"
        }
    ]
}