{
    "title": "I'm terrified that I will go to hell no matter how many times I repent, because I know while I'm repenting that I will do the sins again. I also sometimes doubt He exists. Am I for sure going to hell? - Quora",
    "tags": [
        "Repentance (Christian doctrine)",
        "Heaven and Hell",
        "Beliefs and Religious Practices of Death and Dying",
        "The Holy Spirit",
        "Religious Advice",
        "Understanding Sin",
        "Bible Verses",
        "Hell",
        "Sin",
        "The Bible",
        "God",
        "Christianity",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marcus Anderson",
                "href": "/profile/Marcus-Anderson-78"
            },
            "answer_text": "If you’re relying on your own goodness then you will go to hell. Fortunately for us we don’t have to rely on our own goodness. We can trust in Jesus and follow him; relying on his goodness. This is the gospel message and is explained by the Apostle Paul in the Bible in the book of Romans. Paul, Jesus' chosen apostle to the Gentiles, (Romans 11:13) didn't write a gospel as in a biography of Jesus' life as Matthew, Mark, Luke and John did. But he did present the Gospel to the church in Rome, and it's recorded for us in the Bible, in his letter we commonly call the Book of Romans. Paul first explains that God is the Creator: For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men, who by their unrighteousness suppress the truth. For what can be known about God is plain to them, because God has shown it to them. For his invisible attributes, namely, his eternal power and divine nature, have been clearly perceived, ever since the creation of the world, in the things that have been made. So they are without excuse. Paul's use of creation language, where he says, ever since the creation of the world, in the things that have been made means that God's revelation of himself is universal. We can all see the stars in the night sky. We can all feel the warmth of the sun on our skin. We smell the trees of forest, we taste the good food that God causes to grow, and we experience and express love with touch through physical affection; for example a parent with a child or a wife with her husband. Paul sums up God's revelation of himself and the world's response in this way: So they are without excuse. Paul then explains how the wrath of God is revealed God doesn't display his wrath for us as we might expect. He doesn't smite us all with bolts of lightning when we sin (as he has every right to do) but rather when \"they exchanged\" good for evil, Paul tells us that God \"gave them up\" to sin. Claiming to be wise, they became fools, and exchanged the glory of the immortal God for images resembling mortal man and birds and animals and creeping things. The first thing Paul tells us is that true worship was exchanged for idolatry. Therefore God gave them up in the lusts of their hearts to impurity, to the dishonoring of their bodies among themselves, because they exchanged the truth about God for a lie and worshiped and served the creature rather than the Creator. Because they exchanged true worship for idolatry, God gave them up to lust and sexual sin. They worshiped animals, therefore God gave them up to behave like animals. And since they did not see fit to acknowledge God, God gave them up to a debased mind to do what ought not to be done. They were filled with all manner of unrighteousness, evil, covetousness, malice. They are full of envy, murder, strife, deceit, maliciousness. They are gossips, slanderers, haters of God, insolent, haughty, boastful, inventors of evil, disobedient to parents, foolish, faithless, heartless, ruthless. Though they know God's righteous decree that those who practice such things deserve to die, they not only do them but give approval to those who practice them. Paul observes that everyone knows in their heart that envy, murder, strife, deceit, and maliciousness are evil. Our consciences testify to our evil thoughts. However because we no longer acknowledge God, our debased minds say evil is good and good is evil. We override and sear our consciences. Instead of hating evil, we approve of evil. In addition to Creation and our conscience, God gave another revelation of his will: The Law that he revealed to Israel at Mt Sinai. God said: I am the Lord your God, you shall have no other Gods before meYou shall not worship false GodsYou shall never take my name in vainYou shall keep the sabbath day HolyHonor your Father and MotherYou shall not murderYou shall not commit adulteryYou shall not stealYou shall not lieYou shall never want what belongs to othersPaul explains that although God revealed his Holy Laws to the Jews they are, in fact, no better off. All the law does is show us just how evil we are. We covet and lie and steal and lust in our hearts. Paul sums up this problem in Romans 2: But if you call yourself a Jew and rely on the law and boast in God and know his will and approve what is excellent, because you are instructed from the law; and if you are sure that you yourself are a guide to the blind, a light to those who are in darkness, an instructor of the foolish, a teacher of children, having in the law the embodiment of knowledge and truth— you then who teach others, do you not teach yourself? While you preach against stealing, do you steal? You who say that one must not commit adultery, do you commit adultery? You who abhor idols, do you rob temples? You who boast in the law dishonor God by breaking the law. For, as it is written, “The name of God is blasphemed among the Gentiles because of you.” Paul explains that Jews, those who received the law, also stand condemned. \"You who boast in the law dishonor God by breaking the law.\" Therefore, Paul explains, Jews and non-Jews are all under sin: What then? Are we Jews any better off? No, not at all. For we have already charged that all, both Jews and Greeks, are under sin, as it is written: “None is righteous, no, not one;no one understands;no one seeks for God.All have turned aside; together they have become worthless;no one does good,not even one.”“Their throat is an open grave;they use their tongues to deceive.”“The venom of asps is under their lips.”“Their mouth is full of curses and bitterness.”“Their feet are swift to shed blood;in their paths are ruin and misery,and the way of peace they have not known.”“There is no fear of God before their eyes.” Paul then moves on to God's rescue plan. God loves us. He doesn't want us to perish. This is where Jesus comes in. Paul writes: But now the righteousness of God has been manifested apart from the law, although the Law and the Prophets bear witness to it— the righteousness of God through faith in Jesus Christ for all who believe. Although we are thoroughly evil and stand guilty before God, through Jesus we can be declared righteous by faith in Jesus Christ. Paul first shows how this was evident with Abraham where he writes: What then shall we say was gained by Abraham, our forefather according to the flesh? For if Abraham was justified by works, he has something to boast about, but not before God. For what does the Scripture say? “Abraham believed God, and it was counted to him as righteousness.” And Paul shows that Abraham was counted righteous through faith, even before he was circumcised (the symbol of the covenant he made with God) That is why his faith was “counted to him as righteousness.” But the words “it was counted to him” were not written for his sake alone, but for ours also. It will be counted to us who believe in him who raised from the dead Jesus our Lord, who was delivered up for our trespasses and raised for our justification. When Paul writes \"It will be counted to us who believe in him who raised from the dead Jesus our Lord, who was delivered up for our trespasses and raised for our justification.\" He is explaining that Jesus died on the cross instead of us. Jesus substituted himself for us, taking our punishment upon himself. And Jesus did this before we did any works of righteousness. Paul writes, \"but God shows his love for us in that while we were still sinners, Christ died for us.\" In other words, we are saved purely because of Jesus and not because of anything we did.Of course, Paul is quick to point out that this gift of salvation does not give us license to sin. On the contrary, if we believe in Jesus, Paul writes, \"So you also must consider yourselves dead to sin and alive to God in Christ Jesus.\" We must not keep on sinning! Paul writes: \"For the wages of sin is death, but the free gift of God is eternal life in Christ Jesus our Lord.\"Paul understand the conflict this is going to produce within us. Following Jesus does not suddenly change our hearts and make us sinless people. There is a struggle within us, and Paul acknowledges it within himself, as he writes, So I find it to be a law that when I want to do right, evil lies close at hand. For I delight in the law of God, in my inner being, but I see in my members another law waging war against the law of my mind and making me captive to the law of sin that dwells in my members. Wretched man that I am! Who will deliver me from this body of death? Thanks be to God through Jesus Christ our Lord! So then, I myself serve the law of God with my mind, but with my flesh I serve the law of sin. Paul immediately follows this pronouncement up with these words: There is therefore now no condemnation for those who are in Christ Jesus. For the law of the Spirit of life has set you free in Christ Jesus from the law of sin and death. For God has done what the law, weakened by the flesh, could not do. By sending his own Son in the likeness of sinful flesh and for sin, he condemned sin in the flesh, in order that the righteous requirement of the law might be fulfilled in us, who walk not according to the flesh but according to the Spirit. We should, therefore, ask for the Holy Spirit to live in our hearts! And if you have not asked for the Holy Spirit to live in your heart, then you definitely should! You, however, are not in the flesh but in the Spirit, if in fact the Spirit of God dwells in you. Anyone who does not have the Spirit of Christ does not belong to him. But if Christ is in you, although the body is dead because of sin, the Spirit is life because of righteousness. If the Spirit of him who raised Jesus from the dead dwells in you, he who raised Christ Jesus from the dead will also give life to your mortal bodies through his Spirit who dwells in you. Ask Jesus to send you his Holy Spirit, that the Spirit of God may dwell in you. Paul sums up his message for salvation in this way: But what does it say? “The word is near you, in your mouth and in your heart” (that is, the word of faith that we proclaim); because, if you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved. For with the heart one believes and is justified, and with the mouth one confesses and is saved. How then should we live having turned to Jesus in repentance and faith? We should follow Jesus! Paul writes: \"I appeal to you therefore, brothers, by the mercies of God, to present your bodies as a living sacrifice, holy and acceptable to God, which is your spiritual worship. Do not be conformed to this world, but be transformed by the renewal of your mind, that by testing you may discern what is the will of God, what is good and acceptable and perfect.\" Paul also reiterates the words of Jesus, as he writes: Let love be genuine. Abhor what is evil; hold fast to what is good. Love one another with brotherly affection. Outdo one another in showing honor. Do not be slothful in zeal, be fervent in spirit, serve the Lord. Rejoice in hope, be patient in tribulation, be constant in prayer. Contribute to the needs of the saints and seek to show hospitality.Bless those who persecute you; bless and do not curse them. Rejoice with those who rejoice, weep with those who weep. Live in harmony with one another. Do not be haughty, but associate with the lowly. Never be wise in your own sight. Repay no one evil for evil, but give thought to do what is honorable in the sight of all. If possible, so far as it depends on you, live peaceably with all. Beloved, never avenge yourselves, but leave it to the wrath of God, for it is written, “Vengeance is mine, I will repay, says the Lord.” To the contrary, “if your enemy is hungry, feed him; if he is thirsty, give him something to drink; for by so doing you will heap burning coals on his head.” Do not be overcome by evil, but overcome evil with good. Paul then goes on to show how following Jesus should permeate every part of our lives. Our lives should be transformed through trusting and following Jesus and the power of the Holy Spirit living in our hearts. Paul knows we can't do this in our own strength however. This is why we must pray and ask for the Holy Spirit to enable us to live for him. He understands our strength comes from God, which is why he writes in closing: Now to him who is able to strengthen you according to my gospel and the preaching of Jesus Christ, according to the revelation of the mystery that was kept secret for long ages but has now been disclosed and through the prophetic writings has been made known to all nations, according to the command of the eternal God, to bring about the obedience of faith— to the only wise God be glory forevermore through Jesus Christ! Amen. ",
            "date": "Answered October 11, 2020",
            "views": "139",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alexz Mamba",
                    "user_href": "/profile/Alexz-Mamba"
                },
                {
                    "user_id": "Josh Choi",
                    "user_href": "/profile/Josh-Choi-52"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allen Roscoe",
                "href": "/profile/Allen-Roscoe-1"
            },
            "answer_text": "The Gospel of Jesus Christ is called Good News. Jesus Christ Himself is called the Prince of Peace. As I had come to be a disciple of Christ I recieved the worthy instruction of continuing in His Word. This was to fulfill a promise set out by Jesus Christ to all those who desire Him. The Bible says that if we continue in His Word we are His Disciples indeed, and we shall know the Truth, and the Truth shall make us free. In the book of Revelation, John the Beloved Disciple of Christ gives an account of the Word's of Christ saying, “Behold I make all things New.” The two passages that I quoted up above can be found in the Bibe (KJV). But there is something more important for me to point out to you as a doer of the Truth. Though you may consider yourself to be imperfect you must be aware of and that is that His Grace is sufficient for thee! For His strength Is made perfect in weakness. Please remember that Jesus Christ is not the author of confusion, there is a sincere simplicity and understanding when it comes to making Jesus Christ the actual Lord over your life. It does take a tremendous effort and push to remove religious spirits out of your life to allow the Holy Spirit indwell you. This is very important to know. Jesus Christ was crucified by religious people, so be aware of Christ alone and the Gospel and avoid all other spiritual forms of adultery. This will help you in coming to the knowledge of the Truth that is in Him. I also would recommend fellowship with others. For the Bible says, “If we walk in the Light as He is in the Light, we have fellowship one with another, and the blood of Jesus Christ his Son cleanseth us from all sin. There more passages that I will point out to you if you wish to seek Holy Counsel with our Lord. These I have provided below so that you may be aware of the context and the references. Just remember, the Gospel of Jesus Christ is Good News and with it there is no fear. Perfect Love casteth out all fear dear friend in Christ. And remember that repentance and true submission is absolutely necessary for this. The Lord does not despise a broken or contrite heart. John 8:51 King James Version 51 Verily, verily, I say unto you, If a man keep my saying, he shall never see death. John 14:21 King James Version 21 He that hath my commandments, and keepeth them, he it is that loveth me: and he that loveth me shall be loved of my Father, and I will love him, and will manifest myself to him. John 14:15 King James Version 15 If ye love me, keep my commandments. John 14:18 King James Version 18 I will not leave you comfortless: I will come to you. 1 John 2:19 King James Version 19 They went out from us, but they were not of us; for if they had been of us, they would no doubt have continued with us: but they went out, that they might be made manifest that they were not all of us. John 8:31-32 King James Version 31 Then said Jesus to those Jews which believed on him, If ye continue in my word, then are ye my disciples indeed; 32 And ye shall know the truth, and the truth shall make you free. Luke 13:3-5 King James Version 3 I tell you, Nay: but, except ye repent, ye shall all likewise perish. 4 Or those eighteen, upon whom the tower in Siloam fell, and slew them, think ye that they were sinners above all men that dwelt in Jerusalem? 5 I tell you, Nay: but, except ye repent, ye shall all likewise perish. Hebrews 10:26-29 King James Version 26 For if we sin wilfully after that we have received the knowledge of the truth, there remaineth no more sacrifice for sins, 27 But a certain fearful looking for of judgment and fiery indignation, which shall devour the adversaries. 28 He that despised Moses' law died without mercy under two or three witnesses: 29 Of how much sorer punishment, suppose ye, shall he be thought worthy, who hath trodden under foot the Son of God, and hath counted the blood of the covenant, wherewith he was sanctified, an unholy thing, and hath done despite unto the Spirit of grace? Revelation 21:8 King James Version 8 But the fearful, and unbelieving, and the abominable, and murderers, and whoremongers, and sorcerers, and idolaters, and all liars, shall have their part in the lake which burneth with fire and brimstone: which is the second death. 2 Timothy 1:7 King James Version 7 For God hath not given us the spirit of fear; but of power, and of love, and of a sound mind. I pray that this answers some of your immediate concerns and that the Lord would show you the importance of the word Grace. For indeed He is full of Grace and Truth. May the Love of Jesus Christ be with you, as with all the saints, always and forever. Amen. —Brother Allen Roscoe, Biblical Dreams & Visions. ",
            "date": "Answered October 20, 2020",
            "views": "161",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Iris Rullan",
                    "user_href": "/profile/Iris-Rullan-1"
                },
                {
                    "user_id": "Gandy M. Rosioru",
                    "user_href": "/profile/Gandy-M-Rosioru"
                }
            ]
        }
    ]
}