{
    "title": "I've heard the sky isnt actually blue, so what color is it and why do we percieve it as blue? - Quora",
    "tags": [
        "Sky",
        "Blue (color)",
        "Visible Light",
        "Colors (vision)",
        "Science of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Nelson",
                "href": "/profile/James-Nelson-228"
            },
            "answer_text": "The color can be blue, grey, or black, or other colors depending on lighting conditions. But it’s utter nonsense to say the sky “isn’t blue” if it looks blue. Color is the label we put on our *perception*. It is not a physical property of the outside world; it’s a psychological sensation. The individual gases in small quantities appear colorless. But in large quantities they do not. Varieties of glass, or ice, or other materials can appear colorless in small amounts, but appear bluish (or a variety of other colors) in thick layers or large masses as well. We perceive the sky as blue for precisely the same reason we see other things as color: Preferential reflection and absorption of different wavelengths of light lead to different interpretations of color in our nervous system. Rayleigh scattering, the description of atmospheric interaction with light, is just one example of preferential scattering and absorption. ",
            "date": "Answered May 2, 2019",
            "views": "198",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Martin Hogbin",
                "href": "/profile/Martin-Hogbin"
            },
            "answer_text": "It is as ‘actually blue’ as much as anything else blue. Blue is a human perception so anything that we perceive as blue is blue. In fact it is perfectly reasonable to say that the sky is blue because air is blue. There are several mechanisms by which things have colour; one of them is scattering, which is what makes the sky blue, but it is no less blue than things which are blue due to absortion, for example. ",
            "date": "Answered May 2, 2019",
            "views": "44",
            "upvotes": "0"
        }
    ]
}