{
    "title": "If infinite regress is impossible then how are infinite universes a possibility? - Quora",
    "tags": [
        "Parallel Universes",
        "Multiverse",
        "Infinity (mathematics)",
        "The Universe"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Catiller",
                "href": "/profile/John-Catiller"
            },
            "answer_text": "Well our known universe had a definite start time. The end time is still a great unknown. We can only go back as far as time allows us to go in our known universe. Before that, if there was a before, is outside our universe (if there is an outside) and therefore unknowable. So we can only go back do far. As infinte regression in space, we can get smaller and smaller until we reach the point where two it is impossible to tell that two things are not occupying the same space at the same time. The smallest possible space you can have between any two objects and not be on top of each other is known as Planck distance. So in space you can only regress as small as Planck distance. This takes care of infinite regression in both time and space. Now let's go the other direction. Okay, now walk our to the edge of the universe and draw a big circle in chalk. Go ahead, I wait. Okay I see you are back. Wow, pretty big circke right? Contains anything and everything known, believe and imagined to exist right? All neatly contained within your chalk circke…. except, wait a minute, what's that outside your circle? If there is an outside then something is there right? So now we need you to go back out and draw another circke around all of the nothing that surrounds our universe! Go ahead, I'll wait. Ah, your back, well done, you have contained the universe, you have neatlt circled the great big nothing that contains our universe, all done right? Except that darn circle again. You see you contained the nothing, it all inside your circke now, do what exactly is your “nothing” beinf separated from? What is on the other side of this new circle. No matter how big you draw your circle, there will be “something” even if it is “nothing\"on the other side of it. Your circle would eventually br infinitely large, and it wil take you an infinite amount of time for you to draw. I hope that you will forgive me for waiting for you to come back this time. Take care and have fun. ",
            "date": "Answered July 7, 2017",
            "views": "133",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kahla Waslah",
                "href": "/profile/Kahla-Waslah"
            },
            "answer_text": "You see the problem for anybody to answer that guestion is you must come to a belief either in infinity or not. Thats really is a game changer… and who told you infinite regress is impossible. ? And why?also if you lean towards a pro- infinite, your aswer to a infinite number of universe's would have to change into the possibility of 1 universe with infinite variables. The downside to infinitey is , the only way to dicuss it is to put an infinity into a bag or an infinite number of infinitys into bags of infinitys.. . infinitys ..plural… is a misnomer. By definition ther can only be one infinity. Its a good question but really difficult to aswer …when i think in terms of infinity i cant go very far before i run into my natural impulse to add subtract ect. Its ,i think, hard to give a infinite answer to a finite creature. Please Let me know if you could share the reason why Infinite regress is impossible .. ",
            "date": "Answered July 7, 2017",
            "views": "77",
            "upvotes": " Answer requested by Paul Phillips",
            "upvoters": [
                {
                    "user_id": "Larry Walden",
                    "user_href": "/profile/Larry-Walden-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Comet",
                "href": "/profile/Comet-7"
            },
            "answer_text": "If infinite regress is impossible then how are infinite universes a possibility? Okay, you start with a postulate that infinite regress is impossible.Next, you demonstrate that you considered the concept of infinite universes.We observe that within the system of YOU in your lifetime, that you didn’t exist forever, so you don’t rely on infinite regression as an independent system. Now we propose an axiom that states that it is possible that conceptializing is analogous to creation, for the case of universes. Given that you have managed to consider the concept of infinity without you yourself requiring infinite regression, we have proved that infinite universities are a possibility. QED. ",
            "date": "Answered July 8, 2017",
            "views": "197",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Muhammad Ali Sayfiddinov",
                    "user_href": "/profile/Muhammad-Ali-Sayfiddinov"
                },
                {
                    "user_id": "Virgil Fenn",
                    "user_href": "/profile/Virgil-Fenn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Albert Bijzitter",
                "href": "/profile/Albert-Bijzitter"
            },
            "answer_text": "If infinite regress is impossible then how are infinite universes a possibility? Infinite regression is possible in the realms of logic and mathematics, whether it is possible in the real world is a different thing and to my best knowledge still an unanswered question. If infinite regression is impossible in the real world then an infinite regression of universes is impossible.If infinite regression is possible in the real world then an infinite regression of universes is possible.We must even be careful before drawing these two conclusions, because in \"the real world\" is a tricky thing when talking about multiple universes, we do not know whether our rules about \"the real world\" apply across universes. We derive all our ideas about \"the real world\" from what we can observe in our universe. How can we be sure that they extent to other universes? ",
            "date": "Answered July 8, 2017",
            "views": "86",
            "upvotes": " Answer requested by Paul Phillips"
        },
        {
            "author_info": {
                "name": "Simon Bridge",
                "href": "/profile/Simon-Bridge-1"
            },
            "answer_text": "The question proposes a hypothetical in which infinite regresses are impossible but infinite universes are possible… and suggests that there is a contradiction there. The way to do this without it being a contradiction is to propose that these are different kinds of infinities. I can show you how to do this without special pleading by referring you to Cantor’s hotel (look it up). The hypothetical need only rule out higher order infinities in reality. However - there is nothing holding that infinite regress is impossible. There are just situations where a regression does not work as an explanation for something. If the explanation for how the Earth is held up is that it sits on a turtle … then that begs the question: what holds the turtle up? saying it is turtles all the way down does not solve the problem … but not just because it is an infinite regression. The turtle theory involves an infinity of extra features (the turtles) compared with other models - so it falls to Occam’s Razor. Back to the Universe. An infinite Universe is “possible” in the sense that it can be the best and simplest mathematical model of the Universe that accounts for the known facts of Nature and has predictive utility. We do not know that it is possible in Nature or not… it’s just that the Universe appears to us in such a way that an infinite-flat model is the one with the easiest maths, and why do hard maths if you don’t have to am I right? ",
            "date": "Answered July 9, 2017",
            "views": "145",
            "upvotes": " Answer requested by Paul Phillips"
        },
        {
            "author_info": {
                "name": "Ali Abdulla",
                "href": "/profile/Ali-Abdulla-15"
            },
            "answer_text": "Infinite universes possibility is imagination of some theoretical physicists,no physical clear evident supporting such hypothetical postulation.So any postulation physically not verified can`t be consider a base for judgment. ",
            "date": "Answered July 7, 2017",
            "views": "62",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Virgil Fenn",
                "href": "/profile/Virgil-Fenn"
            },
            "answer_text": "Infinite regress is a concept and as such, it is possible - in the world of ideas. Infinity is a useful concept, but we should be careful in applying the concepts to reality. If you have found an actual infinity in the real world, please show it to me. ",
            "date": "Answered July 8, 2017",
            "views": "30",
            "upvotes": " Answer requested by Paul Phillips"
        },
        {
            "author_info": {
                "name": "Fred Kuryllowicz",
                "href": "/profile/Fred-Kurylowicz"
            },
            "answer_text": "The universe is considered finite but unbounded meaning it can continue to grow into what must be unbounded space until it runs into something like…………………..insert best guess here. ",
            "date": "Answered July 7, 2017",
            "views": "24",
            "upvotes": "0"
        }
    ]
}