{
    "title": "If life is full of wisdom and happiness, why are some people always sad in their lives? - Quora",
    "tags": [
        "Sources of Happiness",
        "Wisdom",
        "Developing and Maintaining Happiness",
        "Happiness",
        "Understanding Emotions",
        "Emotions",
        "Philosophy of Everyday Life",
        "Human Behavior",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mridhula Anand",
                "href": "/profile/Mridhula-Anand"
            },
            "answer_text": "There are many people who think that their life is useless.But only few realise that god has given us an amazing oppurtunity to explore many things in our life,that maybe a sad or happy events in our life. I have a friend and he will always stand in an extreme opposite side of mine, Whenever we argue about something or whenever we come up with some sort of justifications. He consideres his life as a burden and he'll never try to mingle with people or will try to accept the reality. He always blames the society and until now i don't even know how the topic of society interfered in our personal arguments! But,still he never even tries to understand things from different aspects. There are some people who are so dominant on what they speak and they want all the people to follow their footprints,But unfortunately they are so dumb enough to realise that their life itself is already in a horrible stage. Those people who think that their life is full of sadness and consider it as useless, should always remember that “Life won't adjust with us,we are the ones who make the life Beautiful\" Ofcourse, we also will have a lot of sorrows too,but we need to be flexible enough to take it in a positive way!  ",
            "date": "Answered May 29, 2020",
            "views": "536",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "Rahul Yadav",
                    "user_href": "/profile/Rahul-Yadav-216"
                },
                {
                    "user_id": "Giovanni Pezzino",
                    "user_href": "/profile/Giovanni-Pezzino-1"
                },
                {
                    "user_id": "Sumithra's Kitchen",
                    "user_href": "/profile/Sumithras-Kitchen"
                },
                {
                    "user_id": "Abinav Narayanan",
                    "user_href": "/profile/Abinav-Narayanan"
                },
                {
                    "user_id": "Himanshu Soni",
                    "user_href": "/profile/Himanshu-Soni-165"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rakshit Bhardwaj",
                "href": "/profile/Rakshit-Bhardwaj-1"
            },
            "answer_text": "Wisdom and Happiness are the states of mind. Let me help you with this. You feel wise enough to answer any questions. You feel wise enough to be of help to someone. You are wise enough to do some task. Wisdom is a quality of your state. A person cannot be wiser than everybody in every situation. It is an ideal situation, highly unlikely to happen. I might be wiser than you when it comes to problems in relationships and you might be wiser than me when it comes to career guidance (funny because my career is facing quite a few struggles right now). Same is the case with happiness. You might be happier than me when it comes to playing video games, I might be happier than you while reading a novel. Wisdom. Happiness. Sadness. Comparable states of mind. Subjective per se. So, I might be sad right now that I am not getting any breakfast to eat and I'm sitting here waiting for my mom call my name in absolute rage so that I end up running fast enough to get a plate and serve myself. But I am wise enough to answer this question of yours and happy enough to be of help. Peace. ",
            "date": "Answered May 25, 2020",
            "views": "52",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Always Vigya",
                    "user_href": "/profile/Always-Vigya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sudhir Kumar",
                "href": "/profile/Sudhir-Kumar-4924"
            },
            "answer_text": "The basic reason is the personal core of a person. If your personal core is not capable enough to share Positive vibes of life, then no matter how much wisdom you hold within yourself, then no matter how much positivity you create within yourself and with how much intensity you desire to sustain your happiness, somehow sadness, anxiety, anger, stress will intrude in your life. The simple way to overcome this is, utilize your wisdom and positivity to cure your personal core and make it healthy. It means to do something great for each one present in your personal core in such a way they can’t stop themselves to “Appreciate you, Praise you, Need you and Miss you” ….  How to do that? well explained in this video -  Stay tuned , Sudhir K.V Author | B4Success…the revolution within. ",
            "date": "Answered June 3, 2020",
            "views": "62",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Himanshu Soni",
                    "user_href": "/profile/Himanshu-Soni-165"
                }
            ]
        },
        {
            "author_info": {
                "name": "Naveena Narayanan",
                "href": "/profile/Naveena-Narayanan-5"
            },
            "answer_text": "Here you go, One evening a father told his son about the battle that goes on inside of people. He said, ‘My son, the battle is between the two “wolves” that live inside us all. One is Unhappiness. It is fear, worry, anger, jealousy, sorrow, self-pity, resentment, and inferiority. The other is Happiness. It is joy, love, hope, serenity, kindness, generosity, truth, and compassion.’ “The son thought about it for a minute and then asked his father, ‘Which wolf wins?’ “The father simply replied, ‘The one you *feed*’” *Story ends* So what we choose is what we get, we become. . . . ~Navee ",
            "date": "Answered June 2, 2020",
            "views": "42",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Siva Prakash",
                    "user_href": "/profile/Siva-Prakash-197"
                },
                {
                    "user_id": "Himanshu Soni",
                    "user_href": "/profile/Himanshu-Soni-165"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aryan Malik",
                "href": "/profile/Aryan-Malik-196"
            },
            "answer_text": "All of them don't think as you do,… so they are like this they fear things some of them give up early some of them fight,… like you some of them are still trying and don't get any answer,. ",
            "date": "Answered May 26, 2020",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Himanshu Soni",
                    "user_href": "/profile/Himanshu-Soni-165"
                }
            ]
        },
        {
            "author_info": {
                "name": "Santhosh Mulkala",
                "href": "/profile/Santhosh-Mulkala"
            },
            "answer_text": "without darkness we will not appreciate brightness, without sad how can we know the value of happiness, that's why almighty God given us sad moments, ",
            "date": "Answered May 28, 2020",
            "views": "34",
            "upvotes": " Answer requested by Himanshu Soni"
        }
    ]
}