{
    "title": "If non-physical beings exist outside our realm of reality, how can we know they exist? - Quora",
    "tags": [
        "Existence of God Debate",
        "Reality",
        "Existence",
        "Philosophy of Religion",
        "Theology",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephen Simon",
                "href": "/profile/Stephen-Simon-12"
            },
            "answer_text": "The question mentions both \"non-physical\" and \"outside of our realm of reality.\" I'm not sure whether they're meant to be, but these two descriptions strike me as different in important respects. I think the uniquely tricky part concerns the \"outside our realm of reality\" part. After all, we know of non-physical things that are within our realm of reality: namely, all the feelings, sensations, thoughts, and emotions of our conscious experience. We don't have anything like an answer for how these non-physical things can exist let alone interact with the physical world, but at least we know that these non-physical things exist. The question is not whether they exist, but how. When we shift to thinking about the possibility of beings that are \"outside of our realm of reality,\" it seems like by definition we cannot know that they exist. How could we?  Well, I suppose one can imagine at least two possibilities. One possibility is revelation: the being outside our realm could reveal itself. But if it did so, then it would no longer be entirely outside our reality. The other possibility is that we could use our logic and reasoning to conclude that something just HAD to exist in another realm even though we have no experience of it. The very notion of \"outside our realm of reality,\" however, seems to suggest something that is not even conceivable for us. Indeed, religious ideas about supernatural beings, such as angels or gods, do tend to say that they are inconceivable. So I would say that we cannot KNOW about the existence of beings outside our reality. We can only, if we so choose, make a leap of faith. And here I think many religious people would agree. After all, if a god revealed itself within our world in an unambiguous manner, there would be little challenge or nobility in \"choosing\" to believe, in opting for faith. It is precisely the fact that we can't KNOW but have to choose faith nevertheless, that makes faith valuable, for those who do have that perspective. Thus, in the end, I'm not sure that the key differences between the religious and non-religious are metaphysical ones. I suspect most religious people don't give much thought to the grand metaphysical implications in any event. They are, I suspect, focused principally on the ethical connection between faith and a life well-lived. They choose to believe despite or even because of the incomprehensibility. To others, of course, this seems silly and a waste of time. The very nature of the disagreement, however, would appear to preclude logical argument from making much difference as a means of persuasion for someone who has chosen to make the leap of faith. ",
            "date": "Answered October 11, 2015",
            "views": "18",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arthur Lim",
                    "user_href": "/profile/Arthur-Lim-44"
                },
                {
                    "user_id": "CRUSADR MUSIC",
                    "user_href": "/profile/CRUSADR-MUSIC"
                },
                {
                    "user_id": "John Doe",
                    "user_href": "/profile/John-Doe-28572"
                },
                {
                    "user_id": "Martin Goulding",
                    "user_href": "/profile/Martin-Goulding"
                },
                {
                    "user_id": "James Hollomon",
                    "user_href": "/profile/James-Hollomon"
                },
                {
                    "user_id": "Emmanuela Louis",
                    "user_href": "/profile/Emmanuela-Louis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Metivier",
                "href": "/profile/Daniel-Metivier"
            },
            "answer_text": "If non-physical beings exist outside our realm of reality, how can we know the exist? By non-physical beings I assume you mean spiritual beings.  There is no current means of either proving or disproving their existence.  If they do exist what does it matter unless they directly effect our existence.  If they can effect our existence then they have some sort of substance.  What attributes to they have that allows for them to interact with us on any level?  If they have attributes then we can test those attributes. If they don't effect our existence or interact in anyway with us then why would we assume they exist? I chose not to belief they exist as I see no direct or indirect logical evidence to support a belief in their existence.  If they have the power to interact with physical beings then they have the power to prove that they exist,  So, in essence the burden of proving that non-physical beings exists is on them not us. ",
            "date": "Answered October 17, 2015",
            "views": "308",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarah Rahmanyar",
                    "user_href": "/profile/Sarah-Rahmanyar"
                },
                {
                    "user_id": "James Hollomon",
                    "user_href": "/profile/James-Hollomon"
                },
                {
                    "user_id": "Emmanuela Louis",
                    "user_href": "/profile/Emmanuela-Louis"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Thomas",
                "href": "/profile/David-Thomas-508"
            },
            "answer_text": "Maybe there is a dimension that is forever unreachable where ghostly purple dragons play hockey on frozen orange juice. So what? There probably is very strange places somewhere, at sometime, that is utterly and completely casually separated from our existence. \"Non-physical beings\" can never be proven to not exist. That doesn't mean every fanciful idea is true. All we can ever act on is what is apparently \"real\".   If not, anything goes. That's how charlatans stay in business, \"prove this outlandish claim is wrong.\" Well no one can ultimately prove anything wrong when the proof is said to exist outside of known existence. How about we all just stick to the reality we all agree on as \"real.\" Let's stop inserting mystical or supernatural characters and phenomenon into everyday concerns. Any one of them could be real, somewhere or somehow. In the end all have the same equal standing to be false claims or assumptions. ",
            "date": "Updated January 18, 2016",
            "views": "509",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Burkhart",
                    "user_href": "/profile/Daniel-Burkhart-4"
                },
                {
                    "user_id": "James Hollomon",
                    "user_href": "/profile/James-Hollomon"
                },
                {
                    "user_id": "Emmanuela Louis",
                    "user_href": "/profile/Emmanuela-Louis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fergus Brown",
                "href": "/profile/Fergus-Brown-4"
            },
            "answer_text": "There are plenty of other good answers here, but this is my take: The obvious question is what you mean by 'outside our realm of reality'? If you take 'reality' to mean 'that which can be perceived, observed or experienced', a lot of ground can be covered. The next issue is what might be meant by 'non-physical beings'. Whilst it is within the realms of the imagination to conceive of a consciousness devoid of some form of corporeal substance, it's kind of hard to make this gel with our experience; mostly, folks will say that you can't have consciousness without first having 'being'; it's a tricky one. Asking anything about 'knowing' is a minefield, as attested to by numerous answer on Quora. Taking this in its ordinary sense as far as possible, in the absence of a stimulus which can be attributed reasonably to an external agency, 'proving' or 'knowing is going to be very difficult, more or less impossible; there's no way of gaining confirmation, or verification, of the thought. There's a lot more which could be said, but perhaps this will add a tiny bit to the thinking which is going on. :) ",
            "date": "Answered October 20, 2015",
            "views": "595",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Hollomon",
                    "user_href": "/profile/James-Hollomon"
                },
                {
                    "user_id": "Daniel Metivier",
                    "user_href": "/profile/Daniel-Metivier"
                },
                {
                    "user_id": "Emmanuela Louis",
                    "user_href": "/profile/Emmanuela-Louis"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Hollomon",
                "href": "/profile/James-Hollomon"
            },
            "answer_text": "We can know that non-physical things exist. I know joy and heartbreak exist because I can experience them. Not just that, neuroscientists can scan a person's brain and measure the changes that occurr as their moods shift. But if I suddenly quantum tunneled into a parallel universe currently inaccessible from here in any way, I might still exist, but nobody here in our Universe would be able to tell that I did, and I would not be able to reach into this Universe from my parallel one to let them know. The word \"universe\" means everything that exists. So by definition, it something actully exists in some detectable form, it is part of our realm of reality. Anything that is totally undetectable and unfalsifiable might as well not exist, because it is entirley indistinguishable from that which is nonexistent. ",
            "date": "Answered October 12, 2015",
            "views": "1",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Olivia Wilkinson",
                    "user_href": "/profile/Olivia-Wilkinson-3"
                },
                {
                    "user_id": "Olcay Moreale",
                    "user_href": "/profile/Olcay-Moreale"
                },
                {
                    "user_id": "Sharón Lynn Wyeth",
                    "user_href": "/profile/Sharón-Lynn-Wyeth"
                },
                {
                    "user_id": "Younes Jebbari",
                    "user_href": "/profile/Younes-Jebbari"
                },
                {
                    "user_id": "Emmanuela Louis",
                    "user_href": "/profile/Emmanuela-Louis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Noblett",
                "href": "/profile/Jim-Noblett"
            },
            "answer_text": "If physical beings exist outside our realm of reality, how would we know they exist?  Humans don't seem to have the ability to manifest ourselves in someway in other realms of reality, so the fact is that we cant go visit these other beings. Now, if by non physical beings you are referring to angels or demons as mentioned in the Bible,  then these are described as having the ability to do things in our physical realm. Angels do things according to Gods will, while demons (disobedient angels) only wish to harm, trick, or deceive.   So, in order for these types of non-physical beings to be made known to us in a direct way would require their choosing to do so. I and many others can attest to the fact, that sometines they do just that. ",
            "date": "Answered October 24, 2015",
            "views": "278",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Evee Rellora DV",
                    "user_href": "/profile/Evee-Rellora-DV"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Richfield",
                "href": "/profile/Jon-Richfield"
            },
            "answer_text": "I go with Justin Eiler  on this one. In fact I go further. \"Outside our realm of reality\" suggests that as far as we know they simply do not exist; in fact that they are not \"real\".  Anything inside our realm is there in the sense that it makes some material difference to something else in our realm. Conversely, anything that never can in fact make some material difference to something else in our realm does exist. It seems to me that that if-and-only-if relationship is inescapable as a definition of existence.  We can without obvious internal contradiction hypothesise things that affect other \"realities\" without affecting anything in our \"reality\", but  our relationship to anything of the type recalls the Chinese indifference theorem: \"However great your triumphs or how tragic your disasters, over a billion Chinese could hardly care less.\" Similarly, how do we go about caring about something that doesn't exist, certainly not in any sense that we could conceive or affect? ",
            "date": "Answered October 11, 2015",
            "views": "700",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "James Hollomon",
                    "user_href": "/profile/James-Hollomon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barry Hampe",
                "href": "/profile/Barry-Hampe"
            },
            "answer_text": "If non-physical beings exist outside our realm of reality, how can we know they exist? It would seem to me that if they exist entirely outside our realm of reality, we would never know that they exist and it would not matter. They would be like aliens in another galaxy -- unknown and unimportant. On the other hand, if they exist outside our realm of reality, but are in some way active within our realm of reality, we should be able to detect them. I assume that not detecting such entities either means they do not exist or they do not matter. ",
            "date": "Answered October 11, 2015",
            "views": "692",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adam Borchardt",
                    "user_href": "/profile/Adam-Borchardt"
                },
                {
                    "user_id": "Vikrant Vaidya",
                    "user_href": "/profile/Vikrant-Vaidya"
                },
                {
                    "user_id": "Rohit Kundalkar",
                    "user_href": "/profile/Rohit-Kundalkar"
                },
                {
                    "user_id": "Kelvin Chua",
                    "user_href": "/profile/Kelvin-Chua"
                },
                {
                    "user_id": "Edward Azkarra",
                    "user_href": "/profile/Edward-Azkarra"
                },
                {
                    "user_id": "Cory Radebaugh",
                    "user_href": "/profile/Cory-Radebaugh"
                },
                {
                    "user_id": "Toby Wilson",
                    "user_href": "/profile/Toby-Wilson-10"
                },
                {
                    "user_id": "James Hollomon",
                    "user_href": "/profile/James-Hollomon"
                },
                {
                    "user_id": "Joe Cardoso",
                    "user_href": "/profile/Joe-Cardoso"
                },
                {
                    "user_id": "Tyler Williams",
                    "user_href": "/profile/Tyler-Williams-10"
                },
                {
                    "user_id": "Patricia Rahikainen",
                    "user_href": "/profile/Patricia-Rahikainen"
                },
                {
                    "user_id": "David Thomas",
                    "user_href": "/profile/David-Thomas-508"
                }
            ]
        },
        {
            "author_info": {
                "name": "Al Klein",
                "href": "/profile/Al-Klein"
            },
            "answer_text": "\"Outside our realm of reality\" means \"not real\".  If something isn't real, that means it doesn't exist.  (There are no \"realms of reality\" - there's reality and there's make-believe.) As for non-physical beings, we have no idea, scientifically, how there can be an intelligence, or even a non-intelligent \"being\", that's not physical. So your question boils down to \"how can we detect something we can't define, that can't exist?\", and the answer is \"we can't\". ",
            "date": "Answered October 24, 2015",
            "views": "952",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mike Gleason",
                    "user_href": "/profile/Mike-Gleason-2"
                },
                {
                    "user_id": "Jim Euclid",
                    "user_href": "/profile/Jim-Euclid"
                },
                {
                    "user_id": "Malcolm Sargeant",
                    "user_href": "/profile/Malcolm-Sargeant"
                },
                {
                    "user_id": "Justin Tormey",
                    "user_href": "/profile/Justin-Tormey-1"
                },
                {
                    "user_id": "James Dozier",
                    "user_href": "/profile/James-Dozier-2"
                },
                {
                    "user_id": "Emmanuela Louis",
                    "user_href": "/profile/Emmanuela-Louis"
                }
            ]
        },
        {
            "author_info": {
                "name": "J.M. Schomburg",
                "href": "/profile/J-M-Schomburg"
            },
            "answer_text": "We wouldn't. Even their 'manipulations' of our reality would be detectable as an 'unexplained reaction', even if the source of the 'action' is undetectable; this is how we discovered black holes (light bending around certain 'empty' areas of space, and the same drawing planets), for example. So, not only have we not detected any 'beings' outside our 'reality'; we have, so far, not found any signs of 'unexplainable mysterious intervention', either. And, anyhow, the thing to do in this sort of situation is to say: \"I don't know, let's look further!\", not: \"So therefore this money-and-subservience-demanding human's evidenceless claim!\". When one opts for the latter, all they are doing is demonstrating their dependance on that human to decide things for them (and their fear of living without that 'service'). But I digress. Hm, maybe not. ",
            "date": "Answered October 20, 2015",
            "views": "217",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Hollomon",
                    "user_href": "/profile/James-Hollomon"
                },
                {
                    "user_id": "Dodie Wallace",
                    "user_href": "/profile/Dodie-Wallace"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roberto Vilar",
                "href": "/profile/Roberto-Vilar"
            },
            "answer_text": "Reality is not a clear concept, actualy it never was. The multiverse theory assumes that an infinity of universes spread through an eternity of time. Each of those bubles could encapsulate a different reality and maybe some of those realities could interact with our universe. So invisible beings could be simply living in other possible worlds and somehow interacting with us. In fact some of those beings could be you and me experiencing different possible presents or futurs. (Interstellar movie plays with this concept) All that sounds not very usefull at the end, but still, those are the ways some scientists are exploring, to solve some difficult paradoxes within our actual reality. Thanks for your A2A. ",
            "date": "Answered October 11, 2015",
            "views": "373",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dodie Wallace",
                    "user_href": "/profile/Dodie-Wallace"
                },
                {
                    "user_id": "Emmanuela Louis",
                    "user_href": "/profile/Emmanuela-Louis"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SO-92"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicholas Curtis",
                "href": "/profile/Nicholas-Curtis-25"
            },
            "answer_text": "Existence is discrete persistent physical existence in Space and Time. Nothing immaterial exists. ",
            "date": "Answered March 20, 2020",
            "views": "16",
            "upvotes": "0"
        }
    ]
}