{
    "title": "If nothing exists, does nothing exist? - Quora",
    "tags": [
        "Nothing",
        "Existence",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Owen Pestalozzi",
                "href": "/profile/Owen-Pestalozzi"
            },
            "answer_text": "The question is quite tricky. It says “If nothing exists, does nothing exist?” Logically, the answer would be yes, but it is a qualified yes, an affirmation based simply on the given assumption, supposition, if. In short “if x, therefore x” where x= “nothing”. But if we remove the assumption, the hypothetical supposition, and simply ask “Does nothing exist?”, then the answer needs another premise, a premise other than the assumption that it exists. For us to be able to answer the question, we have to define or have a more or less common understanding of what nothing and what existence mean. Hence, the answers would depend on the definitions of what these two terms mean. (Actually we may also need to define or have a more or less common understanding of what do means, for in its declarative form the sentence would not only be “Nothing exists,” but could also be “Nothing does exist” or it can even be “There is nothing which does the [act of] existing.”) Anyway, I read some answers here, which I find confusing or confused. Big Bang Theory (at least the present so-called standard model) does not assert that everything came out of nothing. What it states is that the present notion of space and time must have begun around 13.6 million years ago, beyond which the current understanding of science is not yet able to explain (FYI: I am not a ‘fan’ of BBT, I am just trying to clarify.)Zero is not necessarily nothing. For instance, it is a specific point in the number line from which positive numbers follow to the right and negative numbers to rhe left. Zero degree celsius is not the absence of temperature nor of the Celsius measuring unit, it is in fact a specific amount of temperature or a specific point in the thermometer at which liquid water turns to ice.In philosophy, i.e., in materialism, matter is the substance of all things, which includes the non-matter physical entities in physics. Meanwhile energy can be construed as a property of matter.In physics, “nothing comes out of nothing” is but an expression of a law of thermodynamics, the conservation of mass and energy.Now, I know I have not answered the question, but I hope this helps. ",
            "date": "Answered July 1, 2017",
            "views": "28",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Max Danil",
                    "user_href": "/profile/Max-Danil"
                },
                {
                    "user_id": "Elixir Aura",
                    "user_href": "/profile/Elixir-Aura"
                },
                {
                    "user_id": "Chinmayee Dahake",
                    "user_href": "/profile/Chinmayee-Dahake"
                },
                {
                    "user_id": "Pti Mek",
                    "user_href": "/profile/Pti-Mek"
                },
                {
                    "user_id": "Valerie Yip",
                    "user_href": "/profile/Valerie-Yip-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sylvain Chamberlain",
                "href": "/profile/Sylvain-Chamberlain-1"
            },
            "answer_text": "nothing is a compound of no and thing. so we enter the debate on fundamental nature of…. noumena is a state “where” no “thing” exists. This statement assumes that thing = matter and that no-thing = no-matter. We know from Einstein that matter is equitable to energy and represents some form of it. So Noumena can be seen as a state of quiescent energy not producing but capable of producing any-thing. This puts your question of, “Does nothing exist?” as a oxymoron if we accept that “exist” equates to matter as opposed to no-matter (doesn’t exist). If we can accept that all matter and the observable cosmos are a mixed bag of matter and energies, perhaps the analogy of Phenomena and Noumena are graceful binary and define the two states of matter and non-matter (energy). Therefore nothing, (Noumena) is by virtue of not existing, extant. Threefold Lotus Kwoon Core Teachings of Buddha ",
            "date": "Answered June 23, 2017",
            "views": "789",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Deak",
                    "user_href": "/profile/David-Deak-1"
                },
                {
                    "user_id": "Marcos Felix",
                    "user_href": "/profile/Marcos-Felix-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Mark",
                "href": "/profile/Kevin-Mark-17"
            },
            "answer_text": "I choose to see this as a playful question of the mind, and one that points to the limitation of language as we usually think of it. It is not a question of the heart. Take the expression “Nothing is the matter.” It is like saying “Matter is nothing.” In the language of physics we see matter as a form of energy vibrating at a certain frequency: “not a thing.” So now we have an unconventional sense of the familiar expression, “Nothing’s the matter.” Matter is energy. Looking at “nothing” as equivalent to “energy” allows us to rephrase the original question in this way: “If energy exists, does energy exist?” Now it is clearly an oxymoron. To which we can reply: “The answer is there is no question.” I like this answer when it comes to matters of the heart. Life is a mystery to be embraced and enjoyed. Questions have their place, but not on the deepest levels of “existence” where we need to learn the language of love that swells within the human heart. Kevin Mark's answer to What do we have when we have nothing? ",
            "date": "Updated July 16, 2017",
            "views": "716",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ackram Barhar",
                "href": "/profile/Ackram-Barhar"
            },
            "answer_text": "Yes, if nothing exists, nothing exist. If everything exist, nothing can exist in everything. Think of everything as a set. In this set you could have nothing, zero, all odd integers, even integers, earth, all humans, etc. That is why the universe starts from everything and end at everything. Kinda like life, the beginning of life is a virus, the end of life is a virus. If you start with everything, you will end with everything. Within everything, you create some things like a car, a human, a sun, nothing, darkness, etc. Quantum field theories back the idea we came from everything. The electron field, the positron field, the vaccuum field, Higgs field, etc. already existed and forever existed. We can trigger particle out from these fields by its energy level. ",
            "date": "Answered June 22, 2017",
            "views": "811",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brad Kelly",
                    "user_href": "/profile/Brad-Kelly-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prasad Chitta",
                "href": "/profile/Prasad-Chitta"
            },
            "answer_text": "Nothing appears to exist. It has no existence. If nothing exists, then it becomes something and it no longer be nothing. Does 0 exists? No there can be 1 stone, 2 stones … how can there be 0 stones? Nothing is a concept to negate something. Something exists and nothing negates existence of something. So, nothing of any something is same void. What really exists is everything. Everything exists always. Not even something. Something that has origin will be destroyed at sometime. Neither nothing, nor something really exist! Does it help?  If interested read posts from Plain Truths on several things focusing on explaining Nothing, Something and Everything. ",
            "date": "Answered July 3, 2017",
            "views": "14",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rubén Palma",
                    "user_href": "/profile/Rubén-Palma"
                },
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-26397"
                },
                {
                    "user_id": "Techi Akey",
                    "user_href": "/profile/Techi-Akey-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Pawlak",
                "href": "/profile/Joshua-Pawlak"
            },
            "answer_text": "It depends on what you mean. If you mean “nothing” as an abstract concept, then yes, I would say that it exists. There is a concrete definition of “nothing” and I can use it in context just like any other word. If, however, you mean it as a tangible thing, it gets a bit more complicated. Space, for example, is in essence nothing. It is an empty, dark, cold vacuum. So, in one sense it does exist, because space is a very real fact in our universe, but at the same time, it doesn't exist, because it is defined as the absence of “things”. In the end, however, it’s up to you, to make your own conclusion. ",
            "date": "Answered July 1, 2017",
            "views": "598",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Graeme McRae",
                    "user_href": "/profile/Graeme-McRae"
                },
                {
                    "user_id": "Yavor Hadzhiev",
                    "user_href": "/profile/Yavor-Hadzhiev"
                },
                {
                    "user_id": "Fabio Santiago Morales Galvis",
                    "user_href": "/profile/Fabio-Santiago-Morales-Galvis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fistos Mohlatlole",
                "href": "/profile/Fistos-Mohlatlole"
            },
            "answer_text": "Definition: Nothing is defined as the absence of something. Example 1: If I ask you what do you see in the dark, you are most likely to say “ I see nothing”, thus the absence of light is nothing in respect to your observation(light). Example 2: Have you ever heard the expression “I have don NOTHING wrong”, the absence of wrong doing is described as nothing. Conclusion:The concept of nothing does exist but it exist an abstract(you can not point, touch, feel or see), which is relative towards the meaning of something,so the next time you say ‘nothing, it might mean your speech lacks sense. ",
            "date": "Answered October 11, 2017",
            "views": "453",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kieran Tilley",
                    "user_href": "/profile/Kieran-Tilley-1"
                },
                {
                    "user_id": "Pedro Henrique Dadalt de Queiroz",
                    "user_href": "/profile/Pedro-Henrique-Dadalt-de-Queiroz"
                },
                {
                    "user_id": "Malsawmtluanga Hmar",
                    "user_href": "/profile/Malsawmtluanga-Hmar-3"
                },
                {
                    "user_id": "Jan Zavec",
                    "user_href": "/profile/Jan-Zavec"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sheila Davis",
                "href": "/profile/Sheila-Davis-36"
            },
            "answer_text": "Science says nothing existed, then suddenly a second a second or so, through Big Bang Theory everything came into existence. So the question becomes, do we exist since we came from nothing. The way humans think, is if you can see it, touch it, smell it, or hear it, it exist. But how is it possible from the human point of view,that nothing could create something. They say God didn't do it, then in the scientific contradiction says it happened… everything came from nothing. ",
            "date": "Answered June 22, 2017",
            "views": "151",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Brocklehurst",
                "href": "/profile/Paul-Brocklehurst-2"
            },
            "answer_text": "If nothing exists, does nothing exist? I’m trying to understand what you could mean by that. Every interpretation is meaningless: If nothing exists, You mean if there is something that isn’t anything? How could that be true? does nothing exist? By definition nothing can’t be anything otherwise it’s something isn’t it? ",
            "date": "Answered June 20, 2020",
            "views": "109",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ganesh Kalyanaraman",
                "href": "/profile/Ganesh-Kalyanaraman-1"
            },
            "answer_text": "When you analyse existence deeply it can be proved that existence always refers to something real or imaginary. Either something real exists or something imaginary and unreal exists. As such nothing exists is itself a fallacy. It can neither be correct nor true to say that nothing exists. If you insist that nothing exists it can be logically proved that you are wrong because there is your mind imagining that nothing exists and when your mind is present it is wrong to say that nothing exists. As the question is illogical there is no answer possible. However when you consider a closed system like a vacuum tube, it is true that nothing exists in a vacuum. It only means that matter does not exist in the vacuum. If we replace the word 'nothing' by 'no matter' it will be right to say that if no matter exists, then no matter exists. ",
            "date": "Answered August 1, 2020",
            "views": "79",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ethan Kahn",
                "href": "/profile/Ethan-Kahn-6"
            },
            "answer_text": "Let’s start here. Thingness = the essence of existence Therefore, nothingness = the essence of non-existence Nothing does not exist, because if it existed, it would be a thing (and things are not no-thing). So nothing does not exist, however, it does subsist. Subsistence is just a broader category than existence. It’s a category that includes both existence and non-existence as well as any other concept for any other type of “…-existence.” ",
            "date": "Answered September 15, 2018",
            "views": "252",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohsen Djalalian",
                "href": "/profile/Mohsen-Djalalian"
            },
            "answer_text": "when universe foundation is space with time as a property, even nothing refers to a space with time of that nothing remains as nothing. Mathematically Nothing can be referred by zero. Physically Nothing could refer to a reference what’s before BB. ",
            "date": "Answered June 14, 2020",
            "views": "94",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Johnny Edwards",
                "href": "/profile/Johnny-Edwards-15"
            },
            "answer_text": "Yes . The smallest atom smallest thing in the world that everything everyone is made from that is the round dot and positive and negative electrons turning around that dot . And what’s inside that dot , is nothing empty just empty spot , that’s what evryinting made from . From base of that which is empty lool ",
            "date": "Answered October 11, 2017",
            "views": "171",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Om Sharma",
                "href": "/profile/Om-Sharma-132"
            },
            "answer_text": "Everything exists, which therefore means nothing exists, but if nothing exists, how can everything exist? The mystery to the universe. ",
            "date": "Answered July 1, 2017",
            "views": "282",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kristy",
                    "user_href": "/profile/Kristy-218"
                },
                {
                    "user_id": "Sharma",
                    "user_href": "/profile/Sharma-125"
                },
                {
                    "user_id": "Fabio Santiago Morales Galvis",
                    "user_href": "/profile/Fabio-Santiago-Morales-Galvis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trilce Marsh",
                "href": "/profile/Trilce-Marsh"
            },
            "answer_text": "The nothing is an unexplained law, it seems to rule an endless emptiness, vacuity, where not even a proclaimed space would ever even exists. How to advert the nothing, as an existing absence of the everything? Only if is into a different dimension. ",
            "date": "Answered June 9, 2020",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jan Kobuszewski",
                "href": "/profile/Jan-Kobuszewski"
            },
            "answer_text": "A Book named “A Universe from Nothing” presents premise made by Lawrence M. Krauss. It is an interesting piece of work where he struggles to explain to layman scientific jargon of “nothingness”. ",
            "date": "Answered July 2, 2017",
            "views": "258",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lansing Kentucky",
                    "user_href": "/profile/Lansing-Kentucky"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shmuel Ross",
                "href": "/profile/Shmuel-Ross-1"
            },
            "answer_text": "“Nothing” cannot exist as a separate entity. It simply connotes a lack of a thing. If there isn't a thing, there is nothing. Therefore, if nothing (no thing) exists, “nothing” does not exist, because “nothing” physically cannot exist. Nothing is simply the byproduct of not having a thing. ",
            "date": "Answered June 22, 2017",
            "views": "241",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Skylar Grand",
                "href": "/profile/Skylar-Grand"
            },
            "answer_text": "Well yea, if nothing exists, nothing exists. (Nothing existing) = (nothing existing)(Apple) = (Apple)(Fruit salad) = (Fruit salad) ",
            "date": "Answered June 23, 2017",
            "views": "88",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mason Kelsey",
                "href": "/profile/Mason-Kelsey-4"
            },
            "answer_text": "You are treating nothing as if it was something. Only somethings exist. You cannot even say “Nothing exists” because that is treating nothing as something. ",
            "date": "Answered October 11, 2017",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard A Salmeron",
                "href": "/profile/Richard-A-Salmeron"
            },
            "answer_text": "No. ",
            "date": "Answered May 29, 2020",
            "views": "35",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Fabio Santiago Morales Galvis",
                    "user_href": "/profile/Fabio-Santiago-Morales-Galvis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chelsea Miriah Boyd",
                "href": "/profile/Chelsea-Miriah-Boyd"
            },
            "answer_text": "Only with the existence of something [sentient], can a question like that be asked, therefore there must be something, so something exists. ",
            "date": "Answered November 27, 2019",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Genji Chandra Sekhar",
                "href": "/profile/Genji-Chandra-Sekhar"
            },
            "answer_text": "simple. the answer is beyond our thinking . i bet no one can give a perfect answer to your question with a proof . good luck .have a nice day ",
            "date": "Answered December 3, 2018",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thuraisingam Udayaseelan",
                "href": "/profile/Thuraisingam-Udayaseelan"
            },
            "answer_text": "Nothing is opposite of existence. But it is a concept to explain the opposite of existence. It is not existing in real life but conceptually is. we can say there water exist. but there nothing water doesn’t mean anything. But concept is correct. ",
            "date": "Answered October 11, 2017",
            "views": "186",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bill O'Reilly",
                "href": "/profile/Bill-OReilly-12"
            },
            "answer_text": "An answer to that question doesn’t ",
            "date": "Answered October 11, 2017",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Slavinka Zachova",
                "href": "/profile/Slavinka-Zachova"
            },
            "answer_text": "All around you yeah. ",
            "date": "Answered October 11, 2017",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rajesh Sehgal",
                "href": "/profile/Rajesh-Sehgal-16"
            },
            "answer_text": "WE HAVE TO ADD SOMETHING TO MAKE LIFE MEANINGFUL ",
            "date": "Answered June 22, 2017",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Raju Ooty",
                "href": "/profile/Raju-Ooty"
            },
            "answer_text": "http://No.it does not ",
            "date": "Answered June 12, 2020",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Julia Windham",
                "href": "/profile/Julia-Windham-1"
            },
            "answer_text": "I think so…. ",
            "date": "Answered July 5, 2017",
            "views": "24",
            "upvotes": "0"
        }
    ]
}