{
    "title": "If one pregnant woman knew her child would have ALD syndrome (or other incurable diseases), would it be inhumane to still give birth to the child knowing it would suffer? - Quora",
    "tags": [
        "Childbirth",
        "Ethics",
        "Morals and Morality",
        "Obstetrics and Gynecology",
        "Pregnancy",
        "Medical Conditions and Diseases",
        "Children",
        "Parenting",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keyvah Grant",
                "href": "/profile/Keyvah-Grant"
            },
            "answer_text": "This is a very personal question that can only really be answered by the mother/ parents involved. It is not for ME to say anything or do anything that would add to this horrible burden of choice. If a friend of mine was going through this I would support what ever choice they made. I would not think less or more of them should they choose to terminate the pregnancy, I would not think less or more of them if they choose to see it to the end either. My love thoughts and prayers would be with the mother/couple going through this NOT my judgement. ",
            "date": "Answered March 19, 2020",
            "views": "46",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nia Wohl",
                    "user_href": "/profile/Nia-Wohl"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elon Medici",
                "href": "/profile/Elon-Medici"
            },
            "answer_text": "Is it that you think the child will suffer, or the pregnant woman having to care for it? I personally think that blood testing before marriage or contemplating having a child should be mandatory. Certain genotypes and phenotypes should not mate because the blood type may not blend well genetically. If one knows their blood type they should know who they can and cannot mate with successfully. ",
            "date": "Answered March 19, 2020",
            "views": "26",
            "upvotes": "0"
        }
    ]
}