{
    "title": "If one God created our universe, how many gods did it take to make the multiverse? - Quora",
    "tags": [
        "Multiverse",
        "Christian Theology and Philosophy",
        "Philosophy of Religion",
        "The Universe",
        "Theology",
        "God"
    ],
    "response": [
        {
            "author_info": {
                "name": "Debi K Baughman",
                "href": "/profile/Debi-K-Baughman"
            },
            "answer_text": "Just for fun, say God did create the Universe. There is an archaic version of God from my first study Bible I owned in which the term God itself was plural. This wasn’t the same kind of plural that it’s described as today as it offered more than one version. The way it’s explained now is that it incorporates the Trinity, Father, Son and Holy Spirit. Lets go with only the latter of Spirit since that is a term that basically incorporates All that is. There. Got that out of the way so we can focus now on the plurality of God itself, which is plural. I’m sure you can see where this going, if it’s not all ready gone there more Times than we can imagine. That is, if we are going to assume each one of those parts of God has already created her, his, or ‘it’s’ Universe or ‘their’ multi-verses. God has, by many, been compared to a Prism, full of many; lights, or squares, or pixeels, with each one containing the whole, again, all of those, each one inside of the one, which displays the many. No, your head may not ever get used to it all, though someday it will, maybe. That’s the closest I’m going to come to describing it to you because you want to see it for yourself, not through somebody else eyes. Which, in the end result is the same as saying you are seeing it through Gods eye. s. I just described God as the prism. I like that.But I was even more excited upon realizing that the term Universe describes itself; in a Verse. A verse, a musical piece that contains Chorus and Verse, so, when you create a Multi-Verse, what do you have? Why, you have a symphony! A song of many verses. Or it could be a poem, the lyrics which is also described as verses. and,If you look at scriptural texts, they are also comprised of verses.Yayweh putting his song to words?All of the other Gods putting their worlds to verses? As to your last question “Will I ever find an answer in this Universe?” i say yes. Although, that is not where I found it. I was in transit, when I found it:). ",
            "date": "Answered November 7, 2016",
            "views": "279",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Philip Gibbs",
                "href": "/profile/Philip-Gibbs-1"
            },
            "answer_text": "It is true that if there was only one universe governed by some specific set of mathematical equations that defines the laws of physics then there would need to be something equivalent to a God that created it. Whether that God takes the form of a physical being like the Christian God or something more akin to Spinoza’s God is another question. Something would have had to determine which equations control the universe. Given how beautiful, sophisticated and fine-tuned for life those equations are, I would have to admit that the something would have to be pretty God-like. What if instead there is a multiverse? Would that require multiple God’s or one powerful one? How about some infinite hierarchy of Gods creating lesser Gods below them in other universes? The correct answer is that the multiverse requires no God’s at all. The ultimate multiverse is just the collection of all logical possibilities for the equations that could govern a universe and the universe we experience is just one of the many possibilities. Just as we live on one planet with particular physical characteristics that suit us for life we also live in one particular universe out of all the logically possible universes in the multiverse. There is no need for some special God-like power to select the mathematical laws for our universe because there never was any selection other than through the need for us to be able to evolve and survive in the universe that we find ourselves in. You might object and say that if this were the case then the laws of physics would be random and without scientific form. To some extent the laws are random. They must be to allow for fine-tuning for life, but on another level they follow principles of symmetry that seem very special. The reason for this is that complex systems have emergent properties that satisfy principles of universality. This is something we don’t yet fully understand but we have observed it in chaos theory, statistical physics and other domains of complexity. It is therefore natural to expect that a multiverse consisting of a statistical ensemble of all logically possible universe would also be subject to rules of emergence that would explain the symmetry in the laws of physics for our universe. So while a universe requires a God to choose the laws of physics, kick start evolution and provide consciousness to humans, in a multiverse none of that is needed. In the multiverse consciousness is just biology and psychology plus nothing else. Biology is just chemistry and then physics plus nothing else. The physics of our universe is just one possibility within mathematics plus nothing else, and mathematics is just the rules that logical possibilities must satisfy plus nothing else. No special spark is required to make our universe special, or to create life using physics or to give consciousness to life, because they are not really special at all. They are just one of many different ways that things could have worked and do work out there in the vast multiverse. ",
            "date": "Answered November 12, 2016",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kiran Kaur",
                    "user_href": "/profile/Kiran-Kaur-82"
                },
                {
                    "user_id": "Kishan Panaganti Badrinath",
                    "user_href": "/profile/Kishan-Panaganti-Badrinath"
                },
                {
                    "user_id": "Akansha Karira",
                    "user_href": "/profile/Akansha-Karira"
                }
            ]
        },
        {
            "author_info": {
                "name": "Naaved Temkar",
                "href": "/profile/Naaved-Temkar"
            },
            "answer_text": "Introduction How did God get here? Richard Dawkins, among other atheists, thinks he has the ultimate proof that God doesn't exist. If God created a complex universe, wouldn't it take an even more complex entity to have created God? However, such logic assumes that time has always existed, rather than being merely a construct of this universe. Rich Deem Who created God? It is an age-old question that has plagued all those who like to think about the big questions. Having grown up as an agnostic non-Christian, it provided me with a potential reason why there might not be any god. Various religions tend to solve the problem in different ways. The LDS church (Mormonism) says that the God (Elohim) to whom we are accountable had a father god, then grew up on a planet as a man, and progressed to become a god himself. Many other religions have claimed that gods beget other gods. Of course the problem with this idea is how did the first god get here? This problem of infinite regression invalidates such religions. Christianity claims that God has always existed. Is this idea even possible? Does science address such issues? Christianity's answer Christianity answers the question of who made God in the very first verse of the very first book, Genesis: In the beginning, God created the heavens and the earth (Genesis 1:1) This verse tells us that God was acting before time when He created the universe. Many other verses from the New Testament tell us that God was acting before time began, and so, He created time, along with the other dimensions of our universe: No, we speak of God's secret wisdom, a wisdom that has been hidden and that God destined for our glory before time began. (1 Corinthians 2:7)This grace was given us in Christ Jesus before the beginning of time (2 Timothy 1:9)The hope of eternal life, which God... promised before the beginning of time (Titus 1:2)To the only God our Savior, through Jesus Christ our Lord, be glory, majesty, dominion and authority, before all time and now and forever. Amen. (Jude 1:25)The idea that God created time, along with the physical universe, is not just some wacky modern Christian interpretation of the Bible. Justin Martyr, a second century Christian apologist, in his Hortatory Address to the Greeks, said that Plato got the idea that time was created along with the universe from Moses: \"And from what source did Plato draw the information that time was created along with the heavens? For he wrote thus: 'Time, accordingly, was created along with the heavens; in order that, coming into being together, they might also be together dissolved, if ever their dissolution should take place.' Had he not learned this from the divine history of Moses?\" 1 God exists in timeless eternity How does God acting before time began get around the problem of God's creation? There are two possible interpretations of these verses. One is that God exists outside of time. Since we live in a universe of cause and effect, we naturally assume that this is the only way in which any kind of existence can function. However, the premise is false. Without the dimension of time, there is no cause and effect, and all things that could exist in such a realm would have no need of being caused, but would have always existed. Therefore, God has no need of being created, but, in fact, created the time dimension of our universe specifically for a reason - so that cause and effect would exist for us. However, since God created time, cause and effect would never apply to His existence. God exists in multiple dimensions of time The second interpretation is that God exists in more than one dimension of time. Things that exist in one dimension of time are restricted to time's arrow and are confined to cause and effect. However, two dimensions of time form a plane of time, which has no beginning and no end and is not restricted to any single direction. A being that exists in at least two dimensions of time can travel anywhere in time and yet never had a beginning, since a plane of time has no starting point. Either interpretation leads one to the conclusion that God has no need of having been created. Why can't the universe be eternal? The idea that God can be eternal leads us to the idea that maybe the universe is eternal, and, therefore, God doesn't need to exist at all. Actually, this was the prevalent belief of atheists before the observational data of the 20th century strongly refuted the idea that the universe was eternal. This fact presented a big dilemma for atheists, since a non-eternal universe implied that it must have been caused. Maybe Genesis 1:1 was correct! Not to be dismayed by the facts, atheists have invented some metaphysical \"science\" that attempts to explain away the existence of God. Hence, most atheistic cosmologists believe that we see only the visible part of a much larger \"multiverse\" that randomly spews out universes with different physical parameters. 2  Since there is no evidence supporting this idea (nor can there be, according to the laws of the universe), it is really just a substitute \"god\" for atheists. And, since this \"god\" is non-intelligent by definition, it requires a complex hypothesis, which would be ruled out if we use Occam's razor, which states that one should use the simplest logical explanation for any phenomenon. Purposeful intelligent design of the universe makes much more sense, especially based upon what we know about the design of the universe. What does science say about time? When Stephen Hawking, George Ellis, and Roger Penrose extended the equations for general relativity to include space and time, the results showed that time has a beginning - at the moment of creation (i.e., the Big Bang). 3  In fact, if you examine university websites, you will find that many professors make such a claim - that the universe had a beginning and that this beginning marked the beginning of time (see The Universe is Not Eternal, But Had A Beginning). Such assertions support the Bible's claim that time began at the creation of the universe. Conclusion  God has no need to have been created, since He exists either outside time (where cause and effect do not operate) or within multiple dimensions of time (such that there is no beginning of God's plane of time). Hence God is eternal, having never been created. Although it is possible that the universe itself is eternal, eliminating the need for its creation, observational evidence contradicts this hypothesis, since the universe began to exist a finite ~13.8 billion years ago. The only possible escape for the atheist is the invention of a kind of super universe, which can never be confirmed experimentally (hence it is metaphysical in nature, and not scientific). ",
            "date": "Answered April 5, 2016",
            "views": "16",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Park Griffin",
                    "user_href": "/profile/Park-Griffin"
                },
                {
                    "user_id": "Kyu Rhee",
                    "user_href": "/profile/Kyu-Rhee-3"
                },
                {
                    "user_id": "Praveen Kumar",
                    "user_href": "/profile/Praveen-Kumar-2036"
                },
                {
                    "user_id": "Shivlok Bhagat(krishna)",
                    "user_href": "/profile/Shivlok-Bhagat-krishna"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Simpson",
                "href": "/profile/John-Simpson-4"
            },
            "answer_text": "Genesis 1:1 says that “God created the heavens and the earth.” Then, Colossians 1:16 gives the added detail that God created “all things” through Jesus  Christ. The plain teaching of Scripture, therefore, is that Jesus is the  Creator of the universe. The mystery of the triune God is difficult to understand yet is one of  the doctrines revealed in Scripture. In the Bible, both God the Father  and Jesus are called Shepherd, Judge, and Savior. Both are called the  Pierced One—in the same verse (Zechariah 12:10). Christ is the exact representation of God the Father, having the same nature (Hebrews 1:3).  There is some sense in which everything the Father does, the Son and  Spirit also do, and vice versa. They are always in perfect agreement at  every moment, and all three equal only One God (Deuteronomy 6:4). Knowing that Christ is God and has all the attributes of God aids our understanding of Jesus as the Creator. “In the beginning was the Word, and the Word was with God, and the Word was God” (John 1:1).  There are three important things in this passage about Jesus and the  Father: 1) Jesus was “in the beginning”—He was present at creation.  Jesus had existed eternally with God.  2) Jesus is distinct from the  Father—He was “with” God. 3) Jesus is the same as God in nature—He “was  God.” Hebrews 1:2 says, “In these last days he has spoken to us by his Son, whom he  appointed heir of all things, and through whom also he made the  universe.” Christ is the agent of God’s creation; the world was created  “through” Him. The Father and the Son had two distinct functions in  creation yet worked together to bring about the cosmos. John says, “All  things were made through [Jesus], and without [Jesus] was not anything  made that was made” (John 1:3, ESV).  The apostle Paul reiterates: “There is but one God, the Father, from  whom all things came and for whom we live; and there is but one Lord,  Jesus Christ, through whom all things came and through whom we live” (1 Corinthians 8:6). The Holy Spirit, the third Person of the Trinity, was also an agent in creation (Genesis 1:2).  Since the Hebrew word for “spirit” is often translated as “wind” or  “breath,” we can see the activity of all three persons of the Trinity in  one verse: “By the word of the LORD the heavens were made, their starry  host by the breath of his mouth” (Psalm 33:6). After a thorough study of Scripture, we can conclude that God the Father is the Creator (Psalm 102:25), and He created through Jesus, God the Son (Hebrews 1:2).  Is Jesus the Creator?",
            "date": "Answered February 16, 2014",
            "views": "399",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Moulana Abrar Alam",
                    "user_href": "/profile/Moulana-Abrar-Alam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dharma Somashekar",
                "href": "/profile/Dharma-Somashekar"
            },
            "answer_text": "According to  vedic scriptures  No \"GOD\" created the Universe., The formation of the Panchabhuthas. The five elements that the World is made up of are formed in THIS order – and they dissipate in the same REVERSE order. 1 AKASHA,  SKY -OZONE 03 is known as SWYAMBHU  Manvantra 2 VAYU…..AIR oxygen O2 SWRCHISHA- Manvanthara 3 AGNI…..Fire-hydrogen h2 is called Outhami Manvanthara 4 AAPA…..Water..H2o 5  RIVATHA Manvanthara 5  Prithvi…..Earth ..element   Thamas These are the 5 elements which help create Jeevies  and Pranies   6 VANSPATHI…..vegetation (Jeevies ) is called CHAKSHUSHA 7 ANIMALS…..Human beings, all creatures( Pranies).  VYVASWATHA  So seven physiological-changes, which form VASUNDRA,(earth or world)  is  called  ONE Manvantra. Therefore it takes 7 Manuvantharas for the Earth to grow …and seven Manvantharas for it to die …   So ONE birth and death of the EARTH … happens in 14 Manvantharas.      And this 14 changes is known as MAHA MANVANTRA Now we come to  YUGAS.  The Yugas are divided into 4 sections, called Chathur Yuga . One chathuryuga = 43, 20,000 years. One chathur yuga is made up of  1.   Kaliyuga……                                                                 4,32,000years 2.   Dwaparayuga=DWAY (two)– KALIYUGAS               8,64,000years 3.  Trethayuga=TRI  (three)– KALIYUGA                        12,96,600year 4    Krathuyuga (Sathyuga) = Four KALIUGAS                 17,28,000years                                                                                      ---------------------                                                                        total                     43,20,000 years  the life span of earth & elements 1000x Chathuryugas.1000x43,20,000 years = 432 crore years.   (4,320, millon years)   1000 chathuryugas is 14 Manuvantaras. one heart beat of the earth is One Samvantra ( solar year) .(Utharayana  it rises 6 months and Dhakshinayana falls 6 months) ",
            "date": "Answered February 20, 2014",
            "views": "18",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sudeep Kumar Jain",
                    "user_href": "/profile/Sudeep-Kumar-Jain"
                },
                {
                    "user_id": "Marcus Ford",
                    "user_href": "/profile/Marcus-Ford"
                },
                {
                    "user_id": "Shalabh Tayal",
                    "user_href": "/profile/Shalabh-Tayal"
                },
                {
                    "user_id": "Sriram Padmanabhan",
                    "user_href": "/profile/Sriram-Padmanabhan-4"
                },
                {
                    "user_id": "Rama Chandran",
                    "user_href": "/profile/Rama-Chandran-3"
                },
                {
                    "user_id": "Vijendra Pardhi",
                    "user_href": "/profile/Vijendra-Pardhi"
                },
                {
                    "user_id": "Manali Latkar",
                    "user_href": "/profile/Manali-Latkar"
                },
                {
                    "user_id": "Kaushal Mhatre",
                    "user_href": "/profile/Kaushal-Mhatre-1"
                },
                {
                    "user_id": "Sujan Deshpande",
                    "user_href": "/profile/Sujan-Deshpande"
                },
                {
                    "user_id": "Nikhil Sreenivasa",
                    "user_href": "/profile/Nikhil-Sreenivasa"
                },
                {
                    "user_id": "Bhavesh Mehta",
                    "user_href": "/profile/Bhavesh-Mehta-2"
                },
                {
                    "user_id": "Vishal R Sharma",
                    "user_href": "/profile/Vishal-R-Sharma"
                },
                {
                    "user_id": "Santhosh Amg",
                    "user_href": "/profile/Santhosh-Amg"
                },
                {
                    "user_id": "Santosh S Kerimath",
                    "user_href": "/profile/Santosh-S-Kerimath"
                },
                {
                    "user_id": "Lalith Mandala",
                    "user_href": "/profile/Lalith-Mandala-1"
                },
                {
                    "user_id": "Balakrishnan Vasudevan",
                    "user_href": "/profile/Balakrishnan-Vasudevan"
                },
                {
                    "user_id": "Madan Panathula",
                    "user_href": "/profile/Madan-Panathula"
                },
                {
                    "user_id": "Aditya Dogra",
                    "user_href": "/profile/Aditya-Dogra"
                },
                {
                    "user_id": "Bhargava Reddy",
                    "user_href": "/profile/Bhargava-Reddy-6"
                },
                {
                    "user_id": "Gauri Noolkar",
                    "user_href": "/profile/Gauri-Noolkar"
                },
                {
                    "user_id": "Hemanth Krishna",
                    "user_href": "/profile/Hemanth-Krishna-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stefan Zvonar",
                "href": "/profile/Stefan-Zvonar-1"
            },
            "answer_text": "God created the heavens and the Earth!…For hundreds of years, people from all walks of life have debated whether God exists, or if He’s just a fictional character.By taking a look at the world around us, we can see that it was designed and created by a supreme Being.The existence of the universe itself is compelling evidence for a creator.By taking a look at the world around us, we can see that it was designed and created by a supreme Being.Look around you. And look at the precision of the universe. The chances of that randomly happening are pretty much zero. If we were just a little bit too close to the sun, or just a little bit too far away, we would all be dead. But yet, everything is very precise. That does not just happen. The more we look into the workings of life, the more complicated it gets, and the more we see that life could not arise by itself.We all know that nothing cannot do something. Nothing is nothing. Nothing cannot see, smell, act, think, let alone create something.Nothing does not produce something.For the universe to spontaneously pop out of absolute nothingness, is a violation of the scientific laws that naturalism is supposedly subject to.You do not need to see the painter to believe that he or she exists. The painting is all the evidence you need. It would not be there if the painter did not exist, and so it is with the universe. .. All the different forms of life that occur today on planet earth, have been created by God, the almighty.Properties of the earth and the relationship of living things to it are a testament to a Designer.There are so many incredible “coincidences” in our world. The earth’s atmosphere has the right mixture of gases to support life. The sun is the right distance away and the right size to keep our climate comfortable. The tilt of the earth is right to give us moderate seasons. The proximity of the moon stabilizes the earth without causing excessive tides. There are many mineral deposits and natural resources to support our life. Topsoil supports the growth of food. The list is endless. These “coincidences” speak of a Designer. The human body is also a testament to a Designer.The human body is an incredible piece of machinery; who put it together?The existence of highly sophisticated living organisms implies a highly sophisticated designer of these organisms. Believers call this designer, the Creator or God. What could possibly be the flaw in such an argument?… Man is almost like a computer and needed something(God) to program him to do what he does.(this also goes for the copying of DNA and other things on a biological scale.).A computer cannot program itself; it needs a programer. In the human body, DNA ‘programs’ all characteristics such as hair, skin, eyes, and height. DNA determines the arrangement for 206 bones, 600 muscles, 10,000 auditory nerve fibers, two million optic nerve fibers, 100 billion nerve cells, 400 billion feet of blood vessels and capillaries and so on. Such extraordinary sophistication can only reflect intelligent design… The creation of DNA, the basic building block of life presents an interesting evolutionary problem. DNA cells contain thousands of genes that direct the functioning of living beings, including inherited characteristics, growth, organ and system structure. The DNA for each species is unique. Certain protein molecules or enzymes must be present for DNA to replicate, however those enzymes can only be produced at the direction of DNA — the DNA itself has the blueprint for the specific enzymes it needs to replicate. Each depends on the other and both must be present for replication to take place. How evolution could explain this has never been answered…. Dr. Werner Gitt, Director and Professor at the German Federal Institute of Physics and Technology, makes it clear that one of the things we know absolutely for sure from science, is that information cannot arise from disorder by chance. It always takes (greater) information to produce information, and ultimately information is the result of intelligence:“A code system is always the result of a mental process (it requires an intelligent origin or inventor). It should be emphasized that matter as such is unable to generate any code.All experiences indicate that a thinking being voluntarily exercising his own free will, cognition, and creativity, is required.There is no known natural law through which matter can give rise to information, neither is any physical process or material phenomenon known that can do this.”… All matter originates and exists only by virtue of a force which brings the particle of an atom to vibration and holds this most minute solar system of the atom together. We must assume behind this force the existence of a conscious and intelligent mind. This mind is the matrix of all matter.The claim that consciousness cannot exist beyond our physical bodies does not hold water because our physical bodies are themselves manifestations of consciousness. Believing that a person’s consciousness dies with their body is dependent upon the assumption that consciousness exists only as a product of physical (brain) processes… There is no evidence that life can emerge from non-living matter.Some atheists, agnostics, and evolutionists believe that life on earth was brought to the planet by some alien force or object. The object could have been – so they believe – been brought to earth by an asteroid. But then the question becomes “Then where did this life come from” and on and on again, into infinity ad nauseum. This only pushes the question of the origin of life back and back and back… A common argument from atheists and skeptics is that if all things need a cause, then God must also need a cause. The conclusion is that if God needed a cause, then God is not God (and if God is not God, then of course there is no God)…God is not in the category of things that are created or caused. God is uncaused and uncreated—He simply exists.How do we know this? We know that from nothing, nothing comes. So, if there were ever a time when there was absolutely nothing in existence, then nothing would have ever come into existence. But things do exist. Therefore, since there could never have been absolutely nothing, something had to have always been in existence. That ever-existing thing is what we call God... ",
            "date": "Answered June 16, 2016",
            "views": "471",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joseph McCormick",
                    "user_href": "/profile/Joseph-McCormick-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Moulana Abrar Alam",
                "href": "/profile/Moulana-Abrar-Alam"
            },
            "answer_text": "Only one God who is God of Islam, created this universe because there is no any signs of partnership in whole universe. If only God of Islam did not creat the universe, then who   preserved hundreds of fresh dead  bodies with fresh blood of Muslim Martyrs and saints   from decay in  their graves since centuries and years without used any chemicals. ? If God of Non-Muslims created this universe,  why  there is no any fresh dead body with fresh blood of any Atheists and  Non-Muslims in world? Natural, Neutral, perceptible and Irrefutable Proofs on Truth of IslamThe Earth: (1)The Earth is a nature. It cannot tell a lie. It cannot favor or support wrong thinking or wrong beliefs or wrong lifestyles. It is 100% true and neutral. This obeys only true God or true followers of God. It doesn't obey any other fabricated Gods or any followers of fabricated Gods or any Atheists.The irrefutable proof on above commentary is that there are hundreds of fresh dead bodies with fresh blood of Muslim Martyrs and saints who are preserved from decay in their graves since centuries and years without used any chemicals. Once we had dug their graves for any reasons, we found them in above condition, our doctors examined them and there are thousands of eyewitnesses too. We will not dig their graves again for every person on his desire now because you non-Muslims are 5 billion at this time in the world.So, if you are sincere for truth, but you do not trust us, then contact us with your doctors, researchers and media team about the research of these fresh dead bodies. If you refuted above research, we will pay you 1 million dollars and we will be ready for any punishment from you in front of world media otherwise accept our research and enter in Islam. Do not see condition of some bad Muslims because the Islam is perfect, but all Muslims are not perfect.According to my research there is no fresh dead body with fresh blood of any Atheists and Non-Muslims that is preserved from decay under the Earth or on the Earth since centuries and years without used any chemicals. So it is 100% proof that there are no other Gods except Almighty Allah and the nature Earth doesn't support or obey any fabricated Gods (except Almighty Allah) or followers of fabricated Gods or Atheists.The Air: (2)The Air is a nature. It cannot tell a lie. It cannot favor or support wrong thinking or wrong beliefs or wrong lifestyles. It is 100% true and neutral. It obeys only true God or true followers of God. It doesn't obey any other fabricated Gods or any followers of fabricated Gods or any Atheists.The 100% proof on it is that if you leave intact dead bodies of all soldiers on the Earth who fought against each other in the name of their Gods and religion, then after death only Muslim Martyrs will remain in fresh condition with fresh blood and their enemies will decay. There are two questions to all Atheists and Non-Muslims:1) The Muslim soldiers who are slain in the way of Islam, why their dead bodies remain in fresh condition with fresh blood? And, all Atheists and all Non-Muslims soldiers who are murdered in the way of their religions, why their dead bodies do not remain in fresh condition with fresh blood?2) Why the God did not preserve your soldiers' dead bodies who sacrificed for Him and why the God of Islam Almighty Allah preserved the dead bodies with fresh blood of those Muslim soldiers who sacrificed for Him?The Fire: (3)It is perfect that the Fire is a nature. It does not have any capacity to save any human body in it. So, if a Muslim goes in it without using any chemicals and he is immune to burn, then it will be a miracle and a 100% proof on truth of Islam. And, look how intransigents are majority of Atheists and Non-Muslims that they do not agree to demonstrate such miracle and if we Muslims are ready to demonstrate such miracle (by the mercy of Allah) then they are not even willing to convert to Islam.Dear Atheists and non-Muslims, I ask you that if a Muslim goes in Fire without using any chemical on his body in front of world media and he is immune to burn in it, then will you all convert to Islam or not?If yes, then fix a time, date and place and start announcement in whole world because you are 5 billion and it is impossible that we enter in Fire for every Atheists and Non-Muslims for proving the truth of Islam.The Water: (4)The water is a nature. Our claim is that it only obeys the God of Islam or only true followers of God of Islam. So please study following research and event that is proof on our claimProphet Moses and his followers (peace be upon them) were escaping from Egypt. When they reached to the Red Sea, they prayed to Almighty Allah. Allah the exalted said to Prophet Moses (peace be upon him) to hit the Red Sea with his staff. When the Prophet Moses (peace be upon him) hit the Red Sea, then sea split in two parts and they found the open path to cross the sea. So, the Prophet Moses and his followers (peace be upon them) crossed the sea.The Pharaoh Ramesses and his army who were chasing the Prophet Moses and his followers (peace be upon them) reached to Red Sea. They found the open path, so they walked on dry ground following them, but when they reached in the middle of Red Sea, the sea joined back on them and they drown in it.After this event, Almighty Allah saved the dead body of Pharaoh forever as a sign for Atheists and Non-Muslims.So according to head of archaeologist and anatomical scientists the Professor Maurice Bucaille (who converted to Islam after his research) and according to Holy Quran, Pharaoh Ramesses died in the Red Sea following the Prophet Moses and his followers (peace be upon them).For details on research of Professor Maurice Bucaille on this event please study “The Dead body of Pharaoh” in the article section on Fresh Dead Bodies with Fresh Blood.Commentary on this event: (1) This event is 100% true. So this event proves that there is existence of a God Almighty Allah (who is God of Islam and the God of Prophet Moses) because the Prophet Moses (peace be upon him) hit the red sea via his staff by the order of Almighty Allah and the red sea obeyed the Prophet Moses (peace be upon him) and his God Almighty Allah.(2) This event also proves that water obeys the God Almighty Allah and His true followers because when the Prophet Moses (peace be upon him) hit the red sea via his staff by the order of Almighty Allah, it divided in two parts and gave the way for Prophet Moses (peace be upon him) and his followers.(3) There are some true Muslim followers of Almighty Allah who can split the red sea in two parts at this time too in front of world media by the order of Almighty Allah but only if  5 billion Atheists and Non-Muslims will agree to convert to Islam.(4) My challenge forever is that there is no other God except Almighty Allah who is the God of Islam. If anyone from Non-Muslims claims that there is another God except Almighty Allah, then he should prove his God by any neutral, natural and irrefutable proofs & evidence in front of world media. (5) I also challenge forever that there is no any Atheists and Non-Muslims who can claim that the water obeys or supports him.References from Holy Quran:Holy Quran, Surah 10, Verse 90-92:We took the Children of Israel across the sea: Pharaoh and his hosts followed them in insolence and spite. At length, when overwhelmed with the flood, he said: \"I believe that there is no god except Him Whom the Children of Israel believe in: I am of those who submit (to Allah in Islam).(It was said to him): \"Ah now!- But a little while before, wast thou in rebellion!- and thou didst mischief (and violence)! This day shall We save you in your body, that you may be a Sign to those who come after you! But verily, many among mankind are neglectful of Our Signs” Holy Quran, Surah 41, Verse 53: We shall (continue to) show them Our evidence in the world and within their souls until it becomes clear that the Quran is the truth. Is it not sufficient for you that your Lord witness all things?Holy Quran, Surah 7, Verse 179: We have destined many men and jinn for hell. They have hearts but do not understand, eyes but do not see. They have ears but do not hear. They are worse than lost cattle. These are the heedless ones.In cemetery of an Islamic University \"Jamia Binoria near Site police Station Site Area Karachi Pakistan\" founded a fresh dead body with fresh blood of Mufti Ateequr Rahman who was a famous Muslim Scholar and teacher of this \"Jamia\". The details of this event is that Mufti Ateequr Rahman was murdered by firing on him on Thursday after prayer of Esha on 23/6/2005 when he was returning after teaching of Holy Quran at Brins road Karachi Pakistan. He was buried on Friday after prayer Asar, in cemetery of Jamia Binoria, site area Karachi Pakistan at dated 24/6/2005. After 13 months and 24 days on Friday dated 18/8/2006 it happened that his grave was damajed by the hard raining in Karachi and his fresh dead body in sleeping condition became open in his grave. When the principle, teachers and students of this \"Jamia Binoria\" knew about it, they  went to see the dead body of Martyr Mufti Ateequr Rahman in cemetery of this Jamia.  It was very stranger that when his son Mufti Jamal Ateeque entered in his grave for repairing his grave, he found his dead body like alive person. The blood of his wounds was fresh and the perfume was coming from it. The principal of this Jamia Mufti Muhammad Naim, many teachers and students of this Jamia Binoria saw this fresh dead body with fresh blood in his grave.  It is perfect that the Earth itself doesn't have capacity to preserve his dead body in fresh condition with fresh blood since 13 months. So it is a Miracle and a neutral, natural and perceptible proof on truth of Islam, Holy Quran and last prophet hood of Muhammad (peace be upon him), because he was a true and sincere Muslims. Every one can verify about this event and research about him, or contact to this \"Jamia Binoria Site Area Karachi Pakistan\" on phone numbers 0092-213 25603000092-213 25604000092-213 2575228 Fax Number: 0092-212564586 Email: binoria@binoria.com or contact to his son Jamal Ateeque on Mobile no  0092 300 92 64 709  1 Million Dollar prize 4 those Atheists and Non-Muslims who will prove that the dead bodies of two companions of last prophet Muhammad (peace be upon him), are not preserved in fresh condition with fresh blood since centuries. Why the Atheists and Non-Muslims do not accept the news of our Muslim news papers about preserved fresh dead bodies with fresh blood of two companions of last prophet Muhammad (peace be upon him), if they are not in their favor, and why they accept our news if they are in their favor? The earth also respects the Holy Quran because it protected the dead bodies of 2 companions of Muhammad (S.A.) who were true followers of Holy Quran. So accept the witness of Earth who is the nature, doesn't tell a lie? So this event is proof on being the Islam as a true religion, being the Holy Quran verses of Almighty Allah and being the Muhammad (S.A) last prophet of Allah, the Exalted. Estimated reading time: 6 minutes, 50 seconds Though in normal cases and circumstances the dead bodies in the grave decompose and disintegrate yet there are proofs where the dead bodies of martyrs, prophets and saints have been found intact when their graves were dug. In 1932 A.D. (1351 A.H) the then ruling King of Iraq Shah Faisal I, dreamt that he was being addressed by Hazrat Hudhaifa al-Yamani (ra), who said: \"O King! Remove Jabir ibn Abdullah al-Ansari and me from the bank of river Tigris and bury us at some safe place because my grave is already water-logged, (full of water) while Jabir ibn Abdullah al-Ansari's grave is slowly getting water-logged.\" This dream was repeated again the next night but King Faisal I, did not pay attention to it on account of his pre-occupation with state affairs. On the third night Hazrat Hudhaifa al-Yamani (ra) was seen in the dream by the grand Mufti of Iraq. Hazrat Hudhaifa al-Yamani (ra) said to the grand Mufti: \"I have been directing the king since two nights to transfer our Bodies but he has not paid any heed. Tell him emphatically to arrange for the transfer of our graves!\" So after discussing this matter, the King, his Prime Minister and the Grand Mufti decided to carry out this work. It was decided that the Grand Mufti should issue a fatwa (religious ruling) on this matter and the Prime Minister will issue statement to the press, so that the public may know about this great event. It was declared that on 10th Zulhijjah after noon prayers the graves shall be opened and the holy bodies shall be transferred to another place. As it was Hajj season, pilgrims had gathered in Makkah. They requested King Faisal I, to postpone the event for a few days so that they all could attend the event after performing the Hajj. Hence, the King postponed this event to 20th Zulhijjah. After noon prayers, on 20th Zulhijjah 1351 A.H. a large number of Muslims and non-Muslims gathered in Baghdad, and the city was heavily crowded. First when the grave of Hazrat Hudhaifa al-Yamani (ra) was opened water was fond inside. The body was lifted with a crane in such a way that it safely came on a stretcher. Then the stretcher was lifted by the King, the Grand Mufti, the Prime Minister and Prince Farooq of Egypt and brought to a glass coffin box made especially to keep the holy bodies. The body of Hazrat Jabir ibn Abdullah al-Ansari (ra) was also transferred to the glass box in the same scrupulous manner. The most marvelous spectacle was now seen by the huge crowd that had gathered to witness this great event. Both the holy bodies of these true companions (Sahabah) of Holy Prophet Muhammad (saw) were fresh and intact while their open eyes issued forth such divine light that the spectator's eyes were dazzled. Furthermore, their coffin, clothes were also intact and at first glance, it appeared as if these heroes of Islam were alive.  The two bodies were then taken away and buried afresh near the grave of another great hero of Islam, Hazrat Salman-e-Farsi (ra), in Salman Park which is 30 miles from Baghdad. This miracle amazed the scientists, philosophers and doctors. They were all bewildered and spellbound to witness this great miracle. A German physiologist who had been showing a lot of interest in this was so impressed by the conditions of the bodies, which were buried for more than a thousand years, that he immediately came to the Grand Mufti, held up his hands and said, \"What more evidence can there be in support of Islam. I embrace Islam so teach me about it!\" Thus before thousands of people this German doctor became a Muslim. His example was followed by many Christians and Jews and for a long time it continued in Baghdad and a large number of people became Muslims as a result of this miracle. Now let us all sit-back and think over this event and derive a lesson from this miracle. Pondering over such events is potent food for the mind and serves as an eye-opener to humanity. Some of the material above was published in a Pakistani newspaper, \"Daily Jung\" on 7th June 1970.and in daily Ummat Karachi dated 19-09-2013. www.rightfulreligion.com ",
            "date": "Answered February 16, 2014",
            "views": "345",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vipul Mehta",
                "href": "/profile/Vipul-Mehta-5"
            },
            "answer_text": " Hindu cycle of the universe (section) and another one the latest theory : my own What i conceived Give you the Exact idea who created whom as per below     See this is a triangle merging into itself : now see other way roundinner triangle contracted from outer triangleouter triangle expanded from the inner triangle So  both these triangles are responsible  for each other to give birth to each other. the meeting point and infinity point both were the corresponding points of each other. So whole Universe created to God and God created the Universe. And this is a great phenomenon explained in Hindu myths.    Hindu Universe and Creation another way of explain as below  See all dots or circle does not seem merging or demerge from or to... but both are leading  to  create  each other , since it is illusion, so that is why whole universe is called illusion for  our limited senses. that is why this question arose,  if you understand this the question is answered.      \"the creation was not a bringing into being of the wonder of the world. Rather it was dismemberment, a disintegration of the original Oneness. For him the Creation seemed not the expression of a rational benevolent Maker in wondrous new forms but a fragmenting of the unity of nature into countless limited forms...For the Hindu our very notion of creation was reversed. Instead of transforming nothing into everything the Hindu creation broke into countless imperfect fragments what was already there.\"  integration and disintegration is the same for unity that oneness oneness or zeroness is the same entity, only to understand fractions between them. ",
            "date": "Updated February 23, 2014",
            "views": "869",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Walter Hanson",
                    "user_href": "/profile/Walter-Hanson-6"
                },
                {
                    "user_id": "Hemanth Krishna",
                    "user_href": "/profile/Hemanth-Krishna-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robbi Tomsen",
                "href": "/profile/Robbi-Tomsen"
            },
            "answer_text": "Good grief!! How worried you must be. Stop a minute and think. First question…do you believe there is a God? If so, what kind of God? Is this God all powerful and able to create the universe? Ok, suppose you have answered yes to these questions…..then take it a step further….. could this God create more universes? Yes again? Then you have answered your question. An all powerful God could and did create unnumbered universes. One God. It didn't take hundreds or more. Now, are there other universes that are beyond our knowing and not part of any thing we can imagine? Not only beyond knowing and that even fantasies can't think of, I believe so. Other Creators, sure, why not? But it is silly to spend time trying to imagine, or fantasize about things so far separate from the incredible number of our own universes or Galaxys or any other label you may want to apply. One all powerful God created innumerable stars, universes and so forth. We cannot comprehend all of this but we don't need to do so. We just need to have faith in our one God and his Son Jesus Christ. Simple. ",
            "date": "Answered June 1, 2017",
            "views": "110",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ajinkya Suranis",
                "href": "/profile/Ajinkya-Suranis"
            },
            "answer_text": "Multiple Gods are not required to create the 'multiverse'.According to quantum mechanics, a certain type of universe is created by fine tuning of particular parameters (such as Planck's constant, speed of light, etc).A 'multiverse' is nothing but a set of universes, each universe having different combination of values of theses parameters.Since there can be infinite number of combinations of these parameters, the multiverse may consist of infinite number of universes.Ours is just one of the universes with a fixed combination (Planck's constant: 6.62606957 × 10-34 m2 kg / s, speed of light: 3  ×  10^8 m/s). ",
            "date": "Answered November 19, 2014",
            "views": "14",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elinor Noft",
                    "user_href": "/profile/Elinor-Noft"
                },
                {
                    "user_id": "Kanika Pradhan",
                    "user_href": "/profile/Kanika-Pradhan"
                },
                {
                    "user_id": "Marius Manea",
                    "user_href": "/profile/Marius-Manea"
                },
                {
                    "user_id": "Ron Frankwick",
                    "user_href": "/profile/Ron-Frankwick"
                },
                {
                    "user_id": "Jacob Hauwiller-Gustafson",
                    "user_href": "/profile/Jacob-Hauwiller-Gustafson"
                },
                {
                    "user_id": "Mathan Rajendran",
                    "user_href": "/profile/Mathan-Rajendran-2"
                },
                {
                    "user_id": "Aditya Verma",
                    "user_href": "/profile/Aditya-Verma-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alfonso R Reyes",
                "href": "/profile/Alfonso-R-Reyes"
            },
            "answer_text": "Your question is contradictory. In a scientific context you will not see a god or gods intervening to create a universe or multiverses, otherwise, the conversation stops. If a god or gods created these *verses then why science should continue searching for the origins of the universe? That god or gods will provide for any possible explanation of how things came to be, in other words miracles, dogma, animism, spiritualism will give you all your answers; no need for science. Since you are asking your question from the theological point of view then you will have your answer immediately besides the fact that a religious god wouldn't mind thinking about constructing multiverses either. I forgot to mention, you will not find the word multiverse in any religious scriptures. The term is very recent. ",
            "date": "Answered November 19, 2014",
            "views": "380",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Geoff Cutler",
                "href": "/profile/Geoff-Cutler"
            },
            "answer_text": "If one God created our universe, how many gods did it take to make the multiverse? The answer lies in one book - The Urantia Book, and yes it will make your head spin. This little baby universe of ours was created by a “Creator Son” - a divine and eternal created being. So not a “god”. There are about 400,000 Creator Sons, spread across SEVEN Super Universes. And in unpervaded space, new universes are being created. It will never end, apparently. ",
            "date": "Answered July 18, 2017",
            "views": "34",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Graves-Barakaat",
                "href": "/profile/James-Graves-Barakaat"
            },
            "answer_text": "There is no “multiverse” but multiple universes. The Ascended Masters teach that there is one Creator God for each universe. There are infinite possibilities in this universe so there is no reason to be concerned about other universes. It’s better to contemplate the unseen life that is experienced within the self as God. Without the unseen life that the human experiences within itself, there is no heartbeat, no breath, no thoughts, no emotions, and no imagination. The human sees only the expressions of life in other humans, animals, and plants. The biggest problem of the human is that it seems to always be looking for answers outside of itself but not about the unseen life it experiences within itself. ",
            "date": "Answered January 15, 2017",
            "views": "363",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ay Stewart",
                    "user_href": "/profile/Ay-Stewart"
                },
                {
                    "user_id": "William M. Holland",
                    "user_href": "/profile/Edward-Snowden-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Dauenhauer",
                "href": "/profile/Frank-Dauenhauer"
            },
            "answer_text": "If one God created our universe, how many gods did it take to make the multiverse? It may confidently be assumed that no gods created our universe, since there is no objective, empirical evidence of gods. Likewise, there is no evidence of a multiverse. ",
            "date": "Updated June 29, 2018",
            "views": "671",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Bob-Loblaw-114"
                },
                {
                    "user_id": "Kanika Pradhan",
                    "user_href": "/profile/Kanika-Pradhan"
                },
                {
                    "user_id": "Rana Sk",
                    "user_href": "/profile/Rana-Sk"
                },
                {
                    "user_id": "Lily Haverlah",
                    "user_href": "/profile/Lily-Haverlah"
                },
                {
                    "user_id": "Peter Denyer",
                    "user_href": "/profile/Peter-Denyer-1"
                },
                {
                    "user_id": "Kevin Klein Cartagena",
                    "user_href": "/profile/Kevin-Klein-Cartagena"
                },
                {
                    "user_id": "Sam Wiegand",
                    "user_href": "/profile/Sam-Wiegand-1"
                },
                {
                    "user_id": "Nazir Haffar",
                    "user_href": "/profile/Nazir-Haffar"
                },
                {
                    "user_id": "Toms Thomas",
                    "user_href": "/profile/Toms-Thomas"
                },
                {
                    "user_id": "Anne Fletcher-Jones",
                    "user_href": "/profile/Anne-Fletcher-Jones"
                },
                {
                    "user_id": "Rajarshi Bandopadhyay (রাজর্ষি বন্দোপাধ্যায়)",
                    "user_href": "/profile/Rajarshi-Bandopadhyay-রাজর্ষি-বন্দোপাধ্যায়"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gayla Roberts",
                "href": "/profile/Gayla-Roberts-1"
            },
            "answer_text": "The universe is a physical thing that can be seen.Everything that can be seen physically has a cause or origin.God too is a spirit and spirit can cause anything.So meaning God made the universe.God's existence can't be explained by any human being.Because everything that can be seen by this fresh(body) can be explained by the body.But anything spiritual can be Explained by the One who caused them to exit.So God only can explain who He is and how he existed,We have eight planets but non hold live.The universe is wide but non has been reported to be as earth.He has given man the authority to discover how wonderful he is.If God didn't create human more specifically,We wouldn't see how special and loving he is to mankind.For short God is spirit and no one In this physical universe can Explain where God came from. ",
            "date": "Updated October 7, 2016",
            "views": "306",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tetteh John",
                    "user_href": "/profile/Tetteh-John"
                },
                {
                    "user_id": "Paul Falotico",
                    "user_href": "/profile/Paul-Falotico-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alec Cawley",
                "href": "/profile/Alec-Cawley"
            },
            "answer_text": "If there is more than one, you need a super-God to create those Gods. So the answer is that the number of Supreme Beings is either one or zero. If that Supreme Being exists, any other “gods” are just subordinate workers. My choice is zero - which solves all your other questions. ",
            "date": "Answered November 5, 2016",
            "views": "369",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rahul Challapalli",
                    "user_href": "/profile/Rahul-Challapalli"
                },
                {
                    "user_id": "Rana Sk",
                    "user_href": "/profile/Rana-Sk"
                },
                {
                    "user_id": "Deepjyoti Lahkar",
                    "user_href": "/profile/Deepjyoti-Lahkar"
                },
                {
                    "user_id": "Mark White",
                    "user_href": "/profile/Mark-White-101"
                },
                {
                    "user_id": "Martin Fabian",
                    "user_href": "/profile/Martin-Fabian-1"
                },
                {
                    "user_id": "Sam Wiegand",
                    "user_href": "/profile/Sam-Wiegand-1"
                },
                {
                    "user_id": "Clark Wierda",
                    "user_href": "/profile/Clark-Wierda"
                },
                {
                    "user_id": "Ken Leland",
                    "user_href": "/profile/Ken-Leland-1"
                },
                {
                    "user_id": "Gerard van Wilgen",
                    "user_href": "/profile/Gerard-van-Wilgen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Weir",
                "href": "/profile/Rob-Weir"
            },
            "answer_text": "How many Frazbies does it take to make a Gorghly? We tend to run into problems when asking questions about the relationship between two entities that are not known to even exist and whose purported properties are nebulous. ",
            "date": "Answered November 19, 2014",
            "views": "622",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Walter Hanson",
                    "user_href": "/profile/Walter-Hanson-6"
                },
                {
                    "user_id": "Eric Hawthorne",
                    "user_href": "/profile/Eric-Hawthorne"
                },
                {
                    "user_id": "Edward Azkarra",
                    "user_href": "/profile/Edward-Azkarra"
                },
                {
                    "user_id": "Cory Cooper",
                    "user_href": "/profile/Cory-Cooper"
                },
                {
                    "user_id": "Zach Sekaran",
                    "user_href": "/profile/Zach-Sekaran"
                },
                {
                    "user_id": "Paul Olaru",
                    "user_href": "/profile/Paul-Olaru"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pundrik Shah",
                "href": "/profile/Pundrik-Shah"
            },
            "answer_text": "Heard about the big bang theory? No. Not the one with her.  This one: Big Bang Read it, you'll understand how universe was created. This is one theory, here God does not interfere. ",
            "date": "Updated July 10, 2017",
            "views": "600",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Bob-Loblaw-114"
                },
                {
                    "user_id": "Peter Denyer",
                    "user_href": "/profile/Peter-Denyer-1"
                },
                {
                    "user_id": "Kirti Neotia",
                    "user_href": "/profile/Kirti-Neotia"
                },
                {
                    "user_id": "Lakhan Kadam",
                    "user_href": "/profile/Lakhan-Kadam"
                },
                {
                    "user_id": "Vikrant Vaidya",
                    "user_href": "/profile/Vikrant-Vaidya"
                },
                {
                    "user_id": "Madhav Ved",
                    "user_href": "/profile/Madhav-Ved"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jai Shah",
                "href": "/profile/Jai-Shah-2"
            },
            "answer_text": "None. Universe does not have a beginning or an end. It was 'always there'. No one has created it. If someone is of opinion that God created Universe then next question would be 'Who created God?' ",
            "date": "Updated July 31, 2014",
            "views": "333",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anu Swaghatha",
                    "user_href": "/profile/Anu-Swaghatha"
                },
                {
                    "user_id": "Nikita Shah",
                    "user_href": "/profile/Nikita-Shah-7"
                },
                {
                    "user_id": "Rikhav Khimasia",
                    "user_href": "/profile/Rikhav-Khimasia-1"
                },
                {
                    "user_id": "Him Pann",
                    "user_href": "/profile/Him-Pann"
                },
                {
                    "user_id": "Vipul Mehta",
                    "user_href": "/profile/Vipul-Mehta-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashley Bradbury",
                "href": "/profile/Ashley-Bradbury-1"
            },
            "answer_text": "None. The gods only got here a few years after humans. You are always going to have this problem of 'who' if you keep thinking of the universe as having been 'created'. ",
            "date": "Answered February 18, 2014",
            "views": "356",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Barak Shoshany",
                    "user_href": "/profile/Barak-Shoshany"
                },
                {
                    "user_id": "David Cabrera",
                    "user_href": "/profile/David-Cabrera-9"
                },
                {
                    "user_id": "Dharma Somashekar",
                    "user_href": "/profile/Dharma-Somashekar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Him Pann",
                "href": "/profile/Him-Pann"
            },
            "answer_text": "Since all other answers here present views of their belief system or religion, and give answers to this question mythologically, I'd like to present my views in a different way. I'd include science aswell as spirituality in my answer. So, how many gods created the universe? None. I'll link the book, Patanjali Yoga Sutras by Swami Vivekananda to answer this question. I know it's a bit long, but trust me, it's so worth it. A very philosophical piece of work. Great, indeed.  Patanjali Yoga Sutra - Swami Vivekananda.pdf ",
            "date": "Updated March 1, 2014",
            "views": "412",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kausalya Ganesh",
                    "user_href": "/profile/Kausalya-Ganesh"
                },
                {
                    "user_id": "Julie Prentice",
                    "user_href": "/profile/Julie-Prentice"
                },
                {
                    "user_id": "Purwa Rojindar",
                    "user_href": "/profile/Purwa-Rojindar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Johnnie Lockett",
                "href": "/profile/Johnnie-Lockett"
            },
            "answer_text": "Universe means one. There is no \"multiverse.\" It is a nonsensical term dreamed up in men's imaginations. It literally contradicts itself. If there are multiple regions consisting of any number of galaxies and other \"space stuff\"—once you separate them from one another, each ceases to be a \"universe.\" The universe, then, is where you keep them all. ",
            "date": "Answered November 19, 2014",
            "views": "153",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ay Stewart",
                    "user_href": "/profile/Ay-Stewart"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jagannath D",
                "href": "/profile/Jagannath-D"
            },
            "answer_text": "When God is omni-everything. Dont you think the same one God can be the reason for multiverse or that the same one God can be many at the same time also? HTH. ",
            "date": "Answered November 19, 2014",
            "views": "199",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rajendra Ojha",
                    "user_href": "/profile/Rajendra-Ojha-2"
                },
                {
                    "user_id": "Ana Godeanu",
                    "user_href": "/profile/Ana-Godeanu"
                },
                {
                    "user_id": "Aditya Verma",
                    "user_href": "/profile/Aditya-Verma-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marlene Dublinsky",
                "href": "/profile/Marlene-Dublinsky"
            },
            "answer_text": "I believe that one God created all of the universes. It occurred to me that if God is much greater than us and we couldn't possibly know the mind of God, who are we to limit God to having created just one universe and only one planet inhabited by life? Therefore, I do believe in the multiverse and that one God is over all. Atheists believe science disproves God. The more that I learn about science, the more I see the awesomeness of God. ",
            "date": "Answered July 20, 2017",
            "views": "107",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abdullah Mamun",
                    "user_href": "/profile/Abdullah-Mamun-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Seren Starlight",
                "href": "/profile/Seren-Starlight"
            },
            "answer_text": "“If one God created our universe, how many gods did it take to make the multiverse?” or a simpler question might be “How many gods does it take to change a light-bulb?” Answer: None. ",
            "date": "Answered November 6, 2016",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Rumore",
                "href": "/profile/Mike-Rumore"
            },
            "answer_text": "Good question. Reminds me of astrologers wanting to use telescopes for deep-space astrological observations.  Think about it. Only about 5000 or 6000 stars are visible to the naked eye, but billions of stars exist!  You need a telescope to see them. Wow! Those horoscopes will be so accurate! ",
            "date": "Answered November 20, 2014",
            "views": "520",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edward Azkarra",
                    "user_href": "/profile/Edward-Azkarra"
                },
                {
                    "user_id": "Luís D Oliveira",
                    "user_href": "/profile/Luís-D-Oliveira"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thibaut Deveraux",
                "href": "/profile/Thibaut-Deveraux"
            },
            "answer_text": "This theory means that everything that can exist, has to exist. If there is some god prior to this, maybe he just had to say: I want everything to exist ! If our God has been created with our universe, just remember that everything exists. This means that there is also a universe without God. ",
            "date": "Updated November 23, 2015",
            "views": "433",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Suresh K",
                    "user_href": "/profile/Suresh-K-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashish Jain",
                "href": "/profile/Ashish-Jain-329"
            },
            "answer_text": "Universe always existed. It is made of six Dravyas. They are:1. Jiva2. Pudgala 3. Dharmastikaya 4. Adharmastikaya 5. Aakasha 6. Kaala ",
            "date": "Answered January 27, 2015",
            "views": "65",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sampriti",
                    "user_href": "/profile/Sampriti-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Person",
                "href": "/profile/Alan-Person"
            },
            "answer_text": "1Everything that moves within creation has been created by that 1. God is far older than science has been able to measure. ",
            "date": "Answered July 26, 2014",
            "views": "116",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Srikanth Vaindam",
                    "user_href": "/profile/Srikanth-Vaindam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Girish Gupte",
                "href": "/profile/Girish-Gupte-2"
            },
            "answer_text": "—\u0000—\u0000—\u0000—\u0000- As a spider spreads out and withdraws its web, as on earth grow the herbs and trees, and as a living man issues out hair, so does the Universe emerge here from God. -Mundaka Upanishad —\u0000—\u0000—\u0000—\u0000—\u0000— According to Ancient Indian ( Vedic or Hindu ) scriptures, one supreme consciousness ( God) creates multiple universes, and resides in each of them. Each universe is born from the supreme being and desolves into the supreme being ",
            "date": "Answered November 3, 2017",
            "views": "197",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Koreen Kruger",
                "href": "/profile/Koreen-Kruger"
            },
            "answer_text": "Krishnamurti's aim was to set humanity free. He maintained that the individual is freed by becoming aware of their own psychological conditioning, and that this awakening will enable them to give love to another. Once this occurs humanity will have no more need for gods creating the universe! ",
            "date": "Answered February 23, 2014",
            "views": "156",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rahul Kumar",
                "href": "/profile/Rahul-Kumar-646"
            },
            "answer_text": "This is one answer i have written for a question . Rahul Kumar's answer to Why is the creator not worshipped in Hinduism, but the protector and the destroyer are? Hope it helps ! ",
            "date": "Answered July 19, 2017",
            "views": "128",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rajendra Ojha",
                    "user_href": "/profile/Rajendra-Ojha-2"
                },
                {
                    "user_id": "Rajath Seshadri",
                    "user_href": "/profile/Rajath-Seshadri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Guy David",
                "href": "/profile/Guy-David-3"
            },
            "answer_text": "If the concept of a multiverse is true, it's no big deal. God is the ultimate cause of everything in existence. ",
            "date": "Answered November 17, 2015",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ramon Morales",
                "href": "/profile/Ramon-Morales"
            },
            "answer_text": "Same number as it takes to change a light bulb. ",
            "date": "Answered January 3, 2015",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mahesh Varma",
                "href": "/profile/Mahesh-Varma"
            },
            "answer_text": "All it took wast just one big bang !! ",
            "date": "Answered November 21, 2014",
            "views": "101",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Om Shanti",
                "href": "/profile/Om-Shanti-27"
            },
            "answer_text": "God is one and so the universe.you are also the one. ",
            "date": "Answered July 19, 2017",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Thompson",
                "href": "/profile/Chris-Thompson-40"
            },
            "answer_text": "Either one or more >☝. ",
            "date": "Answered June 26, 2015",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jake Keating",
                "href": "/profile/Jake-Keating"
            },
            "answer_text": "Aproximately 10$^{70}$ ",
            "date": "Answered February 20, 2014",
            "views": "116",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kaustav Chakravarthy",
                "href": "/profile/Kaustav-Chakravarthy"
            },
            "answer_text": "Just me. ",
            "date": "Answered February 17, 2014",
            "views": "85",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eric Hanson",
                "href": "/profile/Eric-Hanson-95"
            },
            "answer_text": "1 ",
            "date": "Answered May 19, 2019",
            "views": "10",
            "upvotes": "0"
        }
    ]
}