{
    "title": "If spacetime is a single entity, would space cease to exist if you froze time? - Quora",
    "tags": [
        "Spacetime",
        "General Relativity"
    ],
    "response": [
        {
            "author_info": {
                "name": "David W. Vogel",
                "href": "/profile/David-W-Vogel"
            },
            "answer_text": "A2A: Well, yes. If time stopped how could you measure a distance? How could you move? Light would cease to propagate, so you would be blind. A train of thought would be impossible. There would be no evidence of space. The main reason for regarding space and time as one \"thing\" was provided by Einstein's math professor and mentor, Hermann Minkowski. He noticed that all of special relativity could be summed up in a modified distance formula. Mathematicians and physicists prefer to use the square of the distance. They call it a metric. Recall that the metric for two points on a plane is [math]\\Delta x^2 + \\Delta y^2[/math]. For 3-dimensional space the metric is [math]\\Delta x^2 + \\Delta y^2 + \\Delta z^2[/math]. This formula applies to what we now call Euclidean space. In relativity theory this metric is inconsistent; observers in different reference frames measure different distances between points. However, the expression [math]\\Delta x^2 + \\Delta y^2 + \\Delta z^2 - c^2 \\Delta t^2[/math] is invariant (doesn't depend on the reference frame of the observer). Minkowski showed that all of special relativity follows from treating this expression as the metric of 4-dimensional spacetime. It is simply a concise and convenient way of representing reality. (It is not Euclidean because the 4th term of the expression must be subtracted instead of added.) ",
            "date": "Answered April 21, 2016",
            "views": "142",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harry McLaughlin",
                "href": "/profile/Harry-McLaughlin"
            },
            "answer_text": "This like asking if we take a piece of graph paper and froze the x-axis, would the y-axis cease to exist? In relativity, time is a length, a distance through spacetime. Furthermore these lengths are entangled (not in the quantum sense of the word), that is, what is a spatial distance to some can be a temporal distance to others.  Besides, spacetime is perfectly consistent with the notion of all time and space existing as a single unchanging 4-dimensional block - the Block Universe. The perspective of the question could be from a psychological experience of time and how this is connected with its use in physics. If so then we need to be very careful about how the question is being asked, for instance, is the idea that all worldlines come to an end or that the notion of proper time is somehow no longer valid? Specifically, an answer in the context of physics requires specifying exactly what \"froze\" time is to mean.  ",
            "date": "Answered April 26, 2016",
            "views": "271",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Troy Seivad",
                    "user_href": "/profile/Troy-Seivad"
                },
                {
                    "user_id": "Satyam Singh",
                    "user_href": "/profile/Satyam-Singh-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Magalhães",
                "href": "/profile/Daniel-Magalhães-2"
            },
            "answer_text": "If we picture the dimensions of space and time as two strings in the Universe's fabric, existence would be precisely that point where they merge. So yes, freezing one would definitely freeze the other, but that's the short answer to a question that deserves more.  If – as you point – spacetime is a single entity, wouldn't existence itself depend on the fact that they stick together? IF the very human concept of existence is inexorably linked to the fact that these two dimensions merge, therefore nothing would cease to exist because existence itself wouldn't even exist.  Sound paradoxal, isn't it? Hope that sequence of IFs leave's us a bit further on this matter! :) ",
            "date": "Answered April 20, 2016",
            "views": "85",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vini S",
                    "user_href": "/profile/Vini-S-1"
                }
            ]
        }
    ]
}