{
    "title": "If someone told you they were going to kill you, would you try and kill them first? - Quora",
    "tags": [
        "Death Threats",
        "Killing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kathy Barber",
                "href": "/profile/Kathy-Barber-13"
            },
            "answer_text": "He didn’t tell me to my face, he told his psychiatrist, who took him seriously enought to telephone me in North Carolina that when he got out of the hospital in New Jersey he was coming back to kill me, and my children. He was my estranged husband, their stepfather. I called the Magistrate, can’t get a restraining order if he’s not in the state. Call when he comes back to NC. I called the Women’s Shelter, my daughter and I could go into protected housing. But my son at 13 was too old for the shelter and would be on his own. Against the crazy man who wanted to kill him. Nope, not doing that. I called my son’s teacher. He agreed to hide my son if necessary, on the other side of the county until he could get him to a friend in the next county who would protect him with his life. I called their father, my first ex, and let him know what was going on. He came down and stayed with us to make sure we were safe. We never hated each other, just didn’t agree on some lifestyle choices and got along better long distance. My former neighbor called me to let me know she saw my soon to be ex, riding with another former neighbor and heading my way. I called the sheriff, who basicly said call if he shows up at the house. As soon as we saw them riding up and down the block, I called. They did finally come this time. He claimed he only wanted ‘his stuff’ he’d left when he left in February. It was August. Sheriff told him to take me to court for it. I was nice enough to get the one thing he wanted most of all. His winter coat. He left. Never saw him again. Got my divorce, and he called me once. Wanting to know if I would come pick him up at the bus station. Nope. ",
            "date": "Answered August 5, 2018",
            "views": "644",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Stevlyn Group",
                    "user_href": "/profile/Stevlyn-Group"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Williams",
                "href": "/profile/Andrew-Williams-92"
            },
            "answer_text": "That would rather depend on who they were. I don’t preemptively kill people based on threats - very few have the desire and ability to carry them out. If the threat is real, my first instinct would be escape. Killing people is messy and leads to lots of paperwork. It’s also quite dangerous, especially if you don’t have a gun or any training with one. Going up against a killer, my odds would not be good. If escape is impossible and the threat is clear, however, I might make the attempt. Not saying I’d get very far, but I’d have nothing to lose! ",
            "date": "Answered August 6, 2018",
            "views": "147",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Andrew D Reeves",
                    "user_href": "/profile/Andrew-D-Reeves"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vincent Beers",
                "href": "/profile/Vincent-Beers"
            },
            "answer_text": "That depends on the situation. Is it clear that they have no opportunity to kill me? Then their words are meaningless. Are they close enough to me that their words and actions are a valid threat? I’m not going to hunt them down, it’s a waste of my time. But if they are close enough that the threat is immediate, they are going to die and it’s going to be labeled self defense. Threaten my life when it’s just words and I’m going to ignore it. Threaten my life and actually be close enough to me for the threat to be real. There’s nothing to talk about, you just signed your own death warrant and your monologue at me is just wasted air. ",
            "date": "Answered August 5, 2018",
            "views": "146",
            "upvotes": " Answer requested by Sharon Sims",
            "upvoters": [
                {
                    "user_id": "Tyrone Ray",
                    "user_href": "/profile/Tyrone-Ray-2"
                },
                {
                    "user_id": "Richard Dahm",
                    "user_href": "/profile/Richard-Dahm"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Connelly",
                "href": "/profile/Brian-Connelly-21"
            },
            "answer_text": "If someone told you they were going to kill you, would you try amd kill them first? A few people have said they were going to kill me - only one who said it ever tried (chased me with a knife - the inconsiderate prick!) - and I ran faster than he did. So I survived. If I had killed all the nutcases who had said it (and most of them were just that - nutcases), I would be classed as a serial killer. So - as to you killing them to pre-empt your own demise - dumb idea, most people are just talk. Or unwell. A day later they don’t realise what they were saying, or are sorry for it if they do remember. If you go out with a mindset that verbal threats of lethal violence needs to be met with lethal violence you are going to spend a long time in jail - or end up on death row.  “You can’t do this - he said he was going to kill me” ",
            "date": "Answered August 5, 2018",
            "views": "156",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew D Reeves",
                    "user_href": "/profile/Andrew-D-Reeves"
                },
                {
                    "user_id": "Bill Reich",
                    "user_href": "/profile/Bill-Reich-2"
                },
                {
                    "user_id": "Richard Dahm",
                    "user_href": "/profile/Richard-Dahm"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris McKinney",
                "href": "/profile/Chris-McKinney-27"
            },
            "answer_text": "The credibility of the threat makes all the difference. In the vast majority of circumstances I can force a person to submit without killing them, if I can’t and they present a credible threat of death or great bodily harm . . . I can and will, legally, stop them. Stopping may involve killing but it doesn’t have to and most times doesn’t. Pistol bullets are bad for opposing morale and frequently stop threats but modern medicine more often than not creates survivors of criminal stupidity. ",
            "date": "Answered August 5, 2018",
            "views": "180",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Benjamin Larson",
                    "user_href": "/profile/Benjamin-Larson-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bryan Potratz",
                "href": "/profile/Bryan-Potratz"
            },
            "answer_text": "If and only if they demonstrated both the desire and capacity to do so. Just saying something isn't even necessarily demonstrating the desire to do something. Words are not actions. But if the say something, then act on that expression, AND appear to have the capacity to carry it out? Yeah, they either stop or get shot. This is the classic “Just War” condition. One may justly agressively preempt demonstrative aggression, but may not aggressively take “preventitive” action against a mere perception/threat. It's a fine line, but one that every human should ingrain. ",
            "date": "Answered August 17, 2018",
            "views": "218",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Laurie Iversen",
                    "user_href": "/profile/Laurie-Iversen-2"
                },
                {
                    "user_id": "Tyrone Ray",
                    "user_href": "/profile/Tyrone-Ray-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Thompson",
                "href": "/profile/John-Thompson-321"
            },
            "answer_text": "Possibly … If it was some idiot who said it in a fit of anger and clearly didn’t mean it seriously, then, no .. likewise, if someone made the threat but clearly lacked the means or opportunity to carry it out I might report the threat but do nothing else otherwise. However, if a person was in my presence, with the ability to act on the threat, and looked likely to carry it out, I would probably use some sort of defense… and deadly force if that was necessary. ",
            "date": "Answered August 5, 2018",
            "views": "80",
            "upvotes": " Answer requested by Sharon Sims",
            "upvoters": [
                {
                    "user_id": "Giavanna Buonarroti",
                    "user_href": "/profile/Giavanna-Buonarroti"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laurie Camp",
                "href": "/profile/Laurie-Camp-1"
            },
            "answer_text": "I would step closer to them and ask them how they planned on doing that. If they didn't have a plan I would tell them about the plan I just made to kill them. If they had a plan, I would just nod in agreement. Then I would stare them down. The demon that lurks deep within me would hope they would indeed try to take a shot. If they did, that demon would have no mercy. If they didn't take their shot, they'd never get one. ",
            "date": "Answered August 5, 2018",
            "views": "250",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Lee Littlebird",
                "href": "/profile/Lee-Littlebird"
            },
            "answer_text": "I wish I had a dollar for everytime some punk said that to me. And a few have tried and a couple have even came close but I'm still here. Some people aren't very smart and will say that but not mean it but the neighborhoods I live in and the people I'm around you can pretty well count on 2 things. 1 they mean it and 2 they are armed with something. ",
            "date": "Answered October 30, 2018",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Louise Sackville",
                "href": "/profile/Louise-Sackville"
            },
            "answer_text": "No. First I would tell the police so they could hunt the person down and hopefully arrest him or her for making a murder threat. Then I’d hire a private security company to protect me. I’m not a good hunter so I’d feel there was a better chance of surviving if I got the police and a security provider involved. And finally, I’d hire a lawyer to sue the crap out of the person who threatened to kill me, once the police catch him or her. ",
            "date": "Answered August 5, 2018",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Viktyr C Gehrig",
                "href": "/profile/Viktyr-C-Gehrig"
            },
            "answer_text": "Question: “If someone told you they were going to kill you, would you try and kill them first?” It depends on who it was. There are… maybe a little more than a handful of people I would rather allow to kill me than to raise my own hand against them. Anyone else, yes, immediately. ",
            "date": "Answered August 5, 2018",
            "views": "50",
            "upvotes": " Answer requested by Sharon Sims"
        },
        {
            "author_info": {
                "name": "Dennis Cybulski",
                "href": "/profile/Dennis-Cybulski"
            },
            "answer_text": "Not unless they actually tried. If one preemptively murders another individual they will be charged with a murder regardless of any threat the deceased had allegedly made. Self defense laws do not apply to threats. ",
            "date": "Answered August 6, 2018",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Dahm",
                "href": "/profile/Richard-Dahm"
            },
            "answer_text": "No, if their talking, it's likely that's all it will be. Those that have tried weren't courteous enough to tell me first. ",
            "date": "Answered August 5, 2018",
            "views": "38",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Betsy Devlin",
                "href": "/profile/Betsy-Devlin"
            },
            "answer_text": "No I would make them a sandwich. Maybe they're just hungry. Wait, are we talking about a toddler? ",
            "date": "Answered August 5, 2018",
            "views": "62",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Hooper",
                "href": "/profile/Michael-Hooper-16"
            },
            "answer_text": "I would rather die without having killed someone than live as a murderer. One of the primary reasons I don’t own any guns. ",
            "date": "Answered August 5, 2018",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sue X Brown",
                "href": "/profile/Sue-X-Brown"
            },
            "answer_text": "Probably ",
            "date": "Answered August 5, 2018",
            "views": "33",
            "upvotes": "0"
        }
    ]
}