{
    "title": "If soul has no attachment towards anything. How we go to the soul level and live. Like we know something has happened our mind will give many ideas which may be true or false but soul gives the correct answer. Has anyone experienced it? - Quora",
    "tags": [
        "Soul (metaphysical entity)",
        "Spirituality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Siva Charan",
                "href": "/profile/Siva-Charan-97"
            },
            "answer_text": "The soul is nothing but the Self - whatever you call as yourself. So it’s not something that’s new or not existing. You are always existing at that level but because you are accustomed to a body and a mind, you think - you are the body or mind. So even at this moment - you are already living as the soul - you cannot live any other way. The mind is simply a processor that uses your memory, generates combinations and keeps coming to conclusions. It can only see the world through the five senses and hence is limited to only that which they see. But the Self is beyond (behind) the mind and at that vantage point, one can not only see what the mind is doing, one can even observe themselves passing through all the three stages of waking, sleeping and deep dreamless sleep. So the Self is very much what we really are. ",
            "date": "Answered June 7, 2020",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aditya S",
                    "user_href": "/profile/Aditya-S-115"
                }
            ]
        },
        {
            "author_info": {
                "name": "Swami Jai Deep",
                "href": "/profile/Swami-Jai-Deep"
            },
            "answer_text": "You can access your soul's wisdom if you become desireless. Your soul will speak to you if you transcend your mind. Soul is enslaved by worldly desires and lusts and soul lives inside subtle body which takes on new birth after death. To get direct guidance from soul , you will have to be self-realised. Only self-realised person can talk to soul. Yes I have experienced it and I experience it regularly. ",
            "date": "Answered June 7, 2020",
            "views": "46",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Siva Charan",
                    "user_href": "/profile/Siva-Charan-97"
                },
                {
                    "user_id": "Aditya S",
                    "user_href": "/profile/Aditya-S-115"
                }
            ]
        },
        {
            "author_info": {
                "name": "AiR Institute of Realization",
                "href": "/profile/AiR-Institute-of-Realization"
            },
            "answer_text": "Of course there are people who have realized the truth about the soul. There are many such realized souls in the east and west. It is not common but people do realize the Truth. Then knowing we are not the body, they do not have cravings of the senses; knowing that they are not the mind and ego, they do not let their mind wander and worry. They control the mind, they transcend the mind and even the ego. So one should read about these realized souls. It may be Ramakrishna Paramhamsa or Vivekananda. It may be Ramana Maharshi, Adi Shankaracharya. There are many people who have shared their life story, where they make us understand we are none other than the Divine. When we reach that level of non-duality, then we realize the Truth ",
            "date": "Answered June 29, 2020",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nitin Panchanathan",
                "href": "/profile/Nitin-Panchanathan"
            },
            "answer_text": "I have never believed that nothing is truly no thing and that infinity cannot be measured. I feel everything is something. That something however small or big is still something. I doubt it that we get the right answers always we have a super level intuition which may come after many many years of arduous penance and after achieving atleast some level of communion with god. I have received answers which are correct sometimes using my intuitive powers but not always. ",
            "date": "Answered June 7, 2020",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jyothi Pandit",
                "href": "/profile/Jyothi-Pandit-2"
            },
            "answer_text": "Nothing comes from speculation.Unless you have a guru who can transmit the experience to you ,there will be all kinds of doubts.If you are pursuing sadhana on your own then the easier way is through bhakti,then you dont have to worry about mind and delusions, soul etc. ",
            "date": "Answered June 7, 2020",
            "views": "27",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aditya S",
                    "user_href": "/profile/Aditya-S-115"
                }
            ]
        }
    ]
}