{
    "title": "If there was a universe with no consciousness to observe it, would it even exist? - Quora",
    "tags": [
        "Consciousness",
        "Existence",
        "The Universe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Craig Weinberg",
                "href": "/profile/Craig-Weinberg"
            },
            "answer_text": "What would such a universe be, in which no seeing, feeling, touching, etc is possible? In what way could that universe be different from a universe which does not exist, other than we, with our conscious imagination can project our own awareness outside of it and just give the remaining abstraction the name of \"exists\". If we run it the other way, and assume that existence does not require any sort of sensing, feeling, knowing, perceiving, etc then we must ask how and why such things would come to be at all, given that every one of their functions would be mechanically redundant. The universe that exists without consciousness as no plausible way, as far as I can tell, to accidentally develop the possibility of consciousness, let alone the actuality of it. I think that the difficulty in thinking about this philosophical question is that the nature of consciousness is such that it contains limitations which are ultimately a mirage. Our own level of human consciousness is so different from that of other species, that it is easy to think of our particular quality of consciousness as the defining quality, so that plants, bacteria, and even molecules are surely not conscious in a way which is as significant as our own. While this may be true, the question of what it means is another story.  Because consciousness has to do with the framing of experience, perception is not so much a matter of being an accurate or inaccurate model of an external reality, but a way of filtering and shaping experience from the outside in and the inside out. When we see an insect or a rock, we see only the tip of the iceberg which is available to our eyes and skin for inspection. The exterior of the insect is what is seen by through the experience of the cells of our eyes, and the projections of our psyche. It's not that the bug isn't real, it just isn't the same to us in our frame of reference as it is within its local frame of reference, and neither is the universe in general. An insect sees walls as places to walk on, water as something that can be stored in spheres in the middle of a blade of grass, etc. The entire universe could be nothing but nested experiences, even into the subatomic level. As we know, quantum mechanical phenomena are not really conceivable as material objects, but rather as immaterial states of shared tendencies. Isn't that a description of consciousness? ",
            "date": "Answered June 22, 2014",
            "views": "2",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mary Cris",
                    "user_href": "/profile/Mary-Cris-15"
                },
                {
                    "user_id": "Frenya Franklin",
                    "user_href": "/profile/Frenya-Franklin"
                },
                {
                    "user_id": "Hendrik Lie",
                    "user_href": "/profile/Hendrik-Lie-1"
                },
                {
                    "user_id": "Mike Fifield",
                    "user_href": "/profile/Mike-Fifield"
                },
                {
                    "user_id": "Steve Ball",
                    "user_href": "/profile/Steve-Ball"
                },
                {
                    "user_id": "Stephen Wicklund",
                    "user_href": "/profile/Stephen-Wicklund"
                },
                {
                    "user_id": "Alex Juarez",
                    "user_href": "/profile/Alex-Juarez-4"
                },
                {
                    "user_id": "Dino Velvet",
                    "user_href": "/profile/Dino-Velvet-1"
                },
                {
                    "user_id": "Derek Brangan",
                    "user_href": "/profile/Derek-Brangan"
                },
                {
                    "user_id": "Joschka Yoshi Tryba",
                    "user_href": "/profile/Joschka-Yoshi-Tryba"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pranav Dewan",
                "href": "/profile/Pranav-Dewan-1"
            },
            "answer_text": "This is a very strange question. Is it a 'trick' question? Your answer is apparently in your question itself. How can any logical person…  … say otherwise? Your question has pre-supposed and pre-determined an answer. Please forgive me for saying so, but you are mixing up the paradigms of Spirituality and those of Quantum Physics. Sorry, but you are pre-supposing that they operate on the same root principles… Where, in Quantum or Classical Physics have you found this root of ‘Consciousness’?? What Consciousness? These relative realities only point to Superposition and Entanglement! Where have you found principles of ABSOLUTE Quantum Consciousness in the Observer?? I haven't found mention of any! Universal Consciousness doesn't even EXIST, according to the Scientist. Now, kindly prevent your mind from tripping over itself, and ponder upon Spirituality for a minute. My friend, you have referred to a Universe, and a Consciousness observing it. Yes? This can only be a Spiritual question. Because this involves Consciousness. Consider this: According to Spiritual Truth, Matter DOESN'T EXIST! Matter and it's Sense-dependent reality is an illusion that Indian Spirituality calls MAYA. The only 'thing' that exists is Conscious Energy. Consciousness. God is Infinite Conscious Energy, according to Indian Spirituality. The Universe/Multiverses are this Infinite Conscious Energy. It's very nature is Consciousness! Now you, the reader of this paragraph, are Conscious Energy. You are The Soul, according to Spirituality. You are merely a subset of the Infinite Conscious Energy. If you cease to observe, or to exist, will that prevent the innate Consciousness of the Universe to exist? No. Because Consciousness will still be observing Consciousness! Consciousness doesn't need eyes or instruments. Consciousness is aware of itself at all times! Still, it is good that the scientifically bent mind is now asking about Consciousness observing Reality. Earlier, people used to only talk about the human's five senses observing Reality. So, yes. Even without our individual consciousness to observe it, the Universe would continue existing quite comfortably. Nice trick question. ",
            "date": "Answered December 30, 2017",
            "views": "336",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dushyant Yadav",
                "href": "/profile/Dushyant-Yadav-12"
            },
            "answer_text": "Your father's father's father's father is no longer alive. Surprisingly, the universe still exists. All living things are just a bunch of atoms interacting with each other to remain stable. Our conciousness and the ability to think is also a result of this interaction. So, if we really talk in the language of physics, then this interaction is not at all important for the existence of the universe. BUT Quantum Mechanics (or more precisely - Heisenberg Uncertainty Principle) suggests that in some cases, for something to exist in a defined state, we need to measure/observe it. So, if this conclusion is taken to it's extreme limit, it can be said that the moon does not exist if nobody is observing it* (by observing I mean not feeling it's gravity, not seeing it, and not doing anything that tells you about it's presence). The same concept can be applied to the universe. If the lack of consciousness results in our inability to observe things, then the Universe will stop existing (given that no living being in the universe can observe it). *This conclusion is pretty valid at the very small scale (the quantum scale), but it's validity at larger scales is still a topic of debate. Cheers :) ",
            "date": "Answered November 27, 2015",
            "views": "394",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vishal Arsekar",
                    "user_href": "/profile/Vishal-Arsekar"
                },
                {
                    "user_id": "Jyoti Singh",
                    "user_href": "/profile/Jyoti-Singh-223"
                },
                {
                    "user_id": "Alex George",
                    "user_href": "/profile/Alex-George-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Miller",
                "href": "/profile/David-Miller-707"
            },
            "answer_text": "If there was a universe with no consciousness to observe it, would it even exist? We are such precious, narcissistic, omphalocentric* little life forms! We exercise what intelligence we have in introspection and endless self-analytical philosophising, all aimed at reassuring ourselves about how terrifically important we all must be and how essential to the smooth running, and, now it seems, the very existence, of our universe. We used not long ago to be the glorious chosen apex of creation, resplendent at the centre of everything, surrounded by our sun, moon and lots of pretty stars spread about by the gods, in tribute to us— a vast panoply we call for good reason the heavens, all created purely for our delight. Over the centuries, we have had to emerge kicking and screaming out of our comfy cocoon into a cold unfriendly universe where we are relegated to a very average little rocky ball in a remote corner of an insignificant galaxy amongst trillions of bigger and better ones. We could even be a dull little bunch of primitive animals ignored by the billions of far mightier intelligences we can never meet, spread across the vastness of a universe we will never be given access to. So, consciousness, according to us, is our tiny minds. Could the universe possibly go on existing without those? Phew! Now I’m not feeling so good. It’s back to the analyst for me. *Omphalocentric. Navel-gazing. ",
            "date": "Answered June 12, 2018",
            "views": "262",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tim Geannopulos",
                    "user_href": "/profile/Tim-Geannopulos"
                },
                {
                    "user_id": "Jeff Williams",
                    "user_href": "/profile/Jeff-Williams-180"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim H. White",
                "href": "/profile/Jim-H-White-1"
            },
            "answer_text": "Just a short set of comment, because this is an arena where so much is going on and so much is being learned. I will just make a few of a myriad of possible points, with no attempt at proof, but have been studying such things for decades and have 24 self-published book and mini-books on this and related subjects: Before even the ‘spacetime’ grid was formed, there was Pure Information that could guide all future development of this universe;As we can infer from the very successful equations that describe the evolving state of the universe, there is a great deal of complexity herein and a truly huge number of possibilities for growth;Without some sort of ‘selection between options’ process in place, there is no way that random chance could have resulted in life, or especially us as humans, in the about 14 billion years since the Big-Bang-like process started;Life exists;We exist to ponder all that has been going on and now exists (even though certainly not as we perceive it);The universe is a rather amazing ‘reality’ and we seem to have been intended, so we seem to be ‘Special;’The studies of human consciousness often result in consideration of even a Cosmic Consciousness; and,Just as there was Cosmic Consciousness before Energy/matter came into being, we are likely in existence before we even get a body made of Energy/matter and stardust!Do what you can to stay physically and mentally competent, for as long as you can, because there is going so much growth over the next while that it will be wonderful! Love and Above to those who wonder about such things! ",
            "date": "Answered March 5, 2019",
            "views": "106",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Siri Perera",
                "href": "/profile/Siri-Perera"
            },
            "answer_text": "Consciousness is a manifestation of the Absolute or Universal-mind. The body-mind thinking process seems to need consciousness to function. This is what the mystics say. I am just drawing it out for you what they say.  It has been said that this whole center play of energies below has no physical entity in the body or a place to settle itself into. When it stops functioning like without consciousness then the universe disappears. We operate through the 5 senses and we depend on this energy play below to perceive things. If it stops flashing about in us, then everything we see and perceive disappears. “They are only appearances that we see and not real.”  Having said the above I do believe that the mind can function with the universal mind. It we force ourselves to stop thinking with the body-mind-consciousness which also brings on silence in the body and mind and then try and think with the universal mind. The thinking with the Universal-Mind is not thinking as you know it but a kind of “being” where thinking is like a streaming of information with a no this-and-that thinking like we normally have in trying to figure things out with our body-mind - the figuring seems to have already been done and the results are passed on to us as information. This is where I have been: so just passing on a state of mind to be checked out by others. It is experiential information. If you cannot replicate it then my observation could be wrong. The body-mind-consciousness is what they call a Noumenon - It only appears to be what you see but it is not real. Lets face it there are no colors in the world but just its frequencies. The colors are given by the color senses in the eyes which the brain converts to make color for you. The palette of colors are in your brain and not outside you. The color is created as an appearance only after the frequency had entered your eyes and then brain. It is possible outside of your eyes it is all grey. What a lie in the Truth in you. Because, if you look closely inwards into thyself there are Truths which the mystics have discovered that show what your true self really is all about. What a magical game to play - knowing thyself as you truly are…… Hence that makes all of reality as we experience it as only an appearance and it is not real in us. What was there before birth and death - was only the Universal-Mind or the Absolute. We are born and the body-mind-consciousness start to figure out appearances. When we die the appearances all disappear and we are back to our source the Absolute/Universal-mind. In that sense the SELF and PERSONALITY that we think so important to us, and which we like to preserve, just does not exists in reality - it has no place to sit to stay permanent after we die. Lights on, personality on, or it feels like personality and lights off all personality gone and no trace of it left behind. We are back to being part of the Universal-mind and waiting for our next manifestation. Please comment if I am wrong. Only in relationship can the “new” be seen. ",
            "date": "Answered December 23, 2018",
            "views": "264",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wilson Westbrook",
                "href": "/profile/Wilson-Westbrook"
            },
            "answer_text": "If you take the quotes off of \"consciousness\", and look at the different meanings the answer isn't that mysterious. So let's do that. If you mean human consciousness (/experience) then broadly speaking no, not at all. The universe is much much older than us, and did not spring into being because some plains apes appeared out of the quantum foam. However, Aspects of what we call reality only exist because of us. Time, for instances, only exists as a perceptual tool for human/animal consciousness, and in that sense if all animals died time wouldn't exist.  If you are willing to accept pan-psychism, the idea that literally everything has an consciousness/experience, then you can make the argument that existence and experience are two sides of the same coin, because if some phenomenon isn't observed/experienced by something else - even just cosmic background radiation, the Higgs Field, etc - then it is indistinguishable from it not happening ",
            "date": "Answered December 10, 2015",
            "views": "189",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vishal Arsekar",
                    "user_href": "/profile/Vishal-Arsekar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gregg Kroodsma",
                "href": "/profile/Gregg-Kroodsma"
            },
            "answer_text": "That is an egocentric question. Do you think a rock has had no consciousness? Well, of course a rock has been compressed by gravity to be what it is. Let me formulate an example. The whole of the universe is water without oxygen; that is what it is. Do you realize that? Water is H2O, outer space is mostly H (Hydrogen). Everywhere in the universe was teaming with life, consciousness. You know, I have always wondered in the back of my mind what the Native Americans meant by ‘The walls fell.’ People’s idea of that statement is that there is a brick wall and it falls, but it is opposite of that and at the same time it is not. That takes a little explaining. Each planet in our universe, there is about how many, a trillion? Each planet is a brick and they were all together as one wall and something collided with that wall and broke it all up. Was that wall consciousness? What is the largest planetary body bigger than Betelgeuse? Now, what happens when you throw a huge water balloon against a flimsy wall? ",
            "date": "Answered December 21, 2017",
            "views": "183",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Birch",
                "href": "/profile/Jim-Birch"
            },
            "answer_text": "There is no good evidence that what we call consciousness is a physically priviledged or special process. People do make claims like this but their evidence is in essence a subjective impression. People believe all sorts of weird stuff based on subjective impressions; humans are imaginative creatures. People also claim that trees are green, but this is “naive realism” assuming that the world is actually identical to our perceptions. Just a little analysis (eg, consider color-blindness) reveals that there is clearly no greenness in trees, the greenness is a trick of presentation that occurs as a result of the way the brain is wired. There is no reason to believe the weird things that people believe about consciousness are any more that tricks of presentation, and a bit of imagination and narrative. The brain is complex and we don’t understand it (that much). Humans struggle with simple things like sudoku; they certainly aren’t going to be capable of analysing the brain itself. So, the workings of our own brain are hidden from ourselves; we have a grossly simplified working representation of what is really going on. Most of the fanciful ideas that is believed about consciousness are errors of naive realism, believing that this representation is that actual workings of the brain. It clearly isn’t, and there is a library of psychological evidence that demonstrates that it isn’t. If a bunch of photons hit an eyeball, a bunch of physical effects occur. Some effects may propagate into the brain. Similarly, a bunch of photons hit a rock a different bunch of physical effects occur. Neither of these events will create the source of the photons. ",
            "date": "Answered January 3, 2018",
            "views": "194",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kris Iyer",
                "href": "/profile/Kris-Iyer-1"
            },
            "answer_text": "Not a well formed question.It should be: \"Would the universe continue to exist even if we are not aware of its existence.\" Don't bring consciousness into this, it is a mysterious element and there is nothing science can say to deny or affirm the existence of this mysterious element. So that apart.Lets not complicate anything with \"esse est percipe - to be is to be perceived.\"Lets keep things very simple and very direct. In our not being aware or in our sleep, we see no real world, but probably a subjective world within our control and it reacts as per our actions/reactions.  In our being aware we see the light and darkness and all the many objects that move independently without needing our effort.  It appears the universe/the world around us still running and even if we are not aware of it or when we were in a deep trance.  Your subjective switches will switch off / on  only your screen not the universal screen. And probably there is no universal screen, the drops probably give the appearance of an ocean, there is no ocean, just drops. Thanks for the question. ",
            "date": "Answered November 28, 2015",
            "views": "139",
            "upvotes": " Answer requested by Vishal Arsekar",
            "upvoters": [
                {
                    "user_id": "Hendrik Lie",
                    "user_href": "/profile/Hendrik-Lie-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jean-Pierre Legros",
                "href": "/profile/Jean-Pierre-Legros"
            },
            "answer_text": "This question has several drawers: The first: the universe is it virtual (production of the mind) or real (independent of it)? Although the representations of mind about the universe are owners, it is assumed that there is a independent essence of the real. Why is this a good bet? Because if our universe is completely owner of mind, so it strictly says nothing of what is that mind. No external reference. All questions become insoluble in the sense that all the answers are allowed. The second: if there is a independent real, it produced other minds who seem different from our. We can not even « fit » their vision. All we can do is to pool our representations and compare them. Thus we establish a kind of conceptual mold around the real. It is a collectivist process and not a individualist one. The third: if the universe and its representation in our minds are two different things, disappearance of the second don’t stop the first. However the representations of our minds belong to reality. They are the highest part of his organization (we know presently). If all minds disappeared (including non-terrestrial possible), the universe would lose the top layer of its organization. It would become a heap of stupid molecules. Possibly able to rebuild something else... it has been already very creative :-) ",
            "date": "Answered October 31, 2016",
            "views": "570",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jeanette Leuers",
                    "user_href": "/profile/Jeanette-Leuers"
                },
                {
                    "user_id": "Peter Vicary",
                    "user_href": "/profile/Peter-Vicary"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shobhit Tripathy",
                "href": "/profile/Shobhit-Tripathy"
            },
            "answer_text": "Every creation in the universe and even the universe itself is composed of two components, Matter and consciousness. To illustrate it further let me take an example of a stone. It is made up of matter as science tells us. But what is the driving force which makes it a stone and not a plant. This driving force is consciousness. There are different levels of consciousness present. We,humans exhibit the highest level of consciousness but everything,be it living or non living exhibits consciousness. So,to separate consciousness from universe is like talking about yin without yang. You might argue that your view of the universe is based on your consciousness and different people will have different views depending on their levels of consciousness. But the truth is their exists one universal consciousness which governs all sub consciousness if we may call them. This consciousness is independent of whether you perceive it or not. It is the driving force in the universe. If it is not present,the universe will cease to exist. ",
            "date": "Answered June 24, 2014",
            "views": "476",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kevin Klein Cartagena",
                    "user_href": "/profile/Kevin-Klein-Cartagena"
                },
                {
                    "user_id": "Tony Jackson",
                    "user_href": "/profile/Tony-Jackson-75"
                },
                {
                    "user_id": "Sohail Ahmed",
                    "user_href": "/profile/Sohail-Ahmed-7"
                },
                {
                    "user_id": "Javier Tan",
                    "user_href": "/profile/Javier-Tan-3"
                },
                {
                    "user_id": "Derek Simon",
                    "user_href": "/profile/Derek-Simon-4"
                },
                {
                    "user_id": "Robert Ryan",
                    "user_href": "/profile/Robert-Ryan-35"
                },
                {
                    "user_id": "Mahesh Soori",
                    "user_href": "/profile/Mahesh-Soori"
                },
                {
                    "user_id": "Jon Jermey",
                    "user_href": "/profile/Jon-Jermey"
                },
                {
                    "user_id": "Mitch Williams",
                    "user_href": "/profile/Mitch-Williams-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geoff Lawson",
                "href": "/profile/Geoff-Lawson-4"
            },
            "answer_text": "For a start consciousness is here now, in the universe on this planet earth. Could the universe exist without consciousness? Yes, it could. But because of consciousness we are witnesses to what we call the universe (or that part of it we are capable of observing), the rest is speculation. Without consciousness the universe and all its elements would go on without us. As it did for billions of years before sapient creatures arose on this planet, and as it will long after our world is extinguished when our sun expands and explodes in a few billion years. Now you might hold that we are stardust and from that inception we became conscious beings. So could there be conscious beings out there? Possibly, but unless we are sure of their existence, that also is speculation. We humans are good at speculating possibilities, but just because we can and do speculate does not necessarily give us sufficient grounds to expect our intellectual peregrinations and ratiocinations to be the real deal. Empirically, there is just us floating in space on a tiny planet circumnavigating a star in or very own cosmos, looking out in wonder “Could the universe exist without us,I wonder”. ",
            "date": "Answered March 4, 2019",
            "views": "306",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Ashby",
                "href": "/profile/Jim-Ashby"
            },
            "answer_text": "Yes, of course. Reality, the truth, the universe: none of these things are concerned with human existence (much less, human perception). The universe existed for billions of years before the advent of life. There are some who hold that the moon doesn’t exist unless you look at it. But that’s ridiculous. If a million people look at the moon, not only will they see it, they’ll see it in the same lunar phase — despite not knowing which phase it should be in. If a million rural people were walking outside at midnight during a full moon, they would see their shadow cast by the moon and be able to estimate its position and phase (from its relative brightness) even though they have no idea where the moon should be or which phase it is in. When they turn around and look at the moon, they won’t be surprised that their estimates were pretty reliable. ",
            "date": "Answered October 30, 2016",
            "views": "397",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vishal Arsekar",
                    "user_href": "/profile/Vishal-Arsekar"
                },
                {
                    "user_id": "Craig Weinberg",
                    "user_href": "/profile/Craig-Weinberg"
                },
                {
                    "user_id": "Steve Ball",
                    "user_href": "/profile/Steve-Ball"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priyha Kannan",
                "href": "/profile/Priyha-Kannan"
            },
            "answer_text": "Sir, to keep things easy and for the sake of clarity, shall we call all that the thought creates as reality? Physical objects which are also a product of thought, though an actuality, that is, though it has an actual physical existence independently of thought to some extent, is equally a part of this reality because to some extent, how one perceives the physical objective world and objects, would depend on one's own background of experiences and perceptions, is it not? A table is a physical object, and therefore has an existence independently outside of thought, and to that extent, it is an actuality. Yet, it is also a product of thought, and to that extent, it is a part of reality too, is it not? If one were to take away, all that is left of this reality, including the psychological self/ the “me or ego”, what remains? When one’s mind is empty, one’s thoughts ceases. In that cessation, there is the cessation of me, the ego, is it not? What is left of my consciousness if the content of the “me” ceases? My content includes, my experiences, feelings, emotions, ideas, opinions, perceptions, prejudices, desires, love, hatred, anger, jealousy, successes, failures, fears, anxieties etc. This is what defines me as a person, is it not? If all this is removed from my consciousness, what am I left with? In other words, if you removed the “I” from your consciousness, what is left? Emptiness, Nothingness, Silence. And in that emptiness there is a tremendous expanding energy. But that source of creation itself can never be a creation for it to be grasped by the mind.Writings of Priyha Kannan ",
            "date": "Answered November 18, 2016",
            "views": "331",
            "upvotes": " Not for Reproduction",
            "upvoters": [
                {
                    "user_id": "Reginald Cristofer Rogoff",
                    "user_href": "/profile/Reginald-Cristofer-Rogoff"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeffrey Werbock",
                "href": "/profile/Jeffrey-Werbock"
            },
            "answer_text": "Can the universe exist without hydrogen? Without water? Without dust and other matter? Without light? Each and every component of the Whole is an inevitable part of that Whole. The Whole would not be without its parts and every part is an integral part of the Whole. What seems to be up for debate is whether consciousness is a special part or not. Have you heard of general relativity? Part of it explains that there is no privileged place or time, that everything is relative to everything else. I think that principle holds for all the parts of the Whole; there is no privileged part that is more important, more significant, more real, than any other part. Consciousness merely enables us animals with brains to perceive and evaluate those other parts; it isn’t privileged as a part of that Whole any more than water is because it makes other stuff wet. Consciousness enables us to witness other stuff; it isn’t privileged just because it enables us to witness stuff, it just is. And, it cannot not be, just like everything else in existence. ",
            "date": "Answered March 4, 2019",
            "views": "220",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roy Smith",
                "href": "/profile/Roy-Smith-36"
            },
            "answer_text": "Nothing can exist without consciousness.  Consciousness is the basic fabric of life.  It takes on endless permutations and levels that weave and intertwine with one another in a vast tapestry.  To say that consciousness is one thing and existence is another, is a gross misunderstanding of the nature of existence.  Knowing how different fields of consciousness interpenetrate and interact should be a goal of science.  Science is still in it's stone age with it's emphasis on a \"material\" universe separate from consciousness.  The materialist model dominates current thinking and excludes the role of consciousness by limiting it to an epiphenomenon of the human brain.  That is a backward understanding. Yet, the paradigm of materialism is such a dominant or rule set or matrix in human thought, that few see through it. ",
            "date": "Answered November 28, 2015",
            "views": "306",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sahithi",
                    "user_href": "/profile/Sahithi-59"
                },
                {
                    "user_id": "Elwood Caswell",
                    "user_href": "/profile/Elwood-Caswell"
                },
                {
                    "user_id": "Ron Kolinie",
                    "user_href": "/profile/Ron-Kolinie"
                },
                {
                    "user_id": "Ji Jidoix",
                    "user_href": "/profile/Ji-Jidoix"
                },
                {
                    "user_id": "Caley Tibbittz",
                    "user_href": "/profile/Caley-Tibbittz"
                },
                {
                    "user_id": "Taiye Adeboye",
                    "user_href": "/profile/Taiye-Adeboye-1"
                },
                {
                    "user_id": "Griffin Jones",
                    "user_href": "/profile/Griffin-Jones-15"
                },
                {
                    "user_id": "Quentin Pain",
                    "user_href": "/profile/Quentin-Pain"
                },
                {
                    "user_id": "Tony Slavin",
                    "user_href": "/profile/Tony-Slavin-1"
                },
                {
                    "user_id": "Rob Heusdens",
                    "user_href": "/profile/Rob-Heusdens"
                },
                {
                    "user_id": "Tony Jackson",
                    "user_href": "/profile/Tony-Jackson-75"
                },
                {
                    "user_id": "Sohail Ahmed",
                    "user_href": "/profile/Sohail-Ahmed-7"
                },
                {
                    "user_id": "Denis O'brien",
                    "user_href": "/profile/Denis-Obrien-10"
                },
                {
                    "user_id": "David Dennis",
                    "user_href": "/profile/David-Dennis-12"
                },
                {
                    "user_id": "Ross Rheingans-Yoo",
                    "user_href": "/profile/Ross-Rheingans-Yoo"
                },
                {
                    "user_id": "Benjamin Talbot",
                    "user_href": "/profile/Benjamin-Talbot"
                },
                {
                    "user_id": "Jon Jermey",
                    "user_href": "/profile/Jon-Jermey"
                },
                {
                    "user_id": "Puru Bheemireddy",
                    "user_href": "/profile/Puru-Bheemireddy"
                },
                {
                    "user_id": "Jim Ashby",
                    "user_href": "/profile/Jim-Ashby"
                },
                {
                    "user_id": "Frans du Plessis",
                    "user_href": "/profile/Frans-du-Plessis-1"
                },
                {
                    "user_id": "Hariharan Srihari",
                    "user_href": "/profile/Hariharan-Srihari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Heusdens",
                "href": "/profile/Rob-Heusdens"
            },
            "answer_text": "Well, the materialist assumption is that “things exist independent, apart and outside of cognition”. In the idealist perception of the world however, such would not be true. The existence of the world however prior to the existence of human species or even living species, is nevertheless assumed by science in different fields (astrology, cosmology, geology, etc.). But basically, the question is: what do you mean with ‘existence’? If you mean “knowledge about existence” then sure, only if a conscious observer has gathered knowledge about something existing, only then it can be said to exist. But - on the other hand - if you define existence based on the agreement that things do exist, despite they are not observed and no knowledge exists about their existence or their existential state, then for sure, the universe exists even without someone having awareness about it or knowledge about it. ",
            "date": "Answered December 21, 2017",
            "views": "113",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Se Aviles",
                "href": "/profile/Se-Aviles"
            },
            "answer_text": "Affirmative. The existence and way of being of matter do not depend on any Being observing it, that is, it exists by itself and is, and therefore has objective character. It is knowable by itself being an integrated being. And, it reiterates, it generates the knowledge of itself, by itself. Life is property of dynamic matter. This property manifests itself as organic life when a dynamic entity reaches a certain level of evolutionary integration, that of algae, for example, in which the phenomenon of individuation appears for the first time in the history of the process of evolutionary integration. And much later, in due time, consciousness appears in the beings that reached the last level of evolutionary integration, achieved to date. Matter = Dynamic Matter + Static Matter. Dynamic Matter possesses energy. Static matter possesses inertia. ",
            "date": "Answered October 8, 2018",
            "views": "114",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sufyan Shahid",
                    "user_href": "/profile/Sufyan-Shahid-15"
                },
                {
                    "user_id": "Jim H. White",
                    "user_href": "/profile/Jim-H-White-1"
                },
                {
                    "user_id": "Ralph Glockemann",
                    "user_href": "/profile/Ralph-Glockemann-1"
                },
                {
                    "user_id": "Andrew Chen",
                    "user_href": "/profile/Andrew-Chen-303"
                },
                {
                    "user_id": "Klodiana Taci",
                    "user_href": "/profile/Klodiana-Taci-1"
                },
                {
                    "user_id": "Lance McDowell",
                    "user_href": "/profile/Lance-McDowell"
                },
                {
                    "user_id": "Shaun David",
                    "user_href": "/profile/Shaun-David"
                },
                {
                    "user_id": "Brendan Curtis",
                    "user_href": "/profile/Brendan-Curtis-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Burwood",
                "href": "/profile/Matt-Burwood"
            },
            "answer_text": "The universe appeared to exist for billions of years before life on earth was here. Not only do we have physical evidence of this, we can actually see this due to the finite speed of light and the fact that the light from those events is only just reaching us now.  In fact - there’s a mind bender for you (that the primitive pre-science mystics who thought up the “tree falling in the woods” dilemma could never even have dreamt of)… We are now observing distant stars as they were billions of years ago - imagine there was no life at that time. Does us now observing that past time have an impact on it’s existence or non-existence? Clearly not, the thought is arrogance of the highest order. We think of minds as somehow being special or necessary to existence because we have one, we’re a little biased. ",
            "date": "Answered October 29, 2016",
            "views": "658",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Reginald Cristofer Rogoff",
                    "user_href": "/profile/Reginald-Cristofer-Rogoff"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Van Dinther",
                "href": "/profile/John-Van-Dinther-1"
            },
            "answer_text": "Yes. Existence precedes observation. Observation is made possible when something already exists. There is no evidence that observation is a cause, or necessary component of, existence. All credible science confirms that existence preceded consciousness. Observation becomes possible after something comes into existence. There is an understandable scientific preference to observe states of existence before acknowledging them but some seem to have confused personal observation with proof. Proof does not require live physical observation. Proof can be derived from logic and secondary observation of results of states of existence. So, yes ",
            "date": "Answered December 7, 2019",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Valdis Klētnieks",
                "href": "/profile/Valdis-Klētnieks"
            },
            "answer_text": "If there is a universe with nothing consciously observing it, does it exist? This universe got to be multiple tens of millions of years old before the first stars formed, exploded as supernovas, scattered elements heavier than hydrogen, and a second generation of stars with planets formed. Maybe 100 million years before even the first planets had single-celled organisms, and then a long climb from there to entities with a complex enough neural network to be conscious. So… did all that happen? Or did the universe spring into existence in a case of Last Thursdayism, with the first conscious creatures already existing, and photons carefully arranged to look like the universe had been running for 100 million years already, and all the other stuff equally faked up on the spot, right down to that first conscious creature being given fake memories of having been alive before that instant? ",
            "date": "Answered December 7, 2019",
            "views": "75",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jai Hegde",
                "href": "/profile/Jai-Hegde"
            },
            "answer_text": "The Physical Universe is Non-separate from Consciousness in that it is pervaded by consciousness. The relationship between the universe and consciousness is that of material and finished product. For eg: A Cotton Shirt is the finished product, and Cotton is the material required to make it. Now, once i use the cotton to make the shirt, has the cotton disappeared ? No. It exists…how…in what form…in the form of the cotton shirt. Therefore, wherever the shirt is…there the cotton also is. This is the relationship between a product and its’ material. It is the same relationship between the physical universe and consciousness. Consciousness is the material (also the maker…but that’s a separate topic in itself) and the universe is the finished product. Therefore, just as in the cotton-shirt example…wherever the universe is, there consciousness IS. So Consciousness Pervades the entire Universe. Therefore the Universe Cannot exist without Consciousness! Sincerely, Jai PS — check out my fb page: Self-Knowledge to live a Full life . I have put links there to some videos i have created on Consciousness, the Individual Self, the Universe, the relationship between them, and so on… ",
            "date": "Answered August 2, 2016",
            "views": "789",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jim Ashby",
                    "user_href": "/profile/Jim-Ashby"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Cezanne",
                "href": "/profile/Jon-Cezanne"
            },
            "answer_text": "Well I think this can be answered in a multitude of ways… One Being Yes… The universe can exist without a mind signifying it's existence! To delve into the matter, let's say a child is born on April 30th, 1997. As the years go by this child grows and it's mind matures. This child soon begins to conjure thoughts and ideas of the world and all of its inhabitants.  Now… After having existed for 19 years does that mean the moment of this person's inception was also the beginning of every possible thing imaginable?…  Why? April 30th, 1997 may be the start of this human’s existence, but not everything in existence. Before him were animals, other humans, fruits, vegetables, books, TV’s, paintings, coffee machines, etc. That one fateful day in history wasn't the beginning of all things, just the beginning of the mind becoming alert, awake and aware!  ",
            "date": "Answered October 31, 2016",
            "views": "180",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Larry Pass",
                "href": "/profile/Larry-Pass-2"
            },
            "answer_text": "Depends who you ask. John Archibald Wheeler postulated an “observer created universe” where, until conscious life appeared, the entire Universe was in a state of quantum indeterminacy. John Archibald Wheeler - Wikipedia When consciousness appeared, this large scale indeterminacy was resolved. That present observations can affect the past was demonstrated in Wheeler's delayed choice experiment - Wikipedia, which was a cosmic-scale double slit experiment, where the two slits are two different paths, due to gravitational lensing, a photon could take in passing a galaxy. The instrumental arrangement the observer chooses affects the results in the same way as in the classic double slit experiment, but in this case, the photon passed the galaxy thousands of years ago. ",
            "date": "Answered March 7, 2018",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hilary Donovan",
                "href": "/profile/Hilary-Donovan-1"
            },
            "answer_text": "Yes, I do believe that “If there is a universe with nothing consciously observing it,” that it exists. I believe that this was actually the case many many eons ago when the universe was in its infancy and the only live things were plants, insects, and later on, reptiles. People will probably argue with me about the consciousness of insects and reptiles so maybe I’ll just say that when the plants were the only living things, there was no one consciously observing the universe. I don’t believe in a traditional god. I believe in a supernatural force which gave us our start, but I don’t believe that it can consciously do anything. I believe that it’s invisible and miraculous. ",
            "date": "Answered December 7, 2019",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tomas Cota",
                "href": "/profile/Tomas-Cota-1"
            },
            "answer_text": "I would say through an observer it would, but not to unconscious person. If there were no observers then the unconscious individual would have no sensations to connect with the physical reality. If wind were blowing in their face, they still would have no idea. But then again who is to say that there is wind to be blown if there is no observer? Without an observer the unconscious individual may not exist in a physical world anyways. But let’s say the unconscious body is with an observer in a fire, the body is getting burnt and the observer witnesses it… the unconscious body dies, pulse stops etc. But since it’s unconscious has anything changed in its view of things/perception? The unconscious body may have been experiencing a totally different reality that in which is not physical. ",
            "date": "Answered October 8, 2018",
            "views": "176",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Craig Swanson",
                    "user_href": "/profile/Craig-Swanson-6"
                },
                {
                    "user_id": "Dennis Murczak",
                    "user_href": "/profile/Dennis-Murczak"
                },
                {
                    "user_id": "Stephen Gillam",
                    "user_href": "/profile/Stephen-Gillam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lei Zhang",
                "href": "/profile/Lei-Zhang-68"
            },
            "answer_text": "Here’s the “proof”: If - a universe does not exist if no consciousness observes it, then consciousness cannot come into being before the universe does, as before consciousness, no universe exists. Currently, we define the universe to be everything in reality (we’re not sure if multi-verse or other dimensions exist yet), so if we can prove there exists something real outside of this universe, we can define universe to include that. If consciousness can come into being before the universe, then it must exist somewhere somehow (outside the universe), let’s call it plane X, then we can define the universe (or multi-verse or omni-verse) to include plane X, thus consciousness will always exist post universal existence. ",
            "date": "Answered June 20, 2018",
            "views": "119",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Raj Karki",
                "href": "/profile/Raj-Karki-1"
            },
            "answer_text": "Well, it’s confusing to say that whether the Universe exist inside our mind or Mind exist inside the universe. Personally if there was no mind in my body, there will not be me, for me there will not be anything. It’s like blind person saying colour don’t exist, it’s like deaf person saying music doesn’t exist. Well, for them it might not exist but for other it does. Just because you didn’t heard the bomb blast doesn’t mean there was no blast in Iraq. So, answer might be even if there is no mind to perceive, Universe will still exist. 1000s of years ago, ancestors didn’t thought Dinosaurs existed but in reality it existed. ",
            "date": "Answered November 1, 2016",
            "views": "67",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ruthie Cole",
                    "user_href": "/profile/Ruthie-Cole"
                },
                {
                    "user_id": "David Roetzel",
                    "user_href": "/profile/David-Roetzel"
                },
                {
                    "user_id": "Shalini Solanki",
                    "user_href": "/profile/Shalini-Solanki-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Grossmann",
                "href": "/profile/Jim-Grossmann"
            },
            "answer_text": "If there is no conscious mind to perceive the universe, does the universe still exist? Although we cannot know the answer to this question for certain, describing the world is a much simpler task if we assume the existence of an external world—a universe that exists whether we perceive it or not. From one of Bertrand Russell’s popularizations of philosophy, I remember the example of a cat passing behind a pillar. Does the portion of the cat hidden by the pillar de-exist when it is covered up? This bizarre question can be avoided very elegantly and simply by assuming that all of the cat continues to exist whether we perceive it or not. What is more, best scientific evidence suggests that, for most of its existence, the universe was not perceived by humans. Early on, before supernovas created heavy elements, it couldn’t have been perceived by any known thing. Unless you believe that the evidence of the universe’s antiquity was put there to fool us all. The latter hypothesis is not testable and can therefore be dismissed from a serious discussion of the nature of the universe. Even Bishop Berkeley, a champion of the notion that being and being perceived are one and the same, believed in an external world that transcends our human perceptions of it, and preserved his philosophy by invoking a great perceiver of the external world, namely God. tl;dr: Although the objective existence of the universe can’t be proven philosophically, realist accounts of reality (i.e. accounts of reality that assume that the external world exists apart from perception) are simpler than idealist accounts of reality (i.e. accounts of reality that assumes that being perceived and existing are one and the same). ",
            "date": "Answered December 21, 2017",
            "views": "461",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Breauna Gibbs",
                    "user_href": "/profile/Breauna-Gibbs-1"
                },
                {
                    "user_id": "Hugo Bretones",
                    "user_href": "/profile/Hugo-Bretones"
                },
                {
                    "user_id": "Jon Jermey",
                    "user_href": "/profile/Jon-Jermey"
                },
                {
                    "user_id": "Dennis Murczak",
                    "user_href": "/profile/Dennis-Murczak"
                },
                {
                    "user_id": "David A. Smith",
                    "user_href": "/profile/David-A-Smith-13"
                },
                {
                    "user_id": "Evan Poole",
                    "user_href": "/profile/Evan-Poole"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Siskind",
                "href": "/profile/Richard-Siskind"
            },
            "answer_text": "In the beginning, there was the electromagnetic field and the field of space. Their inherent properties caused them to interact until elements, life and finally consciousness appeared. After that, everything continued just the same. What did NOT exist with no observer is all the subjective sensations that we gained through sensory nerves. Hearing, sight, color , smell, taste, and all the sensations we feel through the skin did not exist. So before consciousness arrived, there was an objective, physical universe exactly the same as it would be afterwards, but it was silent, colorless and dark, despite all the enormous disturbances in the atmosphere and the electromagnetic spectrum emitted by stars. Because without sensory organs, those disturbances are as imperceptible as a radio signal passing by without a radio to convert it to sound. ",
            "date": "Updated July 2, 2018",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeff Wright",
                "href": "/profile/Jeff-Wright-10"
            },
            "answer_text": "Well, not to itself, and unlike this one we’re in. So that asks the question about whether multiple universes can and do exist, and says something like “If there is a universe with nothing inside it that observes it, can it exist by virtue of some outside observer in a different universe”? All that does, however, is reposition the question about what should be considered a universe, whether the definition of such depends on full disconnection. Should the multiverse, if such exists, just be considered a more complex universe with multiple parts? As far as we know, there’s no possibility to actually separate observer and observed, not within the human mind, not within the large scale physical universe, multiple or otherwise. ",
            "date": "Answered December 7, 2019",
            "views": "62",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tim Skene",
                "href": "/profile/Tim-Skene"
            },
            "answer_text": "Oh, these philosophical questions… That’s like asking: if no one has seen my new car, does it actually exist? The problem with most respondents seems that they’re confusing our individual awareness of the universe with the separate physical existence of it. Assume for a moment we are the only existing conscious species in the universe. Before earthly life arose, there was a universe, an earth, and eventually (after a few extinction events), creatures evolved with sentience and consciousness. Our current awareness of the universe developed, the Hubble telescope supplying the most recent data. However, once I’m gone my particular consciousness will no longer exist, but I strongly suspect that the universe will still be around. ",
            "date": "Answered January 1, 2018",
            "views": "360",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sahithi",
                    "user_href": "/profile/Sahithi-59"
                },
                {
                    "user_id": "Nago Tejena",
                    "user_href": "/profile/Nago-Tejena"
                },
                {
                    "user_id": "Sera Yagami",
                    "user_href": "/profile/Sera-Yagami"
                },
                {
                    "user_id": "Laura Fahr",
                    "user_href": "/profile/Laura-Fahr-1"
                },
                {
                    "user_id": "Thomas Ospelund",
                    "user_href": "/profile/Thomas-Ospelund"
                },
                {
                    "user_id": "S Sunshine",
                    "user_href": "/profile/S-Sunshine-1"
                },
                {
                    "user_id": "Ash Gilorn",
                    "user_href": "/profile/Ash-Gilorn"
                },
                {
                    "user_id": "Deins Zukovskis",
                    "user_href": "/profile/Deins-Zukovskis"
                },
                {
                    "user_id": "Karthikeyan Ramachandran",
                    "user_href": "/profile/Karthikeyan-Ramachandran-12"
                },
                {
                    "user_id": "Taranveer Singh",
                    "user_href": "/profile/Taranveer-Singh-6"
                },
                {
                    "user_id": "Jennifer Clark",
                    "user_href": "/profile/Jennifer-Clark-292"
                },
                {
                    "user_id": "Abhishek Katare",
                    "user_href": "/profile/Abhishek-Katare"
                },
                {
                    "user_id": "Greg Schmucker",
                    "user_href": "/profile/Greg-Schmucker"
                },
                {
                    "user_id": "Hibu Taping",
                    "user_href": "/profile/Hibu-Taping-1"
                },
                {
                    "user_id": "Sheena Simone Roberts",
                    "user_href": "/profile/Sheena-Simone-Roberts"
                },
                {
                    "user_id": "Shashank Singh",
                    "user_href": "/profile/Shashank-Singh-933"
                },
                {
                    "user_id": "Stephan Berglund",
                    "user_href": "/profile/Stephan-Berglund"
                },
                {
                    "user_id": "ThulasiDas ThulasiDas",
                    "user_href": "/profile/ThulasiDas-ThulasiDas"
                },
                {
                    "user_id": "Dominic Novielli",
                    "user_href": "/profile/Dominic-Novielli"
                },
                {
                    "user_id": "Richard Saunders",
                    "user_href": "/profile/Richard-Saunders-11"
                },
                {
                    "user_id": "Taylor Humphrey",
                    "user_href": "/profile/Taylor-Humphrey-3"
                },
                {
                    "user_id": "Olivia Gadegaard",
                    "user_href": "/profile/Olivia-Gadegaard"
                },
                {
                    "user_id": "Ben Nguyen",
                    "user_href": "/profile/Ben-Nguyen-19"
                },
                {
                    "user_id": "Tanmay Naik (Blaze)",
                    "user_href": "/profile/Tanmay-Naik-Blaze"
                },
                {
                    "user_id": "Sukhman K Attwal",
                    "user_href": "/profile/Sukhman-K-Attwal"
                },
                {
                    "user_id": "Hendrik Lie",
                    "user_href": "/profile/Hendrik-Lie-1"
                },
                {
                    "user_id": "Kostya Tokar",
                    "user_href": "/profile/Kostya-Tokar"
                },
                {
                    "user_id": "Clara Epson",
                    "user_href": "/profile/Clara-Epson"
                },
                {
                    "user_id": "Samridhi Gambhir",
                    "user_href": "/profile/Samridhi-Gambhir"
                },
                {
                    "user_id": "Satish Ujjanagoudra",
                    "user_href": "/profile/Satish-Ujjanagoudra"
                },
                {
                    "user_id": "Marina Brusaschetti",
                    "user_href": "/profile/Marina-Brusaschetti"
                },
                {
                    "user_id": "John-Paul O’neill",
                    "user_href": "/profile/John-Paul-O’neill"
                },
                {
                    "user_id": "Jay Sapinsky",
                    "user_href": "/profile/Jay-Sapinsky"
                },
                {
                    "user_id": "Julie Martin",
                    "user_href": "/profile/Julie-Martin-31"
                },
                {
                    "user_id": "Karthick Kart",
                    "user_href": "/profile/Karthick-Kart"
                },
                {
                    "user_id": "Shivam Bhandari",
                    "user_href": "/profile/Shivam-Bhandari-1"
                },
                {
                    "user_id": "Joseph Charles",
                    "user_href": "/profile/Joseph-Charles-7"
                },
                {
                    "user_id": "Abhinav Trivedi",
                    "user_href": "/profile/Abhinav-Trivedi-5"
                },
                {
                    "user_id": "Abhishek Navhal",
                    "user_href": "/profile/Abhishek-Navhal"
                },
                {
                    "user_id": "Savita Brandt",
                    "user_href": "/profile/Savita-Brandt"
                },
                {
                    "user_id": "Harsh Jinger",
                    "user_href": "/profile/Harsh-Jinger"
                },
                {
                    "user_id": "Ankit Kashyap",
                    "user_href": "/profile/Ankit-Kashyap-35"
                },
                {
                    "user_id": "Ashish Singh",
                    "user_href": "/profile/Ashish-Singh-1687"
                },
                {
                    "user_id": "Hugo Santos Silva",
                    "user_href": "/profile/Hugo-Santos-Silva"
                },
                {
                    "user_id": "Raghunath",
                    "user_href": "/profile/Raghunath-37"
                },
                {
                    "user_id": "Arthur Renner",
                    "user_href": "/profile/Arthur-Renner"
                },
                {
                    "user_id": "Gavin Hunter",
                    "user_href": "/profile/Gavin-Hunter-4"
                },
                {
                    "user_id": "Steven Miscandlon",
                    "user_href": "/profile/Steven-Miscandlon"
                },
                {
                    "user_id": "Anuj Kumar",
                    "user_href": "/profile/Anuj-Kumar-264"
                },
                {
                    "user_id": "Paul Z",
                    "user_href": "/profile/Paul-Z-25"
                },
                {
                    "user_id": "Rajendera Singh Khurana",
                    "user_href": "/profile/Rajendera-Singh-Khurana"
                },
                {
                    "user_id": "Angela Ronson",
                    "user_href": "/profile/Angela-Ronson"
                },
                {
                    "user_id": "Steve Kieu",
                    "user_href": "/profile/Steve-Kieu"
                },
                {
                    "user_id": "Aravindan Jagannathan",
                    "user_href": "/profile/Aravindan-Jagannathan"
                },
                {
                    "user_id": "Ankush Yemme",
                    "user_href": "/profile/Ankush-Yemme"
                },
                {
                    "user_id": "Natasha Jean",
                    "user_href": "/profile/Natasha-Jean-22"
                },
                {
                    "user_id": "Pierre Deveaux",
                    "user_href": "/profile/Pierre-Deveaux"
                },
                {
                    "user_id": "José Luis Navarro Piqueras",
                    "user_href": "/profile/José-Luis-Navarro-Piqueras"
                },
                {
                    "user_id": "Mikayla Gomez",
                    "user_href": "/profile/Mikayla-Gomez"
                },
                {
                    "user_id": "Khaled Ayari",
                    "user_href": "/profile/Khaled-Ayari"
                },
                {
                    "user_id": "Jan Waldorp",
                    "user_href": "/profile/Jan-Waldorp"
                },
                {
                    "user_id": "Diego Calahan",
                    "user_href": "/profile/Diego-Calahan"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Tomasz-70"
                },
                {
                    "user_id": "Jan Antonsson",
                    "user_href": "/profile/Jan-Antonsson-1"
                },
                {
                    "user_id": "Kaylen Pak",
                    "user_href": "/profile/Kaylen-Pak-1"
                },
                {
                    "user_id": "John Kieran",
                    "user_href": "/profile/John-Kieran"
                },
                {
                    "user_id": "Bob Coon",
                    "user_href": "/profile/Bob-Coon-5"
                },
                {
                    "user_id": "Mary Farris",
                    "user_href": "/profile/Mary-Farris-3"
                },
                {
                    "user_id": "Michel Roussotte",
                    "user_href": "/profile/Michel-Roussotte"
                },
                {
                    "user_id": "Abdullah Mudassir",
                    "user_href": "/profile/Abdullah-Mudassir"
                },
                {
                    "user_id": "Joseph G. Shobe",
                    "user_href": "/profile/Joseph-G-Shobe"
                },
                {
                    "user_id": "Aleja",
                    "user_href": "/profile/Aleja-8"
                },
                {
                    "user_id": "Khomotso Phala",
                    "user_href": "/profile/Khomotso-Phala"
                },
                {
                    "user_id": "Anil Kumar",
                    "user_href": "/profile/Anil-Kumar-3102"
                },
                {
                    "user_id": "Sheri Theroux",
                    "user_href": "/profile/Sheri-Theroux"
                },
                {
                    "user_id": "Anthony Kerstein",
                    "user_href": "/profile/Anthony-Kerstein"
                },
                {
                    "user_id": "Vineet Sharma",
                    "user_href": "/profile/Vineet-Sharma-145"
                },
                {
                    "user_id": "Filipe Garcia",
                    "user_href": "/profile/Filipe-Garcia-4"
                },
                {
                    "user_id": "Vivek Kondawar",
                    "user_href": "/profile/Vivek-Kondawar"
                },
                {
                    "user_id": "Noel Minsula",
                    "user_href": "/profile/Noel-Minsula"
                },
                {
                    "user_id": "Samuel Okoroafor",
                    "user_href": "/profile/Samuel-Okoroafor"
                },
                {
                    "user_id": "Romeo Rwezaura",
                    "user_href": "/profile/Romeo-Rwezaura"
                },
                {
                    "user_id": "Piyush Joshi",
                    "user_href": "/profile/Piyush-Joshi-10"
                },
                {
                    "user_id": "Suzy McKee Charnas",
                    "user_href": "/profile/Suzy-McKee-Charnas"
                },
                {
                    "user_id": "Hannah Ollett",
                    "user_href": "/profile/Hannah-Ollett"
                },
                {
                    "user_id": "Cookie Kaufman",
                    "user_href": "/profile/Cookie-Kaufman-1"
                },
                {
                    "user_id": "Paul Schurr",
                    "user_href": "/profile/Paul-Schurr-3"
                },
                {
                    "user_id": "David Bruce",
                    "user_href": "/profile/David-Bruce-68"
                },
                {
                    "user_id": "Bruce Fenderson",
                    "user_href": "/profile/Bruce-Fenderson"
                },
                {
                    "user_id": "Ray Howard Swartz",
                    "user_href": "/profile/Ray-Howard-Swartz"
                },
                {
                    "user_id": "Mark Herrera",
                    "user_href": "/profile/Mark-Herrera-26"
                },
                {
                    "user_id": "Radosław Chwiszczuk",
                    "user_href": "/profile/Radosław-Chwiszczuk-1"
                },
                {
                    "user_id": "Themba Jonga",
                    "user_href": "/profile/Themba-Jonga"
                },
                {
                    "user_id": "Ana Leticia Gallardo",
                    "user_href": "/profile/Ana-Leticia-Gallardo"
                },
                {
                    "user_id": "Sajan Sudan",
                    "user_href": "/profile/Sajan-Sudan"
                },
                {
                    "user_id": "Victor Akinla",
                    "user_href": "/profile/Victor-Akinla"
                },
                {
                    "user_id": "Doug Schoenbeck",
                    "user_href": "/profile/Doug-Schoenbeck"
                },
                {
                    "user_id": "Quentin Pain",
                    "user_href": "/profile/Quentin-Pain"
                },
                {
                    "user_id": "Anna H Schöld",
                    "user_href": "/profile/Anna-H-Schöld"
                },
                {
                    "user_id": "Sharon Lane",
                    "user_href": "/profile/Sharon-Lane-23"
                },
                {
                    "user_id": "George Pezdirtz",
                    "user_href": "/profile/George-Pezdirtz"
                },
                {
                    "user_id": "Tony Slavin",
                    "user_href": "/profile/Tony-Slavin-1"
                },
                {
                    "user_id": "Harsh Pandya",
                    "user_href": "/profile/Harsh-Pandya-84"
                },
                {
                    "user_id": "Gautham",
                    "user_href": "/profile/Gautham-67"
                },
                {
                    "user_id": "Shivam Shrivastava",
                    "user_href": "/profile/Shivam-Shrivastava-60"
                },
                {
                    "user_id": "Hemant Namdeo",
                    "user_href": "/profile/Hemant-Namdeo-1"
                },
                {
                    "user_id": "Travis Brainerd",
                    "user_href": "/profile/Travis-Brainerd"
                },
                {
                    "user_id": "Jim Hagerty",
                    "user_href": "/profile/Jim-Hagerty"
                },
                {
                    "user_id": "Musawer Ghayoor",
                    "user_href": "/profile/Musawer-Ghayoor"
                },
                {
                    "user_id": "Anil Trivedi",
                    "user_href": "/profile/Anil-Trivedi-3"
                },
                {
                    "user_id": "David A. Smith",
                    "user_href": "/profile/David-A-Smith-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Werner",
                "href": "/profile/Mark-Werner-4"
            },
            "answer_text": "Jeez… I find these questions tiring. Every first-year philosophy student thinks he’s discovered this nonsense…. We seem to get at least one a day here. No, Virginia, the universe existed for billions of years before there was much of anything more complex than a hydrogen atom. It was not possible for anything to be living until 2nd generation stars had formed from the complex debris of first-generation stars. And then it took additional billions before any living thing could evolve to the point of consciousness. As one biologist said… “If we generate reality with our minds, what did the universe look like when there was nothing more evolved than a sea-slug?” But lets take this a bit further. Lets say there’s something to this, and by some magical process a conscious mind is necessary to generate “reality”. Where did the conscious mind come from? Did we just pop into existence? Were we “imagined” by some other race of conscious beings? Who imagined them? We very rapidly run into the “infinite regress” problem that besets ideas of God… “Who made God?” The whole thing is silly. We understand the origin and evolution of the universe pretty well. We’re still refining some bits, of course, but give us a bit of time. ",
            "date": "Answered December 21, 2017",
            "views": "601",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bob Wijntjes",
                    "user_href": "/profile/Bob-Wijntjes"
                },
                {
                    "user_id": "Andres Viau",
                    "user_href": "/profile/Andres-Viau"
                },
                {
                    "user_id": "Gulrez Syed",
                    "user_href": "/profile/Gulrez-Syed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michel Verheughe",
                "href": "/profile/Michel-Verheughe"
            },
            "answer_text": "Good question! The Double Slit experiment, Heisenberg’s Quantum Uncertainty and the Many Worlds Interpretation, seems to say that we can only observe the universe from our frame of reference in space and time and … what we can’t observe … doesn’t exist in our reality. The question of the sound of the tree falling in the wood where nobody lives, has kept many generations in suspense. The truth is, if I could answer your question, I would be packing my suitcase for Stockholm, to receive a Nobel Prize in Physics and Time Magazine would nominate me as The Person of the Year! ;-) ",
            "date": "Answered December 21, 2017",
            "views": "194",
            "upvotes": " View 111 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nagarajan Ramachandran",
                    "user_href": "/profile/Nagarajan-Ramachandran-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Akgayev",
                "href": "/profile/Tim-Akgayev-1"
            },
            "answer_text": "It could, but I think it would not be recognizable. A unieverse without consciousness is most likely very barren, life-less, unstable and short lived void. We know that for life to exist all the constants have to be as they are now, so if we change some of those constants even a little bit (for example we make gravity slightly weaker) then everything goes haywire. The bosons don’t form, elements are not created, stars don’t burn etc etc. And this happens if you change any parameters (most likely because they’re all somehow connected mathematically through something like string theory or some other theory of everything). So I think the consciousness arises out of a universe filled with the “energy of life” from the very beginning. ",
            "date": "Answered March 3, 2019",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Kiskaddon",
                "href": "/profile/Scott-Kiskaddon"
            },
            "answer_text": "Depends on the definition of \"existence\" and our assumptions about how the universe operates.For instance, I observe that the universe seems to go on existing even after people die. I therefore assume that when I die, the universe continues to exist. Therefore, it would seem reasonable to suppose that the universe would go on existing even after a supernova were to wipe us all out. Let's think of it another way. We tend to think that the universe existed well before humans did, since we trace our origins back through various species who have varying degrees of consciousness. The universe clearly existed before consciousness did. Therefore, after the last conscious being is snuffed out, the universe continues to tramp on. ",
            "date": "Answered June 22, 2014",
            "views": "322",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roy Smith",
                    "user_href": "/profile/Roy-Smith-36"
                },
                {
                    "user_id": "Nazir Haffar",
                    "user_href": "/profile/Nazir-Haffar"
                },
                {
                    "user_id": "Jayatheertha Badarayanachar",
                    "user_href": "/profile/Jayatheertha-Badarayanachar"
                },
                {
                    "user_id": "Jim Hagerty",
                    "user_href": "/profile/Jim-Hagerty"
                },
                {
                    "user_id": "Mario Moncada Velasquez",
                    "user_href": "/profile/Mario-Moncada-Velasquez"
                },
                {
                    "user_id": "Madhura",
                    "user_href": "/profile/Madhura-19"
                },
                {
                    "user_id": "Emmanuela Louis",
                    "user_href": "/profile/Emmanuela-Louis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dov Elyada",
                "href": "/profile/Dov-Elyada"
            },
            "answer_text": "If you mean your (or anybody’s) consciousness, then YES. It’s the same as being hit by a truck crossing the road without ever being conscious a truck was coming. But if you mean that the lifeless objects making up most of the universe must have consciousness in order to “exist,” then you are on to something. That’s because consciousness itself is most probably an illusion—even conscious creatures don’t harbor something physical (or informational) that answers to the characterization of consciousness. Then why not the rest of the universe? Poetic license is a basic conscious-human right. ",
            "date": "Answered March 7, 2019",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vinu R Chandran",
                "href": "/profile/Vinu-R-Chandran"
            },
            "answer_text": "Well well well, this is a old philosophy question/inquiry but seems to have got a new lease of life from popular books on Quantum mechanics/Quantum physics from 1980 onwards. Question is fundamentally flawed : I will try to answer to the best of my ability : Exist? is a question that has a meaning only when you observe it, This is purely a semantic connotation, there is no objective meaning for this world “Exists”In other words : If you don’t observe directly/indirectly and it no way influences your event zones, the very word “exists” cannot be used, as it loses its meaningExists word can be used only in relative to observation not an abstract independent objective reality.What QM/QP says is the same thing without observer the events at quantum level is immaterial/ has no meaning within the context of our objective mathematics driven formalization. Remember : the only connection between our Subjective realm (Consciousness/Awareness) & Objective realm is mathematics it is the only bridge, beyond it nothing can be perceived or understood about the objective universe. ",
            "date": "Answered December 7, 2019",
            "views": "173",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jim Ashby",
                    "user_href": "/profile/Jim-Ashby"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Dauenhauer",
                "href": "/profile/Frank-Dauenhauer"
            },
            "answer_text": "If there is no mind to perceive the universe, does it still exist? According to a few experts, No. I see it in a different way. As soon as the first mind capable of perceiving it came into existence, the universe popped into existence along with it. ____________New test backs up theory that the world doesn’t exist until we look at it http://www.dailymail.co.uk/sciencetech/article-3107996/Our-entire-lives-ILLUSION-New-test-backs-theory-reality-doesn-t-exist-look-it.html Your entire life is an ILLUSION: New test backs up theory that the world doesn’t exist until we look at it Quantum mechanics states reality doesn't exist until it's measuredThis means a particle's past behaviour changes based on what we seeExperiment using an atom and laser beams has proven this to be trueHow the atom behaved depended on how it was measured at end of testBy Ellie Zolfagharifard For Dailymail.com Published: 14:01 EST, 2 June 2015 | Updated: 20:22 EST, 2 June 2015 The universe doesn't exist if we stop looking at it. This is according a famous theory in quantum mechanics which argues that a particle's past behaviour changes based on what we see. At the quantum level, reality does not exist if you are not looking at it,' said Associate Professor Andrew Truscott. ",
            "date": "Updated December 22, 2017",
            "views": "623",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jim Ashby",
                    "user_href": "/profile/Jim-Ashby"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dev Theron",
                "href": "/profile/Dev-Theron"
            },
            "answer_text": "Yes, it can and will exist! Two things: a) the creation of space cause chaos. b) the hallucination of observation, create clogged up portals or atoms with Conscious interaction or a gravitational sense or force which cause the birth of primordial black holes. There is little difference between a atom and a blackhole. A blackhole is an atom that is unclogged and are kept open by waves that consciously flow to their singular position of understanding. We ourselves are such doorways that channel the Conscious Universe. We are to the image of these gods. There are only one Truth. ",
            "date": "Answered September 20, 2020",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ted Gorman",
                "href": "/profile/Ted-Gorman-1"
            },
            "answer_text": "Of course it exists. Your mind IS your universe. Never forget, the thermodynamic definition of the Universe is A system and it’s surroundings. If your mind is the system, then everything else is it’s surroundings. Period. What your mind perceives is by definition the Universe. As your mind expands its capacity to observe and describe your understanding of the Universe that doesn’t change the nature of the Universe in its objective form, it just changes the Universe as you perceive it. What is, and what can be, are both manifestations of a system and it’s surroundings. What “is” is the system, and what “can be” are it’s surroundings. ",
            "date": "Answered October 30, 2016",
            "views": "313",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Paul Barends",
                    "user_href": "/profile/Paul-Barends"
                },
                {
                    "user_id": "Mitch Williams",
                    "user_href": "/profile/Mitch-Williams-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dick Wimmers",
                "href": "/profile/Dick-Wimmers"
            },
            "answer_text": "That is similar to asking if a tree falls in the forest and one hears it did it make a noise. Yes, sound waves would have been produced and other animals would have heard them even if no human did. Even if no animal picked up the sound waves they would still have been produced. Many things can exist without any outside awareness of their existence. I am sitting in a room breathing air that is in the room, but the air is still and I am not consciously aware of its existence. And yet, It is definitely present in the room, so it does exist. ",
            "date": "Answered September 3, 2018",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rick DeHaven",
                "href": "/profile/Rick-DeHaven"
            },
            "answer_text": "If their is no conscious mind existing and perceiving the universe it can’t be said the universe exists or does not exist. There is nothing to perceive the universe existing so the question can not be answered. I repeat that there is nothing to tell us because nothing exists. The question can’t be answered in that form. One could ask for example if for example: Did the universe exist before we humans attained consciousness. I assumed it did because how else can we be, if something wasn’t existing before us. I know my mother existed before me therefore I conclude my consciousness is not necessary for the universe to exist. ",
            "date": "Answered December 21, 2017",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dave Davidson",
                "href": "/profile/Dave-Davidson-13"
            },
            "answer_text": "The paradigm is an objective universe that is producing machines made to interact with it. I write this answer as a force riding one of those machines. In order to maintain our place in this objective universe, our consciousness is consistently harnessed to specific concepts, such as finding food. Unless you believe that some other paradigm is producing your consciousness in a weird vacuum type thing and it is also creating this necessary conceptual harness, then a consciousness interacting with a an objective world makes the most sense. The universe would still exist if there were no mind bearing machines to perceive it. ",
            "date": "Answered October 30, 2016",
            "views": "137",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jim Ashby",
                    "user_href": "/profile/Jim-Ashby"
                },
                {
                    "user_id": "Bennett W. Nelson",
                    "user_href": "/profile/Bennett-W-Nelson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Latta",
                "href": "/profile/Robert-Latta-5"
            },
            "answer_text": "Can a physical universe exist without consciousness? What about the universe one thousand years after the Big Bang? It was a purely physical affair, and it constituted reality, but there was no consciousness then. And that answers your question: Yes! Consciousness takes the form of neural activity in a brain, or of some analog of that in a hypothetical case. At best, then, it forms no more than the lightest salting on physical reality. Your mistake is to think of consciousness in subjective, mentalistic terms. You do so for the most prosaic of reasons, simply because you encounter your own consciousness—which, again, takes the form of neural activity in your brain—by way of neural connections within your brain in which no perceptual processing takes place, and hence without perceiving it in any way. Since you do not perceive your own consciousness, you do not know what it is, a physical phenomenon of a certain description. But that is irrelevant. Consciousness is one physical phenomenon among indefinitely many, and not a bit more than that. It is time to break free of this subjectivist morass! It is a waste of time. A physical universe can exist without brains, and hence without consciousness. ",
            "date": "Updated October 14, 2018",
            "views": "280",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matua Mallik",
                    "user_href": "/profile/Matua-Mallik"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sohail Ahmed",
                "href": "/profile/Sohail-Ahmed-7"
            },
            "answer_text": "Thanks Emmanuela for asking me to answer. There are 17 answers and I have voted some of them up. IF MIND’S PERCEIVING IS A PRECONDITION OF EXISTENCE, THEN UNIVERSAL BOUNDARIES CAN NEVER EXIST. We have no idea. We only know theoretically the boundaries are receding and more space is being added. We believe this despite we do not have a perception, mathematics helps us believe that. Universe exists even if our math, physics and philosophy is not there. That is, mind, whether is there or not, these realities continue to exist. Let us assume that infinitesimally small brain existed at a unicellular level at the inception. For the sake of simplicity, let it be around 1B years in Precambrian era. Our solar life is around 4.3B years. Treating brain/mind as a unit, for mind, solar system existed 1B year before if we think mind to be precondition for that. But we cannot say that before that, it was not there. Calculations show it to be of that age, despite realizing it to be a theory only. Likewise, universe is estimated to exist for about 13.7B years. MIND IS NOT A PRECONDITION FOR ITS EXISTENCE. Hope it explains well. ",
            "date": "Answered November 1, 2016",
            "views": "555",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Albert Bijzitter",
                    "user_href": "/profile/Albert-Bijzitter"
                },
                {
                    "user_id": "Stephanie Centino",
                    "user_href": "/profile/Stephanie-Centino"
                },
                {
                    "user_id": "Walter Brameld",
                    "user_href": "/profile/Walter-Brameld-1"
                },
                {
                    "user_id": "Elsin Ann Perry",
                    "user_href": "/profile/Elsin-Ann-Perry"
                },
                {
                    "user_id": "Pulkit Advani",
                    "user_href": "/profile/Pulkit-Advani-2"
                },
                {
                    "user_id": "Jim Ashby",
                    "user_href": "/profile/Jim-Ashby"
                },
                {
                    "user_id": "Shreya Mudgil",
                    "user_href": "/profile/Shreya-Mudgil-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Cole",
                "href": "/profile/John-Cole-93"
            },
            "answer_text": "Your question answers itself. The first step is always to define and clarify the terms. “If there was a Universe,” obviously states there is a universe. Your question would be better: “Without a consciousness to observe could, or would, anything exist?” My answer would be no. In my book: “The Framework The Way to Truth” (Amazon) I postulate that consciousness shares the same shifting, enduring permanence as matter and energy. ",
            "date": "Answered August 26, 2018",
            "views": "75",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shobhit Tripathy",
                    "user_href": "/profile/Shobhit-Tripathy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Punit Bhatt",
                "href": "/profile/Punit-Bhatt-7"
            },
            "answer_text": "Obviously YES! There are places in our cosmos that we have never reached, but that doesn’t mean that they do not exist right? In the similar fashion- with or without any conscious mind to observe or feel aware, things around them will exist as they are. And anyway, our senses are limited. We can only observe limited things. We do not see things as they are, we see things as our senses perceive them. So we are not even fully aware of reality but it exists! ",
            "date": "Answered January 5, 2018",
            "views": "76",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jon Jermey",
                "href": "/profile/Jon-Jermey"
            },
            "answer_text": "We have the best possible reason to believe that the universe was around for several billion years before any minds came into being. We also have strong evidence that there are parts of the universe which we can’t ‘perceive’ except in the most abstract way as a gravitational anomaly; but that doesn’t stop them from existing. Humans — and human minds — are not that important. The first step towards understanding the universe at all is getting that big-headed intrusive human ego out of the way. ",
            "date": "Answered October 30, 2016",
            "views": "281",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gulrez Syed",
                    "user_href": "/profile/Gulrez-Syed"
                },
                {
                    "user_id": "Malcolm Sargeant",
                    "user_href": "/profile/Malcolm-Sargeant"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Vicary",
                "href": "/profile/Peter-Vicary"
            },
            "answer_text": "My universe only exists because my consciousness observes it. Your universe only exists because your consciousness observes it. I cannot observe the universe you experience and you cannot observe the universe that I experience. If my consciousness did not exist, neither would my universe, for they would have collapsed into each other. My non-existence would not cancel out your universe for your universe is created by your consciousness, they are entangled with each other, and neither would exist without the other. ",
            "date": "Answered June 23, 2014",
            "views": "205",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Barends",
                    "user_href": "/profile/Paul-Barends"
                },
                {
                    "user_id": "Google Singh",
                    "user_href": "/profile/Google-Singh-3"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Hyunmin-Song-1"
                },
                {
                    "user_id": "Kevin Wood",
                    "user_href": "/profile/Kevin-Wood-8"
                },
                {
                    "user_id": "Voo Chuk",
                    "user_href": "/profile/Voo-Chuk"
                },
                {
                    "user_id": "Akash Desai",
                    "user_href": "/profile/Akash-Desai-4"
                },
                {
                    "user_id": "Joel Postma",
                    "user_href": "/profile/Joel-Postma"
                },
                {
                    "user_id": "Craig Weinberg",
                    "user_href": "/profile/Craig-Weinberg"
                }
            ]
        },
        {
            "author_info": {
                "name": "Masud Mitul",
                "href": "/profile/Masud-Mitul"
            },
            "answer_text": "Good question indeed! We are the most sophisticated human species ever lived in the world but we are not different from other creatures.we are nothing but part of the universe . If our consciousness can not defined the existance of universe that does not means our universe is nothing but just a complex thought of mind. According to the scientist our universe should not exist at all! But the broke of cp symmetry astonished us and we are still exist.we are part of nature so it is so difficult to define or predict that the universe is not exist or exist too! The existance of universe never ever depends on our consciousness because universe is not the part of us rather we are the part of universe so existance of the universe never depends on our consciousness althogh we define all kinds of rules of universe by using our brains. ",
            "date": "Answered December 22, 2017",
            "views": "52",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dave Hustava",
                "href": "/profile/Dave-Hustava"
            },
            "answer_text": "This question is the faux-Big Thinker version of \"If a tree fell in the forest and no one was around to hear it, would it still make a sound ?\" Yes. OF COURSE the universe would exist, even if there were no consciousness to observe it. It did so for likely billions of years before life evolved somewhere in it, and it will after entropy claims the last erg of energy. ",
            "date": "Answered June 25, 2014",
            "views": "240",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Garry Griffith",
                    "user_href": "/profile/Garry-Griffith-2"
                },
                {
                    "user_id": "Jon Jermey",
                    "user_href": "/profile/Jon-Jermey"
                },
                {
                    "user_id": "Vakur Cankurtaran",
                    "user_href": "/profile/Vakur-Cankurtaran"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keinosuke Johan Miyanaga / 宮永 ヨハン 計之介",
                "href": "/profile/Keinosuke-Johan-Miyanaga-宮永-ヨハン-計之介"
            },
            "answer_text": "It wouldn't matter. Say you had ice cream. But no one could see it, let alone eat it. Not even you. Would this ice cream matter? Not one bit. It wouldn't matter. But say you had ice cream that everyone could see and eat. Even you. Would this ice cream matter? Why, absolutely. And this is our relationship with life and with the universe. It's too late to ask whether this ice cream matters, because we're already eating it.  Might as well make the most of it! Enjoy :) ",
            "date": "Answered June 20, 2014",
            "views": "601",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ryan Clark",
                    "user_href": "/profile/Ryan-Clark-647"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evan Poole",
                "href": "/profile/Evan-Poole"
            },
            "answer_text": "Of course it still exists. Just like when a tree falls in the forest and hits the ground, it still makes a sound regardless if a human or other animals are within earshot of it or not. As for the universe, we have plenty of evidence that it existed billions of years before any conscious beings (and planets for those conscious beings to evolve on) came into existence, and will continue to exist eons after life has gone extinct. Consciousness is irrelevant to the existence of the universe. ",
            "date": "Answered December 21, 2017",
            "views": "85",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Caley Tibbittz",
                    "user_href": "/profile/Caley-Tibbittz"
                },
                {
                    "user_id": "Francois Dovat",
                    "user_href": "/profile/Francois-Dovat"
                },
                {
                    "user_id": "Craig Swanson",
                    "user_href": "/profile/Craig-Swanson-6"
                },
                {
                    "user_id": "Jon Jermey",
                    "user_href": "/profile/Jon-Jermey"
                },
                {
                    "user_id": "David A. Smith",
                    "user_href": "/profile/David-A-Smith-13"
                },
                {
                    "user_id": "Stephen Gillam",
                    "user_href": "/profile/Stephen-Gillam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Pavel",
                "href": "/profile/Dan-Pavel-3"
            },
            "answer_text": "No. The Universe (Latin: universus) is all of space and time and their contents. ( Universe - Wikipedia ) As you ca see, the Universe is everything that existed, exists and will ever exist. As long as at least you exist and you are conscious then the Universe contains consciousness and, because nothing can be taken out or added to the Universe, it means that it can’t exist without consciousness (or even without you). However, an universe that could exist without consciousness could be imagined, but it won’t be our Universe. ",
            "date": "Answered January 11, 2020",
            "views": "59",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Carlos Velasquez Londono",
                    "user_href": "/profile/Carlos-Velasquez-Londono"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dennis Murczak",
                "href": "/profile/Dennis-Murczak"
            },
            "answer_text": "Yes. We know that the early universe was very hot and dense and lacked heavy elements, which is incongruous with the existence of life and thus, consciousness. You are possibly hinting at the quantum observer effect, but an observer in quantum mechanics does not need to be a conscious entity. The “observer” could as well just be another particle or whatever matter is involved in the experiment. ",
            "date": "Answered December 21, 2017",
            "views": "248",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "A. R. Bentrovato",
                    "user_href": "/profile/A-R-Bentrovato"
                },
                {
                    "user_id": "Mattees Van Dijk",
                    "user_href": "/profile/Mattees-Van-Dijk"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manan S Beg",
                "href": "/profile/Manan-S-Beg"
            },
            "answer_text": "What if consciousness can exist with no universe to experience? How would it be? Is independent existence of universe possible? Is the purpose of the universe to create experience for consciousness?  Why should there be a purpose? Is our experience of consciousness bound by experience of time? What if there are other kinds of consciousness which we, being human , do not perceive and do not put these under the umbrella of consciousness?  What if the aggregate of all self serving individuals along with the entire universe is consciousness? The important point is the such enquires cannot be made conclusively  if we are bound by our own experience. We interact in a certain way with universe. To the point ,our intelligence and sense has evolved, arguments for this can be best put under speculation. ",
            "date": "Answered June 21, 2014",
            "views": "280",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Twigg",
                "href": "/profile/Robert-Twigg-1"
            },
            "answer_text": "Yes of course. The universe does not need human consciousness to exist. In fact the universe existed quite well without consciousness for many billions of years. However consciousness allows humans to observe the greater reality of our place in the universe. What we will have to do is figure out how to utilize and adapt to the many challenges confronting a dangerous and expanding universe and the passage of the arrow of time. ",
            "date": "Answered October 11, 2018",
            "views": "284",
            "upvotes": " Answer requested by Reginald Cristofer Rogoff",
            "upvoters": [
                {
                    "user_id": "Zach Laskowski",
                    "user_href": "/profile/Zach-Laskowski"
                },
                {
                    "user_id": "Jon Jermey",
                    "user_href": "/profile/Jon-Jermey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simon Young",
                "href": "/profile/Simon-Young-23"
            },
            "answer_text": "No. Existence is the disclosure of beings from being. It makes no sense to ask if there can be an existence without this process unless one is an extreme idealist or realist (which is a disguised idealism) with those associated problems and faith. It should be noted that we do not perceive the universe, but create it; there is no magical universe beyond that we perceive. ",
            "date": "Answered December 21, 2017",
            "views": "76",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jon Jermey",
                    "user_href": "/profile/Jon-Jermey"
                },
                {
                    "user_id": "David A. Smith",
                    "user_href": "/profile/David-A-Smith-13"
                },
                {
                    "user_id": "Jonathan Heath Carter",
                    "user_href": "/profile/Jonathan-Heath-Carter"
                },
                {
                    "user_id": "Karl Mamer",
                    "user_href": "/profile/Karl-Mamer"
                },
                {
                    "user_id": "Dennis Murczak",
                    "user_href": "/profile/Dennis-Murczak"
                },
                {
                    "user_id": "Rob Heusdens",
                    "user_href": "/profile/Rob-Heusdens"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kyrani Eade",
                "href": "/profile/Kyrani-Eade"
            },
            "answer_text": "No. The Universe is brought into being when the relevant information, which exists in the One Mind (The Mind of the Supreme Being ) is upheld in the Divine Consciousness. If the Supreme Being relinquishes this activity and ceases to uphold the information in the Divine Consciousness, then the Universe ceases to exist. Without the information upheld in the Divine Consciousness there is no Universe. The Universe is just a simulation or in other words a creation. ",
            "date": "Answered March 5, 2019",
            "views": "9",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rajat Pithadia",
                "href": "/profile/Rajat-Pithadia"
            },
            "answer_text": "Yes. There won't be anything to observe but it will still be there. Shaashvatt che toh satyaa che. Satyaa vina pan shaashvatt to chej, hatu and rehsej. Consciousness is soul that lingurs in the cell of universe. If there is no mitochondria, there won't be life in a cell as it is, but it doesn't mean there is no cell. The life will still be in boundaries of the cell going through evolution. ",
            "date": "Answered March 17, 2019",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Victor Record",
                "href": "/profile/Victor-Record"
            },
            "answer_text": "From another point of view Here is the first part of one story. Victor Record's answer to In layman's terms, how is time relative? So, there is no time dilation or contraction, only clocks run slower or faster according to the external speed of that clocks. But I want to emphasize something. If our Universe (as a physical phenomenon) has a beginning and an end, it is a time that begins and ends in his own reference system of the Universe (time duration) . If there is an end of the universe, it is better to live on the Earth than in a spaceship that moves at a speed close to the speed of light. On Earth you can move and build faster any devices than in that spaceship. So, we might say : “For the Universe it would all be over very quickly if he had not developed inside systems which: from one point of view it seems to move faster and from another point of view it seems to gain time. “ So, that’s the point, that’s the message , that's the rule of the Universe: to gain time. The motion and the gravity are the expression of same rule: to gain the time, otherwise it would all be over very quickly? If the Universe respects this rule, it can be a proof that he has consciousness. ",
            "date": "Answered February 9, 2018",
            "views": "255",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rohan Kumar",
                "href": "/profile/Rohan-Kumar-96"
            },
            "answer_text": "First of all, don't think that life and consciousness are or will remain intertwined. There can be a correlation but not causation between the two. With advancement in technology we(humans ) were able to create robot that were self-conscious.  Page on sciencealert.com So, now your question .The universe should exist without consciousness  , why?Because after big-bang  the universe came into being and still existed for billions of years without any form of life being  conscious about it.  Secondly, when the universe was consciously thought to be geocentric (earth in the center model of the universe), while it was heliocentric (sun in the center) , the universe didn't even care about what we thought about it. It remained heliocentric . Lastly , the thing is that we are basically trying to impose our thoughts on the universe and trying to test their validity in term of 'reality', linking to consciousness is just one on them. ",
            "date": "Answered November 29, 2015",
            "views": "97",
            "upvotes": " Answer requested by Vishal Arsekar",
            "upvoters": [
                {
                    "user_id": "Stephen Wicklund",
                    "user_href": "/profile/Stephen-Wicklund"
                },
                {
                    "user_id": "Cody Colburn",
                    "user_href": "/profile/Cody-Colburn"
                },
                {
                    "user_id": "Michael Stevenson",
                    "user_href": "/profile/Michael-Stevenson-4"
                },
                {
                    "user_id": "Sabarish Vadarevu",
                    "user_href": "/profile/Sabarish-Vadarevu"
                },
                {
                    "user_id": "Alex Juarez",
                    "user_href": "/profile/Alex-Juarez-4"
                },
                {
                    "user_id": "Prashanth Hirematada",
                    "user_href": "/profile/Prashanth-Hirematada"
                },
                {
                    "user_id": "Brian Miller",
                    "user_href": "/profile/Brian-Miller-102"
                },
                {
                    "user_id": "Andrew Weimholt",
                    "user_href": "/profile/Andrew-Weimholt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Davis",
                "href": "/profile/Jim-Davis-70"
            },
            "answer_text": "Maybe consciousness only relates to our perception of the universe in it’s classical state, particles, while the “real” universe always exists in the form of waves. in this sense consciousness doesn’t make the universe exist, it just gives us an altered view of the universe that makes it easier for us to interact with it. Of course we would have to expand consciousness to include any living think that has visual, auditory and/or sensory organs for this interaction. ",
            "date": "Answered February 25, 2018",
            "views": "108",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Stockton",
                    "user_href": "/profile/David-Stockton-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Hamilton",
                "href": "/profile/Jack-Hamilton-84"
            },
            "answer_text": "The Universe was around for billions of years with no consciousness to perceive it. The Universe expanded, atoms were created, and all the stars and galaxies formed. The Universe will continue to exist loooong after we (and any other sentient creatures that may evolve) have gone away. The Universe doesn't need us. ",
            "date": "Answered December 21, 2017",
            "views": "107",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sharanya Kumar",
                    "user_href": "/profile/Sharanya-Kumar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Esposito",
                "href": "/profile/Robert-Esposito-7"
            },
            "answer_text": "If there is no conscious mind to perceive the universe, does the universe still exist?  No way to prove it; There is a book called “I Am That” featuring the teachings of Nissargadata Maharaj. He says when you die, the Universe ends. I think this must be a personal Universe. Step on an ant, the ant’s Universe ends, but you are still there, the center of your own Universe, awaiting the time when you get stepped on, ending the Universe you know. ",
            "date": "Answered December 21, 2017",
            "views": "159",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard O. Colestock",
                "href": "/profile/Richard-O-Dick-Colestock"
            },
            "answer_text": "Of course it does - despite the hand-wringing epistemologists. Consider this - you are here asking this question.You came from the universe that you are questioning if it exists.If the universe did not exist before the first sentient being evolved, then where did that sentient being come from - a non-existent universe?The universe existed before you did and will continue to exist long after you are gone.",
            "date": "Answered December 21, 2017",
            "views": "193",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dino Fluri",
                    "user_href": "/profile/Dino-Fluri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kolompár Tarzan",
                "href": "/profile/Kolompár-Tarzan"
            },
            "answer_text": "It can and it does exist without it. All the other religious answers should be skipped. Science is not phylosophy, cannot be agreed at dinner table. It is facts based, and facts coming from measurements. Latest measurements show, there is no need of God or conciousness for the Universe. It does not mean, there is no God. It means, it can survive without it. ",
            "date": "Answered March 4, 2019",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stan Harris",
                "href": "/profile/Stan-Harris-3"
            },
            "answer_text": "The answer is given in the question. \"if there was a universe\". ",
            "date": "Answered June 19, 2014",
            "views": "309",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nagarajan Ramachandran",
                    "user_href": "/profile/Nagarajan-Ramachandran-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ralph Glockemann",
                "href": "/profile/Ralph-Glockemann-1"
            },
            "answer_text": "Max Plank: I regard consciousness as fundamental. I regard matter as derivative from consciousness. We cannot get behind consciousness. Everything that we talk about, everything that we regard as existing, postulates consciousness. As quoted in The Observer (25 January 1931)The only thing we can say for sure is that everything we ‘see’ is ultimately a mental construction. Eminent Researchers - Spiritual Development ",
            "date": "Answered March 4, 2019",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Bush",
                    "user_href": "/profile/Paul-Bush-4"
                },
                {
                    "user_id": "Craig Weinberg",
                    "user_href": "/profile/Craig-Weinberg"
                },
                {
                    "user_id": "Theodore Smith",
                    "user_href": "/profile/Theodore-Smith-3"
                },
                {
                    "user_id": "Joschka Yoshi Tryba",
                    "user_href": "/profile/Joschka-Yoshi-Tryba"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ganesh Kalyanaraman",
                "href": "/profile/Ganesh-Kalyanaraman-1"
            },
            "answer_text": "The most fundamental truth about existence of any entity is that it is out and out a mental phenomenon. As such the question of existence of any entity can arise only in the presence of consciousness. Thus on a careful analysis you can conclude that this question presumes the existence of consciousness. Even to raise a question about existence, you need the presence of consciousness. The obvious answer is that the universe exists the way it is only because of observation by consciousness. If there is no consciousness this question about its existence or absence of existence itself can not arise and as such the question is illogical and deserves no answer! ",
            "date": "Answered February 22, 2020",
            "views": "45",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ryan Clark",
                    "user_href": "/profile/Ryan-Clark-647"
                },
                {
                    "user_id": "Hans J. Bieder",
                    "user_href": "/profile/Hans-J-Bieder"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alberto Martín",
                "href": "/profile/Alberto-Martín-2"
            },
            "answer_text": "This is a moot question not deserving an answer. If you and I exist, then there is consciousness in the universe, and so that hypothetical question becomes trite, meaningless. It is surprising to me that there are so many people willing to answer these sort of questions which Quora is rife with. If you bring up the notion of multiple universes as a possibility, that is just pure theorising that only theoretical physicists can speculate about - it does not touch life as we all live it. ",
            "date": "Answered December 30, 2017",
            "views": "165",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Antonio Guido Leoni",
                    "user_href": "/profile/Antonio-Guido-Leoni"
                },
                {
                    "user_id": "Mary Cris",
                    "user_href": "/profile/Mary-Cris-15"
                },
                {
                    "user_id": "Murari Das",
                    "user_href": "/profile/Murari-Das-1"
                },
                {
                    "user_id": "Ganapati Govind Das",
                    "user_href": "/profile/Ganapati-Govind-Das"
                },
                {
                    "user_id": "Jahnu Das",
                    "user_href": "/profile/Jahnu-Das-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yaqub Sabir",
                "href": "/profile/Yaqub-Sabir-2"
            },
            "answer_text": "Inner Universe existed before living creation and physical Universe. Physical Universe is manifestation and glimpse of inner or astral universe. Still, physical universe does not represents fully The Supreme Consciousness. It can exist being active independent of living creation or observers and flourish.Eternal pure energy beneath universe keeps it active and alive. ",
            "date": "Answered February 19, 2020",
            "views": "29",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Craig Weinberg",
                    "user_href": "/profile/Craig-Weinberg"
                },
                {
                    "user_id": "Sanjay Varma",
                    "user_href": "/profile/Sanjay-Varma-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Clayton",
                "href": "/profile/Eric-Clayton-5"
            },
            "answer_text": "If there is a universe with nothing consciously observing it, does it exist? Of course, existence exists. If this question question is supposed to be a shot at the Copenhagen Interpretation’s version of quantum mechanics what it actually shows is why that “interpretation” is non-sense based on bad philosophy. Many-worlds is a much better version of the theory. ",
            "date": "Answered December 7, 2019",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sanjay Varma",
                "href": "/profile/Sanjay-Varma-14"
            },
            "answer_text": "Existence is consciousness. There is no non-existence of consciousness. Even in deep sleep experience of bliss is universal, implying an underlying ever existent consciousness. The universe appears and disappears in consciousness. ",
            "date": "Answered June 19, 2014",
            "views": "372",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "David A. Smith",
                    "user_href": "/profile/David-A-Smith-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gavin Harding",
                "href": "/profile/Gavin-Harding-1"
            },
            "answer_text": "Yes. The universe existed long before anything on earth evolved a consciousness. Therefore, it will continue to exist long after everything we are aware of that has a consciousness ceases to exist. The universe is the sum total of all existence. Can you prove this claim false? ",
            "date": "Answered January 11, 2020",
            "views": "46",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ralph Glockemann",
                    "user_href": "/profile/Ralph-Glockemann-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashok Ghai",
                "href": "/profile/Ashok-Ghai-1"
            },
            "answer_text": "We do not have to perceive universe. The radio waves coming from stars and planets of our galaxy and other galaxies are proof enough of the existence of universe. If by “conscious mind” you mean that consciousness which is known as GOD, the observation of Isaac Newton and other scientists is relevant - “the manner in which universe, galaxies, stars and planets are existing and moving in an orderly manner is itself the proof of an intelligent system (GOD) that has created it and is controlling it’. ",
            "date": "Answered December 21, 2017",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarvopama Dasa",
                "href": "/profile/Sarvopama-Dasa"
            },
            "answer_text": "I like Max Planck’s answer. According to him consciousness is the ultimate source for everything. It would be nice if we could ask him, “WHOSE?”  ",
            "date": "Answered February 19, 2020",
            "views": "120",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mary Cris",
                    "user_href": "/profile/Mary-Cris-15"
                },
                {
                    "user_id": "Ryan Clark",
                    "user_href": "/profile/Ryan-Clark-647"
                },
                {
                    "user_id": "Andy Kay",
                    "user_href": "/profile/Andy-Kay-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "Theodore Smith",
                "href": "/profile/Theodore-Smith-3"
            },
            "answer_text": "Consciousness is prior to observation; it is the ground on which perception takes place; our \"proof\" that something exists is through our perception alone.  Note Liao's use of the term \"we\"; this is also a perception.  Consciousness is NOT an object of perception. ",
            "date": "Answered June 19, 2014",
            "views": "374",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephen Wicklund",
                    "user_href": "/profile/Stephen-Wicklund"
                },
                {
                    "user_id": "Sonja Tapio",
                    "user_href": "/profile/Sonja-Tapio"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chenbagam Pillai",
                "href": "/profile/Chenbagam-Pillai"
            },
            "answer_text": "Conscious mind can't perceive the universe, because it has many ideas about the universe. Conscious mind will always analyze and compare everything with something other. But subconscious mind can perceive the universe, because every minute it has to react through senses. It is called as Intuition. “The eyes which can see the whole world can't see itself.” Because it is mere lens and will pass the light rays. The subconscious mind can judge the subject. As so our subconscious mind is continuously observing the universe. It has been studying as “biological clock or circadian rhythm”. Thanks for reading. ",
            "date": "Answered December 21, 2017",
            "views": "181",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Tah",
                    "user_href": "/profile/David-Tah-2"
                },
                {
                    "user_id": "Nick Kaftan",
                    "user_href": "/profile/Nick-Kaftan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim McAllister",
                "href": "/profile/Jim-McAllister"
            },
            "answer_text": "Yes. A conscious mind observing a thing is not required for its existence. The universe existed long before the first conscious mind and will exist long after the last of them. In the physics sense “observed” does not mean a conscious mind was involved. ",
            "date": "Answered December 22, 2017",
            "views": "9",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ewald Groenewald",
                "href": "/profile/Ewald-Groenewald"
            },
            "answer_text": "Yes. Consciousness allows us to as how that physical universe came into being. If we were a rock, the universe would still exits, we just wouldn’t know about it. Ewald Groenewald's answer to Are consciousness and reality one in the same? ",
            "date": "Answered October 8, 2016",
            "views": "188",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brendan Curtis",
                "href": "/profile/Brendan-Curtis-1"
            },
            "answer_text": "If this question were asked in one of the \"philosophy\" categories, the answer would be \"no\". The fundamental difference is that at the core of every philosophy, there is the teaching that consciousness creates and penetrates the so-called universe. ",
            "date": "Answered July 31, 2016",
            "views": "145",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Malcolm Sargeant",
                    "user_href": "/profile/Malcolm-Sargeant"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Francis",
                "href": "/profile/Bob-Francis-15"
            },
            "answer_text": "The universe does not depend on my brain’s ability to function. Though a dead man cannot perceive the universe, it still exists, and slowly rots his body. Ecclesiastes 9:5 For the living know that they will die, but the dead know nothing; they have no further reward, and even their name is forgotten. ",
            "date": "Answered November 4, 2016",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Samson",
                "href": "/profile/David-Samson-60"
            },
            "answer_text": "Some people believe a good case can be made for the universe being consciousness: Physics Is Pointing Inexorably to Mind ",
            "date": "Answered January 11, 2020",
            "views": "33",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Stockton",
                    "user_href": "/profile/David-Stockton-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Woodhams",
                "href": "/profile/Michael-Woodhams-1"
            },
            "answer_text": "Yes. This is just a version of the tree in the forest falling and the question being does it make a sound With this question the only thing which becomes absent is perception. The Universe does not vanish ",
            "date": "Answered December 21, 2017",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nick Simon",
                "href": "/profile/Nick-Simon-4"
            },
            "answer_text": "Yes. The inability to perceive something (no matter how you define perception) does not preclude the existence of things that remain unobserved. ",
            "date": "Answered June 19, 2014",
            "views": "357",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephen Jordan",
                    "user_href": "/profile/Stephen-Jordan-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daz Lovegrove",
                "href": "/profile/Daz-Lovegrove"
            },
            "answer_text": "you can be conscious and perceive the multiverse. when i astral travel i use conscious breathing techniques and fly anywhere i so choose in the multiverse. i flew to the source of all once, i can describe it in great detail yet i was much further away from earth as even Hubble could see. When i did this, it was not my own consciousness i was connected to but to the ‘one’ of which we are all a part. ",
            "date": "Answered December 21, 2017",
            "views": "9",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mecca Miles",
                "href": "/profile/Mecca-Miles-1"
            },
            "answer_text": "I cannot answer this question, and I am not sure anyone can, but I want to applaud you for asking it because it is surely the right question to ask at this point in the developmental history of the human species. ",
            "date": "Answered July 31, 2016",
            "views": "69",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Denise L. Parker",
                    "user_href": "/profile/Denise-L-Parker"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dean Carpenter",
                "href": "/profile/Dean-Carpenter-1"
            },
            "answer_text": "Yes. You must have a functioning universe in order to get consciousness. You are conscious now, and observe the universe, but it existed before you did. ",
            "date": "Answered June 20, 2014",
            "views": "384",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeanette Leuers",
                    "user_href": "/profile/Jeanette-Leuers"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vincent Salmon",
                "href": "/profile/Vincent-Salmon-1"
            },
            "answer_text": "No, the universe could not exist without consciousness. Consciousness is the electromagnetic information spectrum from which everything that exists has been constructed. ",
            "date": "Answered March 3, 2019",
            "views": "37",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nagarajan Ramachandran",
                    "user_href": "/profile/Nagarajan-Ramachandran-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eli Pasternak",
                "href": "/profile/Eli-Pasternak"
            },
            "answer_text": "Not only can, it did! Life as we know it has appeared in the last billion years. The universe has existed more than 12 billion years before there was any consciousness. Of course there could be conscious life on other planets earlier than ours but still the universe has existed before them. ",
            "date": "Answered March 3, 2019",
            "views": "57",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeanette Leuers",
                    "user_href": "/profile/Jeanette-Leuers"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lindsay B Harris",
                "href": "/profile/Lindsay-B-Harris"
            },
            "answer_text": "Definitely not. This is what life is all about, ones consiousness and your spiritual journey to the higher realm, ultimately eternal spiritual life. Not that many humans can understand this, while stumbling through this life in flesh. ",
            "date": "Answered March 5, 2019",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kevill Davies",
                "href": "/profile/Kevill-Davies"
            },
            "answer_text": "The universe developed in a way that allowed conscious minds to evolve. In other words there had to be an unperceived universe prior to consciousness. In a way this is the same as the future. There can never be a ‘present’ a ‘now’ if there isn’t a future and yet the future never exists; it has yet to be created. ",
            "date": "Answered January 4, 2018",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gavin Moffat",
                "href": "/profile/Gavin-Moffat-1"
            },
            "answer_text": "Mystics for millennia have stated that consciousness is more fundamental than matter (consciousness is the primary reality) Bernardo Kastrup PhD has written several books/YouTube vids on this, which are worth reading and would give a better explanation than I could re the “scientific” basis for this view having some credibility. ",
            "date": "Answered January 11, 2020",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Malcolm Sargeant",
                "href": "/profile/Malcolm-Sargeant"
            },
            "answer_text": "Our universe has no need of our permission to exist, it does not care, has no mechanism for caring. Other universes would be the same. ",
            "date": "Answered June 23, 2014",
            "views": "237",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Michael Stevenson",
                "href": "/profile/Michael-Stevenson-4"
            },
            "answer_text": "So the universe did not exist during the Big Bang, and you will in principle be able to point to the moment when it started, once conscious life sprung fully formed from the muck?? Ludicrous, easily answered question. ",
            "date": "Answered June 21, 2014",
            "views": "176",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "William Grant",
                "href": "/profile/William-Grant-154"
            },
            "answer_text": "It depends on what you mean, if you mean no consciousness beings exist, then yes. It’d be a bunch of trees and plants, and nothing else, but yes. ",
            "date": "Answered July 31, 2016",
            "views": "76",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yogesh Mahajan",
                "href": "/profile/Yogesh-Mahajan-23"
            },
            "answer_text": "Your question is very tricky. As per vedic literature, Bramha got birth at the begaining of universe and died at the end of all this cosmos. Theoretically, conscious observer i.e. Bramha is present during entire life span of Universe. ",
            "date": "Answered February 19, 2020",
            "views": "21",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Gerard Sans",
                "href": "/profile/Gerard-Sans"
            },
            "answer_text": "Sure. The universe is not human centric only our perception is. ",
            "date": "Answered June 27, 2014",
            "views": "163",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Rafael Bernal Arce",
                "href": "/profile/Rafael-Bernal-Arce"
            },
            "answer_text": "For countless eons there was no consciousness in the universe and, obviously, it existed, for otherwise we would not exist now. so the answer is Yes! ",
            "date": "Answered December 21, 2017",
            "views": "7",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rick Chapman",
                "href": "/profile/Rick-Chapman-24"
            },
            "answer_text": "According to GOD SPEAKS, the magnum opus by Avatar Meher Baba on “the theme of Creation and its purpose,” everything in the “universe” is a manifestation of consciousness. It’s a profound read for anyone seriously interested in questions like this. ",
            "date": "Answered March 4, 2019",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Doug Millhoff",
                "href": "/profile/Doug-Millhoff"
            },
            "answer_text": "Obviously, yes. Without a Universe to exist in, no conscious mind could have evolved to perceive it. ",
            "date": "Answered December 22, 2017",
            "views": "8",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Reilly",
                "href": "/profile/Mike-Reilly-60"
            },
            "answer_text": "I think so. Just because no one hears the noise a tree makes when it falls in a forest doesn’t mean it didn’t make a noise. ",
            "date": "Answered July 31, 2016",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Chidakel",
                "href": "/profile/David-Chidakel"
            },
            "answer_text": "The universe comes first. Then (maybe) conscious creatures evolve. If the universe required consciousness, we wouldn't be here. ",
            "date": "Answered December 28, 2017",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Johnston Robert",
                "href": "/profile/Johnston-Robert"
            },
            "answer_text": "Not really. This is backed up by quantum physics. It is a good argument against deism. ",
            "date": "Answered December 21, 2017",
            "views": "8",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eshwar Naik",
                "href": "/profile/Ne-96"
            },
            "answer_text": "it becomes what you want or Ishwar what he wants, but ishwar to meditate, Then when compared to you, who was a child, who was a child, who was love made, who is father, who fetched the child, if you say it is you, because before one hundred years, you was not there. identity of pot from clay, clay identity is tough, but pot identity is clear, becasue it is carries shape and colour, or naama and roopa, Hence it can and it becomes ",
            "date": "Answered February 23, 2020",
            "views": "9",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Oketa Otira",
                "href": "/profile/Oketa-Otira"
            },
            "answer_text": "It can't. Everything is in a state of motion. All things that move, have been caused to move. Consciousness creates this continuous motion at destroys it at will. But because consciousness will never die, the universe will keep existing, because consciousness continously creates the visible universe from nothing using electricity and magnetism as tools. ",
            "date": "Answered March 4, 2019",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cheryl H",
                "href": "/profile/Cheryl-H-18"
            },
            "answer_text": "The Universe exists because of consciousness. It (and therefore us) is the manifestation of Consciousness or as some people refer to it (god). ",
            "date": "Answered February 16, 2018",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alexander Taylor",
                "href": "/profile/Alexander-Taylor-61"
            },
            "answer_text": "hi This is what is called a moot point. A moot question is one that is arguable or open to debate. ... Thus, a moot point, however debatable, is one that has no practical value. Best wishes :) ",
            "date": "Answered December 6, 2018",
            "views": "8",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prabhat Kumar Tyagi",
                "href": "/profile/Prabhat-Kumar-Tyagi-1"
            },
            "answer_text": "Yes universe can exist without consciousness but   consciousness can not exist without a universe. ",
            "date": "Answered June 19, 2014",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bruce Barron",
                "href": "/profile/Bruce-Barron-1"
            },
            "answer_text": "Yes ",
            "date": "Answered December 21, 2017",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kemauc",
                "href": "/profile/Kemauc"
            },
            "answer_text": "Yes ",
            "date": "Answered October 29, 2016",
            "views": "5",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brenda Jacks",
                "href": "/profile/Brenda-Jacks-1"
            },
            "answer_text": "Yes ",
            "date": "Answered December 21, 2017",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dale Stothers",
                "href": "/profile/Dale-Stothers"
            },
            "answer_text": "Tree. ",
            "date": "Answered June 20, 2014",
            "views": "99",
            "upvotes": "0"
        }
    ]
}