{
    "title": "If time can be created by creating a new space, can time be destroyed by the collapse of the universe? - Quora",
    "tags": [
        "Time (physics)",
        "The Universe",
        "Cosmology",
        "Astrophysics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Jonkers",
                "href": "/profile/Andrew-Jonkers"
            },
            "answer_text": "Don’t know I would go so far as “created”, but there is certainly an intimate relationship between time and space. At present according to physical law and observation, space expands, entropy increases causing time to flow forwards and we remember things as we go into the future. Since a key principle of physical law is time symmetry (reversibility) now consider the implications of something having reversed time. Entropy would have to have decreased to cause this time reversal, space would contract, and memories (information) would be lost. Note I have carefully made no causal link between the expansion of space and the increase of entropy. I am not sure if researchers have ever argued through this chain of logic of a possible link between thermodynamics and the expansion of space. I am likely reinventing the wheel but the argument is as follows: As work is done, entropy increases, and information is produced (by particle interactions) that needs to be stored. It needs to be stored because physical law is time-reversible and without that information being available, that outcome cannot be met. But extra information can only be stored in the spatial configuration of the particles, so it follows that space must expand to provide that additional storage capability. The rate of expansion of space should as a result be related in a fundamental way to the rate of increase of entropy in the universe, which in turn will be a function of how much work is being done against gravity, which in turn will be related to the rate of particle interactions. For example the sun is hot from nuclear interactions doing work against gravity which prevents a collapse and busy increasing entropy as a result. By the logic above, this activity (integrated over the Universe) is also causing space to expand. Because the work is being done against gravity (the only force that extends such distances) it might not be surprising it is a constant in gravitational theory (the cosmological constant) that has a value defined by thermodynamics. Maybe someone can see where I am going here. Since the expansion of space is currently a presumed consequence at least in part of of dark energy and best modelled as the existence of a small positive cosmological constant in general relativity, perhaps the value of this constant is a consequence of thermodynamics and the increasing entropy of the Universe. If the logic above holds, there must be a new formula in physics relating the rate of increase in entropy to the value of the cosmological constant, and hence the rate of expansion. From the argument above, it might be subject to change over time. ",
            "date": "Answered September 25, 2018",
            "views": "139",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gokul NC",
                    "user_href": "/profile/Gokul-NC"
                },
                {
                    "user_id": "Richard Stary",
                    "user_href": "/profile/Richard-Stary"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Church",
                "href": "/profile/Andrew-Church-7"
            },
            "answer_text": "The logic statement called a ‘conditional’: If A (the antecedent), Then B (the consequent) is true if either the antecedent is false or the consequent is true. Your antecedent is false, so your statement is true for any false consequent you use. THAT IS: new space can not be created, even if it could, what does it even mean to attribute to it - new time? “NEW” time is not something known, thought of or defined by anyone I know in this universeTotal fail of your opening statement renders your second statement adrift without foundation, bearing, context or meaning.",
            "date": "Answered September 20, 2018",
            "views": "29",
            "upvotes": " Answer requested by Richard Stary",
            "upvoters": [
                {
                    "user_id": "Gregory Miner Gustafson",
                    "user_href": "/profile/Gregory-Miner-Gustafson"
                },
                {
                    "user_id": "Richard Stary",
                    "user_href": "/profile/Richard-Stary"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Chalmers",
                "href": "/profile/Robert-Chalmers-9"
            },
            "answer_text": "Yes, spacetime and mass are thought to be intrinsic to each other, indeed that is really the heart of the Theory of Relativity. I have read physicists postulating a far away future time, when all matter is in black holes and the universe is dark. My understanding however is that this would collapse both space and time. The result of this would be a physical (point-like) singularity, just the reverse of the process which gave birth to the universe and started time. Einstein said the same thing, that a singularity would twist all of spacetime up within it. ",
            "date": "Answered September 19, 2018",
            "views": "121",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brad Kelly",
                    "user_href": "/profile/Brad-Kelly-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Evan Howard",
                "href": "/profile/Robert-Evan-Howard"
            },
            "answer_text": "Time can “ NOT “ by created. TIME and EXISTENCE Time is just a “ MEASUREMENT “. It is constant wherever you are. The accuracy of the instrument you use will be influenced by gravity, centrifugal force, heat, and a few other variables. Time in not a “ FORCE “. There is no time “ DIMENSION “. There is no possibility of time “ TRAVEL “. All that exists, does so in the present \" INDIVISIBLE \" moment. http://www.creationoftheuniverse.org/ For more info on how the process started. ",
            "date": "Answered September 19, 2018",
            "views": "106",
            "upvotes": " Answer requested by Richard Stary",
            "upvoters": [
                {
                    "user_id": "Babruh Ardana",
                    "user_href": "/profile/Babruh-Ardana"
                },
                {
                    "user_id": "Virginia Hanlon",
                    "user_href": "/profile/Virginia-Hanlon"
                },
                {
                    "user_id": "Angele Roy",
                    "user_href": "/profile/Angele-Roy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ray Orion",
                "href": "/profile/Ray-Orion-1"
            },
            "answer_text": "Time was not created by space. Time is a man made intellectual tool, used to measure a period between events. Its basically the same as length is a means to measure the distance between two points. It is not a thing to be destroyed, it is a concept to be use by man to help explain the universe. If you created a new space, time would not exist until some events happened, and you had an observer of some kind to measure the period between them. ",
            "date": "Answered September 19, 2018",
            "views": "18",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Robert Esposito",
                "href": "/profile/Robert-Esposito-7"
            },
            "answer_text": "If time can be created by creating a new space, can time be destroyed by the collapse of the universe?  Time is a concept of duration, not something created or destroyed. Mark Twain said “Talking with a pretty girl for one hour can seem like a second. Sitting on a burning stove for one minute can seem an eternity.” (I’m sure this is a paraphrase.) ",
            "date": "Answered September 20, 2018",
            "views": "37",
            "upvotes": " View 3 Upvoters "
        },
        {
            "author_info": {
                "name": "Ali Abdulla",
                "href": "/profile/Ali-Abdulla-15"
            },
            "answer_text": "Time is the forth dimension of the universe, spacetime fabric, so collasing the universe back to its intial singularity and start a again, this indicates everything is crunched back including spacetime fabric,so, the answer is yes. ",
            "date": "Answered September 19, 2018",
            "views": "58",
            "upvotes": " Answer requested by Richard Stary"
        },
        {
            "author_info": {
                "name": "Mike Conrad",
                "href": "/profile/Mike-Conrad-34"
            },
            "answer_text": "Time is only constant and real where it is found. Speed of light is constant everywhere ",
            "date": "Answered September 19, 2018",
            "views": "38",
            "upvotes": "0"
        }
    ]
}