{
    "title": "If the world is just a simulation, what can you do to make it go your way? - Quora",
    "tags": [
        "Simulation Hypothesis",
        "Simulation Theory",
        "Simulated Reality",
        "Simulation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Jermey",
                "href": "/profile/Jon-Jermey"
            },
            "answer_text": "Just start playing a game of The Sims. And observe what the characters in The Sims do to make things ‘go their way’. Wait…that’s right, they can’t. Because they are simulated too. And if you are a simulated character in a simulated world, you can’t ‘do’ anything that you are not programmed to do by the parameters of the simulation. For some reason people find it hard to grasp the fact that being in a simulated world means being a simulated person. And as such, everything you do or say or think is determined by the simulation itself. But fortunately there’s no reason at all to think that is the case. Why it doesn’t matter whether we’re ‘living in a simulation’ ",
            "date": "Answered July 2, 2020",
            "views": "43",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harry Johnstone",
                "href": "/profile/Harry-Johnstone-7"
            },
            "answer_text": "I've heard countless theories on simulation. Comes down to you can't.. either you already decided how your life will be, so any attempts you feel you are manipulating it.. are a mere manifestation of your own creation. Or something else dictates your experience.. either way.. you can't alter it. I mean by all means try.. and if good comes your way, you will attribute that to “you altering destiny” But you can't if that was/is a thing.. Very peridoxical… ",
            "date": "Answered July 4, 2020",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Oakes",
                "href": "/profile/Michael-Oakes-57"
            },
            "answer_text": "If this is a simulation, we may not have a choice. And that on one hand, on the other the next right step. Simulation has a way of gaining by showing up. If WE are showing up to our lives…then that is who we are. It is a simple circular logic. Everything that seems like a simulation is available to push back. ",
            "date": "Answered July 4, 2020",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Hoheisel",
                "href": "/profile/Mark-Hoheisel-1"
            },
            "answer_text": "See if you can discover a story line or player character. Try to follow it or them. The universe may exist for their benefit so you’d be well served by making “your way” into their way. ",
            "date": "Answered July 7, 2020",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Middleton",
                "href": "/profile/Scott-Middleton-51"
            },
            "answer_text": "There is definately a life hack. A lot of people have figured it out. There are quite a few happy successful people on this planet who are blissfully ignorant. Also is believing its a simulation much different than believing in fate or intelligent design? In a lot of ways a simulation is better than Atheism (me). In Atheism there are no save games or redundant backups. :) just the 80′s 8 bit \"GAME OVER\" ",
            "date": "Answered July 2, 2020",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James H. Jenkins",
                "href": "/profile/James-H-Jenkins"
            },
            "answer_text": "Decide what I want to have happen, and work toward it. ",
            "date": "Answered July 6, 2020",
            "views": "37",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cathy Riess",
                    "user_href": "/profile/Cathy-Riess"
                }
            ]
        }
    ]
}