{
    "title": "If the universe is random, how does the universe create random values? - Quora",
    "tags": [
        "Randomized Algorithms",
        "Determinism",
        "Random Number Generators (RNG)",
        "Randomness (statistics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Toni Sementana",
                "href": "/profile/Toni-Sementana"
            },
            "answer_text": "The world we live in. The one filled with things like people, animals, and cars is described by something called “Classical Physics.” It says the world is predictable. But the tiny world of quantum particles is inherently random. Quantum physics says the world is unpredictable. Which leads to one question: How can a world made of unpredictable things be predictable? Let’s start with something random but familiar. Like a penny. Most people consider coins to be pretty random. The reason I like them is they only have 2 states: Heads or Tails. Nice and simple. If you give it a good flip, you’re not going to have any idea what state it’s in. When I just flipped it, I got tails but I could have just as easily gotten heads. Let’s say I do it 10 times. I could have end up with any number of either state. Totally unpredictable, right?!?! Well, maybe not. While I could have gotten, say, 10 heads, that’s not very likely. There’s only a 1 in 1024 chance that will happen. The same goes for the possibility of all tails: a 1 in 1024 chance or another way to say that: There’s a little less than a 0.1% chance. That’s what we called a “Probability” and that probability is much higher for mixed states, which is exactly what we ended up with for 10 flips. Even though each coin flip is unpredictable, we can make some predictions about a group of flips. Flip your pennies a lot more than 10 times, say, 1000 times. The more flips you do, the closer the group will tend toward 50/50. For 1000 flips, that’s about 500 heads and about 500 tails. Which is an extremely predictable result and probably. See what I did there? probably not that surprising to most of you. If you flipped the coin 1000 times again, it would probably happen again. In fact, there’s only a 1 in 10.7 googol googol googol chance you’ll get all heads or all tails, so that’s probably never going to happen. These are things we develop instincts about. It’s predictable. No one ever expects to get 1000 heads in a row. Pennies are just an analogy for quantum particles. Coins have two sides, two states. If that coin is perfectly balanced and perfectly random, well, then behaves exactly like a photon. Photons have no rest mass, no electric charge, and no color charge. Just a couple of spin orientations and that’s it. They can spin forward, what we call counterclockwise or right-handed spin. Or they can spin backward, what we call clockwise or left-handed spin. Those are the only options available . So does that mean circular-polarized light is more fundamental than linear-polarized light? Yes. That’s exactly what this means. The two linear orientations are quantum super-positions of left and right handed spin. But spin is the fundamental property of the photon. If you’ve got a light source like a light bulb, then there’s no built in preference. You have a 50/50 chance of getting either spin state with each photon. Just like our perfect penny. Although, unlike a real penny, our quantum penny I mean, photon, isn’t really in either state until we actually measure it. It’s in one of those quantum super-positions with a 50% chance of collapsing into either possibility when measured. That’s what true randomness looks like. In the penny experiment, we got to look each time to see what state the penny was in. We can't actually see the spin of a photon, so we have to send it through a circular polarizer like these. If you have a right-circular polarizer, it will pass all right-circular photons and it will block all left-circular photons. It’s either passed or it’s blocked. No in-between! Each measurement is individually random, but if you do it a bunch of times? Like, say, the 10 million trillion photons coming out of this bulb every second? Half of them will pass through and the other half will be blocked. Each photon is random, but the whole group isn’t. and this works for other photon interactions too. We don’t know if any one photon will reflect off of a mirror or get absorbed. But we do know about 84% of them will reflect and about 16% will get absorbed. It’s not even limited to just photons. It works for any quantum particles. We call this the law of large numbers. If you perform an experiment an enormously large number of times the results will equal the expectation. That’s exactly what happens with the universe. Everything in it is made of an unimaginable number of quantum particles. The Earth? About 10^52 particles. The human body? About 10^29 particles. A single piece of dust? About 1 million million million particles. A virus? About 100 million particles. No matter how random each individual particle is, the thing they’re a part of will be predictable because of the sheer number of particles, hence the Universe is NOT random. ",
            "date": "Answered January 28, 2019",
            "views": "241",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joshua Engel",
                "href": "/profile/Joshua-Engel"
            },
            "answer_text": "That's the lesson of quantum mechanics over and over: stop trying to force the universe into your preconceived notions.  That's an extremely unsatisfying answer, but it's an important lesson. The probabilistic Copenhagen interpretation is misleading.  It's a fairly direct way of looking at the amplitudes, and it fits the same math as a probability distribution, but there are a lot of ways in which it's wonky.  It gives the impression that the particle is nice and real, then has a decision to make, then goes back to being real.   That's especially misleading in the continuous cases.  The particle doesn't just go left or right, as in the two-slit experiment: all by itself, its location is not a fixed number.  It's not \"fixed but unknown\", but genuinely not defined. That said, it does behave a lot like a random probability distribution when you force it down: take a measurement on a superposition, and it collapses down to exactly one of its basis kets.  It's awfully tempting to call that \"random\", and it acts like randomness, but it's missing the non-local aspects of it.   That is, just because there aren't any local hidden variables doesn't mean there aren't non-local ones.  You don't need to go outside the universe to search for it.  Why does the particle go left rather than right, if you have a measuring apparatus?  Because the sum total of the universe pushed it that way, and the only way to know why would be to aggregate over every particle in the universe. You can't do that, so it acts just like a random die: probability as a measure of your ignorance about the state.  And I think that's the answer to your question: each \"random\" decision is arrived at by asking the universe as a whole, using criteria we can't even begin to guess at, and almost certainly having something to do with the origin of matter in the universe, and definitely by an entirely different mechanism than anything you're familiar with classically.  So I'm afraid that the answer doesn't really give you what you're hoping for: a way to force the universe back into a classical form.  Once the can of worms is opened, the only way to get them back is to use a bigger can. ",
            "date": "Answered May 5, 2011",
            "views": "25",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mahem",
                    "user_href": "/profile/Mahem"
                },
                {
                    "user_id": "Kenneth Young",
                    "user_href": "/profile/Kenneth-Young-25"
                },
                {
                    "user_id": "Ramit Das",
                    "user_href": "/profile/Ramit-Das"
                },
                {
                    "user_id": "Kevin Schenkers",
                    "user_href": "/profile/Kevin-Schenkers"
                },
                {
                    "user_id": "Malcolm Sargeant",
                    "user_href": "/profile/Malcolm-Sargeant"
                },
                {
                    "user_id": "Jonathan Aaron Alpart",
                    "user_href": "/profile/Jonathan-Aaron-Alpart"
                },
                {
                    "user_id": "James H. Kelly",
                    "user_href": "/profile/James-H-Kelly"
                },
                {
                    "user_id": "Shane Kai Glenn",
                    "user_href": "/profile/Shane-Kai-Glenn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Nelson",
                "href": "/profile/Mark-Nelson-2"
            },
            "answer_text": "At the quantum level it has been exhaustively demonstrated that the universe generates events randomly. In the words of the Wikipedia, the Schrödinger equation describes how the state of a physical system changes with time. This equation can describe the probability that an event will occur, but cannot say exactly whether or not it will occur. There is a long-standing argument among people who object to the probabilistic nature of this equation, with attempts to invoke hidden laws or states as being the actual mediators of events. But modern physicists seem to be content that it has been conclusively proven that there are no hidden laws or state information. So, for example, you can conduct an experiment in which you shoot a single photon at a surface with two slits. (Yes, you can actually do this.) The photon will go through one slit or the other (at least it will after you measure it.) Which slit it goes through is an entirely random event. I am not a physicist. Update in response to the comment asking for more details on hidden laws:If you look at the Wikipedia article on Quantum Mechanics and jump to the section on Philosophical Implications you get a little bit of text about this. http://en.wikipedia.org/wiki/Quantum_mechanics Einstein was not happy with the probabilistic nature of quantum mechanics. The Copenhagen interpretation says that when a photon is headed towards two slits, there is no deterministic way to know which of the two it will pass through. Einstein and many others were uncomfortable with this, and felt there were hidden variables that would let us know in advance which slit the photon would go through. His feeling was that even though we might not be able to discern these variables, their presence made the question deterministic. John Bell came up with a theorem that allowed physicists to actually test for the presence of hidden variables, and the results that have come in over the years have pretty much put to rest the notion of deterministic causality. So when we dig down to the nuts and bolts level of the universe, causality simply doesn't work the way it does at the macroscopic level. This gives people a lot of trouble - we have a mental model of things, and to find out that it doesn't scale properly in one direction is disconcerting. There are some pretty good explanations of all this in some popular books on quantum mechanics. For example, you can use Google Books to get a preview of Brian Greene's book The fabric of the cosmos: space, time, and the texture of reality. If you go to page 11 he talks about this, with the money quote: most physicists agree that probability is deeply woven into the fabric of quantum reality.I think to get a good lay understanding of this you probably need to dig into a book like Greene's. There is a fair amount of infrastructure you have to work up to in order to get conversant with how Bell's inequalities are tested. The Wikipedia articles on these topics tend to be written at a somewhat higher level than is going to work for someone who is just skimming. I am still not a physicist. ",
            "date": "Updated February 24, 2017",
            "views": "38",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike B",
                    "user_href": "/profile/Mike-B-12"
                },
                {
                    "user_id": "Eiric Hasson",
                    "user_href": "/profile/Eiric-Hasson"
                },
                {
                    "user_id": "Ankit Ahuja",
                    "user_href": "/profile/Ankit-Ahuja-5"
                },
                {
                    "user_id": "Veerendra Kakumanu",
                    "user_href": "/profile/Veerendra-Kakumanu"
                },
                {
                    "user_id": "Piyush Kumar",
                    "user_href": "/profile/Piyush-Kumar-8"
                },
                {
                    "user_id": "Tom DeHart",
                    "user_href": "/profile/Tom-DeHart"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason MacDonald",
                "href": "/profile/Jason-MacDonald"
            },
            "answer_text": "The universe does not create numbers, random or otherwise. Numbers are an abstract concept, used to represent a measurable quality of something else (quantity, ratio, size, probability, etc.). ",
            "date": "Answered May 5, 2011",
            "views": "940",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Veerendra Kakumanu",
                    "user_href": "/profile/Veerendra-Kakumanu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sturm Ren",
                "href": "/profile/Sturm-Ren"
            },
            "answer_text": "The universe is not random. It follows certain rules, which make it pretty much the same as the ''Pseudo-random'' numbers. ",
            "date": "Answered January 26, 2011",
            "views": "195",
            "upvotes": "0"
        }
    ]
}