{
    "title": "If time cannot exist without matter or space, then what is time? - Quora",
    "tags": [
        "Existence",
        "Time (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keinosuke Johan Miyanaga / 宮永 ヨハン 計之介",
                "href": "/profile/Keinosuke-Johan-Miyanaga-宮永-ヨハン-計之介"
            },
            "answer_text": "It’s an abstraction. Time and everything else all exist and don’t exist at the same time. They exist because they can be abstracted, but they don’t exist without their abstractions. The key is that not everything can be abstracted. There must be something to abstract from. Not all abstractions make sense, and not all sense is real. This source of our abstractions is everything at once, undivided, and unabstracted. Yet it is also nothing at the same time, because existence is abstraction itself. It’s before it’s anything. What is unabstracted cannot exist because it cannot be known. What cannot be known cannot be talked about, and so is beyond reasoning. Then what is time? It’s connection with other abstractions is a good sign, because there are no abstractions that are disconnected from everything. But that can also be said about matter, or space, or anything else. And the key here is that everything knowable is also somehow connected to us, or they would be unabstractable. Abstraction is what happens when an intelligent agent makes contact, resulting in intelligence. Time is a concept, which in itself is a state of existence, backed both by common sense and mathematical proof and scientific evidence. Time is a piece of intelligence. Everything is a concept, which in itself is a state of existence. What anything is backed by though differs, and that is the only thing we have to differentiate existences to test how aligned they are with reality, how accurate they may be, and whether they’re worth using or not. And testing whether they are worth using is something I’m doing right now as I type, or what anyone does whenever they utter anything. Abstractions manifest themselves as words. Every word is connected with the root of all abstractions or else they would never come into being — words such as time, space, even God, and even reality. And that is why scientists can depend on words to do science, and philosophers can use words to untangle — or further tangle — reality. Words are an extension of reality itself. It is everything physically knowable to us making itself known. Then what is reality? Reality too is just a word, and the pursuit of a distinction between any other type or class of existence here is futile. Words are no less real than anything else. It’s all real, and everything bleeds into everything else. The only illusion is the illusion itself which is the only true contradiction. There cannot be anything without something to begin with. At the end of the day, our intelligence cannot escape us, and we cannot escape our intelligence. Reality is not the basis of our models, but a model in and of itself. My reality is not your reality and neither are mathematical or physically accurate models, yet they are, to us, as real as it gets. Of course, this mind bending exercise does serve one progressive purpose. Throughout it all, we find ourselves getting smarter, and maybe that’s all that matters. But I digress. Time is a word, and a very good word, at that. Use it as you wish, and you can learn from how others use it. ",
            "date": "Answered December 2, 2016",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Puru Bheemireddy",
                    "user_href": "/profile/Puru-Bheemireddy"
                },
                {
                    "user_id": "Stefan Kruger",
                    "user_href": "/profile/Stefan-Kruger-3"
                },
                {
                    "user_id": "Russel Rhay Basiao",
                    "user_href": "/profile/Russel-Rhay-Basiao"
                },
                {
                    "user_id": "James Gates",
                    "user_href": "/profile/James-Gates-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zane Scheepers",
                "href": "/profile/Zane-Scheepers-1"
            },
            "answer_text": "The simplest answer is that time exist the same way motion exists. If there was no matter to move or space to move through, motion wouldn't be possible. Time refers to motion through the temporal dimension. It's something that things do. If there were no things to time, time wouldn't exist/be possible. We didn't invent time. We named it. It's a naturally occurring phenomenon. We invented clocks, which allow us to measure the temporal distance an object travels. Now, our consciousness progresses from one moment to the next and as this happens, we perceive changes occurring around us and to us. This is how we experience time passing. It's not that time passes. It's us that move through the temporal dimension. We time. ",
            "date": "Answered January 9, 2020",
            "views": "100",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Gates",
                    "user_href": "/profile/James-Gates-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Wong",
                "href": "/profile/David-Wong-266"
            },
            "answer_text": "Time can be interpreted in more than one way.It is acceptable to view time as a fourth dimension, but the way I like to explain time so that almost anyone can understand it, is like this:______________________________________________________________The only two ways to measure the passage of time are as follows: either by watching change in matter, or the movement of matter through space.______________________________________________________________Therefore, time cannot exist without matter or space. Since time is the process of change or movement involving matter or space, then time is simply the observation of change, of matter changing or moving in a certain order.______________________________________________________________I am quite confident in my answer and I wonder what Richard Muller would think of my explanation.Thanks for the A2A! ",
            "date": "Answered December 1, 2016",
            "views": "849",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Oroborust",
                    "user_href": "/profile/Paul-Oroborust"
                },
                {
                    "user_id": "John Arseneau",
                    "user_href": "/profile/John-Arseneau-1"
                },
                {
                    "user_id": "David Csinsi",
                    "user_href": "/profile/David-Csinsi"
                },
                {
                    "user_id": "Kenneth Armstrong",
                    "user_href": "/profile/Kenneth-Armstrong-9"
                },
                {
                    "user_id": "Carter Gebert",
                    "user_href": "/profile/Carter-Gebert"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sébastien Pauleau",
                "href": "/profile/Sébastien-Pauleau"
            },
            "answer_text": "I think your assumption is that time and space are different things. From what I've heard, time and space is one thing. This is called space-time and it's not a convention. It is one thing. You can speak of the space-time fabric. Your question thus actually asks if space-time can exist without matter. The answer seems easy: Yes. An even easier one would be the opposite “Could matter exist without space-time?” No. Back to your question, I would say maybe no after all. Although I can imagine an ”empty” space-time fabric, it seems that from its nature it is obviously more than only that. All the ingredients to matter might well be included. Maybe if you'd launch a slightly different version of our space-time fabric, you could generate it so as to be sterile. With no possibility of appearance of anything. Our space-time fabric, it's my educated guess, might hide in even more than only space and time. Everything from a background for the four fundamental forces and energy, to the “things” needed for consciousness. ",
            "date": "Answered December 2, 2016",
            "views": "213",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Charan Rdy",
                    "user_href": "/profile/Charan-Rdy"
                },
                {
                    "user_id": "Rohan Dixon",
                    "user_href": "/profile/Rohan-Dixon-1"
                },
                {
                    "user_id": "Russel Rhay Basiao",
                    "user_href": "/profile/Russel-Rhay-Basiao"
                },
                {
                    "user_id": "James Gates",
                    "user_href": "/profile/James-Gates-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sreenivasulu Kondannagari",
                "href": "/profile/Sreenivasulu-Kondannagari"
            },
            "answer_text": "According to physicists, with the big bang the dimension-less singularity mutated into the 3-dimensional space. We readily accept space as empirical entity. But is this space static? No. We know that it has been expanding and evolving into energy and matter. So we need a time-frame of reference to put this dynamic evolution in perspective. That is time. ",
            "date": "Answered December 2, 2016",
            "views": "219",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Gates",
                    "user_href": "/profile/James-Gates-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kapil Gupta",
                "href": "/profile/Kapil-Gupta-328"
            },
            "answer_text": "Time is the dimension which confirms existence of space. Existence of matter confirms the existence of space. No space, no matter no earth no solar system no milkyway no universe. Time is the dimension which defines the action of matter and gravity.You exists bcoz space exist and you work bcoz time exist. ",
            "date": "Answered December 2, 2016",
            "views": "222",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Oroborust",
                    "user_href": "/profile/Paul-Oroborust"
                },
                {
                    "user_id": "Zac Alexander",
                    "user_href": "/profile/Zac-Alexander-1"
                },
                {
                    "user_id": "Marsh Paull",
                    "user_href": "/profile/Marsh-Paull"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marshall Barnes",
                "href": "/profile/Marshall-Barnes-2"
            },
            "answer_text": "It’s actually the other way around. Matter and space can’t exist without time. Actually, matter can’t exist without space either. Time is connected to all levels and portions of space and its purpose is to allow matter and energy the ability to exist, move, vibrate, etc. Without time, there would be nothing. ",
            "date": "Answered June 24, 2020",
            "views": "96",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aidan Hayward",
                "href": "/profile/Aidan-Hayward-1"
            },
            "answer_text": "There is no such thing as no space. Space is everywhere. Even the void an infinite distance from the universe would still be space. Space is nothingness (with the occasional atom, and its full of dark energy but that’s besides the point) Nothing-Nothing still equals nothing. Time is just a way to measure how long an event takes to happen ",
            "date": "Answered December 2, 2016",
            "views": "168",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Uriel Anderson",
                "href": "/profile/Uriel-Anderson-4"
            },
            "answer_text": "Time is CREATED by matter itself. Time Is governed by the sun and moon…MATTER. As far as “space” is concerned, space cannot be “created” because space is a absence of matter for the most part. Between two particles is space. “Space” is manifested by a objects movement. It exists before an object displaced it. ",
            "date": "Answered February 25, 2020",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Khuram Rafique",
                "href": "/profile/Khuram-Rafique"
            },
            "answer_text": "Time is behavior of matter and the said behavior takes place in space. ",
            "date": "Answered December 2, 2016",
            "views": "64",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zac Alexander",
                "href": "/profile/Zac-Alexander-1"
            },
            "answer_text": "http://philosophyfaculty.ucsd.edu/faculty/ccallender/FQX.pdf ",
            "date": "Answered December 11, 2016",
            "views": "81",
            "upvotes": "0"
        }
    ]
}