{
    "title": "If we can learn many things without having to follow the education system, what is the point of enrolling in schools? - Quora",
    "tags": [
        "Learning",
        "Schools",
        "Higher Education",
        "Colleges and Universities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mitul Mehta",
                "href": "/profile/Mitul-Mehta"
            },
            "answer_text": "If you are smart and motivated enough to learn enough by yourself, go for it. Maybe even apply for the Theil fellowship http://www.thielfellowship.org/ But chances are that you will actually get more out of going to a school with a curriculum because one doesn't know what they don't know. Meaning, how do you know what you need to learn?  Obviously there are certain fields (like mine, eye surgery) that absolutely require decades of formal education. But there is tremendous value in physically going to a place of learning and surrounding oneself with people who are there to learn. There is an amazing synergy when this is done correctly (as I felt at MIT when I was a student).  I learned so much outside of class from my schoolmates but I never would have been in that environment if it weren't for the school. I worked on the phone system for our fraternity house because a few guys built one from scratch, all the way from designing the circuit boards and wiring the whole house. And back in the old days we had portable CD players and some of them didn't have a way to adjust the base and treble, so I built one. I actually did that in my freshman physics class in college.  There is no way I would have taught myself this stuff on my own and I am obviously a motivated, hardworking person.  So good luck and stay in school. ",
            "date": "Answered October 12, 2014",
            "views": "210",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sheldon Mojelski",
                    "user_href": "/profile/Sheldon-Mojelski"
                },
                {
                    "user_id": "David Lewis",
                    "user_href": "/profile/David-Lewis-131"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Stone",
                "href": "/profile/Thomas-Stone-13"
            },
            "answer_text": "You ask a very valuable and intellectual question.  As much as today's kids claim they go to post-secondary to pursue higher learning, they actually ARE only there for a certificate (piece of paper).   Today's high school grads are under tremendous pressure to succeed and make a name for themselves.   This is the SOLE purpose in enrolling in university these days, to obtain a piece of paper from an accredited school JUST so they can show their parents and their peers that they've \"done something with life.\"  Its utterly ridiculous and nonsensical.   Now, have said that, there ARE a few fields of work DO require higher education, like health care related careers and science.  Outside of these fields, the actual NEED for higher education is questionable. ",
            "date": "Answered October 11, 2014",
            "views": "158",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alexander Nikolov",
                    "user_href": "/profile/Alexander-Nikolov-2"
                }
            ]
        }
    ]
}