{
    "title": "If we want something from God, will they give it to us or not? - Quora",
    "tags": [
        "Philosophy of Religion",
        "Theology",
        "Belief and Beliefs",
        "God",
        "Religion",
        "Philosophy of Everyday Life",
        "The United States of America",
        "Human Behavior",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ganapati",
                "href": "/profile/Ganapati-11"
            },
            "answer_text": "Hi, It depends on how strong your desire and what is your commitment/effort to achieve that. Just look at examples from Ramayan and Mahabharat. Lots of people taken boon from God after doing severe tapas. In today’s world, Bhakti marg is recommended to achieve your desire. Bhakti should be like Hanuman, Radhe, Meera, Bhakt Kanakdas. 100% surrendering. Shirdi Sai Baba whom I worship always said we can achieve anything in our life by following Shraddha and Saburi. However, one most important thing which people ignore- God/Guru whom we believe knows everything and he knows our past, present and future and naturally, he is aware of what is our current situation and what is good for us at that point of time. it would be better to express our difficulty and challenges and allow God or Guru to give what is good for us. It helps in the long run. Sairam ",
            "date": "Answered August 19, 2020",
            "views": "15",
            "upvotes": " Answer requested by Gursimran Dhaliwal",
            "upvoters": [
                {
                    "user_id": "Shalini Chandel",
                    "user_href": "/profile/Shalini-Chandel-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ajit Karve",
                "href": "/profile/Ajit-Karve-2"
            },
            "answer_text": "My answer may be bewildering. It is true for fact. If I have No desireNo wantNo needNo fearNo expectationDo I need God. Possibly the answer is no. The universal one, the being of existence, the omnipresent, the omnipotent, the omniscient ‘IS'. God is an human abstraction of / for that one. His job is to create and sustain creation.  So now the question : Will I receive, if I ask? Yes and No. Yes. Because you will receive. No. Because there is no giver. Reality lies hidden in this dichotomy called God. ",
            "date": "Answered August 18, 2020",
            "views": "34",
            "upvotes": " View 1 Upvoter "
        }
    ]
}