{
    "title": "If we all take as read that Trump is a narcissist, have we had any other narcissists besides Trump in the White House? - Quora",
    "tags": [
        "The White House",
        "Narcissistic Personality Disorder",
        "Narcissism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Robinson",
                "href": "/profile/Paul-Robinson-79"
            },
            "answer_text": "Your question is framed in such a way as to make you the narcissist - Trump is anything BUT a narcissist -he gave up a billionaire lifestyle to live in sub-standard housing, fly in an outdated jet and work for nothing, while being insulted for everything he does, and his mega accomplishments for America scorned. ALL to rescue America YOU think that is the definition of being a narcissist? Obama - yes. Broomhilda - certainly. Trump? you need to revisit the definition of the word. ",
            "date": "Answered September 3, 2018",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Noelle Bridgman-Wile",
                "href": "/profile/Noelle-Bridgman-Wile"
            },
            "answer_text": "I’m not a fantastic student of history, so can only answer generally: most were. I think most leaders are somewhat more narcissistic than average, and it’s likely that the higher one rises in politics (or industry), the more narcissistic. Ambition runs the show, and the less you worry (or even recognize) the downside or fall-out of ambition, the more successful you’re likely to be. One of the elements of NPD is in seeing the world as a game of win or lose. It’s not about building a contented, happy life, it’s about winning. Relationships are tools for achieving ends, not for the benefit of the interpersonal connection. It requires calculation and dispassion, both of which are more difficult to maintain the less narcissistic (or ASPD) someone is. The more empathic, the more attuned you are to the negative consequences of your ambition on others, and the more you’ll avoid those. ",
            "date": "Answered September 2, 2018",
            "views": "65",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lou Anderson",
                    "user_href": "/profile/Lou-Anderson-5"
                },
                {
                    "user_id": "Bob Trammell",
                    "user_href": "/profile/Bob-Trammell-1"
                }
            ]
        }
    ]
}