{
    "title": "If we did not have a consciousness, would we have thought of the idea of consciousness? - Quora",
    "tags": [
        "Consciousness",
        "Neuroscience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pierz Newton-John",
                "href": "/profile/Pierz-Newton-John"
            },
            "answer_text": "No, this is not a stupid question, in fact it’s a really, really good one because it gets at an important problem in the philosophy of mind: the problem of the so-called “philosophical zombie”. A philosophical zombie is not an undead person who is kind of okay with being a shambling corpse. It refers to the idea of a person who is capable of simulating in every way the behaviour of a real person, but who has no consciousness, no inner experience. Imagine a doll that cries when you press a little button on the back of it. You don’t imagine that the doll is actually experiencing sadness when it squeezes out tears. You could make this emotional simulation more and more accurate and convincing, but presumably there is no point at which the doll starts to actually feel something. Or is there? The Turing test assumes that when the doll can convince us that it is human, we must assume it is human, in a sense. We must assume it has an inner life corresponding to its outer behaviour. Our current materialist model of the world describes sentient beings such as humans in terms of objective mechanical processes. The mind-body problem is the problem of explaining why such collections of mechanical processes have subjectivities, why they experience anything. Why are we not philosophical zombies, programmed by evolution to do all the things that humans and other animals do: avoiding harm, seeking out food, mating and so on, but with no internal experience, nobody home? The reason your question is a good one is that it shows the absurdity of the notion of a such a non-sentient simulacrum of a human. If there was a philosophical zombie society isolated from conscious people and conscious society, would they discuss consciousness with one another, and talk about the mind-body problem? It seems they would have to, otherwise we could distinguish them from conscious humans. But how would they come up with such an idea as consciousness? What could it possibly mean to them? Consciousness has no definition. It cannot be described objectively. There is no measure of it, no proof. This has led some philosophers (e.g. Daniel Dennett) to embrace “eliminativism”, the position that consciousness doesn’t really exist, but is an illusion. To me - and to many academic philosophers of mind - that is absurd. After all, consciousness was the one thing which Descartes argued we could never doubt: “I think therefore I am.” One answer to your question might be that if we didn’t have a consciousness we could not “think” of anything, we could only produce speech and writing which represents thought we don’t really have. If philosophical zombies could exist, they would have to produce speech and writing about consciousness. However the idea that they could generate such ideas without an experience of consciousness certainly appears absurd, and I take it to be a strong argument against the possibility of their existence. ",
            "date": "Answered March 21, 2018",
            "views": "399",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Timothy Kim",
                    "user_href": "/profile/Timothy-Kim-76"
                },
                {
                    "user_id": "Caroline Castle",
                    "user_href": "/profile/Caroline-Castle-3"
                },
                {
                    "user_id": "Sonia Elkes",
                    "user_href": "/profile/Sonia-Elkes"
                },
                {
                    "user_id": "Trevor Maxville",
                    "user_href": "/profile/Trevor-Maxville-1"
                },
                {
                    "user_id": "Sujith Kumar",
                    "user_href": "/profile/Sujith-Kumar-110"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Kolinie",
                "href": "/profile/Ron-Kolinie"
            },
            "answer_text": "Another way to say this is could I come up with the idea of consciousness and not be conscious. I do not think so. I read all the answers to this question and I feel there is something missing. Animals with smaller brains must have developed some level of consciousness. Let me give some examples. First, we had four gold fish in a tank. My wife would feed them every morning. They would come to the top of the tank to be fed. But, slowly one died then another. Now there are only two. Fish have a pecking order which is a hierarchy of status seen among members of a group of people or animals. The top fish or dominant always went to feed first. But, this dominant fish got sick and did not want to come to the top of the tank to feed. The other, less dominant fish tried to help the dominant fish. He continued to help the dominant one until he finally passed away. How does a fish with such a small brain know his friend is sick and how to help. Second, bees do a dance to tell other bees how far and what direction they can find food. Third, I saw a rat come out and look at some nuts I had put out for some squirrels. He did not go get the nuts but just kept moving around to survey where the nuts where on our deck. He then took off without eating one nut. Five minutes later, he came back with another rat and the two of them stuffed themselves with nuts and took them back to there hideout. How did the first rat tell his friend about the nuts? Forth, an experiment was done with raccoon. A 50 pound bag of dog food was placed in a small barn with only the smallest of ways to enter for the raccoons. It took several weeks but a raccoon found the entry and ate some food. Over the next several days several more raccoons came to eat the dog food. The original raccoon never came with any of the later visitors. How did the raccoon tell his friend where the food was at the barn? Fifth, Helen Keller was deaf-blind and was like an animal lost to the world with no meaning. Keller's teacher, Anne Sullivan, broke through the isolation imposed by a near complete lack of language, allowing the girl to blossom as she learned to communicate. Helen Keller seemed to have a lack of consciousness until she acquired language by sense of touch. Each of these examples seems to require some sort of consciousness with language. Why is language important? If you have the qualia of a blob of green in your vision and you can call it a tree. Then the word tree has meaning for you. Scientists were able to locate the specific part of the brain where the meanings of words are created. With out the sense of touch on Helen Keller's hand given by Anne Sullivan as water was poured on her hand, Helen Keller may have never made the connection. She was the first deaf-blind person to earn a bachelor of arts degree. I am not sure we have true consciousness without language and meaning. Then with language and meaning, we are able to develop a theory of consciousness. Being conscious and having language seem to have developed close together. In the question, was the word conscious changed from conscience because some answers imply this happened? ",
            "date": "Answered April 6, 2018",
            "views": "98",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sonia Elkes",
                    "user_href": "/profile/Sonia-Elkes"
                }
            ]
        }
    ]
}