{
    "title": "If you choose not to decide, have you still made a choice? - Quora",
    "tags": [
        "Life Decisions",
        "Decision Making",
        "Important Life Lessons",
        "Hypothetical Scenarios",
        "Experiences in Life",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yingzi Li",
                "href": "/profile/Yingzi-Li-7"
            },
            "answer_text": "Making decision is a thought process of selecting a reasonable choice from a variety of available options. We normally weigh the benefits and risks, positives and negatives, advantages and disadvantages, current interests and the future outcomes to determine which option is the best for that particular situation. However, situation is always changing and our knowledge and understandings are also changing. If I choose not to decide, I may or may not have made a choice. The possibilities are: I have not been ready to make any choices yet since I have not mastered the nature of this thing. Situation is changing too fast. I cannot figure out which choice is the best at present. I would make a choice when situation becomes steady and mature. Or I am too young and psychologically naive to make any choices.If I talk about“making decisions”, the chance of “I have already made a choice in my heart” is probably 70%. As long as I have not made my final decision, the choice that I have made could be changed at any time depending on the development of the situation.There is a possibility that if I choose not to decide, I would probably give up all choices temporarily and forget this thing. Or I would wait for more better choices to come up in the future.There is another possibility that I cannot make any choices since I am not even familiarized with those choices.Therefore, it depends on the circumstance of “not making decisions” at that time such as my feelings, the maturity of the thing and my familiarity of the thing and all available choices. Under most circumstances, I have still made a choice although that choice maybe uncertainly made, and therefore, a temporary one. ",
            "date": "Answered April 29, 2019",
            "views": "142",
            "upvotes": " Answer requested by Lara Landis",
            "upvoters": [
                {
                    "user_id": "Jose Bustamante",
                    "user_href": "/profile/Jose-Bustamante-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ralph Buck",
                "href": "/profile/Ralph-Buck-2"
            },
            "answer_text": "If you have the choice to make a decision, and choose to do nothing, that is then your choice. The “null set” (nothing) is always one of the alternatives in every decision. You might also choose not to decide “right now,” because you believe there is still missing information about your choices. The question then becomes: how long can I procrastinate before I have effectively chosen the null set? There can be many good reasons to procrastinate: Some crucial ideas, notions, thoughts may come to you only when you’re not working on your project.Effective procrastination recharges your batteries and gives you new energy.Maybe there’s something else you could be doing instead and procrastinating means you get it done.Maybe whatever it is you’re supposed to do, turns out to be irrelevant or even a bad idea. Maybe the reason you procrastinated was, that your subconscious knew this before your conscious mind.How long to procrastinate? Perhaps it is until your subconscious mind clarifies the choice for you. Or, until the alternatives change…at which point, you lost the chance to choose in the original set of alternatives. Or until you reach a self, or outside imposed deadline. ",
            "date": "Answered April 29, 2019",
            "views": "262",
            "upvotes": " View 1 Upvoter "
        }
    ]
}