{
    "title": "If you had to pick a philosophy for life, would you choose Epicureanism, Stoicism or Cynicism? - Quora",
    "tags": [
        "Epicureanism",
        "Cynicism",
        "Stoicism",
        "Social Advice",
        "Philosophy of Everyday Life",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Philippus",
                "href": "/profile/Daniel-Philippus-1"
            },
            "answer_text": "Well, as my bio indicates, I have chosen one of those—Stoicism. I hadn’t looked at either Epicureanism or Cynicism when I made that choice, but having looked at them to some extent, I stand by it. However, I do not believe in absolute morality or the Stoic Divine Reason; I follow Stoic ethics by choice, not by belief in their absolute correctness. I am a moral nihilist and do not believe any ethical system can be objectively correct or incorrect. I would note that I do consider the Stoic dichotomy of control—you control your choices (the actions of your will) and do not control (but may be able to influence, through choices) anything else; therefore, it is foolish to consider anything outside of the nature of your will to be truly a good, as you cannot be assured of getting it—to be a factually true practical consideration. If you can choose what you value, and you control some things but not others, it is foolish to place the highest value on things you don’t control. Epicureanism appeals to the human desire for pleasure, and certainly it has valuable teachings on, for instance, the use of natural science to dispel superstition. However, per the above, I think it is unwise to consider pleasure or the absence of pain to be the highest good because we don’t control these things. We can, maybe, choose to be happy, but we can’t choose to experience pleasure, nor to wholly avoid pain (suffering yes, not pain). Of course, a counter-argument is that we may not have the choice to consider pleasure truly indifferent, in which case Epicurean goals, if not exclusively through Epicurean methods, are the only reasonable choice. At present, to the best of my knowledge, this is a choice of premise, not something we can conclusively answer. I also think that, while tranquility is somewhat more achievable, the Epicurean approach is unnecessarily fragile. Tranquility through avoidance of pain relies on circumstances beyond your control. Tranquility through endurance of pain is much more dependable. Thus, even if we accept Epicurean goals, it is arguably best to achieve them through Stoic methods (which is what William Irvine does in A Guide to the Good Life, which claims tranquility is the goal). I find Cynicism to be much more agreeable. I see it, as Epictetus did, as the shorter path to the same sort of virtue pursued by Stoics, not an entirely different system, but a more intensive approach to essentially the same thing. Cynics hold the same definition of virtue to be the sole good, but they push themselves much more aggressively to achieve it. (I would say that Diogenes the Dog could well be considered a Stoic Sage). I choose to take a longer path to virtue in exchange for being able to more practically interact with society. I do implement askesis on occasion, where practical, in forms like cold showers and short fasts. I also train myself against pain incidentally, but not as a primary goal, through long-distance running and wilderness expeditions. I have very high respect for someone who practices Cynicism in earnest, and would expect them to be closer to virtue than I am. ",
            "date": "Answered September 21, 2017",
            "views": "12",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sinan Toprak",
                    "user_href": "/profile/Sinan-Toprak"
                },
                {
                    "user_id": "Jayesh Mitra",
                    "user_href": "/profile/Jayesh-Mitra"
                },
                {
                    "user_id": "Ardeshir Sassani",
                    "user_href": "/profile/Ardeshir-Sassani"
                },
                {
                    "user_id": "Iris Elgrann",
                    "user_href": "/profile/Iris-Elgrann"
                },
                {
                    "user_id": "Ashton Hennessy",
                    "user_href": "/profile/Ashton-Hennessy"
                },
                {
                    "user_id": "Sean McManus",
                    "user_href": "/profile/Sean-McManus-24"
                },
                {
                    "user_id": "Robby Shima",
                    "user_href": "/profile/Robby-Shima"
                },
                {
                    "user_id": "Lawrence Bloom",
                    "user_href": "/profile/Lawrence-Bloom-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thaddeus Howze",
                "href": "/profile/Thaddeus-Howze"
            },
            "answer_text": "Protean with Stoic propensities, Epicurean leanings and Cynical distrust of all around me.  Wikipedia gives us a general overview of Stoicism:  Stoicism is a school of Hellenistic philosophy founded in Athens by Zeno of Citium in the early 3rd century BC. The Stoics taught that destructive emotions resulted from errors in judgement, and that a sage, or person of \"moral and intellectual perfection\", would not suffer such emotions.[1] Stoics were concerned with the active relationship between cosmic determinism and humanfreedom, and the belief that it is virtuous to maintain a will (called prohairesis) that is in accord with nature. Because of this, the Stoics presented their philosophy as a way of life, and they thought that the best indication of an individual's philosophy was not what a person said but how that person behaved.[2] I like to believe that ultimately, life isn't just what happens to you but how you deal with it. The Stoic DEALS with reality as it is. No embellishment, no additional baggage. The Stoic doesn't take the universe's vicissitudes as personal affronts or attacks. They are just part of the natural order. However, even as Stoic as I am, I recognize I have a desire for happiness, for an existence where I am more likely going to be happy than sad, even as I manage to move through my life bearing up under difficulties. Hence my quiet leanings toward Epicurean Thought.  Epicureanism is a system of philosophy based upon the teachings of the ancient Greek philosopher Epicurus, founded around 307 BCE. Epicurus was an atomic materialist, following in the steps of Democritus. His materialism led him to a general attack on superstition and divine intervention.   Following Aristippus—about whom very little is known—Epicurus believed that what he called \"pleasure\" is the greatest good, but the way to attain such pleasure is to live modestly and to gain knowledge of the workings of the world and the limits of one's desires. This led one to attain a state of tranquility (ataraxia) and freedom from fear, as well as absence of bodily pain (aponia).   The combination of these two states is supposed to constitute happiness in its highest form. Although Epicureanism is a form of hedonism, insofar as it declares pleasure to be the sole intrinsic good, its conception of absence of pain as the greatest pleasure and its advocacy of a simple life makes it different from \"hedonism\" as it is commonly understood. And if I were being honest with myself, I would definitely say I see the world filled with Cynical people who are mostly motivated by their own self interests, selfishness and greed and this has absolutely nothing to do with me as a person, nor can I change it. Our society rewards those whose outward appearances of gregariousness, a tendency toward economic empowerment no matter who is harmed by it, and the selfish tendency to lie and embellish themselves if it will give them power, money or influence over their fellows.  Cynicism is an attitude or state of mind characterized by a general distrust of others' motives believing that humans are selfish by nature, ruled by emotion, and heavily influenced by the same primitive instincts that helped humans survive in the wild before agriculture and civilization became established.[1]   A cynic may have a general lack of faith or hope in the human species or people motivated by ambition, desire, greed, gratification, materialism, goals, and opinions that a cynic perceives as vain, unobtainable, or ultimately meaningless and therefore deserving of ridicule or admonishment. A common misapplication of this attitude involves its attribution to individuals who emote well-thought-out expressions of skepticism.   Such miscategorization may occur as the result of either inexperience and/or a belief system in which the innate goodness of man is considered an important tenet or even an irrefutable fact. Thus, contemporary usage incorporates both a form of jaded prudence and (when misapplied) realistic criticism or skepticism.   The term originally derives from the ancient Greek philosophers, the Cynics, who rejected all conventions, whether of religion, manners, housing, dress, or decency, instead advocating the pursuit of virtue in accordance with a simple and idealistic way of life. I have no desire to make money by harming others, by misusing my power, such as it is in our society, nor do I think misleading people as to my abilities, my thought processes or my deeds in life, is an ideal way to exist.  Does all of this make me seem contradictory? What are arguably Whitman's most famous lines appear here:  \"Do I contradict myself?  Very well then I contradict myself,  (I am large, I contain multitudes.)\"  -- Walt Whitman.  Whitman is recasting one of Ralph Waldo Emerson’s central ideas:   “A foolish consistency is the hobgoblin of little minds, adored by little statesmen and philosophers and divines. . . . Speak what you think now in hard words, and to-morrow speak what to-morrow thinks in hard words again, though it contradict every thing you said to-day. . . . To be great is to be misunderstood.”   For Whitman, as we have seen, the self is a continually evolving and expanding entity, and new experiences will always broaden and challenge and upset what a self believed earlier. We must learn to be grateful to arrive at contradictions and to cultivate a sense of a self open and aware enough to “speak against” (the root meaning of “contradict”) the self that existed yesterday.   As “Song of Myself” has demonstrated throughout, a self that does not change is a stunted identity, dead to the transforming stimuli of the multitudinous world around us, stimuli that include the transforming words of this poem.  Ergo, my true Philosophy for Life would be one subject to how long my life would be and the changes in the world required for me to effectively navigate it. An immutable philosophy is also useless as a reference point capable of dealing with the world as it is, not as we WISH it to be.  My only true Philosophy would be Protean, subject to change and adaptation as needed. Everything else is sophistry. REFERENCESWikipedia: Stoicism, Epicureanism, and CynicismWalt Whitman Archive ",
            "date": "Answered June 8, 2015",
            "views": "34",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prince Sv",
                    "user_href": "/profile/Prince-Sv"
                },
                {
                    "user_id": "Sinan Toprak",
                    "user_href": "/profile/Sinan-Toprak"
                },
                {
                    "user_id": "Justin Kwong",
                    "user_href": "/profile/Justin-Kwong-3"
                },
                {
                    "user_id": "Balakumar Ravichandran",
                    "user_href": "/profile/Balakumar-Ravichandran-1"
                },
                {
                    "user_id": "Susan Hautzinger",
                    "user_href": "/profile/Susan-Hautzinger"
                },
                {
                    "user_id": "Sean Camden",
                    "user_href": "/profile/Sean-Camden"
                },
                {
                    "user_id": "Isaac Santana",
                    "user_href": "/profile/Isaac-Santana"
                },
                {
                    "user_id": "Dyuthi B",
                    "user_href": "/profile/Dyuthi-B"
                },
                {
                    "user_id": "Micheal Nelson",
                    "user_href": "/profile/Micheal-Nelson-2"
                }
            ]
        }
    ]
}