{
    "title": "If you are speeding because of an emergency, and you need to get to a dying loved one right away, if a cop tries to pull you over, should you stop? - Quora",
    "tags": [
        "Speeding Tickets",
        "Interacting with Police",
        "Police Procedures"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karen J. Taylor",
                "href": "/profile/Karen-J-Taylor"
            },
            "answer_text": "Yes. You are not having the emergency yourself, nor are you a trained first responder responding to a call. You might say you are having an emergency but you are not. Neither you nor anybody in your car can change what is happening. The officer might decide to cut you some slack, but that is up to him or her. Speeding in a civilian car with no emergency equipment puts you, any passengers in your car, as well as people around your car at serious risk. You may wish or want to be with your loved one, but your presence or absence is not going to change the outcome medically. When my father died and later my mother passed away I had to drive 300 miles to get to the hospital. There was no point in my speeding, it wouldn't change anything. I drove with the flow of traffic. My father's body was on life support which wasn't turned off until the family was gathered. However he had already passed away, there was no brain activity. My mother had passed away before I even got the call, no reason to hurry. I thought the case with my father was macabre. My being at his bedside might have been of some comfort to my mom but otherwise my presence changed nothing. I think they should have turned off the machines as soon as they found there was no brain activity. He had a broken neck from a fall, nothing was going to change that. ",
            "date": "Answered January 29, 2020",
            "views": "54",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peri Collins",
                    "user_href": "/profile/Peri-Collins-1"
                },
                {
                    "user_id": "Walter Konrad",
                    "user_href": "/profile/Walter-Konrad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Stacey",
                "href": "/profile/Mike-Stacey-28"
            },
            "answer_text": "YES!!!!! Listen children, DO NOT REFUSE AN ORDER BY A POLICE OFFICER TO PULL OVER!!! You will then be engaged in a high speed pursuit and he will be authorized by law to use alternative means to enforce that stop. That could consist of a PIT maneuver, calling in air support, calling in for road blocks and spike strips, and whatever else is in the bag of tricks. When they do stop you you will be charged with a whole host of crimes that you DID in fact commit whether you think you did or not. And you will be presumed to be hostile at the termination of the stop. So you will be subdued and handcuffed and the tools for subduing you could range from verbal and loud and scary to being shot with a shotgun, depending on the level of resistance you provide. Because when you are speeding and refuse to pull over the suspicion is that you are armed (actually the car is considered a weapon at this point) and dangerous and a potential fleeing felon. Don’t do it. Or go ahead and do it. It’ll be fun for some people to watch on the news. ",
            "date": "Answered February 4, 2020",
            "views": "17",
            "upvotes": "0"
        }
    ]
}