{
    "title": "If you were given a chance to destroy or delete one thing in this world, what would it be? - Quora",
    "tags": [
        "Hypothetical Scenarios",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Louvel Moone",
                "href": "/profile/Louvel-Moone-1"
            },
            "answer_text": "Just one thing. Well that's pretty hard, because there are umpteen things that should be deleted, like, forever for a peaceful and happy coexistence of humanity along with nature. But to start with, I'd say, greed. It's greed which has compelled humans to exploit the nature of her most prized possessions. It is the root cause of all corruption, of all social differences. It presides in every heart, sparing a few of those souls which never fail to rekindle our faith in humanity. Greed can be for power,money, superiority and anything any individual considers desirable. Regardless of whatever form it may take its consequences can be brought down to one word: self destruction . And that's the process through which the most brilliant of all species is going . If I refer to the human race as greedy, it's not just because of a few avaricious people, but because each one of us desires to have more than what we require and deserve. Also, deleting this vice might be difficult, but it is not impossible. It's an irony that most of us are aware of what's wrong and how it can be fixed, but don't. It's not too late though. Things might be going terribly wrong, be it the climatic change or terrorism, but little efforts from each one of us would leave a big impact. All we need to do is get rid of our greed. At least, we can try. ",
            "date": "Updated June 14, 2017",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Francese D Wilcox",
                    "user_href": "/profile/Francese-D-Wilcox"
                },
                {
                    "user_id": "Sanjana Darji",
                    "user_href": "/profile/Sanjana-Darji"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stefan Papp",
                "href": "/profile/Stefan-Papp"
            },
            "answer_text": "There would be so much… In a way, I believe we steering towards a global catastrophe. I do not know when it will happen, but at some point it will happen, if nothing changes. Mankind takes more resources than grows backWorld Population increasesWe feel it with climate change. We will gradual feel the problems of this global stupidity. I could pick various items. There are various option such as the ability to create more than two children (so that we are forced to shrink)Another one would be the greed or the egoism.The ability to look away or to create a reality distortion.How ever if I take this creativity away, then we will also lose a lot. If we take the ability to create more than two kids, we will also deny loving parents to spread their love to more than to kids. Also mankinds resilience and stubbornness led us in the past somewhere. So instead of taking away, I would rather give something. A stronger empathy. The ability to feel what is going on and to feel also the effects of actions. Might still lead to some chaos, but that is part of life. ",
            "date": "Answered June 13, 2017",
            "views": "576",
            "upvotes": "0"
        }
    ]
}