{
    "title": "If you have children but could change the past, would you still have children? - Quora",
    "tags": [
        "Children and Families",
        "Parents",
        "Children",
        "Family",
        "Parenting",
        "Hypothetical Scenarios",
        "Psychology of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Victoria Elder",
                "href": "/profile/Victoria-Elder-1"
            },
            "answer_text": "If you have children but could change the past, would you still have children? Because I’ve done multiple interviews over the last three years concerning my admission on Quora that I regret becoming a parent, I’ve been asked this question many times. The first time I was asked, I immediately answered no because I wasn’t prepared for the question and hadn’t really thought about it. Obviously, if you regret becoming a parent, you may wish that you hadn’t had children and if you could go back in time, you wouldn’t have them, right? Well, after I thought about it for a while, reflecting on the initial interview where I said no without any hesitation, I realized all of the things that have happened if I hadn’t had my daughter. Yes, being a parent sucked for me and I hated every minute of the parenting job, but I never once hated my daughter. She is brilliant and funny and wonderful and amazing and spirited and I wouldn’t want to have missed out on her existing as a human being, even if it means that I had to be her parent. I also would not have been able to affect the lives of so many other people that simply being my daughter’s parent brought into my life. People who needed me and who I wouldn’t have been able to help if there had been no Morgane. I can’t just sit here and ignore all that would not have happened if she hadn’t existed so of course I would have her and do it all over again, as much as I hated it. ",
            "date": "Answered January 15, 2019",
            "views": "270",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jemmy Bloocher",
                    "user_href": "/profile/Jemmy-Bloocher"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashmede Asgarali",
                "href": "/profile/Ashmede-Asgarali"
            },
            "answer_text": "That's a very interesting question. I suspect that my children might themselves say that we should not have, because we passed on so many genetic deficiencies, in their mind to them by having them. None of them have kids of their own. If it was purely my decision, I would do it all over again, but I have to tell you that going through delivery as moral support is a hellish experience in terms of that feeling of being completely useless and helpless in that delivery room. So yes, I would do it again and if my spouse wanted more, I would help her to achieve that goal. ",
            "date": "Answered January 13, 2019",
            "views": "46",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jemmy Bloocher",
                    "user_href": "/profile/Jemmy-Bloocher"
                }
            ]
        }
    ]
}