{
    "title": "If you and I hold differing opinions on a subject, what then is a reliable and accurate way of determining whose opinion is in fact the correct one? - Quora",
    "tags": [
        "Substantiating Opinions",
        "Philosophy",
        "Understanding Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeanine Joy",
                "href": "/profile/Jeanine-Joy"
            },
            "answer_text": "We’re most likely both right.  Source: Annca on Pixabay (CC) We merely have different perspectives. If we’re both on this Ferris wheel at the same time and my opinion is that the sky is on the other side of the wheel from where I am and your opinion is that you are on the same side of the wheel as the sky, we are both right. The reason so many people have so many disagreements is that our society lacks depth. We attempt to solve disputes on the surface without looking deeper. Take politics. More often than not, the two sides agree far more than they think about the desired outcome, they fight about the method that should be used. Oh the world we would have if we focused on what we all want instead of the how which wouldn’t matter a hill of beans if our goal were accomplished. If, 100 years from now less than 1% of the population is ever incarcerated because crimes are rare, would they give a shit about whether it was a Democrat or Republican solution that brought the solution forward? If, 100 years from now, poverty was so rare we had to explain what it was to most people, who would care if it was a Republican or a Democratic idea that solved the problem? No one would care. The truth is that most of the solutions already exist and they are neither democratic or republican ideas—they are scientific solutions that we know work but politicians would rather argue than solve problems so it is up to the people. But I digress. You’re both probably right. Dig deeper, non-judgmentally, and you’ll live a richer and more fulfilling life. Being right is way over rated. Folks who are intent on defending the rightness of their opinions and beliefs rarely learn anything new and at the rate new knowledge is amassing, they fall behind very quickly. This tendency may even reflect a Fixed Mindset which is associated with poor outcomes in every area of life. Psychological Flexibility is associated with greater success in every area of life. What do I mean by areas of life? Physical, mental, behavioral, and emotional health, relationships and success in career, academia, and sports. If that doesn’t cover everything, let me know what I’m missing. ",
            "date": "Answered January 26, 2018",
            "views": "366",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Phil Teunon",
                    "user_href": "/profile/Phil-Teunon"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                },
                {
                    "user_id": "Arshad Azad",
                    "user_href": "/profile/Arshad-Azad"
                },
                {
                    "user_id": "Ammon Crapo",
                    "user_href": "/profile/Ammon-Crapo"
                },
                {
                    "user_id": "Nicole Ballard",
                    "user_href": "/profile/Nicole-Ballard"
                },
                {
                    "user_id": "Shine Pushpan",
                    "user_href": "/profile/Shine-Pushpan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raymond Griffith",
                "href": "/profile/Raymond-Griffith"
            },
            "answer_text": "You sound like a reasonable person. So let’s talk. First of all, we need to agree on the facts. One of the biggest problems in todays dialectic is that “facts are fungible.” People believe that something they consider a fact is actually “true” — or at least ought to be. Kellyanne Conway proposed that Trump’s press secretary had given “Alternate Facts.” That they weren’t facts at all, but outright denial of verifiable facts only made the ridicule worse and excluded any possibility of consensus or understanding. If we cannot actually agree on the facts, then we will never be able to determine which opinion, if any, is the better one. And it could well be, once the facts are in evidence and agreed upon, that neither opinion is better than another. Opinions are judgments we make about what we perceive as fact, and our judgments will differ depending upon a wide variety of factors, many of them prejudices and attitudes which will not be stated or admitted to openly. When I say “prejudices” I include in the mix any moral or religious lenses through which you may interpret the facts. Let’s take one example. We have facts concerning abortion. How those facts are viewed depends in large measure on the attitudes and prejudices one has toward others even before the information is considered. A “fact” is that the fetus is “alive.” An opinion would be at what point in the pregnancy it is allowable to abort, or for what reasons. It should not be thought that only one side of the debate is the “moral” position, because each side has a moral prejudice based on complicating factors. Furthermore each side discounts moral arguments from the other side because the opinions of the other side do not consider certain facts as important as others. So facts are not going to be enough. You and I must be willing to admit our own prejudices and the reasons for them, and be willing to listen to each other without automatically judging each other. This is very difficult. If I know you voted for Trump, then my innate prejudices are already trying to peg you as a particular kind of person. If you know I am a “liberal” you may have invectives ready to describe how desperately you hate my political position. Or maybe not. But the further apart we are on the political/religious spectrum, the harder it will be to talk to each other. And yet, if we do not talk, we cannot listen, either, and without listening we can never understand the reasons why people believe what they believe. You and I may be forced to admit that neither one of us are willing to relinquish our opinion in favor of the other. At best, we might be willing to modify — slightly — our opinions, but not in a way that makes us uncomfortable. Modification of opinions takes *time*, and usually lots of it. So, how best to start? Maybe if you wish to change my opinion you could start out by asking questions. Why do I hold this opinion? Can I look up some things to get back to you? What are my sources? When you ask questions you can gauge whether or not I am even receptive to thinking differently. If I am, then you can pursue the topics further. This is, of course, woefully incomplete. But I hope it helps. Regards. ",
            "date": "Answered January 14, 2018",
            "views": "236",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ames Gilbert",
                    "user_href": "/profile/Ames-Gilbert"
                }
            ]
        }
    ]
}