{
    "title": "If you could rid the world of one thing, what would it be? - Quora",
    "tags": [
        "Hypothetical Scenarios",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Brewer",
                "href": "/profile/Michael-Brewer-58"
            },
            "answer_text": "Organized religion. I’m not talking about ‘erasing’ god here, or even erasing the concept of a divine being. But I’d get rid of these brand-name corporations that take wealth from the poor and pay no taxes while inciting every kind of social controversy and prejudice, spreading war and terrorism across the globe in the process. I have no idea how many ‘recognized’ religions there are currently, but let’s just consider the 3 name-brands for a moment. Three clubs whose executive members all claim to have exclusive knowledge of the true nature, behavior, and will of the divine being who created all things. Ask them for objective evidence to support their claim that would stand up in a court of law, and what will you get? You’ll either be denounced as a blasphemer deserving of eternal torture or you’ll get a lecture on ‘faith’. Or you could be summarily executed if you ask the wrong member of the club. Of course, that’s after they show you their book of holy words written by ancient people who are supposed to have been under the direct supervision of the divine being. Not the other brand’s divine being, but their brand of divine being. Can you imagine a greater form of arrogance or self-righteousness? Bet you can’t. And this is despite the fact that each club is completely aware of the other major clubs making the same claim, and despite their awareness of the hundreds of religions that have passed through human civilization since we started leaving cave paintings and stone monoliths for archaeologists to find. And the biggest ‘despite’ of all is the existence of all the conflicting variations within each name-brand. Are you orthodox or reformed, protestant or catholic, Sunni or Shiite? And which club of reformed do you belong to, which brand of Sunni? Are you baptist or southern baptist, or are you methodist (dancing baptist)? It matters, you know. It matters so much that if you’re a member of the wrong subset of your club you could wake up with a bomb in your underwear or find yourself disinvited to the hereafter, which will naturally result in being tormented by demons for all eternity. And all for having the nerve to hang around with the wrong sub-brand of the right name-brand. And why all these different name-brands and sub-brands and sub- sub-brands? Because there’s no objective support for any of them, just like there’s no objective support for Druidism or sun-worship. And yet, these name-brand corporations and their sub-divisions are allowed to insert their beliefs into the lives of every living soul on the planet in some form or another. They build castles and buy private jets for their corporate executives from money they take from the poor by threatening them with eternal damnation if they don’t do and think exactly as they’re told. Or they start wars or spread terrorism, again using the poor and mentally ill to carry their name-brand hate to distant places. They manipulate our elected officials who are supposed to provide service to all their constituents, not just the ones who voted for them or those who support the same name-brand of faith. They’re allowed to do all this while paying no taxes and receiving no oversight, and all on the basis of claims with no justification whatsoever. Yeah, get rid of the name-brands and let people find the divine for themselves, as long as they do it without hurting anyone else. The ones that can’t manage that you throw in the loony-bin with all the other messiah-complex nutjars… ",
            "date": "Updated November 9, 2018",
            "views": "31",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Neil Bravo",
                    "user_href": "/profile/Neil-Bravo"
                },
                {
                    "user_id": "Katalina Joanna Marshall",
                    "user_href": "/profile/Katalina-Joanna-Marshall"
                },
                {
                    "user_id": "Peter Patina",
                    "user_href": "/profile/Peter-Patina"
                },
                {
                    "user_id": "Gregory Dickson",
                    "user_href": "/profile/Gregory-Dickson-4"
                },
                {
                    "user_id": "Tom Gee",
                    "user_href": "/profile/Tom-Gee-8"
                },
                {
                    "user_id": "Daniel Byrne",
                    "user_href": "/profile/Daniel-Byrne-41"
                },
                {
                    "user_id": "Paul John Sykes",
                    "user_href": "/profile/Paul-John-Sykes"
                },
                {
                    "user_id": "Conner Wood",
                    "user_href": "/profile/Conner-Wood-8"
                },
                {
                    "user_id": "Timothy Singleton",
                    "user_href": "/profile/Timothy-Singleton-1"
                },
                {
                    "user_id": "Norman Allen",
                    "user_href": "/profile/Norman-Allen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evan Poole",
                "href": "/profile/Evan-Poole"
            },
            "answer_text": "These waste of human chromosomes, which will all collective represent as the one thing I would eradicate off of the Earth. People who senselessly murder other people (including serial killers, armed robbers, and “spur of the moment” murderers)Rapists/violent sex offendersPedophiles/child molesters/child abusers who interact with children in despicable ways.Spousal/SO (significant other) abusersArsonistsAdult neighborhood bullies who resort to lethal means of bullying othersGang members/thugsViolent drug dealers/drug traffickersReligious extremists (this includes those who impose and enforce Sharia Law in predominately Islamic countries, abortion clinic bombers, abortion doctor killers etc.)Racist organizations who commit violent acts (Doesn’t matter if they’re white supremacists, black supremacists or any other ethnic/national/racial supremacists)Terrorists organizationsCrime family organizationsCrooked police officers who get away with killing innocent civiliansCorrupt politiciansDictatorsWarlordsWar criminalsPoachersAnimal abusersHuman traffickersHit-and-run drivers who end up killing pedestriansDrunk, drugged or texting drivers.Acid attackersPolicemen that find anyone they can to fill the position of “guilty”, regardless of the facts of the case.Prosecutors that suppress evidence, so that those innocents that could have been exonerated, manage to be killed by the state.Inept defense attorneys, that operate out of their league, in a capital case where the death penalty is a possible outcome.See my answer to: Evan Poole's answer to If we must have the death penalty, what is the best method of execution? ",
            "date": "Answered June 13, 2019",
            "views": "29",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aixa Diaz",
                    "user_href": "/profile/Aixa-Diaz-3"
                },
                {
                    "user_id": "Eetu-Oskari Lundin",
                    "user_href": "/profile/Eetu-Oskari-Lundin"
                },
                {
                    "user_id": "Pabriel Gomez",
                    "user_href": "/profile/Pabriel-Gomez"
                },
                {
                    "user_id": "Fiona McConnell",
                    "user_href": "/profile/Fiona-McConnell-5"
                },
                {
                    "user_id": "Cathy O'Brien",
                    "user_href": "/profile/Cathy-OBrien-15"
                },
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                },
                {
                    "user_id": "Michael Baker",
                    "user_href": "/profile/Michael-Baker-457"
                },
                {
                    "user_id": "Kong Thao",
                    "user_href": "/profile/Kong-Thao-11"
                },
                {
                    "user_id": "Peter Willis",
                    "user_href": "/profile/Peter-Willis-39"
                }
            ]
        }
    ]
}