{
    "title": "If you could delete a year from your life, would you want to? Why or why not? - Quora",
    "tags": [
        "Hypothetical Personal Situations",
        "Important Life Lessons",
        "Hypothetical Scenarios",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Justin Wu",
                "href": "/profile/Justin-Wu-133"
            },
            "answer_text": "Never, no matter how hard it was and how harsh it was on me. I answer this with the assumption that when I remove a year from my life, I will also lose my memory of that year, basically shaving that one year out of my entire life history (also making me one year younger…). A thing people think about is whether they can forget something that they have experience because it is either too painful or too embarrassing. This could be things like struggling through life with debts, or going through a breakup (or flawed relationship for that matter). It could also be some more extreme things like sexual harassment, verbal abuse, domestic abuse that plagued that one year. Or that year was filled with deaths, of family, of stars (but mainly family okay?). So people want to forget, like dipping themselves quickly into the river Lethe in Greek mythology, to wipe away those memories so they may live better in peace. And to that I say no. No matter how harsh it was, it is always better to remember. Part of the human experience is changing and learning from our experiences, our past experiences make us who we are. Say you were bullied at school. Could you have been a different person if you never encountered that bully, never went through his abuse? You might not be, because that bully may have affected your behaviour towards other, be it negative or positive (hopefully positive). If it is harsh trauma, like the extremes mentioned above, it also serves to be an experience on how to be better, how to avoid predators. And it also acts like a teaching initiative, show others what you have learned from life (kinda like how Quora is working right now). We are who we are because of what we have experienced, and those things that we have experience are a result of us, and so we learn, like the animals we are. We learn to adapt, and survive, and take our experiences so we can avoid them if we need to. ",
            "date": "Answered January 7, 2019",
            "views": "119",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Hood",
                "href": "/profile/Richard-Hood-37"
            },
            "answer_text": "It Would Be Last Year-(2018).I Have Lived 65 Years,Without Getting Into Any Kind Of Trouble. I Formerly Lived In A Mobile Home In Orwell,Ohio. I Resided There For 11 Years,With No Real Incident.There Was And Is A Lot Of Trailer Trash In That Park. I Was Doing Something Very Innocent By Walking My Dog,In The Park,Not Bothering Anyone.Suddenly,I Was Charged,Not Once But Twice For Trespassing And Looking Into High Mobile Home Windows,What Is Called Being A Peeping Tom.This Was All Made Up By The Trailer Trash. In This Mobile Home Park,There Is A Lot Of Drugs, Both Buying And Selling.There Is Also More Than Their Share Of The Criminal Element,From Residents Who Break Into An Unoccupied Mobile Home And Steal Its Contents And Prostitution In The Park. There Is Also More Than Their Share Of Open Marriages In The Park.What I Think Transpired Is That The Trailer Trash Got Together And Decided That I Was A Threat,To Their Criminal Activities,By Walking My Dog.What Made It Much Worse,That They Insinuated To The Manager,That I Was Some Sort Of Sexual Predator,That Shouldn’t Be Living There And That I Should Be Charged For My Behavior.The Manager Of The Mobile Home Park Is An Alcoholic And Doesn’t Keep His Pants Zipped Up,When He Goes Into Town.Because He Has Problems With Alcohol,The Part Of His Brain That Is Supposed To Govern Common Sense,Has Long Been Destroyed.He Contradicts Himself Because He Can’t Remember What He’s Said.Because I Think,That He Takes Advantage Of The Open Marriages,Drugs And Alcohol In The Mobile Home Park. The Two Situations,Which Made My Matter Much Worse,Was The Local Police And The Kangaroo Court,I Was Sent To. The Orwell Police,Is A Modern Day Gestapo,Who Likes To Convict,Whether They Are Guilty Or Not.The Kangaroo Court In Geneva,Doesn’t Practice Any Kind Of Civil Rights.I Was Charged,Arrested And Convicted On Extremely Thin Evidence.I Served My 30 Days In Jail,And Tried To Make The Best Of A Very Bad Situation. Ironically,The People,That Know Me, Know That I Would Never Do Such A Thing. I Treated Everyone In Jail,Including The Officers,With Respect.The Officers In The Jail,Learned About My Situation, And God Bless Them,Said That The Orwell Police Force Wasn’t Good And That I Was Railroaded.When I Finally Served My Full 30 Days,The Kangaroo Court Judge,Had A Warrant For My Arrest.I Had To Call His Secretary,To Phone The Jail,To Verify I Indeed,Had Served My 30 Days. Of Course,I Was Kicked Out Of The Mobile Home Park,But It’s Been Almost A Year Since Then And I Don’t Miss Living Among The Buckeye Trailer Trash.Because Of What I’ve Been Through,I Say That Orwell,Ohio,Is A Fascist Village That Adolph Hitler Would Love. ",
            "date": "Answered June 4, 2019",
            "views": "62",
            "upvotes": "0"
        }
    ]
}