{
    "title": "If you know the future, can you change it? - Quora",
    "tags": [
        "En Primeur",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Indigo Arya",
                "href": "/profile/Indigo-Arya"
            },
            "answer_text": "The usual answer is yes. However it isn’t always true. The variables are many fold really but some of the primers are easy to understand. What scope of the future? and by that I mean how many people are involved. If it’s just you, chances are very very high it will change simply by allowing the thought to reside in your brain because our thoughts in part create our reality. Knowing something even to be 100% true can raise doubts which effect it. And or planning for it means it won’t happen. The way to look at the future is to look at percentages of potentials ,and there are usually many potentials, some can be completely erased simply because you drop your keys one day, or need to tie your shoe laces a minute earlier. It isn’t just thoughts that create reality though, actions and emotions count too. And there are nearly 8 billion ppl on the planet all creating the future of the masses. For example current timelines don’t look good if you have been ignoring your heart this year. The world govenments and world economy has been on the brink of collapse since feb 2020, they are holding on by mere threads because they implemented fear mongering and will continue to do so towards nefarious means. So two of the biggest timeline potentials right now are thus. When the vaccine starts killing people in the hundreds of thousands people will wake up to the truth and the governments will collapse completely. Timeline two, Hundreds of millions and possibly a couple of billion will die before humanity stands up for itself after dozens of false starts from revolutionaries planning to stand up but being killed off before it can happen. Timeline three, people are going to start standing up before the deadly nano chipped vaccine can be given out at all after realising that no government or business has any liability when you die or what ever reason (there are many reasons to stand up) and no good reasons to lie down and die. Whether or not this is a tipping point for collapse or not I don’t know yet. For the record government collapse is the best outcome in all of the biggest potentials, the sooner the better, it is inevitable in all timelines and it will broker a new age of world peace and freedom from tyranical control, the only point of contention is whether it will take thousands, or billions of senseless deaths to get there and how much control and lack of freedom is stretched before hand. Does knowing this now change things for you? Over 50% of the planet are doing what the government says day in day out, glued to their tvs and giving up on their humanity whilst laws are put in place to keep you locked in your homes. Even if you change your own future by standing up now, the masses of people glued to their tvs will be controlling the big timelines. In the grand scheme right now there are more than three big ones, but what would it matter if a million psychics all stood up and said the same things, group think is still very real, the message will be deleted and group think keeps taking over. If jesus himself stood up on youtube (not that he will jecause the bible got it wrong anyway). All he would recieve is group think hatred, scepticism and his message would also be deleted. Changing the future for one person is as easy as nudging them to dropping their keys. Changing the future of humanity is more complicated. ",
            "date": "Answered October 21, 2020",
            "views": "223",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Archana Bhat",
                    "user_href": "/profile/Archana-Bhat-42"
                },
                {
                    "user_id": "Wayne Hardy",
                    "user_href": "/profile/Wayne-Hardy-6"
                },
                {
                    "user_id": "Daisy",
                    "user_href": "/profile/Daisy-1097"
                }
            ]
        },
        {
            "author_info": {
                "name": "Derek Olson",
                "href": "/profile/Derek-Olson-19"
            },
            "answer_text": "Greetings Wayne, I would think it would depend on how much a person ‘believes’ knowing their future could actually be a catalyst to live their life differently. Thoughts are energy and contribute to creating the reality we wish to experience. It’s not a easy/simple process to create our reality just by thinking/knowing/being told of a ‘future’ reality; it’s a work in progress. Multiple hidden factors come into play which can change our game plan and the act of knowing our future can not only change our future, but our present reality as well. We might become labeled along with Chicken Little without screaming… “the sky is falling, the sky is falling”! If we were to put considerable effort into actually changing (not instantly) our future, we’d need to ‘want’ the newer future we have become aware of; this is our ‘desire’ to have that future. Then we’d have to ‘see’ ourselves fully immersed in living, acting, playing the new me part; this is our ‘imagination’ at work having to have that future fully created. Then we still haven’t thrown that extra ingredient into the pot we are cooking-up to have that future reality and that is our ‘expectation’ of having that future reality and owning it. This recipe is simple enough to follow, that is if there weren’t other cooks in the kitchen messing with/telling us things we don’t need to hear. If we were to mentally and emotionally shut out anyone who is doubting Thomas, we might want to consider that we ourselves can become a doubting Thomas, if our future hasn’t manifested when we expected. We are in a world where duality causes the pendulum to swing in the opposite direction and our ‘expectations’ may take a hit and feelings of ‘disbelief’ and ‘hopelessness’ may over shadow the future we expected. Well Wayne, if the act of knowing our future can instantly change our actual future, I’d like to know how it came about to gather this information; I thought this information was on a need-to-know basis and we agreed to have this veil in place prior to entering this reality; otherwise if we were to have knowledge of a future experience where the depths of our soul exposes past deeds of atrocities we participated in, we may want to avoid going through the experience. ",
            "date": "Answered January 4, 2020",
            "views": "82",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Wayne Hardy",
                    "user_href": "/profile/Wayne-Hardy-6"
                }
            ]
        }
    ]
}