{
    "title": "If you had Superman's powers, how would you use them? - Quora",
    "tags": [
        "Superpowers (special powers)",
        "Superman (creative franchise)",
        "DC Comics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Carter",
                "href": "/profile/Robert-Carter-521"
            },
            "answer_text": "If I were Superman… The only way to stay moral would be to offer my services to the good of all mankind. But I’d probably keep my powers hidden at first, and practice with them, and, make myself obscenely rich in secret first to protect my loved ones. This should be ludicrously easy for me with Superman’s powers and I wouldn’t have to steal a thing. I could go into space and find some valuable minerals, gemstones, gold, or whatever, or, conversely, do some routine, but valuable work in nano-seconds- but a lot of it, and make myself a billionaire. Probably some combo. I am a billionaire in secret and protect my family before I do anything else. During this time I start to consult with the world’s greatest’s minds. I consult with them- not about crime (crime will always be here) but space exploration and terraforming. That’s the next step. I don’t do too much at first. Unfortunately, I will eventually outlive my human wife. But since Kryptonian DNA is compatible with human we will have children that are half-human, half Kryptonian with powers that are compatible with mine. This is good. I won’t be alone and immortal. I raise them with principles of non-interference in the human race, but I’m assuming they will make some mistakes (damn kids!) I help out with major disasters from time to time though. I also don’t let them nuke themselves. But that’s about it. Then I (and maybe a couple of the kids) terraform Mars by 2040. By 2050 we are onto the 3rd Generation of Kryptonians. Assuming I haven’t screwed up the kids too bad, I head up a deep space exploration- to look for another suitable planet to terraform and to search for other intelligent life. This will take take me to at least 2100. Since I’m lightspeed capable, I would just need some gear that could hold a solar charge and some basic supplies in case I need a back up. Maybe one of the kids or grand kids goes with me. It’s a long journey. By the time I get back there are now five generations of Kryptonians. I’m assuming there are some problems in the family at this point, and factions brewing. But, since I’m Superman, and have had my powers the longest, I’m still the most powerful… but the humans may be sick of us. It’s time for us to have our own planet. I suggest we terraform our own. But now there is some genetic diversity. Maybe I come back with some friendly aliens. Maybe I find hostile aliens? Maybe I come back with squat. Sounds like one hell of a ride…. where can I touch the platinum kryptonite and sign up! ",
            "date": "Answered December 20, 2019",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jalil Riley",
                    "user_href": "/profile/Jalil-Riley"
                },
                {
                    "user_id": "Junior Hassan",
                    "user_href": "/profile/Junior-Hassan-6"
                },
                {
                    "user_id": "Peter Stine",
                    "user_href": "/profile/Peter-Stine-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Vargus",
                "href": "/profile/Joe-Vargus"
            },
            "answer_text": "Supermans Power  now you might be saying (Joe, Superman has many powers?) it would seem so but there no more then just powerful reactions/side effects of his one true power!! Kryptonian Soler Enhancement: Kryptonian’s have always had Human like biology's plus some other organs on the side that they have adapted. but there true power comes from this.  here bodies are hidden weapons as there cells absorb this energy from our Star and unlocks the hidden god-like potential in all of them. this gives them all the powers you see on screen. Super Strength, Laser Vision, Tactile Telekinesis (seen better with Superboy) and so much more. What would I do with this power you may ask? 1: steal money from criminal organisations, syndicates, gangs, malicious rebellions, cartels etc and use the money to buy thousands of massive nets.   you may be wondering why I wan’t so many fish? I don’t, I want it for this  which would be going into the nets, flown up into space and thrown into this and never seen again.  hopefully this would start a movement as this would all take a very long time, I would pay some volunteers to gather it all in the nets with my help so I can get it up there!! Ass hole Companies: HEY, YOUR THROWING AWAY OUR CONTAINERS FOR OUR PRODUCTS ASSHOLE!!! Me: well either come and get it and never have it end up here in the first place or SHUT THE FUCK UP!!! 2: plant millions of trees everywhere possible, like spilling a big bag of flour over the globe. and I would also be counting this as the Help Us Plant 20 Million Trees - Join #TeamTrees movement as I would be killing 2 birds with one stone. a noble cause deserving of my help!!!  once that is done in areas who would allow it.!! 3: help put out all of the worlds fires as fast as I can. I would do this by scouring every part of the globe with Super Speed and flight while using my frost breath to put them out!!   that will do nicely!! 4: restore all the lost ice from the antarctic and then some with this extreme frost breath, this would still be taxing on me but with me only needing yellow sun energy, I would get it done!!! 5: continue to help out with global problems, maybe go to SpaceX and help out with the whole getting to Mars thing if my work only prolonged the inevitable.  get a autograph from the Legend himself  Random kid in crowd: he is my dad!! shake a couple hands and give a few autographs out of my own, maybe!! 5: once everything is less hectic for a while, I would then go set up a base in the Antarctic!!  It has the worst Ozone damage with on the Planet which means more UV rays which means me being more powerful on Earth. plus I love the cold so It’s a win-win!!  6: deal with stuff that comes up, get a girl and eventually get married+kids and live with what I would say happily ever after!!! ",
            "date": "Answered November 25, 2019",
            "views": "18",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jalil Riley",
                    "user_href": "/profile/Jalil-Riley"
                },
                {
                    "user_id": "Cody Hudson",
                    "user_href": "/profile/Cody-Hudson-38"
                }
            ]
        }
    ]
}