{
    "title": "In Avengers: Infinity War, what is the big purple guy’s name? - Quora",
    "tags": [
        "Avengers: Infinity War (2018 movie)",
        "Thanos (Marvel character)",
        "Avengers (creative franchise)",
        "Marvel Cinematic Universe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Physics Spidey",
                "href": "/profile/Physics-Spidey"
            },
            "answer_text": "Man! Did you even watch the movie? That “big purple guy\" was the main character of both Infinity War and Endgame and if you were really into him, you would know that he was the man behind the New York attacks by Loki and Chitauri (Avengers: Age of Ultron). He was also featured in The Guardians of the Galaxy. He was the destination of all MCU. He was the Endgame. Do you know his story? You would surely do if you watch Infinity War. He once had a crisis of resources on his planet, Titan which resulted in many people dying. He suggested that they should kill half of the planet's population so that the other half can live satisfied. He was declared a madcap and was thrown out. Several years later wheen he returned, he saw that the planet was destroyed, with not even a single person left. He then swore to collect the six infinity stones and destroy half the life in the universe so that the other half could live happily. That's how the journey of The Mad Titan started in the MCU. And yeah, your question. His name? Thanos Greek for the god of death. Appropriately named. ",
            "date": "Answered October 21, 2020",
            "views": "123",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ben Lloyd",
                    "user_href": "/profile/Ben-Lloyd-80"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anna Lee",
                "href": "/profile/Anna-Lee-786"
            },
            "answer_text": "Where have you been living, under a rock? Seriously, though, almost everybody was talking about Avengers: Infinity War after it came out. The big purple guy, the main antagonist of Avengers 3 & 4, and retconned to be a driving force behind most of the interplanetary conflict in the MCU, is named Thanos, after the Greek god of death. He would be the one to bring dead souls down to the underworld for Hades. Someone else pointed out a nice, short exchange between Bruce Banner and Tony Stark about him. Tony: Tell me his name again Bruce: Thanos. He’s a plague, Tony. He invades planets, he takes what he wants, he wipes out half the population. He sent Loki! The attack on New York, that’s him! ",
            "date": "Answered August 30, 2020",
            "views": "452",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kristen Griessmann",
                    "user_href": "/profile/Kristen-Griessmann"
                }
            ]
        }
    ]
}