{
    "title": "In life, why does simplicity give way to complexity? - Quora",
    "tags": [
        "Simplicity",
        "Complexity",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Milo Grika",
                "href": "/profile/Milo-Grika"
            },
            "answer_text": "First and foremost, be careful about making generalizations. For every instance of X becomes Y, there is an exception. Secondly, \"why\" is a philosophical question. Explaining \"how\" we see a rainbow is simple science, trying to explain \"why\" there is a rainbow is probably a futile endeavor. Thirdly, \"life\" implies your life, or human lives, or at minimum, the total time period humans have existed in the universe. Refer to my first statement. (Plus we humans tend to make our lives more complicated then they need to be, or perceive them to be more complicated than they really are.) I'm sure you can come up with examples of how things simplify, how parts of your life have simplified, how complexity can be described as a collection of simple parts, etc. A more accurate question would be, \"How can simplicity give way to complexity?\" So yes, learning about entropy might help, but I would encourage you to take the time to fashion better questions, conceive of how to do the testing experiments, be consciously unbiased in recording the results (actually look for evidence that conflicts with your premise), and be skeptical of anything anyone tells you is the only answer. ",
            "date": "Answered January 29, 2015",
            "views": "185",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tim Dawes",
                "href": "/profile/Tim-Dawes"
            },
            "answer_text": "At the sub atomic level, it's a matter of probabilities that things get more complex.  There are many pathways that a particle can take as the result of an interaction. And very few of those preserve simple configurations. And there are very, very many particles and interactions. The macro scale (lifesize) reflects the underlying complexity of the nano scale or is analagous to it.Sol Kingston asked me to elaborate on this spare answer. I'm going to be using images from Sean Carroll's \"Arrow of Time\".  From a physics standpoint, the difference between the past and the future is that things in the past tended to exist at a state of lower entropy (greater organization) than things in the future.  In other words, things in the past were often simpler (or at least more orderly) than things in the future. Again, from a physics point of view, one reason is there are many more ways to be disorderly (complex) than ways to be orderly (simple).  I'm saying that life, on a macro scale, tends to reflect or appear like this movement from orderliness to disorderliness on an atomic or subatomic scale. Sol may be reacting to my implicit claim that simplicity is a reflection or result of orderliness and complexity is a reflection or manifestation of disorderliness And I think that's a claim worth challenging. ",
            "date": "Answered January 24, 2015",
            "views": "643",
            "upvotes": "0"
        }
    ]
}