{
    "title": "In layman's terms does Godel's incompleteness theorem imply that the whole of mathematics has a breaking point? - Quora",
    "tags": [
        "Kurt Gödel",
        "Gödel’s Incompleteness Theorem",
        "Layman's Explanations"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Gould",
                "href": "/profile/John-Gould-6"
            },
            "answer_text": "Question originally answered: In layman's terms does Godel's incompleteness theorem imply that the whole of mathematics has a breaking point?  In layman’s terms, does the fact that from only the even numbers and the operations of addition and multiplication I cannot calculate any odd number imply that mathematics has a breaking point? In layman’s terms, does the fact that I cannot square the circle (construct a square with the same ‘circumference’ as the circle with a compass and ruler) imply that mathematics has a breaking point? In layman’s terms, does the fact that I cannot construct arbitrary angles with only a compass and ruler, imply that mathematics has a breaking point?  What all of the above examples illustrate is that, the available means limit what can be constructed with those means. And just as a screw-driver is not beyond some breaking point, whatever that might mean, just because I can’t use it to fasten bolts, just so is it, that a consistent effective formal logic including the signature and inference rules of Robinson arithmetic, is not some broken system, just because it cannot prove or disprove all of its propositions. You should ask yourself why it would even be the case that you would expect a screwdriver to be useful for fastening bolts in the first place? Why would you even expect to able to construct all angles with a compass and ruler? Why would you even expect to able to produce odd numbers from the even numbers and our arithmetic operations? Why would you even expect all propositions to either provable or disprovable in a relevant logic? You would do well to consider that it is not perhaps the ‘brokenness’ of the system, that is at issue here, but your own expectancies, that are unreasonable.  The incompleteness theorems[1] say all and only that there are certain propositions that can neither be proven nor disproven in a logic satisfying the prerequisites for the theorems to apply. Provability is the issue at hand here, not any notion of truth, although it of course the case that we would like it to be the case that if a proposition were provable, that then also the interpretation of that proposition (it’s meaning, if you will) in all model, is also true. Note very carefully, that we need it to be true in all possible worlds, not just in some subset of possible worlds, for in logic we are interested in what must be true in all possible worlds in which the axioms are true. So for example, if in possible worlds it can be either raining or not raining, and in all possible worlds the lawns can be either wet or not, and if in all possible worlds it holds that if it is raining that then the lawns are wet, then it must be the case that if in any world it is raining that then, in that world, the lawns will be wet. In logic, we are interested in that which is necessarily the case in all worlds satisfying the axioms, not in that which is coincidentally true in some worlds and not others. For the logics that the incompleteness theorems speak about, we have another very famous result (although curiously enough not among many laymen), namely the completeness theorem[2], which also is named after Mr. Gödel. The contents of that theorem are precisely that, for an even wider class of logics (including also logics not necessarily subsuming arithmetic) it is the case that all and only those propositions are provable, that are actually true in all models. So it is simply not the case that one any right at all to expect all propositions to be either provable or disprovable. The best one could hope for is that all propositions expressing a necessary truth (falsity), as opposed to a merely coincidental one, should be provable (disprovable). From the fact that any proposition is neither provable nor disprovable (i.e. undecidable), by the completeness theorem, it follows only that any such undecidable proposition cannot be necessarily true, nor necessarily false. That is to say, neither is it true in all worlds, nor is it false in all worlds. The truth or falsity of the proposition is simply world-dependent and not at all forced by the axioms. What would break mathematics (viewed as a logic that says something about models), would be that it says falsely of some proposition that it is a necessary truth or falsity, when it simply is not. Far from showing some breaking point in mathematics, these theorems show an unwarranted expectation on the part of some readers. Demanding the impossible, says nothing about whether or not the tools are broken, it just speaks on the unreasonableness of the demands, whether or not the asker recognises that unreasonableness. Don’t go blaming the tools when it is the tool-user that should be looked at.  Given what it is that we construct the tools for (describing and deducing the validities of a class of models), we have no right at all to assume that all such validities should be provable for arbitrary logics and model classes. It is a milestone result that we can do so for first order predicate logics by the completeness theorem. It is well known that this result does not hold for higher order predicate logics. For first order logics, at least we can prove all and only the validities of the models, but for higher order logics, we cannot even prove all validities. The best we can hope for is that that which we can prove is a validity (that the logic is sound). Personally, I would not call an inability to live up unreasonable expectations any kind of a ‘breaking point’ for mathematics. Just because you want a system that satisfies some list of desiderata, does not mean that there can exist such a system. Is mathematics broken, simply because I cannot construct a geometric object that is both a circle and a square by any means? Is gravity broken, simply because an apple cannot fall upwards? Or is the expectation that an apple should be able to do so simply an unwarranted one?  I guess, that what I’m clumsily trying to express here, is the idea that the having of limitations does not imply some brokenness. In fact the very fact that we can prove these kind of theorems, so-called no-go theorems that establish limitations on what can or cannot be constructed, I take to be rather strong evidence that it is very unlikely that mathematics is broken. In fact, I’d be wary and distrusting of a system that showed that it was not broken, precisely because the incompleteness theorems tell me that a ‘not-broken’ system cannot prove its own unbrokenness unless it is in fact broken. A screw driver is not ‘broken’ because I cannot use it to fasten bolts and pointing out that I cannot do so is merely pointing out a limitation on the use of screw drivers. Footnotes[1] Gödel's incompleteness theorems - Wikipedia[2] Gödel's completeness theorem - Wikipedia",
            "date": "Updated February 9, 2020",
            "views": "276",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Victor Duarte",
                    "user_href": "/profile/Victor-Duarte-16"
                },
                {
                    "user_id": "Stacey G Harris",
                    "user_href": "/profile/Stacey-G-Harris"
                },
                {
                    "user_id": "David Joyce",
                    "user_href": "/profile/David-Joyce-11"
                },
                {
                    "user_id": "Mark Gritter",
                    "user_href": "/profile/Mark-Gritter"
                },
                {
                    "user_id": "Alan Bustany",
                    "user_href": "/profile/Alan-Bustany"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Joyce",
                "href": "/profile/David-Joyce-11"
            },
            "answer_text": "Gödel’s incompleteness theorem says you can’t axiomatize number theory in a way such that for each statement, either that statement or its negation can be proved. No matter what effective, consistent, first-order axiomatization that includes the Dedekind-Peano axioms for number theory, there will be some statement that can’t be proved from those axioms and neither can its negation. Before Gödel, it was expected that the Dedekind-Peano axioms were sufficient, that given any statement, either that statement or its negation could be proved from the axioms. After all, they were very successful then, and they’re still good a century and a half after their formation to prove nearly everything we know about numbers. There are, now, some proofs of interesting theorems in number theory that go beyond those axioms. The incompleteness theorem is not a breaking point, but it indicates there’s more to number theory than what can be done with Dedekind-Peano axioms. ",
            "date": "Answered February 7, 2020",
            "views": "409",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Scott Brickner",
                    "user_href": "/profile/Scott-Brickner"
                },
                {
                    "user_id": "Christian Schmidt",
                    "user_href": "/profile/Christian-Schmidt-47"
                },
                {
                    "user_id": "Danijar Dreger",
                    "user_href": "/profile/Danijar-Dreger"
                },
                {
                    "user_id": "Vladimir Pitch",
                    "user_href": "/profile/Vladimir-Pitch"
                },
                {
                    "user_id": "Wes Whiting",
                    "user_href": "/profile/Wes-Whiting"
                },
                {
                    "user_id": "Deniz Şuözer",
                    "user_href": "/profile/Deniz-Şuözer-1"
                },
                {
                    "user_id": "Mark Gritter",
                    "user_href": "/profile/Mark-Gritter"
                },
                {
                    "user_id": "Brian Smith",
                    "user_href": "/profile/Brian-Smith-876"
                },
                {
                    "user_id": "Victor Duarte",
                    "user_href": "/profile/Victor-Duarte-16"
                },
                {
                    "user_id": "Alan Bustany",
                    "user_href": "/profile/Alan-Bustany"
                }
            ]
        }
    ]
}