{
    "title": "In non-duality, how do you explain the human body? If you are not your body, then what is your body and also the mind? Answers like objects in consciousness won't help. In transcendence, is the feeling of the body severed? - Quora",
    "tags": [
        "Nondualism",
        "Spiritual Awakening",
        "Enlightenment (spiritual)",
        "The Mind",
        "Hinduism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Teja Anand",
                "href": "/profile/Teja-Anand-2"
            },
            "answer_text": "This question comes up time & again:If there’s only One Thing (non-duality) how do you explain all the apparent ‘many things’ we see manifested? Our bodies? The hard solid ground? The water we can see, feel and drink? The atoms, quarks and other particles of apparently ‘real’ matter that make up water, earth and bodies? (Apparently, indeed. Science has already confirmed all atoms are 99% space, less than 1% “matter.”) Unfortunately, the questioner is asking for a mind-based, mind-understandable answer, and insisting ([“non-objective] answers won’t help”) on limiting the answer to something the dual, subject/object-based mind can comprehend. “If there’s only One Thing, which means all body-minds are illusions or projections, could you pease explain what that illusory body-mind is…to my illusory body mind:-) See the problem? It’s like a person’s shadow. Can a shadow explain what’s casting it, or jump up and become the person casting it? Your right eye is a non-duality. You only have one right eye. It cannot see itself as a non-duality. That would take a second eye sitting outside the first eye, looking back at it…and then you’d be back to duality. Within your nighttime dream, you always think you are your body and your body is real. When a dream car swerves towards you, your dream body jumps out of the way to avoid getting hurt. Your dream is created by just One Thing, your mind. No one else’s. So it’s just One Thing, creating all these many things. Real things, or at least, you’re quite certain their real” while you’re dreaming. But then you wake up, and you see they were just projections from your One Thing. Your waking dream is no different. “It just seems to be more continuous and last longer,” as Ramana Maharshi said, “but a dream projection, nonetheless.” At the Absolute level, it’s obvious there is only One Thing, or more accurately, NoThing. The Unmanifest. The Void. In enlightenment, or what you call ‘transcendence,’ we can get a fragrance of that. But we can never be The Absolute, because The Absolute can not know Itself. That would take two, right - The Absolute and a separate “knower.” Then it wouldn’t be The Absolute anymore, it would be a duality. So what can we do? We can know that the One Non-Dual Thing is ‘in the background’ behind all duality, projecting itself through The Everything, including our bodies. We can then enjoy our bodies and our One Life, avoid trying to figure out anything with our mind, or ‘attain’ anything, and know that, when we’re finished enjoying this projection for the OneThing’s delight & ‘purpose,’ we’ll dissolve back into that. BTW. Edg Duveyoung has some real mastery in the area of Advaita (Non-Dulaity.) I’d suggest browsing through his past answers on this very subject, in his profile, and if you still don’t see the answer you’re looking for, send him a direct ‘answer request’ for this question ",
            "date": "Answered February 1, 2019",
            "views": "17",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Martine Dakar-Raoult",
                    "user_href": "/profile/Martine-Dakar-Raoult"
                }
            ]
        }
    ]
}