{
    "title": "In philosophy, what is the definition of metaphysics? - Quora",
    "tags": [
        "Metaphysics",
        "Philosophy of Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Samuel Champion",
                "href": "/profile/Samuel-Champion"
            },
            "answer_text": "There’s a-million-and-one ways you can go about defining metaphysics. In fact, there’s infinitely more ways than that. But all those various definitions are definitions of the same thing. If you’re looking for a solid definition to grasp the ‘objective’ of metaphysics - or purpose of the subject of metaphysics - then you already have begun to define it for yourself. This drive to understand, or comprehend, is universally present in any form of explication imaginable; it traverses completely all the domains of human knowledge, and extends quite possibly beyond that - if you do the math, that is. (Its formal representation being logic) Hence, we refer to it as metaphysics, which connotes something that is at once a psychological drive in the same league as the need for food and sex, and a core constituent (like matter in physics) of a logical progression from desiring to know more about…the universe…a rock in your backyard…the way our ancestors first began to use tools…the history of impressionism…etc., etc., to knowing more period. In other words, it is broad and specific at the same time. Or, better yet, it is the parametrization of the broad and the specific that typically models itself in the form of: question and answer. Thus, Quora itself is a rather close model of metaphysics. ",
            "date": "Answered July 2, 2020",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anu Jain",
                "href": "/profile/Anu-Jain-11"
            },
            "answer_text": "There are two main elements in Philosophy - metaphysics and epistemology. Metaphysics is about the Reality, i.e., what is absolutely real. Metaphysics is about knowing things in themselves. And, Epistemology is the Knowledge of that Reality, i.e., how we can know that reality. These two are the two main issues in Philosophies which different philosophers try to answer differently. They are mainly divided into two schools - Rationalists and Empiricists. According to Rationalists, anything which is based on reason is Real, while according to Empiricists, anything which is based on experience is Real. ",
            "date": "Answered August 28, 2017",
            "views": "403",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kritika Jain",
                    "user_href": "/profile/Kritika-Jain-3"
                },
                {
                    "user_id": "Jyotirmay Pradhan",
                    "user_href": "/profile/Jyotirmay-Pradhan-2"
                },
                {
                    "user_id": "Nandika",
                    "user_href": "/profile/Nandika-4"
                },
                {
                    "user_id": "Brijesh Nayar",
                    "user_href": "/profile/Brijesh-Nayar"
                },
                {
                    "user_id": "Aisha Qadoos",
                    "user_href": "/profile/Aisha-Qadoos"
                },
                {
                    "user_id": "Samiksha Nath",
                    "user_href": "/profile/Samiksha-Nath"
                },
                {
                    "user_id": "Abhinash Khare",
                    "user_href": "/profile/Abhinash-Khare"
                }
            ]
        }
    ]
}