{
    "title": "In what instances did you want to cease existing and stop living? - Quora",
    "tags": [
        "Psychology of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sheri Fresonke Harper",
                "href": "/profile/Sheri-Fresonke-Harper"
            },
            "answer_text": "I suffered from endometriosis and ended up needing surgery--the result was I'd never be able to have children. This type of surgery is hard on your hormone balance and it necessitates that I take supplements. When my hormone level first dropped, it felt like I had plunged off the side of a cliff. Just moving felt like I lived on Jupiter--I had no energy, I couldn't sleep, my body burned, anyone walking up to me felt like a zap of lightning hit. I wondered what purpose I had in living; what I felt to be my primary role, giving birth to children no longer existed. It wasn't as if I had tried to have children, it was more the expectation I would and it helped define my decision-making -- I chose a career based on the ability to be a mother. I felt I had already died; I lived in Purgatory--waiting for something. Other things happened but this fundamental lack changed my life. I still feel as if already dead; I exist in a permanent limbo and very little brings me above--children make me smile, people give me momentary purpose, only my intellect lives on, curious as ever, driving toward new... It's this drive that is my only life. ",
            "date": "Answered October 6, 2015",
            "views": "246",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bennett W. Nelson",
                    "user_href": "/profile/Bennett-W-Nelson"
                },
                {
                    "user_id": "Bryan Griffin",
                    "user_href": "/profile/Bryan-Griffin-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Catty Jones",
                "href": "/profile/Catty-Jones"
            },
            "answer_text": "Definitely when a loved one dies I want to stop hurting, so I feel like not existing. The horrors people do to others and animals leaves me furious, not wishing to die. I want them to die!I know losing a loved one can lead to feelings loss of control or sense of the world, but pettiness and cruelty would not normally evoke that feeling enough to wish to be dead.Depression can make ever sad emotion lead to that, though. II also feel like I wish I didn't exist when I have failed in some massive way...deep deep shame I was so stupid or careless. Which has lead very closely to suicide.If you feel this way alot, please get help. The grieving process can take a long slow time, but it can be helpful to talk. ",
            "date": "Answered October 7, 2015",
            "views": "85",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bryan Griffin",
                    "user_href": "/profile/Bryan-Griffin-33"
                }
            ]
        }
    ]
}