{
    "title": "In what book does Nietzsche talk about the Death of God? - Quora",
    "tags": [
        "Friedrich Nietzsche (philosopher, author)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ryan Rider",
                "href": "/profile/Ryan-Rider-13"
            },
            "answer_text": "He talks about the idea mainly in two books; both from the middle period of his career. First is in Book III of The Gay Science or, as it’s sometimes called; The Joyful Wisdom/Science. Two of it’s sections mention or discuss the idea, but the most famous is Section 125. This features the oft-quoted, if also oft-misused quote of: “God is dead. God remains dead. And we have killed him. How shall we comfort ourselves, the murderers of all murderers? What was holiest and mightiest of all that the world has yet owned has bled to death under our knives: who will wipe this blood off us? What water is there for us to clean ourselves? What festivals of atonement, what sacred games shall we have to invent? Is not the greatness of this deed too great for us? Must we ourselves not become gods simply to appear worthy of it?” This part is the most famous individual statement to which relates on it. But the idea has been commonly associated with Nietzsche’s following; and most famous text, Thus Spoke Zarathustra. The section in particular whence it is directly mentioned, is at the end of the 2nd section of “Zarathustra’s Prologue”. In it, he meets a wandering ascetic in a forest who loves God, and after the two depart; this is said: “But when Zarathustra was alone, he spoke thus to his heart: \"Could it be possible! This old saint has not heard in his forest that God is dead!\"” To my knowledge, he mentions the idea in none of his other texts thereafter, perhaps excluding a mention or reference in one of his last works; The Anti-Christ. ",
            "date": "Answered March 16, 2020",
            "views": "594",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aishwarya",
                    "user_href": "/profile/Aishwarya-628"
                }
            ]
        },
        {
            "author_info": {
                "name": "Will Jay",
                "href": "/profile/Will-Jay-10"
            },
            "answer_text": "God is dead - Wikipedia Both “The Gay Science” and “Thus Spoke Zarathustra” contain the idea. “God is dead. God remains dead. And we have killed him. How shall we comfort ourselves, the murderers of all murderers? What was holiest and mightiest of all that the world has yet owned has bled to death under our knives: who will wipe this blood off us? What water is there for us to clean ourselves? What festivals of atonement, what sacred games shall we have to invent? Is not the greatness of this deed too great for us? Must we ourselves not become gods simply to appear worthy of it? — Nietzsche, The Gay Science, Section 125, tr. Walter Kaufmann[1]” And, “When Zarathustra heard these words, he saluted the saint and said \"What should I have to give you! But let me go quickly that I take nothing from you!\" And thus they parted from one another, the old man and Zarathustra, laughing as two boys laugh. But when Zarathustra was alone, he spoke thus to his heart: \"Could it be possible! This old saint has not heard in his forest that God is dead!\" — Nietzsche, Thus Spoke Zarathustra, tr. R.J. Hollingdale[8][9]” ",
            "date": "Answered December 31, 2017",
            "views": "33",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "R. Kevin Hill",
                    "user_href": "/profile/R-Kevin-Hill"
                },
                {
                    "user_id": "Lewis Whelan",
                    "user_href": "/profile/Lewis-Whelan-3"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                },
                {
                    "user_id": "Jim Grossmann",
                    "user_href": "/profile/Jim-Grossmann"
                },
                {
                    "user_id": "Gage H. Leibman",
                    "user_href": "/profile/Gage-H-Leibman"
                }
            ]
        }
    ]
}