{
    "title": "In your opinion, is philosophy still an important field of study? - Quora",
    "tags": [
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Albert Schmidt",
                "href": "/profile/Albert-Schmidt-7"
            },
            "answer_text": "Question: In your opinion, is philosophy still an important field of study? Of course. So long as humans continue asking questions about the world in which we live in, philosophy will always remain important. Philosophy asks question that science cannot or does not possess the tools to answer, and tries to formulate answers based upon a combination of logic and empiricism. Metaphysics, for instance, is the school of philosophy that asks about the nature of reality. Epistemology asks questions about the nature of knowledge and how we can truly know anything. Ethics asks questions about what makes actions right or wrong. Aesthetics asks what makes something beautiful to the human mind. There are numerous schools of philosophy, and each of them asks questions that science cannot answer and seeks to try finding answers to those questions. As such, philosophy is constantly seeking new knowledge and trying to find new questions to answer and to seek new possible answers that are consistent and can be argued for and against. Much of philosophy is also tied heavily in science. One cannot study metaphysics completely without also studying physics. Epistemology is a must for anyone who values the scientific method, as that method originated from epistemology itself, as well as for anyone who wishes to study psychology, neuroscience and sociology. Ethics is a central issue in philosophy as well and science is also upon the verge of trying to learn more about how, evolutionary wise, altruistic behavior among humans within tribal groups helped us survive in nature as opposed to selfishness. Not only does modern science and philosophy tie themselves closely together, but literally every subject of humanities owes its existence to philosophy. This includes natural, social and applied sciences too. You see, virtually every scientist up until the mid-1800s considered himself a natural philosopher. Philosophy and science were, until about the late 1600s, considered the same thing, and even afterwards scientists continued to also act as philosophers. This change in distinguishing science from philosophy only came about with the scientific method being used as a tool, and that itself didn’t come about until epistemologists established the idea of the scientific method, largely based on the work of George Berkeley and many of the other early empiricists. In fact, Karl Popper himself, a major figure in the philosophy of science, would be inspired by Berkeley to establish the idea of “Berkeley’s Razor,” which essentially states that all ideas that are not perceived by humans are to be ruled out completely. As such, philosophy is the father of science and it is thanks to philosophy that science even exists. The scientific method is itself a philosophical principle, an idea of logic that makes assumptions of the world even being capable of being studied and tries to discover new information based on that assumption. Philosophy also encompasses all forms of knowledge. There is a philosophy of science (and a philosophy for each natural and social science), mathematics, literature, technology, language, mind, politics, society, etc. Pretty much any subject you can think of, there is a school of philosophy that attempts to answer questions in regards to the best way to study or use that subject. As such, philosophy is important to study due to it’s immense influence on virtually all other fields of knowledge as well as its attempts to ask and answer major questions that no fields of knowledge have definitive answers to. It also encompasses virtually all subjects that exist and try to offer some kind of knowledge to humanity for us to use. ",
            "date": "Answered August 3, 2017",
            "views": "395",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gabriele Kembuan",
                    "user_href": "/profile/Gabriele-Kembuan"
                },
                {
                    "user_id": "David Moore",
                    "user_href": "/profile/David-Moore-408"
                },
                {
                    "user_id": "Ahmad Moustafa",
                    "user_href": "/profile/Ahmad-Moustafa-2"
                },
                {
                    "user_id": "David Chase",
                    "user_href": "/profile/David-Chase-26"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manu G Raj",
                "href": "/profile/Manu-G-Raj"
            },
            "answer_text": "Yes. Philosophy is always an important branch of study. To understand it, let's just look into the importance aspects of philosophy, Metaphysics discussing the nature of reality,Epistemology discussing the nature of knowledge,Value theory,Ethics and Aesthetics discussing the nature of individual and social -perceptions and interactions.These points are always worthwhile,or the most significant for any Cognitive being. These are questions we still try to answer more profoundly with philosophy. Without philosophy,the major scientific perceptions including those of quantum electrodynamics or Chaos theory or fractals would never have originated. ",
            "date": "Answered August 2, 2017",
            "views": "250",
            "upvotes": "0"
        }
    ]
}