{
    "title": "In your own words, state what 'self' is for each of the following philosophers. After doing so, explain how your concept of 'self is compatible with how they conceived of the 'self. kants the philosopher? - Quora",
    "tags": [
        "Identities",
        "Self-Awareness",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Matkowski",
                "href": "/profile/Eric-Matkowski"
            },
            "answer_text": "1 According to Kant, we all have an inner and an outer self which together form our consciousness. The inner self is comprised of our psychological state and our rational intellect. The outer self includes our sense and the physical world. 2 In my opinion self doesnt exist seperatly from brain and it is a simplified mirror of reality .It Is created by senses. Mind is created by senses as well. Self is a function of Mind and senses. It means senses creating it.(Mind means thoughts,memory mental faculty generally) The awareness that arises in conjunction with the activity of a given sensory system is itself impermanent and momentary: visual awareness and visual object, for instance, are both events within a mental stream of continuing relations. The ultimate basis for cognition: this is to be found in the sensory domain itself, given that cognitions change following modifications at the level of sense rather than in the mind . In the case where changes in the mental stream occasion in the absence of any sensory stimulus, these are said to be the result of unconscious traces of past experience rather than endogenous to mind itself. ",
            "date": "Answered September 9, 2020",
            "views": "543",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Victor F. Sarmiento",
                "href": "/profile/Victor-F-Sarmiento"
            },
            "answer_text": "Kant's Thesis on the Self: (Heidegger) \"Being is obviously not a real predicate, that is, a concept of something that can be added to the concept of a thing. It is simply the position of a thing or of certain determinations in itself\". (Heidegger) That is, being for Kant is only in an objective, qualifying concept of things. This concept is initially in Aristotle. To refer to things is to define them by seeking their sense of being. The Being, for me, is in the universal and personal subjective sense, in other words, in a universal Me and a personal, individual. This sense is initially in Eastern Philosophy, specifically in Taoism. ",
            "date": "Answered September 9, 2020",
            "views": "246",
            "upvotes": "0"
        }
    ]
}