{
    "title": "International Relations: What are the differences between classical realism and structural realism? - Quora",
    "tags": [
        "Neorealism",
        "Realism",
        "Theory and Theories"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Todorovic",
                "href": "/profile/Alex-Todorovic"
            },
            "answer_text": "Classical realism refers to writings by Thucydides, Machieavelli, Carl von Clausewitz and Hans J. Morgenthau - they are concerned with order, justice and change at the domestic and international level and their analysis is similar for both - they stress similarities, not differences, between domestic and international politics, and the role of ethics and community in promoting stability. They tend to have a “tragic” outlook - that history repeats itself, and that hubris leads to war… in their view, communal bonds are fragile and easily undermined by those seeking unilateral advantage by either individuals or states. A key difference between classical realists and structural realists lies in the motivation to power. The two schools view that question differently. Classical realists say that the will to power is linked to human nature, and that’s why their analysis of individuals and states is similar. Everyone is born with a will to power hardwired into their brain, and therefore nothing can really be done to improve that situation, for which reason war seems inevitable. There will always appear some asshole who wants to dominate others. For structural realists, human nature has little to do with why states want power. Rather, the architecture of the international system forces states to pursue power… it is simply rational for every state to acquire sufficient power to defend itself in the event that it is attacked. In such a system, states are forced to compete if they wish to survive. Structural realists ignore cultural differences among states and regime type because the international system creates the same incentives for all great powers. For structuralists, unlike for classical realists, who is in power is not that important, so classical realists put more emphasis on human actors/human agency. Another question shows the differences between the two: How much power is enough? Defensive realists (also structuralists) like Kenneth Waltz say it is unwise for states to acquire too much power because the system will punish them. Offensive realists like John Mearsheimer argue that it makes strategic sense for states to acquire as much power as possible, and even to pursue hegemony. For classical realists, power is an end in itself, a function of human nature, but for structural realists, power is a means to an end, and the ultimate end is survival. ",
            "date": "Answered May 16, 2016",
            "views": "40",
            "upvotes": " View 86 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anirudh Raghuram",
                    "user_href": "/profile/Anirudh-Raghuram"
                },
                {
                    "user_id": "Saumya Rajput",
                    "user_href": "/profile/Saumya-Rajput-16"
                },
                {
                    "user_id": "Andres Gonzalez",
                    "user_href": "/profile/Andres-Gonzalez-110"
                },
                {
                    "user_id": "Sonu Meena",
                    "user_href": "/profile/Sonu-Meena-59"
                },
                {
                    "user_id": "Muanghai Seachao",
                    "user_href": "/profile/Muanghai-Seachao"
                },
                {
                    "user_id": "Shehroz Ahmed",
                    "user_href": "/profile/Shehroz-Ahmed-34"
                },
                {
                    "user_id": "Hareem Khalil",
                    "user_href": "/profile/Hareem-Khalil-1"
                },
                {
                    "user_id": "Hagbard Celine",
                    "user_href": "/profile/Hagbard-Celine-2"
                },
                {
                    "user_id": "Alain Mitra",
                    "user_href": "/profile/Alain-Mitra"
                },
                {
                    "user_id": "Upasana Ghosh",
                    "user_href": "/profile/Upasana-Ghosh-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Seb González",
                "href": "/profile/Seb-González-1"
            },
            "answer_text": "The most significant difference is classical realism, which places emphasis on human and domestic factors, and neorealism, which emphasizes how the structure of the international system determines state behavior. In contrast to more optimistically minded idealists who expected international tensions to be resolved through open negotiations marked by goodwill, classical realism developed by Morgenthau set out an approach that emphasized power over morality. Indeed, morality was portrayed as matter that should be avoided in policymaking. In Morgenthau’s account, every political action is directed towards keeping, increasing or demonstrating power. The thinking is that policies based on morality or idealism can lead to weakness – and possibly the destruction or domination of a state by a competitor. In this sense pursuing the national interest is ‘amoral’ – meaning that it is not subject to calculations of morality. The realist account of international relations stresses that the possibility of peaceful change, or in fact any type of change, is limited. For a leader to rely on such an idealistic outcome would be folly. Meanwhile, in Theory of International Politics (1979), Kenneth Waltz modernized IR theory by moving realism away from its unprovable (albeit persuasive) assumptions about human nature. His theoretical contribution was termed ‘neorealism’ or ‘structural realism’ because he emphasized the notion of ‘structure’ in his explanation. Rather than a state’s decisions and actions being based on human nature, they are arrived at via a simple formula. Firstly, all states are constrained by existing in an international anarchic system (this is the structure). Secondly, any course of action they pursue is based on their relative power when measured against other states. Therefore, Waltz offered a version of realism that recommended that theorists examine the characteristics of the international system for answers rather than delve into flaws in human nature. In doing so, he sparked a new era in IR theory that attempted to use social scientific methods rather than political theory (or philosophical) methods. The difference is that Waltz’s variables (international anarchy, how much power a state has, etc.) can be empirically/physically measured. Ideas like human nature are assumptions based on certain philosophical views that cannot be measured in the same way. Many critics of realism focus on one of its central strategies in the management of world affairs – an idea called ‘the balance of power’. This describes a situation in which states are continuously making choices to increase their own capabilities while undermining the capabilities of others. This generates a ‘balance’ of sorts as (theoretically) no state is permitted to get too powerful within the international system. Realism school of thought accentuate the competitive and conflictual side of international relations. Realism’s roots are often said to be found in some of humankind’s earliest historical writings, particularly Thucydides’ history of the Peloponnesian War, which raged between 431 and 404 BCE. ",
            "date": "Answered June 17, 2020",
            "views": "14",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abhishek Sharma",
                    "user_href": "/profile/Abhishek-Sharma-10220"
                },
                {
                    "user_id": "Jyoti Gautam",
                    "user_href": "/profile/Jyoti-Gautam-35"
                }
            ]
        }
    ]
}