{
    "title": "Is 4 days of not fapping good for a teen? - Quora",
    "tags": [
        "Puberty",
        "Masturbation",
        "Adult Question",
        "Teenagers and Teenage Years"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cory Erickson",
                "href": "/profile/Cory-Erickson-16"
            },
            "answer_text": "The effects are probably minimal either way, good or bad. You might have slightly higher amounts of sexual frustration built up because of it, might have a bit of a harder time concentrating than you would if you were more sexually satisfied or however you want to put it, and things like that, but four days isn't that long so as I said, minimal. But, good how, exactly? There really isn't anything “good\" about not masturbating. Masturbation is healthy and normal, especially as a teenager, hormones are a bitch. Please don't listen to people who took a Reddit joke seriously and made it into pseudoscientific nonsense, there is no benefit to not masturbating. If you don't do it for long enough there's actually a potential negative, you're still producing sperm, if it doesn't come out from you choosing to let it out, it's going to eventually come out by itself in your sleep. And that might not be fun to wake up to. ",
            "date": "Answered August 10, 2020",
            "views": "124",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kenneth Peterson",
                    "user_href": "/profile/Kenneth-Peterson-61"
                },
                {
                    "user_id": "Rita Mitze",
                    "user_href": "/profile/Rita-Mitze"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael McClennen",
                "href": "/profile/Michael-McClennen"
            },
            "answer_text": "Masturbation is a normal and healthy activity. It really doesn’t make any difference to your health whether you do it or not. If it feels good to not masturbate for four days, then fine. But don’t listen to the people who promise that your health will improve, because what they are telling you is nonsense. ",
            "date": "Answered August 10, 2020",
            "views": "73",
            "upvotes": "0"
        }
    ]
}