{
    "title": "Is an intelligent world, a dangerous world? - Quora",
    "tags": [
        "Danger and Dangers",
        "Intelligence",
        "Philosophy",
        "Politics",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Franzane Abella",
                "href": "/profile/Franzane-Abella"
            },
            "answer_text": "Well, that is when intelligence is driven by a malicious intention which precedes series of vicious acts and plans… an intelligent person thinks that he knows how to control a particular “thing”, so he is confident that he can manipulate it with ease(whether he wants to put a restraining factor towards the thing or not, it’s nigh-fascist act)… with the confidence on the belief that you can control such things with absolute precision and skills, this could lead you to think for an experimentation of thing… e.g. you wanted to experiment a certain object to the extent that you are beginning to hurt it without even realizing the fact that such actions toward the object are dangerous… so, consider the possibility that this object represents the world… the intelligent person then would begin by experimenting the world, he would take the risk of being dangerous just to know more about the world and how to control it…. ",
            "date": "Answered April 17, 2020",
            "views": "132",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tristan Flowers",
                    "user_href": "/profile/Tristan-Flowers"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Trejo",
                "href": "/profile/Paul-Trejo-1"
            },
            "answer_text": "Intelligent or unintelligent, the world has always been a dangerous place. Before the modern era, there was at least one military battle raging somewhere on Earth every year since the rise of Humanity. Sometimes dozens. Sometimes hundreds. Sometimes a World War. Let us not forget the eternal nature of Crime. Even before Humanity arose, the Earth was a food-chain, where the stronger prey upon the weaker. Add to this the Natural Disasters — the floods — the famines — the plagues. So, as I say — intelligent or unintelligent, the world has always been a dangerous place. The watchword of every century has always been — BE CAREFUL! ",
            "date": "Answered April 25, 2020",
            "views": "147",
            "upvotes": " Answer requested by Tristan Flowers"
        }
    ]
}