{
    "title": "Is applied ethics essentially just taking normative ethics a step further? - Quora",
    "tags": [
        "Meta-Ethics",
        "Ethics and Morality",
        "Ethics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brandon Munson",
                "href": "/profile/Brandon-Munson-2"
            },
            "answer_text": "Thanks for the A2A. In short, I think the answer is yes, but I do not think that it trivializes either. To begin, let’s think about the difference between applied physics and theoretical physics. Theoretical physics would correspond to Meta and Normative Ethics. For physics, it is a question of modeling. What is possible? What could be the case? In ethics, what does it mean to say “good” or “bad,” and what is good or bad?” Meta and Normative Ethics are theorizing about our basis for ethical statements. In applied ethics, it is usually done in a specific context. What does this look like in a business context? A medical context? It’s applying theory to current, concrete scenarios. It is no longer theorizing, but producing laws and policies. Is applied physics taking theoretical physics one step further? Well, it does in a sense, but theory helps map possibilities for experimentation and verification. When applied physics progresses, it informs theoretical physicists. In the same way, normative ethics gives a basis for applied ethics, but applied ethics can give feedback to normative ethicists based on observing the results of implemented policies. Lastly, I don’t think it should be called applied normative ethics. For one, I think it’s superfluous. Besides that, Applied Ethics is messier, because distinguishing good from bad actions is a less ambiguous business that deciding on policies and dealing with peculiar occassions which aren’t exactly “normative.” ",
            "date": "Answered February 12, 2017",
            "views": "291",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joe Watson",
                    "user_href": "/profile/Joe-Watson-14"
                },
                {
                    "user_id": "Jonathon Jones",
                    "user_href": "/profile/Jonathon-Jones"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mihir Parekh",
                "href": "/profile/Mihir-Parekh-11"
            },
            "answer_text": "I have read few books on normative ethics and one on practical ethics (by Peter singer). I feel practical ethics goes few steps deeper than just normative ethics. Like say utilitarianism says equal importance of happiness for everyone. But how to address problem of abortion with this? Does fetus counts equally? Animals? What kinds of euthanasia to be allowed? Many questions seem innocent on outside but are a rabbit’s hole. Singer had to use many rules to arrive at conclusions which are not available in normative ethics books. Also practical ethics is not like armchair philosophy. It takes input from psychology, laws and other allied fields to reach conclusions. So, all in all, it is related to normative ethics but practical ethics is not just one step further. It is quite a walk. ",
            "date": "Answered February 13, 2017",
            "views": "146",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Adam Uraynar",
                    "user_href": "/profile/Adam-Uraynar"
                }
            ]
        }
    ]
}