{
    "title": "Is a physicist a mathematician? - Quora",
    "tags": [
        "Mathematicians",
        "Physicists"
    ],
    "response": [
        {
            "author_info": {
                "name": "George Hrabovsky",
                "href": "/profile/George-Hrabovsky"
            },
            "answer_text": "There is a big difference between a mathematician and a physicist. A mathematician invents new mathematics. Mathematics need not have anything to do with nature. A physicist is a scientist that attempts to study fundamental processes in the universe. To really do physics everything must begin and end with nature. Mathematics is useful in performing calculations. Being good at calculation does not make you a mathematician. Inventing new mathematics makes you a mathematician. Few physicists invent new mathematics. One area of overlap is in theoretical physics in what we call mathematical physics. You convert a physics problem into a math problem. Solve the math problem. And produce a physical interpretation of the solution. This can involve inventing new mathematics. So, some physicists invent new mathematics, but most never do so. ",
            "date": "Answered November 22, 2015",
            "views": "29",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chi Quynh Duong",
                    "user_href": "/profile/Chi-Quynh-Duong"
                },
                {
                    "user_id": "Adrian Shipp",
                    "user_href": "/profile/Adrian-Shipp-3"
                },
                {
                    "user_id": "Sebastian Art",
                    "user_href": "/profile/Sebastian-Art"
                },
                {
                    "user_id": "Demetrios E. Lekkas",
                    "user_href": "/profile/Demetrios-E-Lekkas"
                },
                {
                    "user_id": "Himani Mishra",
                    "user_href": "/profile/Himani-Mishra-8"
                },
                {
                    "user_id": "Ernest Chase",
                    "user_href": "/profile/Ernest-Chase"
                },
                {
                    "user_id": "Haider Alwasiti",
                    "user_href": "/profile/Haider-Alwasiti-1"
                },
                {
                    "user_id": "Shailendra Singh",
                    "user_href": "/profile/Shailendra-Singh-18"
                },
                {
                    "user_id": "Flynn Vadim Valery Sherbinin",
                    "user_href": "/profile/Flynn-Vadim-Valery-Sherbinin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tiberiu Tesileanu",
                "href": "/profile/Tiberiu-Tesileanu"
            },
            "answer_text": "No, physicists aren't mathematicians. The main difference is in focus: it's true that physicists tend to use math a lot, but they aren't interested in it for math's sake. Instead, they use math to solve questions about the natural world. Can you be a physicist without knowing math? Probably not, but there are many kinds of math and many levels of math proficiency. Experimental physicists often spend more time learning experimental techniques (as they should), and less time learning math. Because of this they're often less mathematically knowledgeable than theoretical physicists -- but this is just a rule thumb, meaning you can easily find exceptions, and also -- they're still very good at math. But knowing math doesn't make one a mathematician, any more than eating food makes you a cook. ",
            "date": "Answered November 6, 2015",
            "views": "23",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aaron Norman",
                    "user_href": "/profile/Aaron-Norman-47"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/From-Mars-3"
                },
                {
                    "user_id": "Brad Saint George",
                    "user_href": "/profile/Brad-Saint-George"
                }
            ]
        }
    ]
}