{
    "title": "Is beauty the purpose of art? - Quora",
    "tags": [
        "Purpose",
        "Painting and Paintings (art)",
        "The Arts",
        "Fine Art"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joshua Mack",
                "href": "/profile/Joshua-Mack-42"
            },
            "answer_text": "You like to look at beautiful things. If something is beautiful, it has a better shot at conveying its message, if it has one. Beauty is a tool, a means to an end. Sometimes, but not necessarily. So the statement”beauty is the purpose of art” would be wrong. Some things are aesthetic, everything beautiful is also aesthetic, but you can call a compositionally well aranged painting of a pile of horrifying corpses aesthetic. Aesthetic can be found in many striking art pieces and even war photographs. The composition of a photo that draws the eye, whether the scene is actually beautiful or rather gruesome. Beauty can convey meaning in a painting. An emperor can be drawn beautiful to say he is good, just as negative carricature of people, be it individuals or ethnicities or enemies in war usually makes them ugly. Beauty, or aesthetic, keeps you looking at a painting or draws you to it in the first place. The respect or fascination with painting technique can also make you keep looking. a painting that is optically confusing or hurts your eyes may make you look away before it conveyed its message. If the hero of the painting is a disfigured badly painted stickfigure, the painting will have a hard time convincing you of its heroism. So while beauty and aesthetic can be the purpose of a painting, and beauty of certain elements or persons in a painting can mean something, it often is a means to an end. You like to look at beautiful things. If something is beautiful, it has a better shot at conveying its message, if it has one. Beauty is a tool, a means to an end. However mindlessly making your painting more Beautiful by any means can end up conveying a wrong message. ",
            "date": "Answered October 28, 2019",
            "views": "343",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Greg Holley",
                    "user_href": "/profile/Greg-Holley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Beth Goldowitz",
                "href": "/profile/Beth-Goldowitz"
            },
            "answer_text": "Sometimes yes. Sometimes no. It depends on the individual artist, the social, political and economic situation at the time and can vary from person to person. Some artists just want to go out into the landscape and paint beautiful pictures. Other artists want to express artistic, philosophical or political theories through their art. Some simply want to push the boundaries and definitions of art as far as they can go. Some artists are redefining the meaning of beauty itself. That’s why you get artists as different as Nam Jun Piak, Vito Acconci, Judy Chicago and Rodney Alan Greenblat, to name just a few contemporary artists. If you go back in history, you find art made for different purposes, supporting different philosophies. Renaissance at is overtly religious, glorifying the Catholic church, but it was also made to glorify the individual donors. These paintings guaranteed that the church would continue to say prayers for the donor’s soul long after he was dead. Often you see the artists patron presenting a small model of a building in these paintings, to show that he has donated money to build a church or chapel. It’s a form of religious conspicuous consumption that’s very different from the Dutch and Flemish still lives, which glorified the richness and bounty of middle class existence.Yes, those paintings are beautiful, but there are other motivations behind their creation. As for Jesse Waugh’s Manifesto of Pulchrism, a word he invented to suit his own needs, there’s a reason anyone feels compelled to publish a manifesto. It’s to promote a particular idea or ideology. So his manifesto isn’t about the notion of pure beauty. It’s about Jesse Waugh’s notion of beauty and how it applies to art. It strikes me as a rather narrow definition, but he’s certainly entitled to his opinion.  Rodney Alan Greenblat with some of his work  Vito Acconci, Face of the Earth #3, 1988  Nam Jun Paik, Electronic Superhighway  Faith Wilding, Waiting, 1972, from Judy Chicago’s Womanhouse Performances  By Jan van Huysum - The Yorck Project: 10.000 Meisterwerke der Malerei. DVD-ROM, 2002. ISBN 3936122202. Distributed by DIRECTMEDIA Publishing GmbH., Public Domain, File:Jan van Huysum 002.jpg  Male side panel of Hans Memling's Triptych of Wilhelm Moreel; the father is supported by his patron saint, with his five sons behind him. The central panel is here. ",
            "date": "Answered October 6, 2017",
            "views": "16",
            "upvotes": " View 1 Upvoter"
        }
    ]
}