{
    "title": "Is being a nihilist a good way of living? - Quora",
    "tags": [
        "Nihilism in Popular Culture",
        "Nihilism",
        "Understanding Human Behavior",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pavan Raina",
                "href": "/profile/Pavan-Raina-2"
            },
            "answer_text": "I try to find meaning of nihilist and see as pessimistic, anarchist, radical, revolutionary, rebel, destroyer in different ways and context. One thing common in them is violence at least in the mind of such person. If mental peace is not the objective one can experiment and find it out and if one is already with disturbed mind two negatives shall not make a positive. Further negativism doesn’t crop by deep thinking but is a spark out of ignorance or result of disturbed state of mind that can never help a good cause. Questioning anything is not bad and if one questions very elementary nature of thought could mean deeper diving in the subject which is not necessarily a pessimistic approach. - Being positive thinker is a tough way and comes by learning and practicing the life, by keeping mind engaged in constructive thoughts and actions. - By being focused on the objective overseeing winning or losing as these two are partners associated always each to teach something good by accepting mind. - By following discipline life that could reduce the burden by half because of working on a process than the results as an outcome. It is the confidence which is built by following the above paths inculcating many traits hidden in us not known but come by practicing like patience, sacrifice, compassion, gratitude and many more siblings of such nature. All these branches are of one common tree which is full of love and respect with human and nature equally leaving nothing to feel dejected or feel pessimistic. ",
            "date": "Answered January 27, 2019",
            "views": "99",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sidharth Sabat",
                    "user_href": "/profile/Sidharth-Sabat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sapna Pushkarna",
                "href": "/profile/Sapna-Pushkarna-1"
            },
            "answer_text": "Nihilist is no way of existing! You want to rebel every nuance of life, the very existence of yours in this society, which is no way to live! You believe in nothingness, when you reject all morals of life, religion & the society, you are a zombie, as far as I am concerned! We are essentially society animals & do follow the norms of the social infrastructure! You can’t be in a denial state of the same! We may, or may not agree on several issues, but that’s a separate matter! Accept the facts, the morality of your existence, only then you are leading a good way of living!! ",
            "date": "Answered July 8, 2019",
            "views": "23",
            "upvotes": " Answer requested by Sidharth Sabat"
        }
    ]
}