{
    "title": "Is boredom important? - Quora",
    "tags": [
        "Psychology Education",
        "Boredom",
        "Social Psychology",
        "Human Brain",
        "Psychology",
        "Social Media"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Ringland",
                "href": "/profile/John-Ringland"
            },
            "answer_text": " In 2013 I had a fascinating discussion with Augustin de la Pena,  whose primary research is into the psychophysiologic foundations of  boredom and interest and how these relate to our overall behaviour,  individually and collectively. This is a summary of what I learnt from him. This answer begins with  John Ringland's answer to What is boredom? Why do we require a constant stream of subjectively stimulating information (visual, tactile, olfactory, etc.) in order to feel meaning in our lives? Why is it so difficult to just stop and smell the roses?. It is essential that you read that first if you are to understand what I say below. The  ego's response to intense boredom is to attempt to shake up its  underlying cognitive structures, which de-automatizes them. This is done  by selectively or randomly seeking new interests, entertainment,  unusual experiences, taking risks, inciting conflict, consuming drugs  and generating crises, with intended and unintended consequences. This exploration and upheaval can break cognitive habits and lead to the emergence of new perspectives, new understandings, new attitudes, awe, being in the flow, inspiration, creativity, etc. It can unlock reserves of energy, insight and hidden potential. Those with relatively simple cognitive structures can become satisfactorily interested in and entertained by relatively simple things. They have relatively weak attentional automatization, due to having relatively simple cognitive structures with sparse integration. Thus a relatively light shake up is all that is needed to de-automatize things, perhaps a glass of wine, a walk in the park, a little small-talk and gossip, watching a movie, etc. However those with highly complex and elaborate cognitive structures have a greater need to pursue interests due to their greater capacity for experiencing boredom. They have strong attentional automatization, due to having complex cognitive structures with dense integration. Thus they require a more vigorous shake up to loosen things and are thus more prone to extreme and risky behaviour, such as extreme sports, extreme conflict, extreme drug use, extreme recklessness, extreme entertainment, etc. Those with cognitive structures that are compatible with the mass culture or various alternative cultures will be satisfactorily interested in and entertained by the products of those cultures. Thus, for example, many movies, television programs and documentaries will be quite entertaining to them. However those with highly specialised cognitive structures have specialised areas of interest, thus they are less likely to be interested in the products of mass culture or the alternative cultures. Thus, for example, cutting edge conversations with potentially revolutionary implications would to entertain them. Thus the interplay between interest and boredom underlies and motivates many behaviours that on the surface may seem peculiar, unnecessary and even dangerous. It is likely that much of the conflict, strife, drug use, entertainment, recklessness, crises etc in the world are driven by these psychophysiologic dynamics. This raises some important questions (Note: these unfold in order so they each imply the previous questions.) Why are so many people so bored?  \tCould it be that our mass culture \tand even alternative cultures are presently not nourishing to us?Could it be that the products of \tour cultures are too simplistic to really interest the growing \tnumber of people with complex cognitive structures?Could it be that many of us have \tcognitive structures that are largely incompatible with those that \tare able / allowed / encouraged to be conveyed via our cultures?  \tIf we were to communicate more \topenly, honestly, vulnerably and clearly would we find that the \tinternal life of others is very unlike their culturally conditioned \tfaçade?If we were more able to express \tour real selves and to really see and understand each other, would \tthe resulting culture become more nourishing?With a more nourishing culture \twould there be less boredom and craving for excitement, drama, \tconflict and crisis?Is this the manner in which mutual \tunderstanding can lead to peace - not just through things like \tarbitration between complainants, but in a very personal and deep \tpsychophysiologic manner?Would a peaceful consciousness be \tas creative and innovative or would we be satisfied with relatively \tsimple pursuits?Is there a balance between peace and conflict (between \tpeople) that results in a balance of creative innovation and simple \tpursuits, whilst avoiding the destructive extremes?Do these dynamics influence not \tjust our personal consciousness but also the collective \tconsciousness within a society?Could these dynamics explain the \tbehaviour of and interactions between nation states, corporations \tand other such entities?Could excessive 'institutional' \tautomatization (e.g. privatisation of government services, \toutsourcing, etc) lead organisations (nations, corporations, etc) to \tmetaphorically feel bored and thereby develop cravings for the \tpursuit of their interests, entertainment, conflict and crisis at a \tnational and global scale?Are organisations (nations, \tcorporations, etc) with more complex and specialised institutional \tstructures more prone to boredom and likely to develop intense \tcravings for the pursuit of their interests, entertainment, conflict \tand crisis at a national and global scale?Could this 'institutional' \tautomatization be the underlying cause of much of the drama and \tstrife in the world - including the tendency to move in the \tdirection of fascism and authoritarianism as the cravings become \tmore intense?If organisations (nations, \tcorporations, etc) were to communicate more openly, honestly, \tvulnerably and clearly, and they became more able to really see and \tunderstand each other, would the resulting political and economic \tculture become more nourishing?With a more nourishing political \tand economic culture would there be less institutional boredom and \tcraving for excitement, drama, conflict and crisis?Is this the manner in which mutual \tunderstanding between nations can lead to world peace - not just \tthrough things like peace-talks between nations, but in a very \tsocial and deep psychophysiologic manner?Would a peaceful society be as \tcreative and innovative or would it be satisfied with relatively \tsimple pursuits?Is there a balance between peace and conflict (between \torganisations) that results in a balance of creative innovation and \tsimple pursuits, whilst avoiding the destructive extremes?If there is a balance point of \tpeace and conflict at both the personal and organisational levels, \twhat is the interplay between these two balance points?  \tHow does the demographic distribution of personal balance \tpoints contribute to the organisational balance point?Many complain that meditation is \ttoo boring, does this indicate that meditation has some impact on \tthe ego's cognitive structure?Advanced meditators have a very \tpeaceful and clear consciousness, is this because meditation \tsimplifies the ego's cognitive structure and also makes it more \tuniversally compatible with the stream of experiences, so that \tsimple and ordinary experiences become quite stimulating and \tnourishing?Is there something like meditation \tat an organisational level that can foster peaceful organisations \t(nations, corporations, etc)?Aside from meditation, what other methods are there to bring \tpeace to egos and organisations that are tormented by cravings that \tlead them into drama, strife and danger?Related work by myself: Gaian Ego Hypothesis and in particular STriking At the Root (STAR). Note:  the above is off the top of my head; based on my recollections of my  conversation with him and also informed by my own perspective and  experiences. So some of the views expressed above are not necessarily a  reflection of Augustin's. For a very detailed examination of his ideas  see his paper: Consequences  of Increments in Cognitive Structure for Attentional Automatization,  the Experience of Boredom, and Engagement in Egocentric, Hyperdynamic,  Interest-Generating Behaviors: A Developmental Psychophysiologic  Approach | de la Pena | Proceedings of the 50th Annual Meeting of the  ISSS - 2006, Sonoma, CA, USA ",
            "date": "Answered July 9, 2014",
            "views": "695",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Grace Flaherty",
                    "user_href": "/profile/Grace-Flaherty-12"
                },
                {
                    "user_id": "Joel Chong",
                    "user_href": "/profile/Joel-Chong-15"
                },
                {
                    "user_id": "Christian Crews",
                    "user_href": "/profile/Christian-Crews-7"
                },
                {
                    "user_id": "Jake B",
                    "user_href": "/profile/Jake-B-263"
                },
                {
                    "user_id": "Eloisa Clarisse Eusuya",
                    "user_href": "/profile/Eloisa-Clarisse-Eusuya"
                },
                {
                    "user_id": "Jane .",
                    "user_href": "/profile/Jane-920"
                },
                {
                    "user_id": "Rares Mircea",
                    "user_href": "/profile/Rares-Mircea-3"
                },
                {
                    "user_id": "Alvin Sihombing",
                    "user_href": "/profile/Alvin-Sihombing-1"
                },
                {
                    "user_id": "Will Klutch",
                    "user_href": "/profile/Will-Klutch"
                },
                {
                    "user_id": "Davie Xiao",
                    "user_href": "/profile/Davie-Xiao-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jordan Harbinger",
                "href": "/profile/Jordan-Harbinger"
            },
            "answer_text": "Scientists are now discovering that boredom can produce some surprising benefits. One recent study found that boring activities actually result in increased creativity, and explored the role of daydreaming - a common activity that arises in response to boredom - as a mediator between boredom and creativity. In other words, a wandering mind can actually lead to new and better ideas. There are loads of studies that echo this finding, and all of them are excellent reminders that being stuck (and growing bored) are not only helpful parts of our process, but necessary ones. One landmark study, for instance, gave participants a ton of time to complete problem-solving and word-association exercises. Once they worked through all of the obvious answers, participants offered up more and more inventive ones as a way of staving off the feeling of boredom. The research here is vast, and it all points to one central insight: that being bored can actually be fruitful and productive. ",
            "date": "Answered December 15, 2017",
            "views": "466",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Margo Maddy",
                    "user_href": "/profile/Margo-Maddy"
                },
                {
                    "user_id": "Katie C",
                    "user_href": "/profile/Katie-C-103"
                },
                {
                    "user_id": "Eric Siu",
                    "user_href": "/profile/Eric-Siu"
                },
                {
                    "user_id": "Travis Bradberry",
                    "user_href": "/profile/Travis-Bradberry-1"
                }
            ]
        }
    ]
}