{
    "title": "Is believing that objective morals don’t exist immoral? - Quora",
    "tags": [
        "Secular Humanism",
        "Antitheism",
        "Ethics of Everyday Life",
        "Atheists",
        "Ethics and Morality",
        "Existence",
        "Atheism",
        "Ethics",
        "Morals and Morality",
        "Belief and Beliefs",
        "Philosophy",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Darren Farley",
                "href": "/profile/Darren-Farley-7"
            },
            "answer_text": "To give a short and sharp answer: no. When we consider morals we usually use the basic litmus test of “Does it cause harm?” Holding a belief does not harm anyone, and so passes the litmus test and is considered moral/amoral (where amoral is defined as not having a moral concern, neutral, neither right nor wrong.) Even if that belief were to influence a person to commit a generally considered immoral action, it would be the action judged immoral, not the belief. Longer answer - We would have to consider the question: “Is there actually such a thing as objective morality?” To which I believe the answer is “no, there is no such thing as objective morality”. Here’s the thing. In order to consider something ‘objective’ it would have to, by definition, not be subject to human perception and interpretation, because that is the realm of subjectivity. Morality is our code of what is ‘right’ and what is ‘wrong’. But, herein lies the problem: ‘right’ and ‘wrong’ are themselves subjective terms defined by the individual who is perceiving the action and judging it according to their thoughts, beliefs, knowledge, experience, etc. And as these thoughts, beliefs, knowledge, experience etc vary from one person to the next each individual will judge an action differently. So while I (as a moral person I believe) would see lying, cheating in relationships, assault, murder etc as wrong, there are people in situations where they would view them not only as right but required. Hell, there’s even situations in which I would view those things as right and do them quite gladly. Murder, for example. Generally accepted to be wrong, I go out and randomly shoot up a nursery/kindergarten full of kids and I would receive the just rewards for that breach of ‘considered good’ conduct and spend the rest of my life in prison, if I survived the police response that is. But what if I was the one shooting and killing someone else who was actively shooting up a nursery/kindergarten? Suddenly I’m a hero, parents crying tears of gratitude, shaking hands with the Prime Minister and kneeling in front of the Queen receiving a title. People would consider it a moral action purely because the opposite (having the ability to stop it and choosing not to, therefore choosing to allow the kids to die) is immoral. So, the issue of the morality of murder is not quite as black and white as objective morality would require it to be, instead it depends too finely on context. Add to this the added complexity that is intent. Perfect examples of this abound across Quora in the form of religious questions and answers but I will pick one that is relevant to me personally: that of religion vs LGBTQ+ issues. Person on Quora asks for help reconciling their LGBTQ+ nature with their religious belief because their religion says homosexuality is a sin and should be avoided and shunned. Person from the LGBTQ+ community answers telling them to shun the religion as being homophobic and ignorant, intending their best for the person, this would be seen by many to be a moral action because they are actively writing words of support, trying to help the person be happy and live a productive, joy and love filled life, wishing them the best etc. The religious community would likewise answer telling them to shun their LGBTQ+ nature and live life celibate, which to a different many people would be seen as a moral action because they are actively writing words of support, trying to help the person be happy and live a pious life that will give them a joy filled eternity. Two groups of people, opposing points of view, both intending the best, but seeing each others actions as immoral. How can that be if morals are objective, unless of course we were to include “self contradictory” as a trait of objectivity, in which case how is it to be studied or interpreted at all? How would we rule what is right and wrong if actions can be right and wrong at the same time? What if right is wrong and wrong is right? That way lies a mental minefield. So if the morality of an action is considered based on the subjective notions of “right”, “wrong”, “context”, “intent”, how is it objective in any way? How can it be when it’s based so heavily on the subjective? As a final point I would throw in that the idea of “objective morality” is itself offensive to the idea of morality. Why is this? Objective morality would exist objectively in the universe as a universal code of rules by which we would literally be forced to judge everything by. There would be no argument against it, no changing it, no recourse against its judgements, no latitude for people to hold different opinions, no exception for context, no understanding for intent. Secondly, where would this objective moral set come from? Who or what would decide what is right and wrong in order to publish such an objective moral set? Where do they get their idea of right and wrong? What evidence do we have to believe that they are correct? It would be, by definition, tyrannical. And this objective moral-set creator would be a tyrant. And the problem with tyranny is that people generally consider tyranny to be immoral, and we would be left with objective morality and its source itself being immoral and therefore not a very good source of morals to follow, in which case what moral code do we follow? We would be left to invent our own code of morality, possibly along the lines of Scanlon’s contractualism, which is pretty much what we have at the moment, because all we have is reasonable public agreement or disagreement on what is right and wrong, which is the core of contractualism. ",
            "date": "Answered October 19, 2020",
            "views": "40",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Arjun Dev",
                    "user_href": "/profile/Arjun-Dev-129"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Andros",
                "href": "/profile/Joe-Andros-1"
            },
            "answer_text": "Is believing that objective morals don’t exist immoral? No. It isn’t. Objectivity is the fantasy viewpoint: the view with the viewer subtracted. No one has ever attained such a view. Objectivity is an ideal. When we try to be objective, we try to identify our biases by how they distort our perceptions, and correct for them. By ruling those out we steer better into the ports we make for, but we never arrive at objectivity. It’s not a destination. No one lives there. Objectivity is a fixed star in the sky to steer by upon these wild rolling subjective seas. Anyway, morality? Morality is any concern in right and wrong, to tell between in order to further right or oppose wrong. All sincere efforts in these lines, trying to separate and weigh, do good make good, make things right…avert wrong, thwart wrong, comfort and assuage those harmed. Be good in this world. What matters is what you steer by. What you value. What you prioritize. This is not objective. Objectivity is what-is. Objectivity cannot say what-should-be. It can’t even say what-is-good. That’s valuation. Personal. Subjective business. But here’s the thing: finding and telling and doing, being right (as opposed to wrong) is about decisions and acts. It isn’t about the existential ontological, epistemological underpinnings. Doesn’t matter how you explain your conscience to yourself, or what nicknames you call it. “Absolute” doesn’t mean a thing to truth, let alone to good. Nor does “objective.” Doesn’t mean a thing. What matters is how you drive, steer, aim, charge. How you assess, miss, fail, recover, reassess and gird up. How you identify every factor you can and act best you can with all on the line. Sometimes with excellent judgment. Sometimes all you have is best guess and yet you have to act.  Morality is in how you take the consequence of the course you chose, and how you use it. Whatever comes, you own up to and examine it to learn. You course-correct to refine your aim towards better outcomes. Morality is in how you care what comes of what you do, and make sincere efforts to better who you are and what you do. In aimed intent from self to better and best self. This is human being business. We do this hard, sharp, deep and clear and we do it with mind and heart. There’s nothing immoral about not believing in objective morality. Nor is there anything immoral in not demanding your morality be recognized as objective, nor even in saying it isn’t. If you think your idea of morality comes from a place that looks without eyes and sees what no viewer could see, that doesn’t matter either way. It makes no difference. What makes a difference is how you tell right from wrong and choose action. That’s what makes you immoral. Or moral. You know what, be honest it’s probably both at different times. A moral person tries hard to aim right and owns where they’ve wronged. If anybody seriously thought it makes the slightest bit of difference whether a person thinks they’re objective, or thinks their morality’s objective…as if you had to believe one or the other to be moral? Anyone who seriously claims or believes that is either a moral imbecile or a casualty of some nonsense system. Either way it’s clear they can’t judge worth a white lie. Their basis to judge from is seriously crocked. Don’t know how morality works. Probably - if they think objectivity’s a be-all break-all - they don’t even know what it’s for. Objectivity or the lack thereof has no conceivable bearing on either. Hope that clears it up. ",
            "date": "Answered October 19, 2020",
            "views": "47",
            "upvotes": " Answer requested by Barock Caleb"
        }
    ]
}