{
    "title": "Is corruption human nature? - Quora",
    "tags": [
        "Arthakranti Pratishthan",
        "Arthakranti",
        "India Against Corruption",
        "Corruption in India",
        "Political Corruption",
        "Corruption"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew Weng",
                "href": "/profile/Matthew-Weng-1"
            },
            "answer_text": "I don’t believe inherently so, no. That’s not to say that humans are inherently honest either, because it’s been scientifically and socially proven that they are not. Anyone who says that they never lie is either lying to you, themselves or simply self-delusional. That being said, the inability of humans to maintain absolute honesty is not the same as corruption in my opinion. It’s a matter of Nths - the degrees to which a person is willing to lie, how regularly they do it and what they lie about - that’s where the hairs begin to split. I, personally, am guilty of lying in the past about many things that i was either ashamed to account for (as many are) due to my own internal fears, and in some cases i was made to feel that the truth was shameful or wrong due to the projection of someone else’s personal views, issues and/or judgements. I have since realized that neither reason are healthy, valid or authentic. The trick, i believe, is to remain as mindful as possible to our words and strive to maintain a higher standard of honesty in ourselves and be very aware of how a lack of real honesty can cause more hurt to others than we could fathom and that we specifically never intended. This, ultimately leaves us in a worse state overall than when others lie to us. Because we’ve betrayed ourselves most of all. This can also provide us a completely new perspective from which to view other people’s level of honesty, how much they are willing to shift their own core values in an attempt to justify their own dishonesty, if they take ownership of it and how easily we all can be guilty of that very same slippery slope and not judge it as much as avoid it. This is something i feel very strongly about in regards to myself and while I, no more than any other human can’t guarantee perfection in attaining this goal, I can guarantee that in striving to maintain that simple value for myself, I will not allow my own internal fears or the external fears of others to affect my truthfulness. I think that’s the best any of us can do. To walk the path of avoiding corruptions of ourselves. Also, never forget - “A lie by omission is still a lie” and as some, ourselves included, may choose to try and overlook, is the easiest lie of all and is very often the most devastating. ",
            "date": "Answered November 9, 2018",
            "views": "711",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "E Bishop Wooten",
                    "user_href": "/profile/E-Bishop-Wooten"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenneth Archer",
                "href": "/profile/Kenneth-Archer"
            },
            "answer_text": "No, corruption is not part of human nature. Crime is a legal concept made by humans to control other humans. There is no corruption in the human animal. The human is the only animal that has corruption. Humans work in duality Honesty and dishonesty are two opposites, thus duality. There is an infinite number of possibilities minus two between honesty and corruption. The degree of reliability and corruption is a legal matter. Human animals may have an essential goodness, but it is learned, not part of human nature. Much has changed in last 40–50 years. We now see post-literate, semi and wild humans in large numbers. The principal cause of wild humans is a lack of taming and training in the first 60–65 months of a human. We are also seeing the domestication of the human animal. The domestication process effectively makes humans unthinking, easily controlled, and a herding animal solely for their consumption of those in charge. Domesticated animals are not wild animals. Domesticated animals have uses; labor, companionship, and consumption. Domesticated animals require little taming and training because of their inability to think, and are human-made through genetic modification. Domesticated humans are easily herded by pieces of round metal and rectangular pieces of paper. When the human is domesticated, tamed and trained, it is used as a source of labor and for companionship. When work and companionship are no longer, domesticated, consumption occurs. The issue of corruption is a legal matter for judicial review. Wild humans are more dangerous and vicious requiring methods of control. Domesticated humans are not hazardous or cruel because it is not part of their nature. ",
            "date": "Answered June 24, 2018",
            "views": "886",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Godfrey McDonnell",
                    "user_href": "/profile/Godfrey-McDonnell"
                }
            ]
        }
    ]
}