{
    "title": "Is consciousness made of energy? If not, what is it made of? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Ryan Mattes",
                "href": "/profile/Ryan-Mattes"
            },
            "answer_text": "Let's start with energy. It's not a thing. Nothing is made of energy. Energy is a measurement. Your question is a bit like asking “Is the sidewalk made of inches?” The inches of the sidewalk can certainly be measured, so in that way, I guess it sort of has inches, but only in the same way that you do. Energy - the capacity to do work; the property of a system that diminishes when the system does work on any other system, by an amount equal to the work so done Thats what energy is: the capacity to do work. Sometimes energy is used to move things, sometimes energy is lost as heat, sometimes it takes more energy to do something because of friction. A laser isn't made of energy, it's light. An explosion isn't made of energy energy, it's heat and sound. Any way you look at it, nothing is made of energy, energy is just a way to measure the ability to change something. As for consciousness, it's not really a thing either, in the sense of something physical that must be made of something. Consciousness - the state of being conscious; awareness of one's own existence, sensations, thoughts, surroundings, etc. Consciousness is more like a state of being. Like… exhausted. You can't hold a handful of exhausted, just like you can't hold a handful of consciousness. It's not made of stuff, it's a state of being. So your question should be something more like “What are the conditions from which consciousness might arise?” Consciousness arises, as far as we can tell, as an emergent property of complex neural networks. In that sense it's “made of” chemicals and electricity, at least in the sense that the electro-chemical state of the brain is the medium from which it arises. What can't really be answered is “Why?” For that question, there are no satisfying answers. ",
            "date": "Answered December 17, 2017",
            "views": "17",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Derrick Tate",
                    "user_href": "/profile/Derrick-Tate-2"
                },
                {
                    "user_id": "Dmitry Petrov",
                    "user_href": "/profile/Dmitry-Petrov-27"
                },
                {
                    "user_id": "Ethan Kang",
                    "user_href": "/profile/Ethan-Kang-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vincent Salmon",
                "href": "/profile/Vincent-Salmon-1"
            },
            "answer_text": "Yes, consciousness is most certainly made of energy. Consciousness is the information experience of the electromagnetic spectrum from which all things are constructed. Consciousness is the universal recipe from which humanity is conceived. All energy is information. All information is energy. Human beings have the innate capacity to experience and comprehend this energy from which we are constructed. Civilisation is constructed out of the compulsion for intellectual specialisation. Intellectual specialisation is constructed by disconnecting other intellectual faculties. When people seek to construct intellectual specialisation, the first faculties that are disconnected are metaphysical faculties. Therefore those people who are the most intellectually specialised are also the most metaphysically depleted and are far less able to comprehend consciousness. Human anatomical tissue cells are the only universal entity that is capable of interpreting and comprehending the energy that is the electromagnetic consciousness. Therefore, in an advanced civil community, genetic depletion and disintegration repeatedly cause the collapse of those civil communities. ",
            "date": "Answered January 4, 2019",
            "views": "503",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Taslima Rahi",
                    "user_href": "/profile/Taslima-Rahi"
                },
                {
                    "user_id": "Christene McAdara",
                    "user_href": "/profile/Christene-McAdara"
                },
                {
                    "user_id": "Genius Turner",
                    "user_href": "/profile/Genius-Turner"
                },
                {
                    "user_id": "Ibrahim Gediana",
                    "user_href": "/profile/Ibrahim-Gediana-1"
                }
            ]
        }
    ]
}