{
    "title": "Is consciousness an emergent property of the brain or a fundamental property of matter? Isn't saying that consciousness is an emergent property of the brain just as much a non-explanation as saying it is a fundamental property of all matter? - Quora",
    "tags": [
        "Philosophy of Mind",
        "Cognitive Science",
        "Consciousness",
        "Human Brain",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dale W. Young",
                "href": "/profile/Dale-W-Young"
            },
            "answer_text": "The notion that consciousness is either an emergent quality of matter or a fundamental quality of matter contains several false premises, all of which may be wholly or partially false. The question is a little like the lawyer posing the question, “\"When did you start beating your wife?” The first of these assumptions is that consciousness is a quality of matter at all. The human consciousness of which we are commonly aware, first person consciousness if you will, is certainly associated with matter but it is also associated with electricity. In fact, what these responses refer to as brain consciousness is measured not by the matter that makes up the brain but by the electrical activity within it. Interestingly, the trend in computer technology is the faster computers become, the less matter (hardware) exists. Matter appears to impede computer functioning more than improve it. There is even some evidence that Alzheimer's is a function of the brain’s electrical functioning becoming impeded from the aging matter of the brain and what Alzheimer's drugs do to combat Alzheimers is restore electrical activity to those areas of the brain where it has become impeded. There are numerous example in medical science of the electricity being used for treatment where electricity appears to create healing, all followed by the statement that researchers do not know how or why it works. One possibility is that electricity itself is core consciousness, or opens a window to core consciousness, with core consciousness actuall acting intentionally at a quantum level. It is, after all, the zapping of a cloned cell with electricity that creates the processes of life within it, though again no one can say why this workday. The next assumption is that because the dreamless brain is associated with an absence of both dream and reality consciousness, there is a total absence of consciousness while the brain is in that electrical state. Yet I can be in that state of dreamless sleep and “hear” the doorknob to my bedroom turn and something, some part of my mind, jerks me out of dreamless sleep into reality consciousness - or out of dream consciousness and into reality consciousness, without any conscious effort on my part. It is as if some part of my mind is conscious and listening for any danger that requires reality consciousness to awaken. (There are a slough of these examples of a second level of more complex consciousness that appears from the shadows of first person consciousness, including creative genius). It seems possible then that what we call evidence of an absence of consciousness during sleep is an absence of first person consciousness, all while another part of the mind, core consciousness, remains conscious perpetually. In other words, the electrical patterns of deep sleep could actually be the pattern of core consciousness; the consciousness of what we incorrectly call the unconscious mind which we falsely assume acts without conscious intention. The brain may be more like a complex biological cell phone. When my friend calls and I hear his voice in the phone I realize he is not the phone. Our assumptions about the mind do not allow for the same possibility concerning the brain matter we associate with the mind. When so little is known, little should be excluded from the realm of possibility. ",
            "date": "Updated August 21, 2017",
            "views": "914",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Liu Xang",
                    "user_href": "/profile/Liu-Xang"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marcus Geduld",
                "href": "/profile/Marcus-Geduld"
            },
            "answer_text": "\"Isn't saying that consciousness is an emergent property of the brain just as much a non-explanation as saying it is a fundamental property of all matter?\" No.  First of all, neither is a non-explanation, though neither is a very detailed or useful explanation. \"From the store\" IS an explanation of where food comes from, but if I want to buy food, it may not be a useful explanation, since I don't know which store you're talking about. We know that the brain is responsible for cognition. We know that in many ways. We can give people cognitive tasks and watch the readouts of brain-imaging devices. We can also examine brain-damaged patients to see what happens when a particular region of the brain is broken. Less ethically, we can (and do) screw around with animal brains to see what happens. We can track a lot of activity down to the level of individual neurons.  We know, for sure, that memory is housed in the brain; we know that emotions are housed in the brain; we know that intellectualizing is housed in the brain...  There's a lot we don't know about consciousness, but we know that it involves (is linked to) memory, emotion and intellectual cognition. We also know that consciousness involves an organism having an understanding of itself, and we know of several ways in which brains store references to brain-owners. So where does this leave us in terms of your question? Let's use food, again, as an analogy: Bill: Where did you get those apples? Mary: the store. Bill: Where did you get those eggs? Mary: the store. Bill: Where did you get that milk? Mary: the store. Bill: Where did you get those bananas? Unfortunately, Mary dies before she can answer the question. Luckily, Bill's friend Occam is nearby. He asks the following: \"Given what you know, what is more LIKELY, that the bananas come from the store or that they come from the universe?\" Also, I don't understand what you mean when you suggest that consciousness is an emergent property of all matter. We've seen signs of consciousness in people and possibly in some other animals. Have you see signs of it in rocks and chewing gum? Why \"all matter\" in particular? Why not muse whether consciousness is an emergent property of the brain or an emergent property of all mini-vans? ",
            "date": "Answered October 19, 2011",
            "views": "33",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ryan Clark",
                    "user_href": "/profile/Ryan-Clark-647"
                },
                {
                    "user_id": "Giulio",
                    "user_href": "/profile/Giulio-4"
                },
                {
                    "user_id": "Peter Robertson",
                    "user_href": "/profile/Peter-Robertson"
                },
                {
                    "user_id": "Tim Pospeshil",
                    "user_href": "/profile/Tim-Pospeshil"
                },
                {
                    "user_id": "Llamapuncher Llamapuncher",
                    "user_href": "/profile/Llamapuncher-Llamapuncher"
                },
                {
                    "user_id": "Laura Middag",
                    "user_href": "/profile/Laura-Middag"
                },
                {
                    "user_id": "Steven Gone Away",
                    "user_href": "/profile/Steven-Gone-Away"
                },
                {
                    "user_id": "Robert S. Powell",
                    "user_href": "/profile/Robert-S-Powell"
                },
                {
                    "user_id": "Ashley Bradbury",
                    "user_href": "/profile/Ashley-Bradbury-1"
                },
                {
                    "user_id": "Morry Secrest",
                    "user_href": "/profile/Morry-Secrest"
                }
            ]
        }
    ]
}