{
    "title": "Is death winning or losing? - Quora",
    "tags": [
        "Hypothetical Death Scenarios",
        "Death and Dying"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Hosei",
                "href": "/profile/David-Hosei-1"
            },
            "answer_text": "I consider it as both. Losing would be for the atheist humans the people who don't believe in god or any religion. If you think about they believe when they die they die. What could they be thinking nothing because there dead. Wouldn't that be scary. Let's say you die and your a atheist you die and what happens after that. Nothing just imagine that well you can try but it's impossible to imagine something like that. It just gets on my nerves thinking about that but it's there opinion. Well I got off topic. I also say that it is winning because for the people who believe in god they get to spend all eternity in heaven. ",
            "date": "Answered October 21, 2017",
            "views": "86",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Brainard",
                "href": "/profile/Scott-Brainard-1"
            },
            "answer_text": "Death is the big cosmic joke. All of your life you build more and more, like a house that you keep adding on to. You spend more time working on it than living in it. For some it becomes bigger and has more rooms. For others it becomes more designed and grand to look at. For most it becomes more durable and sustainable from the coming storms, and it does so by going through the current rains that allow you to learn of all of the leaks and what you can do better to improve the house. In the end, death comes around with a big old grin and spits on it, tears it down piece by piece, and shows you how it was all for nothing. You sit in the ruins and don’t have a single thought from thereon, you don’t have any more time to learn from that rain. You can’t learn the lesson that fixing those leaks was a waste of time, that your house can never be truly durable. There is no winning when you die. If you think life is a game you will only lose. But you don’t have to lose. You don’t have to think of life as a game. When death comes around with his joke, be the one to laugh with him. ",
            "date": "Answered October 22, 2017",
            "views": "125",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Fabio Aversa",
                    "user_href": "/profile/Fabio-Aversa-1"
                }
            ]
        }
    ]
}