{
    "title": "Is destruction as necessary as creation? - Quora",
    "tags": [
        "Destructive",
        "Creationism",
        "Creation (creativity)",
        "Destruction",
        "Philosophy",
        "Science",
        "Religion",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Justice Långvall",
                "href": "/profile/Justice-Långvall"
            },
            "answer_text": "Whenever you create something, you’re destroying something else. When you create a stone statue, you’re destroying a stone in exactly the same way that destroying a stone statue creates new rocks. So it all comes down to what you value. You see more value in a stone statue than in just a rock. Perhaps mainly because there are more rocks that you can count, and they’re all the same to you, but each statue is seemingly unique, and is “human” in its nature. Therefore you see the statue as something much “more” than the rock it came from. This is completely subjective. To “create” in practice means to change something into something else. Thus it is an act of destruction as much as an act of creation, if you out aside personal values and look at it objectively. ",
            "date": "Answered July 14, 2019",
            "views": "121",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Macready",
                "href": "/profile/Stephen-Macready-1"
            },
            "answer_text": "No. The Bible says God desires all sorts of men not to be destroyed but have everlasting life. Yes. The Bible shows that God’s justice must be carried out to those who disobey and reject his sons sacrifice. The reason for destruction is to restore God’s original purpose for mankind and the earth. The only way to fulfill his promise to cleanse the earth of all wickedness is to destroy them. John 3:16 ",
            "date": "Answered June 19, 2019",
            "views": "47",
            "upvotes": " Answer requested by Adrian J. Zarazua"
        }
    ]
}