{
    "title": "Is Descartes' third meditation – his ontological argument – logically sound in your opinion? - Quora",
    "tags": [
        "René Descartes",
        "Ontology (philosophy)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Madison Boyle",
                "href": "/profile/Madison-Boyle-7"
            },
            "answer_text": "Personally, I’m not sold on the idea of necessary existence, whether it’s Anselm or Descartes suggesting it. I would have to agree that a malicious demon could possibly trick the senses of a thinking thing only when there is a thinking thing to trick, but I’m inclined to ask: then what? The only defense that Descartes can imagine against the demon is God. An omniscient, omnipotent, omni-benevolent being would certainly protect him against such an entity. At this point, the argument hits a snag. Descartes has already discounted most forms of knowledge, but he now is faced with the task of proving that God exists. To my memory, Descartes’ ontological argument is similar to Anselm’s: God is the ultimate being: omnipotent, omniscient, omni-benevolent, etc. The ultimate being cannot lack any quality, including existence, and so must exist. Since you ask for my opinion: I have to admit, the first time I heard Anselm’s ontological argument in class, it annoyed me! I didn’t like the notion that someone could “prove” God’s existence with a clever linguistic syllogism. I’m more inclined to agree with Guanilo and Kant. Point one: positing the existence of an ultimate being that must exist is like positing the existence of an island “greater than that which can be conceived” and must also exist (Guanilo). Point two: existence- whether “necessary” or not- is not a predicate (Kant). Also, I’m inclined to believe that Descartes’ reasoning comes from the kind of knowledge that he sets aside due to his (rhetorical) demonic foe. ",
            "date": "Answered April 28, 2019",
            "views": "73",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashley Vandegrift",
                    "user_href": "/profile/Ashley-Vandegrift"
                }
            ]
        }
    ]
}