{
    "title": "Is everything a coincidence? - Quora",
    "tags": [
        "Coincidences"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zohar Shaulov",
                "href": "/profile/Zohar-Shaulov"
            },
            "answer_text": "By the theories of ignorant, psychopaths scientists, yes life in the universe and on earth is a coincidence. Below is the truth that scientists refuse to except: There are many, many more planets in the universe that have evolved higher forms of life than our people in the testing school of Earth. Many of these beings coming from Betelgeuse star. These beings are pure energy. They can travel to our planet in a spirit form, but when they come toward the Earth atmosphere, they have to incarnate in a vehicle because Earth has different density and vibratory nature from their own planet. They can put on any form they wish. Most of the spirits on these other planets are of a higher vibrational rate than us on earth. It’s painful for them to come to earth in a spirit form because they have to lower their vibration. It’s like trying to condense a tornado into a glass. Many other entities are coming from Aldebaran and Sirius. These beings belong to the federation of 36 planets. Many beings have gathered from all over the universe to see the upcoming events and changes on Earth observing and monitoring different forms of life that exists in the ocean, our communications, our electronic capacity and our nuclear power. They also observe the evolutionary rate of our planet and to see if we will evolve to a higher degree, in order to take its place within the galactic federation. This is a spiritual confederation of advanced beings centered in light and love. One group of these beings are called the Watchers. The watchers helped form man on Earth. They were the ones who were involved in the seeding of man on Earth in the past. The Watchers have come to help in the evolution of man from his barbaric level into a high vibratory level. The Watchers have constant communications with their home planet and with all other planets. They have perfect knowledge of time and space and what is happening at all times. They use telepathy to interact with each other and with other beings. They are very advanced and they can send energies over great distances, or periods of time and space. They can travel faster than the speed of light through wraps of time. The various beings coming to Earth for different reasons. The very oldest set keeps an eye on the development of the Earth. Earth has been their pet project. This particular nation is a nation of thinkers and experimenters. They wanted to see if the predicted results would happened if they did a certain action at a very malleable time of the planet’s history. It’s been a steady pattern of mild interference since before there was life as such on Earth. The Earth was like a fertile womb. Life was developing here, but they speeded up the process by seeding the Earth with proto-life. So they could control the development and see what direction it would take, rather than letting the Earth develop its own natural life by itself. They have kept an eye on the Earth the whole time to keep track of the development of things. And to occasionally give things a little nudge here and there to keep them developing in the direction they want to develop. Other Vehicles that come here are from other nations of this civilization, and they come here for various reasons. One nation sends five vehicles on a regular basis to see if comparable technology has been developed here, so we would be ready to join the civilization, or at least open trade with some of the member nation of this great civilization. One nation has a more paranoid mind-set, and it sends vehicles just to explore the military installations to make sure we are not going to do any damage to the rest of the universe through our weapons development, and through our military, scientific exploration. There is another type of nation that comes just out of curiosity. They’re always trying to find out everything that’s going on with everybody. They knew from the distance Earth was from the sun that it could support life. And as they observed the planet they discovered there was indeed life here. But they saw what has happened regarding the political and religious structure, and they knew it would not be a good idea to come into direct contact with the life on this planet yet. Mostly because of the delicateness of the situation and the explosive violence always so close to the surface. And they’ve been keeping watch because they want to be in contact. They feel that the two civilizations together could build something really great, and develop into a galactic power. They see that we are trying very hard to develop, but we are not quite ready. It has to wait till the right time, and so they are waiting. They will make a test contact to see how well humans have developed. They come at different times, and disguise themselves so they can mix with the people. With their psychic abilities they can get a feeling for the general currents in social and mental developments. Occasionally they take a human and give them a physical examination, so they can keep track of how our life science are developing, since they’ve put great emphasis on that on their planet. They have a theory that, according to how advanced the life sciences are and how we take care of the race in general, regarding feeding, medical care, general health and nutrition that are paralleled by technological developments. There are many others that have been observing Earth, but they are the closest ones. They are the ones that would be apt to make successful contact with us first. They mostly are doing passive observing. They really don’t directly interfere with any human very often. It used to be once a century, but lately since the life sciences have been developing at an astronomical rate, it’s been more often. They feel that the time is very close when they can successfully contact humans, and start sharing their technology. These are the group of UFO’s that do travel to our planet. Their dimensions are closely to our own so we are able to perceive them without difficulty. There are several, several UFO’s that you never perceive, simply because their dimensions do not overlap enough with your own. These UFO’s dimensions of length, height and width correspond very closely to our own perceptions, but their dimension of time is different from ours. Consequently, time seems to be, from our point of view, distorted about them. They appear to travel very fast and very swiftly, because of this distortion of time. At the same time, when any humans have close encounters with these, time feels like it stretches out indefinitely, because once again time is being distorted. There’s quite a striving interstellar community in the galaxy. They all know about each other’s existence and many times they will have very close contact with each other. There is one group from a different arm of the galaxy that has quite a distance to travel to get to Earth. They have a great deal of interest in Earth, because they put some early colonists on the Earth millennia ago. And so, in a sense, human beings are their descendants. Some of these groups have gotten together and put a temporary quarantine on this area of space, to give Earth time to do her own development, because right now mankind is at a crucial stage. Just an eye blink ago, regarding universal time, mankind entered the nuclear age, and that is a crucial time for any culture. At this point they know they dare not to interfere or everything could fall apart into ruin. And they have to sit back and wait, to see how race newly introduced to nuclear power is going to handle and deal with it. If they deal with it successfully, then the quarantine is lifted, and they start sending technical advisers to coach the planet and the race, to get them ready to join the galaxy community. Advisers will be sent to spark new ideas, to answer questions, and to show the scientist some of the areas they thought were impossible to research, because of the currently formulated scientific laws that are actually not impossible at all. The main way mankind will fit into the plan of the galactic community is: They will be the major ones to approach and encounter new universes, and the galactic communities in these new universes. For mankind will have the questioning mind necessary to learn and understand these new universes, but will have the strength of not being unduly influenced by them. ",
            "date": "Answered August 12, 2017",
            "views": "22",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Raymond Hiegel",
                    "user_href": "/profile/Raymond-Hiegel"
                },
                {
                    "user_id": "Tom Enright",
                    "user_href": "/profile/Tom-Enright-13"
                },
                {
                    "user_id": "Benjamin Ibelegbu",
                    "user_href": "/profile/Benjamin-Ibelegbu"
                },
                {
                    "user_id": "Christian Drechsler",
                    "user_href": "/profile/Christian-Drechsler-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lars Finsen",
                "href": "/profile/Lars-Finsen"
            },
            "answer_text": "Well, the existence of life on Earth relies on several coincidences. In order to beget life, Earth needed to be within the Sun’s habitable zone for sufficient time that the first life processes could prevail and become stable. Lucky for us, it has remained within the zone for billions of years and will remain there for unknown eons if our activities don’t reverse the actions life has taken to keep the Earth habitable, such as lowering the atmospheric carbon dioxide content and storing methane in frozen soil and the depths of the ocean. We don’t know if other solar systems have been as stable, because we haven’t been able to observe them for billions of years. But because we haven’t observed life anywhere else, we can surmise that the stability of our solar system might be pretty unique. Probably it is the result of a rare phenomenon where planets formed in concentric accretion circles instead of the random distribution planets seem to have around other stars. Maybe the random distributions we see around other stars are the results of encounters with yet other stars messing up the system. Even with such persistent stability it is a tall order to beget such a complex thing as life. Life basically is a process of harvesting energy to preserve existence. A chemical process to prolong the existence of some chemical species would have to arise at random, and one entity possessing such a process would have to invent, also at least half at random, a way to store a recipe for this life-preserving process. Once you have these two major factors, evolution takes over and brings us to the present flourishing of life. But there are many minor coincidences along the way. Evolution relies upon coincidences. Mutations are random. And evolution only progresses because harmful ones (the vast majority) lead to extinction, while favourable ones lead to proliferation. Whether anything or anyone helped any of these coincidences to happen is another question that I suspect underlies the explicit question of the asker. You may well ask because there are some pretty strange coincidences involved. And they may be even more strange than what our present knowledge allows us to envision. If we find proof that they are impossible, then we do indeed have proof that something helped life on Earth to come into being—whether it was aliens, panspermia, or God. As long as we don’t know if they are impossible, then we can continue to research the origin without resorting to these last-mentioned entities. And if we eventually find out how those coincidences came to be, then we know that there were no aliens, panspermia, or gods interfering in the origin of life. ",
            "date": "Updated October 6, 2018",
            "views": "965",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vasilije Krivokapić",
                    "user_href": "/profile/Vasilije-Krivokapić"
                }
            ]
        }
    ]
}