{
    "title": "Is everything possible in an infinite universe? - Quora",
    "tags": [
        "Infinity (mathematics)",
        "The Universe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gabriel Armando Zenteno",
                "href": "/profile/Gabriel-Armando-Zenteno"
            },
            "answer_text": "Only according the the universe’s laws of physics, if it’s physical laws don’t allow something to happen then that won’t be possible. Also it would be difficult for it to be infinite, unless it is infinitely old or it started expanding at speed infinity. ♾ But if it did manage to be infinite than there could be copies of it’s worlds that exist in it. But a person would always make the same choices due to their personality unless the are influenced by a person that doesn’t exist in the other. If one has a disability, and the others doesn’t, if they have different DNA. 🧬 If they are the opposite gender if they are a different species or if their world looks a bit different. Other than those if they have the same personalities than all the choices they make are the same in the parallel planets, (that is if that universe has planets, or moons.) But our universe isn’t infinite, unless it is infinitely old (which it probably is only 14 billion years old.) or it started expanding infinitely fast. Our universe is infinite ♾ in a sense it is always expanding, but it isn’t literally infinite. If it were the multiverse could also be infinite, ♾ but there are only at least 5 googles universe in it. (That’s one with 500 0s.) ",
            "date": "Answered September 7, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Martin Cosentino",
                "href": "/profile/Martin-Cosentino-1"
            },
            "answer_text": "Mr. Khanna, with due respect for your valid question, the word ‘infinite’ is NOT a scientific word, does not belong in the science vocabulary, and, EVEN IF, such a thing as ‘infinity’ could possibly exist. there is NO way it can ever be tested. EVER. The word applies to philosophy, to theology and to spiritual beliefs, as well as poetry and imaginative thinking. But it has NO place in science whatsoever since, by definition, it is a concept that can never be realized, conceptually, physically, or any other stretch of human comprehension. ONLY with G-d, if you believe, are ALL THINGS POSSIBLE. I hope this settles a very confusing and deceptive issue about science. ",
            "date": "Answered September 5, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shiva Kumar",
                    "user_href": "/profile/Shiva-Kumar-458"
                }
            ]
        }
    ]
}