{
    "title": "Is ethical hacking like ethical killing? - Quora",
    "tags": [
        "Ethical Hackers",
        "Ethics of Everyday Life",
        "Ethical Hacking",
        "Ethics and Morality",
        "Killing",
        "Hackers",
        "Ethics",
        "Morals and Morality",
        "Computer Hacking (security)",
        "Computer Security"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gregg Schoenberger",
                "href": "/profile/Gregg-Schoenberger"
            },
            "answer_text": "In the sense that its using fancy excuses as a cover for what should be an immoral act, yes it is. By and large the people who like the term “ethical hacking” are involved with one social justice cause or another. In that role they see hacking a computer as bad, unless you do it to a machine owned by someone they are opposed to. That makes their activity just and those involved pure of sin. Of course if you are one of those targeted by such “ethical hackers” you don’t see it that way. What you see is good old-fashioned criminal activity by groups that are using a false sense of morality as a blanket excuse for their crimes. An example of this would be those opposed to nuclear weapons. A fair enough opinion. But then there are those that have the viewpoint that such weapons MUST be stopped at all costs. You already see their outlook has changed from willingness to debate to the use of force. Some members of this more radical view therefore take it unto themselves to attempt to hack into classified systems, planning to steal documents they can expose to the public in support of their agenda. The person assigned to safeguarding the networks at such a facility easily detects the probing. One thing leads to another, FBI arrives at the hacker’s doorstep, he/she lands in jail. Oh my, they are “ethical hackers”! No, they are violators of US codes regarding sensitive data. The judge agrees and off they go for a lengthy stay at Uncle Sam’s House of Rock Breaking and Other Painful Adventures. ",
            "date": "Answered January 5, 2020",
            "views": "50",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brent Eads",
                    "user_href": "/profile/Brent-Eads-1"
                }
            ]
        }
    ]
}