{
    "title": "Is economics a formal science or a social science? - Quora",
    "tags": [
        "Formal Education",
        "Science Education",
        "Philosophy of Science",
        "Social Sciences",
        "Political Science",
        "Higher Education",
        "Science",
        "Economics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mohammad Gani",
                "href": "/profile/Mohammad-Gani"
            },
            "answer_text": "Sorry to do some pontification on how to ask a question: There is no such thing as formal science. So putting this meaningless term only drives away people who would be happy to answer meaningful questions. It is also a big mistake to suppose that Quora is a school where the beginner can start asking elementary questions. Why not do some reading on science before asking questions that would be interesting? 1 Natural science versus social science Any science has the duty to discover a causal law that governs something happens. But causal laws may be of two categories: natural law and institutional social law. An example of natural law is that the rain falls from the sky towards the ground, and never does the rainwater shoot out from the ground towards the earth. An example of social law is the law of marriage. Nature does not care whether the mates are married or not, but society does. The law of marriage is man-made and hence is essentially arbitrary. You can find very different laws of marriage in different societies and at different times. The problem of science is to show how the proposed law determines the phenomenon being explained. Let us compare two things in respect of human fertility. First, biologists and demographers found out in the middle part of the last century that the natural fertility rate of a human mother is about 12.4. It is a number that captures the mean of a large sample. It does not mean that every mother must have 12.4 children, no more and no less. There is a greater degree of exactness in saying that every mother has two breasts and two hands and two eyes. A slightly less exact statement would say that a mother is a woman between the ages of 14 to 49 during which she may be pregnant and she may deliver a fully formed child. Secondly, you find that actual observed human fertility rate is one-third to one-half of the natural rate. This requires an explanation. Clearly, the failure of a natural law cannot be explained by invoking natural law itself. Some other law must be invoked. Now consider the possibilities. If all women live naturally in the natural homeland (the woodlands), then they would not care about the notion of marriage and would do nothing to prevent pregnancy during their reproductive years. But reliable data for fertility are available only for a few centuries. These data show that in large parts of Asia and Africa, the actual fertility rate was about 6.1 or 6.2 , roughly half of the natural rate. In northwestern Europe, the rate was about 4.1, which is about one third of the natural rate. How to explain this? All this happened before contraceptives or birth control. One resorts to the idea that most women by and large refuse to bear children outside marriage. A birth within wedlock seems to be a strong restriction good enough to cut off half to two-thirds of the fertility. If you try to explain why fertility in Ireland for example was so much lower than in India, you discover that the wide s adoption of primogeniture laws meant that sons younger than the first born had great trouble finding wives: which good woman would want to marry a virtual pauper who would not inherit any land, but must depend on the whim and charity of the first born brother? Primogeniture was strong enough to delay marriage by so many years that Irish women would avoid the birth of many children by not getting married. If this makes sense to you, you have got social science. It is something that explains social events by invoking social laws and by not invoking natural laws. ",
            "date": "Answered March 31, 2019",
            "views": "177",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Chan",
                "href": "/profile/David-Chan-287"
            },
            "answer_text": "There is no difference between formal science and social science. There is just Science. Science is characterized by evidence-based reasoning rather reasoning from received wisdom. It is a paradigm. Read The Fundamental Difference between Religion and Science ",
            "date": "Answered March 27, 2019",
            "views": "38",
            "upvotes": "0"
        }
    ]
}