{
    "title": "Is existence a property? - Quora",
    "tags": [
        "Analytic Philosophy",
        "Ontology (philosophy)",
        "Existence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Toni Kannisto",
                "href": "/profile/Toni-Kannisto"
            },
            "answer_text": "Yes: existence is a property. But the real question is: a property of what? THE INTUITIVE STORY Say I hold up two hands and proclaim: “There are/exist two hands”. This cannot be a statement about either hand, for neither of them – obviously – has the property of being two hands. Rather, this is a statement about the concept of hand: namely that it has two referents, or that two things in the world fall under this concept, or that two things instantiate this concept – there are many ways to spell this out. Now the same goes for the proposition: “Hands exist” or “There are hands”. Strictly speaking – and we do want to be strict on this highly technical issue – these do not assert anything about the things in the world that we call hands but, like above, about the concept hand: that it has referents at all, i.e. that at least one thing in the world instantiates hand-ness or has all the properties required of a hand. First we had two hands, then one (or more), so take this one step further and consider the case when there are none. Take the proposition: “Unicorns exist”. If existence were a property of objects, then also non-existence would be a property of objects – the property of not having the property of existence. We would have to say that unicorns do not have the property of existence. But since there are no unicorns, there is nothing that could have this property! So clearly existence cannot be a property of a thing. Rather it is this property: whether there is a thing at all – which cannot be a property of a thing. Since it is not a property of the thing, it is rather a property of our concept or thought of the thing. Not in the sense of whether the concept exists, but in the sense whether the thought refers to anything real. We can then parse “X exists” as a statement about the concept X, namely whether that concept is instantiated or refers to anything. Is this not a very intuitive and reasonable understanding of existence? If I have a thought of a unicorn, and I want to ask whether there really are unicorns, do I not ask whether something in the world corresponds to this thought I have? This is a question about the thought, and so the answer determines whether the property of existence applies to the thought or not. THE TECHNICAL STORY Concept and Object We have here a strict distinction, then, between a concept and an object. A concept is a thought, a general representation of some class of things. It is defined by the properties we think in it. For example, the concept bachelor is defined as a combination of unmarried and man.Concepts, in turn, refer to objects: things that have the properties we thought in the concept. So, the concept is something in which we think properties, objects are things that have these properties. The concept bachelor refers to things or objects or individuals that fulfil, instantiate, or have all the properties we think in the concept, e.g. they are unmarried and they are men.When we make an existential claim, we do not strictly speaking claim anything about things – e.g. actual hands – but about the concept that refers to these things. When we say, “X exists” or “There are Xs”, we are saying that the concept has referents – one or more. We are therefore attributing a property to the concept – not to any of its objects. Properties and Predicates of Concepts vs. Properties of Objects Now, let us tread carefully. Things have the properties that we think in their concepts. If my left hand (the object) had the property of existing, then I would have to think that property in the concept hand. For, again, things have the properties we think in their concepts. Existence is therefore not such a property as to be thought in the concept or its definition – it is not part of its meaning or thought-content.[*] In technical terms, this means that existence is not a predicate of the concept, and therefore not a property of its object: Predicates are sub-concepts of a concept, like unmarried and man are subconcepts or predicates of bachelor. The set of predicates make up the thought-content (also known as intension) of the concept.Properties are referents of predicates, i.e. their real counterparts in the world (part of their extension). That is, if a concept has a predicate, its object has the corresponding property.If we have the concept red, colour is a predicate in it, whereas colours as they manifest in the world where things are coloured are properties.Ok, so existence is not a predicate of the concept, for it is not thought in the meaning of the concept, and therefore it also is not a property of the object, for those are just real counterparts of the predicates of the concept. What is it then? Well: Existence is a property of the concept. In the insightful words of Frege, existence is a second-level property, a property that does not pertain to things or objects but to concepts. Concept is a first-level representation that refers to a null-level object. When that concept itself is taken as the object in thought, which happens when we ask does this concept refer, the thought that refers to it is a second-level representation (with a first-level representation as its object).Kant puts this less transparently by stating that existence is not a real predicate or a determination of a thing – his term for property. It is still a predicate in Kant’s terminology, just one that describes a property of a thought or concept rather than of the thing.We are, in essence, saying something about the thought we have of an object, not of the object itself, and we are saying simply: To the thought something in the world corresponds. This happens on a further level of abstraction, where the concept itself becomes the object of our thought, and where to this concept we ascribe the property that it refers or that it is instantiated – which is what is then expressed by the existential proposition “it exists”. This view easily avoids the problem of non-existence. Whether or not unicorns exist, we still have the thought or concept of a unicorn, so in either case we have no problem in ascribing the property of existence / non-existence to the concept of unicorn. (Whereas, as we saw, claiming that existence pertains to the object makes it difficult to see how claims of non-existence could be understood.) Summary and TL;DR Existence is not a property of a thing but of the concept of the thing – the thought we have of it. This does not mean that when we say “unicorns exist” we really only say that the concept “unicorn” exists. Rather, existence is an expression that is best analysed in terms of instantiation or referring: “Unicorns exist” is true if and only if the concept “unicorn” refers to something or is instantiated by something. This is a property of the concept, whether it is instantiated or not, and not of its object. Notes * This is the crux of the famous refutation of the ontological proof – a proof grounded on the idea that the concept of God already includes the property of existence. But no concept can include existence in this sense. As Kant puts it, a concept can even be thoroughly determined as to its thought-content, i.e. we could have listed all the properties its object should have, yet we can always ask whether that concept actually refers to anything. (The fullness of intension has nothing to do with whether it has a non-empty extension.) See Toni Kannisto's answer to What does Kant mean by \"Existence is not a predicate\"? ",
            "date": "Answered January 28, 2018",
            "views": "48",
            "upvotes": " View 36 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jinesh Sheth",
                    "user_href": "/profile/Jinesh-Sheth-11"
                },
                {
                    "user_id": "Edwin Tsang",
                    "user_href": "/profile/Edwin-Tsang-11"
                },
                {
                    "user_id": "Nirigaya Raku",
                    "user_href": "/profile/Nirigaya-Raku"
                },
                {
                    "user_id": "Paramyogi",
                    "user_href": "/profile/Paramyogi"
                },
                {
                    "user_id": "William Isun",
                    "user_href": "/profile/William-Isun"
                },
                {
                    "user_id": "Edgar Schönfeld",
                    "user_href": "/profile/Edgar-Schönfeld-1"
                },
                {
                    "user_id": "Peter Townsend",
                    "user_href": "/profile/Peter-Townsend-9"
                },
                {
                    "user_id": "Kim MacKayzee",
                    "user_href": "/profile/Kim-MacKayzee"
                },
                {
                    "user_id": "Tom Conway",
                    "user_href": "/profile/Tom-Conway-32"
                },
                {
                    "user_id": "Daniel Hungerford",
                    "user_href": "/profile/Daniel-Hungerford"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Beale",
                "href": "/profile/Thomas-Beale"
            },
            "answer_text": "The scientific realist position is that it is not. Aristotle, Hume, Kant, Russell and Frege all made this claim, although with different reasoning.  The simplest understanding is probably to say that if any other predicate is true, e.g. 'being red', 'being a Ferrari' of some individual entity, existence of that entity is presupposed, and it therefore makes no sense for it to have a property called existence, since that would add nothing to the object.  Russell's explanation turns on the idea that negation of existence of something (e.g. saying that 'Sherlock Holmes doesn't exist') has to be understood as generic statement rather than a negative predication of existence with respect to the individual entity 'Sherlock Holmes'. Things start getting interesting for those who love to debate what the 'existence of God' actually means. Usually God is understood as a necessarily existing being, but this poses problems for God's relationship with the natural universe, where existence of things is generally assumed to be contingent. If the whole universe is contingently existing, then God can't be inside it. If the whole universe is necessarily existing, we don't need God in the first place. But if God is placed outside the universe, how would beings within the universe have knowledge of him? And what does 'necessarily existing' really mean anyway? Some opt for the idea that 'God is existence', or that God is co-existent with everything. Clearly this presents problems for the mono-theistic religions, who take God to be an interventionist personality. At this point I generally give up and pour a glass of Shiraz and limit myself to contemplating the existence of marvellous wines. ",
            "date": "Answered May 14, 2015",
            "views": "267",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leonard Haid",
                    "user_href": "/profile/Leonard-Haid-1"
                },
                {
                    "user_id": "Michal Danilak",
                    "user_href": "/profile/Michal-Danilak"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta"
                },
                {
                    "user_id": "Franz-Josef Wollang",
                    "user_href": "/profile/Franz-Josef-Wollang"
                },
                {
                    "user_id": "Stephen Farrier",
                    "user_href": "/profile/Stephen-Farrier"
                },
                {
                    "user_id": "Jim Ashby",
                    "user_href": "/profile/Jim-Ashby"
                }
            ]
        }
    ]
}