{
    "title": "Is existence a property of a thing, or is it only the sum of all of its properties? - Quora",
    "tags": [
        "Ontology (philosophy)",
        "Metaphysics",
        "Properties",
        "Existence",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Kemper",
                "href": "/profile/Robert-Kemper-4"
            },
            "answer_text": "Here is the unconventional, but increasingly accepted answer. Existence requires consciousness. That is, to exist something must be observed. Einstein joked about whether the moon was really there when he wasn’t looking. However, one important tenet of science is that nothing at all may be said about an experiment not performed. On the other hand, such scientists as John Wheeler who said that we live in a participatory universe, Freeman Dyson who said that there is evidence of mind in the operation of the universe, and many others, believe that mind is a requirement for existence. What can be said about something whose wavefunction is not collapsed? What may be said about its properties? Of course that still leaves us with the “Hard Problem” of consciousness. ",
            "date": "Answered September 17, 2019",
            "views": "41",
            "upvotes": " Answer requested by Khalid Nezami",
            "upvoters": [
                {
                    "user_id": "Khalid Nezami",
                    "user_href": "/profile/Khalid-Nezami-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roger T Baker",
                "href": "/profile/Roger-T-Baker"
            },
            "answer_text": "Existence is a property of everything that exists. For example, we can say that dragons don’t exist but the idea of one does exist. We can imagine the properties of a dragon but it would lack the poperty of existence. Therefore, one could speak of the sum of the properties of a dragon but they would not add up to existence. ",
            "date": "Answered September 17, 2019",
            "views": "68",
            "upvotes": " View 1 Upvoter"
        }
    ]
}