{
    "title": "Is fascism really that bad? - Quora",
    "tags": [
        "Fascism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Linus Skov",
                "href": "/profile/Linus-Skov"
            },
            "answer_text": "Yes, fascism is, but I don't think that's what your really asking. There are a lot of elements to fascism and all of them can be used in an ideology independently of each other. We have plenty of proof of that in our modern world. I'd dissect it's key points into: Authoritarianism A big part of the Italian fascist (as well a German Nazi and Spanish Falangist) ideology was the notion that society had somehow changed into a state in which a full mobilization of all it's resources was both possible and necessary to solve a vaguely defined problem. For most fascist groups, the problems they wanted to solve were about easily recognizable but vaguely defined evils, such as the an economic recession, recent military defeat or a country losing it's past glory (this was mostly because these fascist nations had previously been European colonial powers). The notion of putting your own human rights aside and sacrificing yourself to rid society of a certain evil seems heroic, but it's usually a very awful thing. When people get that notion, they usually don't consider that the problem may just be a made-up scapegoat, like the Dolchstoßlegende (stab-in-the-back-myth) for the Nazis. Letting your own needs be secondary to those of the broader community is never a good idea, simply because the community is made up of people just like you. And for everyone to get a better standard of living, it's much better that you all demand it, instead of all rejecting it in favor of each other. Nationalism and cults of personality This, much like religious fanaticism, always leads to trouble. Nationalism has always been irrational and in extreme cases it leads to failed judgement on political issues. It keeps leaders from evaluating past mistakes and future challenges objectively. If every leader and every critic is convinced that they're living in the greatest country in the world, which is inherently good and effective, then it blinds them to all the mistakes they're making and can sometimes even lead to doctrines of national or racial superiority. This can, in turn, lead to ethnic conflicts and violence and sometimes genocide, as the ethno-linguistic or ethno-religious group in the majority decides to oust all other groups and finds justification in it's doctrine of ethnic superiority. Autocracy Making one person the sole unquestionable authority on every issue is never a good idea. It is simply not possible for one man to perfect his knowledge on every area that governing a country requires. One cannot hope to be an expert on matters military, economic, social and political all at once and certainly not to make every decision in a country without the experience that it requires. Following one man's orders to the letter is not a good idea, especially since the people who usually end up in a position to give those orders tend to be self-aggrandizing power-hungry megalomaniacs. Dictatorships and autocracies historically have an awful track record, with pretty much every modern dictator I can think of somehow violating human rights or allowing it to happen.  National syndicalist economics This is where I think fascism wasn't entirely wrong. I am, of course, always skeptical of planned economies, since they historically haven't had the best track record either. Conservative mercantilism and Soviet-style planned economy were terribly inefficient. But the re-organization of social groups along the lines of industries and their productions, rather than along the lines of wealth (such as the traditional working/middle/upper class spectrum) seems like a good idea. To make it more simple and understandable, I think organizing society vertically, instead of horizontally seems like a reasonable alternative. I'd agree to at least try it out. ",
            "date": "Answered December 24, 2015",
            "views": "78",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bisma Joyosumarto",
                    "user_href": "/profile/Bisma-Joyosumarto"
                },
                {
                    "user_id": "Donald Glander",
                    "user_href": "/profile/Donald-Glander"
                },
                {
                    "user_id": "Jason Burch",
                    "user_href": "/profile/Jason-Burch-34"
                },
                {
                    "user_id": "Joseph Smith",
                    "user_href": "/profile/Joseph-Smith-110"
                },
                {
                    "user_id": "Fabala West",
                    "user_href": "/profile/Fabala-West"
                },
                {
                    "user_id": "Julian DuPont",
                    "user_href": "/profile/Julian-DuPont-2"
                },
                {
                    "user_id": "David P. Black",
                    "user_href": "/profile/David-Black-219"
                },
                {
                    "user_id": "Dick Graes",
                    "user_href": "/profile/Dick-Graes"
                },
                {
                    "user_id": "Joseph Ingram",
                    "user_href": "/profile/Joseph-Ingram-11"
                },
                {
                    "user_id": "Alice Walsh",
                    "user_href": "/profile/Alice-Walsh-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aarav Jha (आरव झा)",
                "href": "/profile/Aarav-Jha-आरव-झा"
            },
            "answer_text": "Different historians will give you many different answers to that question. For one of the better analyses of what fascism \"is,\" I would consult Stanley Payne's A History of Fascism. In short, fascism is a radical, authoritarian, rightist response to Communism and liberalism. A fascist regime will espouse a fervently ideology in its political culture, bordering on a religious zeal. This zeal is espoused by a charismatic leader that reinforces his (really has to be a man) extreme nationalism with romantic symbols. The regime will enforce this ideology with a mass mobilization and militarization of the population, leading to an emphasis on masculinity and the vibrancy of youth. Fascism as a political philosophy emerged in early 20th century and took hold as the ideology of several political figures in Italy before being adopted and molded by Benito Mussolini. It would later be adopted by Adolf Hitler and taken to even greater extremes of militarization. Is it totally bad? What defines a \"bad\" regime? Technically, one might be able to see a nation prosper under fascism, depending on the leader in question. However, it might be difficult to see fascism as a long-term regime in a political system. Mussolini maintained fascism for quite some time, but he did so with great subjection of his people and countless rights abuses. The historical conditions necessary for fascism to emerge tend to make one consider it as a \"bad\" system I suppose, but with the right charismatic leader, one could probably see \"benevolent fascism.\" ",
            "date": "Answered May 26, 2018",
            "views": "2",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Niraj Chowdhury",
                    "user_href": "/profile/Niraj-Chowdhury-1"
                },
                {
                    "user_id": "Vivek Tanwar",
                    "user_href": "/profile/Vivek-Tanwar-6"
                },
                {
                    "user_id": "Mohaimin Riaz",
                    "user_href": "/profile/Mohaimin-Riaz-2"
                }
            ]
        }
    ]
}