{
    "title": "Is having a high IQ a blessing or a curse? - Quora",
    "tags": [
        "Blessings",
        "Intelligence Quotient"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruno Campello de Souza",
                "href": "/profile/Bruno-Campello-de-Souza"
            },
            "answer_text": "There is no overarching tendency for IQ to be correlated to Extroversion or Agreeableness, indicating that the very intelligent are not particularly prone to being more or less social than others. There is actually some evidence that those with a high IQ usually can deal with social interactions quite well. However, problems can occur in settings where one has limited choice regarding with whom one interacts or not, or how that interaction occurs, such as family, school and occupation. It is important to understand that IQ is measured through an ordinal scale, meaning that equal differences in scores correspond to equivalent differences in intelligence. This means that the difference between a person of an IQ of 126 (threshold for giftedness) and one with an IQ of 100 (average intelligence) is the same that exists between this second person and one with an IQ of 74 (threshold for intellectual disability). In the case of those with an IQ around 120 (above average or high normal), which is the mean for those with an education between high school an college, the difference between them and people with threshold giftedness is of only six points. Therefore, in settings where there is a fairly high level of education, there wouldn't be much of a discrepancy between those who, say, could have been placed in a gifted children program at school and those with whom they interact on a day-to-day basis. But that crucially depends on what arbitrary threshold one takes into account for \"giftedness\". As just stated, an IQ of 126 (top 5%) is just six points above the average of groups between high school and college-level education. Higher IQ's will imply a higher discrepancy. An IQ of 130 (top 3%) is 10 points higher, one of 145 is 25 points higher (top 0.2%), and one of 160 (top 0.01%) is a full 40 points higher. Of course, those with extremely high IQ's are very rare, but their discrepancy to those around them is quite relevant. Differences in IQ, even very large ones, need not at all become an obstacle for conviviality, friendship, or love, especially when the existence, intensity and modality of interaction are freely chosen by all parties involved. For instance, a high IQ person and a low IQ one could be spouses and have a gloriously happy marriage simply by focusing on what they appreciate about each other and what they enjoy doing together, with full liberty to negotiate their roles in the relationship. However, things might not be so harmonious between those who must perform certain tasks or assume specific roles with or in regard to precise others. For example, one's boss might have a much lower IQ and, as a consequence, make suboptimal workplace decisions containing inadequacies that are painfully obvious to a higher IQ subordinate employee. Sometimes, the employee can respectfully question the decision or politely offer an alternative, but there are limits to how often that can happen before boss and subordinate have effectively switched roles. This can lead to various types of tension for those involved. Those with extremely high IQ's will be more prone to experiencing these situations, as well as to being more annoyed by mistakes that are perceived as very clear and self-evident, but will have to endure them due to organizational hierarchy and authority. Similar things might occur in family stituations regarding relationship with one's parents, uncles, grandparents, older siblings, etc. This type of problem is particularly frequent in school, where students with very high IQ's are frequently forced defer to less intelligent teachers, professors, and classmates in certain tasks and activities where said students can do much better, having to accept the negative consequences in terms of lesser outcomes that are imposed upon them. Perhaps the most troubling version of these things comes when one sees problems arising before anyone else does, and, therefore, experiences greater anxiety and has trouble warning others that do not see things so clearly. It can also be very frustrating when one's capacity to contribute with more than what is currently being achieved is not recognized. All of this can see very much like a \"curse\". Of course, none of the above means to say that high IQ individuals are morally superior, error-free and should always be in charge of everything. None of these things is true, for even the extremely intelligent can be (or act) evil, make spectacular mistakes and/or be terrible leaders. It is just that being more capable of perceiving patterns and solving problems in relevant contexts tends to dramatically increase the chances that one experiences the aforementioned annoyances, tensions, and frustrations, even despair and bitterness. ",
            "date": "Answered January 12, 2019",
            "views": "954",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cynthia Montoya",
                    "user_href": "/profile/Cynthia-Montoya-18"
                },
                {
                    "user_id": "Sara Kalans",
                    "user_href": "/profile/Sara-Kalans"
                },
                {
                    "user_id": "Hussam Break",
                    "user_href": "/profile/Hussam-Break-1"
                },
                {
                    "user_id": "Cryptic Wintermoon",
                    "user_href": "/profile/Cryptic-Wintermoon"
                },
                {
                    "user_id": "Garry Hawkins",
                    "user_href": "/profile/Garry-Hawkins"
                },
                {
                    "user_id": "Renan Prado",
                    "user_href": "/profile/Renan-Prado-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susanna Viljanen",
                "href": "/profile/Susanna-Viljanen"
            },
            "answer_text": "It is a blessing which comes at a terrible price. High IQ (135 or more) is a great enabler - both in good and bad. It enables one to achieve and do things ordinary people can only dream of, engage in various activities and hobbies, and be good at them. I have a nice family, a good job and various interests and activities, both intellectual and physical. There are no such thing as “unrealistic expectations” for anyone with high IQ - they are perfectly attainable when high IQ meets hard work, and I learned the value of hard work in the swimming pool and gym in my teens. It is a good idea for a high IQ person to be a sportsperson in his or her youth. Yet high IQ also enables one to commit such crimes, atrocities and catastrophes the ordinary thug or gang banger can only dream of. Neither Adolf Hitler nor Josif Stalin were dullards. When high IQ meets strong ego, thick head and Dunning-Kruger effect, all doors are open for a disaster. But the price! It is terrible, and every Mensa member has certainly paid it. The price of high IQ is skewed communication range. The concept of communication range was first discovered by Leta Hollingworth, and it is the range of IQ where meaningful conversation between people is possible. According to Hollingworth, it is +/- 30 points of one’s IQ. Anyone below that sounds like a moronic dullard and above that like an incomprehensible geek. That does not sound much, until you realize that if you have IQ of 150, your communication range is from 120 to 180. It is some 8% of the whole society. You are effectively a loner, an outcast, a freak. You can find meaningful friendships, companionships, relationships belonging and significant other only within your communication range. That effectively makes you an outsider for the rest of the society. Top intelligent people are more likely to be alcoholics, drug addicts, have a death wish, live in involuntary celibacy, have strange hobbies - and commit suicide - than average people. According to Hollingworth, there is a “sweet spot” for IQ, and it is from 120 to 135. If one’s IQ is within that range, it is high enough to provide real advantage and be an enabler and make you a good leader. If it is higher than that, it offers no real advantage but becomes instead a liability. And most top intelligent people have experienced the ostracism, exclusion, bullying and outright persecution which follows from being different. If you are top intelligent and diligent, you are likely to succeed in the work force. If you are top intelligent and slovenly, you are likely to survive in the work force. But in neither case you are likely to really shine and make it because attaining the top positions require interaction with other people - and you are very likely to find you are outside their communication range and make a bad leader and bad manager. I am just another lab rat. I like my job, and while it isn’t exactly on the apex of academic food chain, it provides me intellectual challenge, meaningful relationships, enough freedom and flexibility and regular paycheck. I feel I am needed and a member of a team. Humans are herd animals, and happy when they can be amongst their own tribe. Hard work hardly works. It can make you a diligent and respected performer, but not a leader nor a manager nor an organizer. Slovenliness is like to get you sacked or side-tracked to a dead end job. The important ability is to distinguish between essential and non-essential tasks and be creatively lazy - to find the way of the least effort to manage the essential tasks and dismiss the non-essential. ",
            "date": "Answered June 29, 2017",
            "views": "31",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hans Rainer Kühn",
                    "user_href": "/profile/Hans-Rainer-Kühn"
                },
                {
                    "user_id": "Adam Lapointe",
                    "user_href": "/profile/Adam-Lapointe-2"
                },
                {
                    "user_id": "Kritkeerat Kaur",
                    "user_href": "/profile/Kritkeerat-Kaur"
                },
                {
                    "user_id": "Langston Mathews",
                    "user_href": "/profile/Langston-Mathews"
                },
                {
                    "user_id": "Bruno Schmidt",
                    "user_href": "/profile/Bruno-Schmidt-8"
                },
                {
                    "user_id": "Anthony Tepas",
                    "user_href": "/profile/Anthony-Tepas"
                },
                {
                    "user_id": "Danny Horvat",
                    "user_href": "/profile/Danny-Horvat-1"
                },
                {
                    "user_id": "Donna Quiroz",
                    "user_href": "/profile/Donna-Quiroz-4"
                },
                {
                    "user_id": "Alexandria Weiser",
                    "user_href": "/profile/Alexandria-Weiser"
                },
                {
                    "user_id": "Noah Hueller",
                    "user_href": "/profile/Noah-Hueller"
                }
            ]
        }
    ]
}