{
    "title": "Is half knowledge really dangerous? - Quora",
    "tags": [
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saurabh Pandey",
                "href": "/profile/Saurabh-Pandey-10"
            },
            "answer_text": "I don’t know how dangerous it can become, but it sure can bring shame and embarrassment in public. Though, I agree with the saying. It’s really Old, so it must be true. Right? (At least that’s what most of the Indians believe.) I have a simple example and few personal experiences too. Okay 1st that example. What if you just learn how to lock a door, but don’t know how to unlock it? This can easily become dangerous. This reminded me of a very Old mythological character from Mahabharata. Anyways, now moving towards my personal experience. I was in high school. I studied in a Hindi Medium boys school. That time we had 6 subjects (5 compulsory and 1 optional - Geometrical Drawing OR Sanskrit -_-). That year, state board added Computer as another optional subject but for some reason; school management didn’t want to include ‘it’ as an optional subject. (I think it was financial reason, obviously they didn’t wanna waste so much money on a new* computer lab and its maintenance.)[*They had a small lab for teaching DOS and basic windows UI.] Anyways, that’s a dangerous age, when you start getting aware of the changes, in you, around you and your mind wanna explore more and more to the deep dark roots of truth, buried by the adults around you. Totally Vyomkesh Baskhi/Sherlrok type feel & you start noticing the obvious clues. My younger brother was in different school and he already knew how to use a computer. So, I took his help and learned Browsing. Now, about other curiosities, I had a friend (Yama* Or M) in school. (We used to be the best friends, later attended the same college and were roommate for 1.5 semesters.) We used to hangout at each others places, walk a lot to explore new streets, Help each other in studies and share general stuff. But at that time I wasn’t aware that he was “The Born King of the West”. I was gullible, thought M was also the same. Unfortunately, he didn’t know how to use a computer. -_-[*Yama (Hinduism)] One fine day, he asked me that he needed some help with studies and need to do some “research” on this particular topic. Meanwhile, I kept hearing some “rumors” from His Subject about His Kindness. I was having a hard time digesting the obvious clues.So, while we were walking towards the nearest Internet cafe, I decided to confirm my doubts, but before that he, not only confronted, even convinced me to go and teach him browsing. :DI was an explorer after all, and not the internet explorer kind.Finally, after a half an hour walk, we reached at our destination. He got a coupon for an Hour of internet access and then chose the semi-open cabin. I sat on the right side chair, besides the wall, for the easy access of mouse. :)He sat on left, open side, just in case he need to go for peeing (Don’t know, had some organ related issues).He wanted to start R&D with PWd, I was a newbie, so I did as instructed, while teaching him web-browsing in an equivalent exchange.After 15 min. OR so, He asked me if He can try it Himself. I was naive enough to let Him. Hardly 10 seconds Later, screen froze at an image, something like this:  Image Source: Google That moment, I realized I forgot to ask my brother, what’s next?After random failed clicks and keyboard bashes, we decided to call for help, but with a different reality.(We were just doing regular ‘yahoo search’ when this pop-up came in front of us out of no where about scholarship at Hogwarts and we just clicked it, hoping for some magic instead of this shameful girl, we didn’t even know, who poses with her cat like this :| ) Score! He believed two innocent looking, studious high school kids, who just wanna go to Hogwarts on a magical scholarship (At least for the first time). Anyways, screen was unfrozen and we were more than ready to surf again. Deja Vu! Slightly different this time, as uncle gave us that “How-Disgusting-Kids-Have-Become-These-Days-Look-At-Me-And-Now-Look-At-Yourself.-No-Moral-Values-Or-Respect-For-Our-Culture.-Now,-Stand-Up-And-Get-The-Hell-Out-Of-Here-And-Never-Ever-Dare-To-Come-Back” Look. and asked us very politely, Not in front of anyone, to go home and never return to magical land of narnia. See, not Dangerous at all. :) Though our thirst of knowledge, didn’t end there. ;) P.S. if any cat lover felt offended by the nature of image above. Here, I’m making up to you. ;) Click Left Mouse button on the link below: PlayGround Fire - Timeline | Facebook ",
            "date": "Updated November 18, 2016",
            "views": "42",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amit Dhopta",
                    "user_href": "/profile/Amit-Dhopta-2"
                },
                {
                    "user_id": "Samruddhi Pathak",
                    "user_href": "/profile/Samruddhi-Pathak-2"
                },
                {
                    "user_id": "Prakhar Maini",
                    "user_href": "/profile/Prakhar-Maini-2"
                },
                {
                    "user_id": "Sneha Shankar",
                    "user_href": "/profile/Sneha-Shankar-37"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ratnakar Sadasyula-రత్నాకర్ సదస్యుల",
                "href": "/profile/Ratnakar-Sadasyula-రత్నాకర్-సదస్యుల"
            },
            "answer_text": "Half knowledge becomes a dangerous thing, when you actually assume that you know enough to take a decision. As long as you are true to yourself and aware that  what you know is only one half of the picture, there is no harm in it. But when you act, or forced to act, basing on only half of what you know, you are in for some serious trouble.  It is akin to exploring a cave, where you only know how to enter it, but have no idea how to get out of it. Now here, as long as you explore the cave to the extent you know about it, where you really do not have to search for an exit route, there is no issue. But when you go deeper into the caves, and you reach a point, where you really do not know how to come out of it, your half knowledge is proving to be fatal.  The key here is knowing the limitations of your knowledge, to what extent you can pitch in. Too often, we get carried away by the false praises of people around us, about how intelligent or knowledgeable we are, and begin to believe we actually know it fully. You try showing off your swimming skills, by going deep into the sea, when in reality, you have no knowledge of the depth there. Always take a stock of how much you really know,before you take a decision. If you do know something, use it as an additional information, than actually basing your decision entirely on it. ",
            "date": "Answered April 29, 2013",
            "views": "57",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Oussama Chemrouk",
                    "user_href": "/profile/Oussama-Chemrouk-1"
                },
                {
                    "user_id": "Rakshit Yadav",
                    "user_href": "/profile/Rakshit-Yadav"
                },
                {
                    "user_id": "Sindhuri Bhattaram",
                    "user_href": "/profile/Sindhuri-Bhattaram-1"
                },
                {
                    "user_id": "Vinod Amanchi",
                    "user_href": "/profile/Vinod-Amanchi"
                },
                {
                    "user_id": "Olive Varsha",
                    "user_href": "/profile/Olive-Varsha"
                },
                {
                    "user_id": "Sachin Bansal",
                    "user_href": "/profile/Sachin-Bansal-9"
                },
                {
                    "user_id": "Rishabh Mankad",
                    "user_href": "/profile/Rishabh-Mankad"
                },
                {
                    "user_id": "Aileen Tang",
                    "user_href": "/profile/Aileen-Tang-3"
                },
                {
                    "user_id": "Abhijeet Shinde",
                    "user_href": "/profile/Abhijeet-Shinde-16"
                },
                {
                    "user_id": "Tamilselvan Mahalingam",
                    "user_href": "/profile/Tamilselvan-Mahalingam"
                }
            ]
        }
    ]
}