{
    "title": "Is it possible to make an absolutely irrefutable argument? - Quora",
    "tags": [
        "Logic (philosophy)",
        "Debate",
        "Understanding Romantic Relationship Dynamics",
        "Behavioral Psychology",
        "Understanding Human Behavior",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ömer Aygün",
                "href": "/profile/Ömer-Aygün"
            },
            "answer_text": "Perhaps not. But your strategy does not seem to me to be reliable because, while refuting the argument, you will also be making one, and while invalidating \"our system of logic\", you will be using one that is suspiciously similar to \"ours\". For instance: (1) All along your refutation of the argument, you will be necessarily assuming that it is the one and the same argument. (Cf. the principle of identity) (2) While you refute the argument, you will be making a certain claim, not its opposite. (Cf. the principle of non-contradiction) (3) Further, you will making your claim as a refutation of the argument, eliminating any third option. (Cf. the principle of the middle excluded) So, I think your question stands, but your strategy for refuting possible answers is self-refuting. ",
            "date": "Answered January 2, 2014",
            "views": "274",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Caswell",
                    "user_href": "/profile/Paul-Caswell-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brett Williams",
                "href": "/profile/Brett-Williams"
            },
            "answer_text": "Your question drew a connection between two disparate things I never thought I would ever connect, David Hume and Presupposational Apologetics. Hume, essentially, points out that assuming that things will be the same tomorrow is something we can't determine through reasoning because we have no way to induce or deduce that conclusion other than behavior in the past. Presupposational Apologetics has the conceit that it can create irrefutable arguments for Christianity by making Jesus an axiom and attacking any detractors through Ad Hominum arguments. Literally, if you disagree you are an adulterer and are going to hell. I think people forget that at logic is a human construction meant to provide a common playing field for disparate ideas to be evaluated against each other. This is interesting. If you're going to play Logic Calvinball, as you advocate in the question, it is no longer interesting. ",
            "date": "Answered January 1, 2014",
            "views": "18",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jesse Franklin",
                    "user_href": "/profile/Jesse-Franklin-11"
                },
                {
                    "user_id": "Costya Perepelitsa",
                    "user_href": "/profile/Costya-Perepelitsa"
                },
                {
                    "user_id": "Ryan Allen",
                    "user_href": "/profile/Ryan-Allen-5"
                },
                {
                    "user_id": "Abhinav Varma",
                    "user_href": "/profile/Abhinav-Varma-2"
                },
                {
                    "user_id": "Alex Suchman",
                    "user_href": "/profile/Alex-Suchman"
                },
                {
                    "user_id": "Niculai Lee",
                    "user_href": "/profile/Niculai-Lee"
                }
            ]
        }
    ]
}