{
    "title": "Is imagination a creation of the mind or are we living in an imaginary world? Which one is true? - Quora",
    "tags": [
        "How True Is X?",
        "Imagination",
        "Reality",
        "Creativity",
        "Comparisons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bibhu Rout",
                "href": "/profile/Bibhu-Rout"
            },
            "answer_text": "Very interesting question which requires subjective interpretation. There are two questions hidden within - What is an imagination and can imagination create a world? How do we judge something? I believe, through acquired skills of evaluating, learnt over period of time. Believing in science, GOD, human beings, self are all result of that acquired skills. If none has ever told me that earth is revolving around Sun, probably, I would have thought the Sun as a big Orange ball who winks in the mornings and sleeps in the night. It is because of education( again an interpretation by some scholars), we get to know about certain facts. Sometimes that education can be misleading e.g. until Newton, Galileo  etc were born and educated the entire world of Solar system, gravity etc, people carried the impression that its the act of GOD and no reasons can be associated to it. Until Hisenburg uncertanity principle came to light, there was no randomness in any scientific theories. Now most of the principle revolves around finding that uncertanities within certainties - the principle of probability has taken a new dimension all together. The matter has become anti-matter and real numbers have become imaginary number. When I was kid, I was told all number system have associative  properties i.e. A + B = B+A. Sometime back I was reading some number system, which negates this associative properties of number. Some mathematician have given interpretation that movement of objects are associated with other random factors, which can violate the associative properties of number. If that is validated and accepted, probably whole basics of number systems, we have read till date, might be history in future. My point is everything depends upon interpretation and acceptance of those interpretation. If there is acceptance, imagination becomes reality. If there is rejection, imagination is confined to individual. Who has seen the GOD? Probably no one. But the believe that GOD exists and solves the mysteries by some magical sticks, helps human being to come out of the problems with flying colors. Science might argue it's mere coincidence or will power of individual which solves the problems, whereas a strong GOD believing person might argue in favor of the UNSEEN. We have parameters to measure the power of eyes, there are instruments which measure the power of ears, but there are no instruments which measures the power of imagination. And every time we keep hearing that imaginations is what makes human-being different from one another. If imagination is so powerful, there is no instrument to measure it yet, it might be possible that once its measurable, we get to know that world that of ours is an imaginary world rather than real. ",
            "date": "Answered November 23, 2014",
            "views": "977",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Riti Verma",
                    "user_href": "/profile/Riti-Verma"
                },
                {
                    "user_id": "Sunil Kumar",
                    "user_href": "/profile/Sunil-Kumar-11587"
                },
                {
                    "user_id": "Muhammad Suleman",
                    "user_href": "/profile/Muhammad-Suleman-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yatit Thakker",
                "href": "/profile/Yatit-Thakker-1"
            },
            "answer_text": "A mind can imagine, even if it is not very creative. The fact that it can imagine means the reference point (the world) has to be somewhat concrete, not imaginary.  If one could imagine something and it became real, then we would be living in an imaginary world that is prone to being changed by the imaginations of its inhabitants. Now that would be scary. ",
            "date": "Answered November 16, 2014",
            "views": "814",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Swapnil Kumar",
                    "user_href": "/profile/Swapnil-Kumar-19"
                }
            ]
        }
    ]
}