{
    "title": "Is it possible to unify determinism and indeterminism? - Quora",
    "tags": [
        "Indeterminism"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Moore",
                "href": "/profile/David-Moore-408"
            },
            "answer_text": "The Asker of this question (Charles Ventin) has shown a significant knowlege of science and skill in philosophy in a number of his posts on Quora. He has kindly asked me to answer a couple of queries (like this one) that are well beyond my expertise. Nevertheless, like the fool I am I will happily prattle: Of course, the answer is ‘Yes and No’ A couple of trite reasons for the affirmative answer include petty points from linguistics (they are both words) and metaphysics (they are concepts that are both ‘child nodes’ of the philosophy of causality), but we should just state those and move on. The negative case is much more significant. According to the rules of deduction, manipulation and other causality theories to hold, at least a form of determinism is required. If the universe is truly indeterministic then processes like this are illusions  Now, (like our consciousnes) it may be true that they are illusions, as the conflicts between the Newtonian and Copenhagen interpretations of physics seems to suggest, but such a conclusion is near-meaningless or at least useless to us. My meager understanding of ‘waveform collapse’ and relativistic gravity will not change my attempt to catch my phone when I drop it. It could spontaneously transform into energy with some perturbation of the Higgs field, it's just that my little mind is very confident of it's bet that such a strange event will not occur without some warning. This, then, is how minds work. They decide what constitutes ‘warning’. With the extremely large number of ‘training examples’ we are exposed to, our little Neural Nets develop association, then rules, then metafunctions which make rules themselves confirm to the fuzzy logic that constructed them.  I have stolen the graphic above from Joscha Bach (Cognitive AI). I was only recently introduced to his work by another Quora friend (Matt Ducker), and I now consider him a genuine leader in the cognitive sciences. His work goes a long way toward unifying determinism and indeterminism, because (of course) it is in our minds that those ideas really exist. I have some degree of training in Cognitive-Behavioral Therapy. CBT has some good evidence behind it. It works (https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3584580/). But how? To those who know some of the history of Psychology, the mashing of the terms Cognitive and Behavioural into some apparently ‘unified therapy’ is at least paradoxical if not oxymoronic. The tradition of Behaviorism is effectively one of causal determinism. We are animals that react to stimuli. On the other hand Cognitive psychology proposes the existence of the mind as an independent entity and defends such concepts as Free Will from determinist slander. Hence, humans are currently construed by the best available science as Machines that Think. How can this be? Machinations are Deterministic, Contemplations cannot possibly be. We have Quanta and we have Qualia. Only one of these can be computed. Thus, can determinism and indeterminism be unified? Not logically, but it occurs in you yourself. ",
            "date": "Updated January 17, 2017",
            "views": "579",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Julia Pugliese",
                    "user_href": "/profile/Julia-Pugliese"
                },
                {
                    "user_id": "Tom Robinson",
                    "user_href": "/profile/Tom-Robinson-110"
                },
                {
                    "user_id": "Charles Ventin",
                    "user_href": "/profile/Charles-Ventin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Albert Fonda",
                "href": "/profile/Albert-Fonda"
            },
            "answer_text": "In a sense, Yes. We generate working models which largely and pragmatically account for certain of our observations. One model may best account for one set of observations, while a differing model does so for another set. We select one model or another depending on our interests. The model of free will is well suited to our habituation when very young (even prenatally) to the apparent chain of causality from expectation to fulfilment. We feel that our expectation caused the result. The actual chain may be from the Big Bang to both expectation and fulfilment, for which the working model may be called determinism. We then have the option of summoning either of two models, the physical and the psychological, to any given expectation and fulfilment. Neither model is absolutely known to be perfect, true, unassailable. We can grant the physical regularity which underlies the psychological, but the underlay does not negate the overlay. Each has its practical uses. The unification lies in the versatility of the extremely complex human mind as a generator of useful models of whatever “reality” is encountered at a particular time. Nothing stops us from switching horses in midstream whenever we choose. If the shoe fits, wear it. If not, make another. Amending my answer of 12/12/16, Allan Bloxham just posted in Quora a version of the same argument at: If we are destined or fated to do something or to meet someone, how can we have free will?. I quote: “For most people the two models for reality that you are asking about seem to be mutually exclusive. Our human lives, (or the world’s future), are either unknowable because they change every second depending on the free will choices made by every living being, or they are pre-determined and hidden to almost all of us by some veil. “Most humans prefer the idea of ourselves having free will, because : (a) the alternative makes our life sound like the blind slavery of automatons, and (b) to our senses it is the way unfolding events quite clearly appear to happen. “But of course, the world is full of examples of things happening contrary to both our personal preferences, and to the way things appear, e.g. we all get sick, have accidents, grow old, and die despite our preferences. ...Destiny and free will are (quoting in turn one Wayne Liquorman) simply strategies for making sense of the vastness of ‘What Is’. “Both terms are a kind of practical shorthand in which the holographic universe is made linear, and this linear conception is simply an overlay. It’s an intellectual, organisational overlay on top of the Totality of ‘What Is’, (in the same way that whichever transparency we place over the light source of an overhead projector will determine the image the image that we see projected in front of us onto the wall.) “Neither destiny nor free will actually describes the functioning of the universe. Yet people subscribing to one overlay endlessly argue with people subscribing to the other overlay. There is ultimately neither destiny nor free will. There is only ‘What Is’. (End of both quotes.) I see this as supportive of my above argument that “The actual chain (of causality) may be from the Big Bang to both expectation and fulfilment. ...Unification lies in the versatility of the extremely complex human mind as a generator of useful models of whatever “reality” is encountered at a particular time.” “All these are versions of the same concept: that from an early source issue both determinism and free will. Deliberation as between them is unnecessary; both are partial descriptions of a not fully knowable reality.” QED! See also the superb 12/18/16 answer by William Waters to the related question Why would it have to be one rather than multiple?. Each treats two seemingly opposed propositions as to reality. Consider Waters’ text with the Free Will/Dualism proposition substituted for the One/Many proposition: “The Free Will/Dualism distinction is just another distinction that humans make in order to establish a way of referring to the phenomenal world, that they may feel comfortable with. When we are able to see through the many distinctions, we do not destroy their usefulness, but see that none of the distinctions are absolutely true or even necessary except, to attempt to communicate our experience to others… “The phenomenal world is just what it is, and it is not really within our abilities to “say” what it is. It is just too much for words (our finger painting) to render…. But we obviously feel compelled to try and that is just part of being human… “From a scientific point of view it is like trying to describe the super-set from the perspective of the sub-set, I’m pretty sure that doesn't work….” This works, doesn’t it! The consolidation of very event since the Big Bang into unbroken causal chains does not destroy the usefulness of our perception of free will; it is just part of being human! ",
            "date": "Updated December 18, 2016",
            "views": "325",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Chris Smith",
                    "user_href": "/profile/Chris-Smith-832"
                }
            ]
        }
    ]
}