{
    "title": "Is it true that the sky is actually green in colour, not blue? - Quora",
    "tags": [
        "Green (color)",
        "Green",
        "Sky",
        "Blue (color)",
        "Color Theory",
        "Colors (vision)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Courtney Seligman",
                "href": "/profile/Courtney-Seligman-1"
            },
            "answer_text": "Take a look at it. Does it look green to you? If so, you have some weird kind of color-blindness. If it looks blue, you’re seeing it correctly, because that is the color it usually has. However, its color is due to scattered sunlight, which is a mixture of all colors. Short wavelength colors like violet and blue are scattered more easily than long wavelength colors like orange and red, so when there isn’t much air around (as on the top of a high mountain), the sky looks dark blue, or even sort of purplish-blue, because not enough of the longer wavelength colors are scattered at all. Closer to sea level, where there is more air to scatter light, blue is by far the predominant color scattered, so the sky looks blue; but if there is some haze in the air, so that it is easier to scatter longer wavelengths, then the color shifts to bluish-white. And when the Sun is setting, and its light has to go through a lot of air and haze, the air near it looks reddish-orange, because all the shorter wavelengths are scattered away from the path of the sunlight before reaching our eyes. (At such a time, the sunlight that reaches mountains on the opposite side of the horizon is the same color as the air near the setting Sun, so the mountains look reddish where they aren’t completely in shadow; this was first noticed in the Alps so it is called alpenglow.) ",
            "date": "Answered August 13, 2019",
            "views": "121",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Naumann",
                "href": "/profile/Robert-Naumann-2"
            },
            "answer_text": "I don’t know why anyone would think the sky is green. A cloudless sky appears blue because of Rayleigh scattering of the sunlight by the molecules that make up the atmosphere. According to the theory worked out by Lord Rayleigh, the amount of scattering is proportional to the fifth power of the wavelength. Since blue light has the longest wavelength in the visible spectrum, it is the predominant color. ",
            "date": "Answered August 12, 2019",
            "views": "17",
            "upvotes": "0"
        }
    ]
}