{
    "title": "Is it okay to change how a character is referred to in third-person limited? - Quora",
    "tags": [
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Don Daniels",
                "href": "/profile/Don-Daniels-7"
            },
            "answer_text": "That would depend on the story, and what you mean by “how a character is referred to.” For instance, in Harry Potter, there didn’t appear to be any trouble referring to the Dark Lord also as, Lord Voldemort, or as Tom Riddle. If the story provides a logical reason for the change, and it’s done clearly enough to not confuse the reader, then it shouldn’t be a problem. But there should be a reason why the character is being referred to differently. It could be a reformed outlaw trying to escape his past, or someone becoming an outlaw and trying to build a reputation that will intimidate future victims. It could be a superhero trying to protect the ordinary people he/she knows, or a cop going undercover. I’m planning on a con man character for a series I’m doing whose persona involves never using the same name twice, but will always having a pattern. For instance, he might start with Joseph Harrison. A few pages later, he’ll introduce himself as Harry Jacobson, Then as Jacob Stevenson. Then as Steven Williamson. Then William Peterson. Peter Robertson. When the other characters catch on, anybody with a name like that, will be suspected of being this person. ",
            "date": "Answered July 12, 2020",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kaden Woltje",
                "href": "/profile/Kaden-Woltje"
            },
            "answer_text": "Yes. In fact, you could do this in first person as well. Third person omniscient is the only perspective where you couldn't. Thanks to a little thing called the unreliable narrator, you can shift many things following a revelation. For example, imagine a fantasy series where there is a very skilled warrior, who is believed to be a man, but later is revealed to be a woman. If the narrator is not privy to this information at first, but is later on, the shift from masculine pronouns to feminine pronouns can really help to give the perspective depth. A good example that comes to mind is from the Disney movie “Tangled.” Throughout the film we know Rapunzel's companion as Flynn Rider, but around the halfway point we learn that his name is Eugene Fitzherbert. After this moment, Rapunzel refers to him as Eugene in many instances, but never did before. If this had been written as a book from third person limited, following Rapunzel's perspective, a similar shift would occur in the prose. Hope this helped. ",
            "date": "Answered July 12, 2020",
            "views": "57",
            "upvotes": "0"
        }
    ]
}