{
    "title": "Is it a problem that I feel 'boredom' nearly everyday for the past few years to the point where I wonder if it's even 'boredom'? - Quora",
    "tags": [
        "Dealing with Boredom",
        "Boredom",
        "Understanding Emotions",
        "Mental Health",
        "Emotions",
        "Understanding Human Behavior",
        "Psychology of Everyday Life",
        "Human Behavior",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Moshe Katz",
                "href": "/profile/Moshe-Katz-5"
            },
            "answer_text": "Boredom is a term that often gets thrown around a lot. It describes the feeling of not doing anything productive. The opposite of bored is busy. Busy means you’re either doing something at the moment or you need an excuse to not do something else. Boredom is not necessarily a problem although it is not recommended. Boredom can lead to depression and we all know how fun that is. If your feeling bored all the time it’s probably because you’re doing something you don’t enjoy. Or doing the same thing to much times. If you’re bored your entire life it doesn’t mean it’s not called boredom it means you have to change some things around. ",
            "date": "Answered March 4, 2020",
            "views": "212",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eddy Frix",
                "href": "/profile/Eddy-Frix"
            },
            "answer_text": "No but it’ll take awhile for humans to get that; its not bordem, its this model of life it hasnt evolved so this feeling will infect everyone before too long. We as a spieces should’ve been wiser to internal healing and structure but we cared more for external bindings. Try hiking with a big group in a lush national forest, get into exploring the earth on foot WITH PEOPLE for security. It’ll help with the bordem feeling ",
            "date": "Answered February 18, 2020",
            "views": "47",
            "upvotes": "0"
        }
    ]
}