{
    "title": "Is immorality objective and absolute in its norms and principles? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Derek Sathre",
                "href": "/profile/Derek-Sathre"
            },
            "answer_text": "It has exceptions. Like eating dead people. In general, it’s sick as in you’ll get sick. On the other hand, if you are stranded in a plane crash you have to eat something. So it takes a little thinking about the context. In general, eating dead people isn’t really a sound practice. When in the plane crash, it would be moral to feed others the dead body to keep them alive. Here you have a virtue of life. Life is more important in this context than the immorality of eating the dead. You have to look at the constraints that people had to deal with in valuing one virtue over another. We have to weigh all our virtues and it gets kinda relative (the people are relative not the morals) but some morals trump other morals in context. It doesn’t mean there aren’t exceptions to a moral, but it also doesn’t mean the moral has no reason and is relative. It’s a way to conduct yourself. How about what the British did to American that caused the American Revolution. In absolute terms, freedom was way more important than paying taxes that they’d never see. So breaking the British law was more valuable. Ask, “At what cost?” Is it moral to kill someone… generally no, but if they are a serial killer and doesn’t want to stop and wont stop… you are constrained and need to value the greater good over that person. It’d be immoral not to act. Morals are tentative. Just like truth is. It’s a human element though, so it’s not an exact science, yet anyway. Would you kill a baby if it’s crying will get the group killed? I mean the baby will be dead either way… ",
            "date": "Answered February 3, 2019",
            "views": "189",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zhang Seralrop",
                    "user_href": "/profile/Zhang-Seralrop"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sabri Shahin",
                "href": "/profile/Sabri-Shahin"
            },
            "answer_text": "The God who created people has empowered them with original gifts; the gifts of minds, intelligence, and the conscience are internal personal Prophets for each human to guide him to the basic measures of the good things to do and the bad things to avoid People who never heard of Prophets are not forsaken because God has equipped them by internal prophets and they will be guided to the wisdom by their original gifts The person can have morality based on the gifts of reason and conscience if he likes for others what he likes for himself (applying the golden rule) The person becomes immoral when he does not make use of the gift of conscience and allow himself to be wicked and unjust. We have not created the gifts of conscience and reason. Morality and good deeds are not enough for salvation; salvation requires obedience and repentance in addition to the good deeds. We should remember that the true religion teachings will not change Feeding the hungry is a virtue as taught by all prophets and it will remain so until heaven and earth pass away Defending the oppressed is a virtue as taught by all prophets and it will remain so until heaven and earth pass away Self-constraints, patience, and resisting temptations are virtues, and will remain so until heaven and earth pass away Abortion is a sin because it means killing an innocent soul and it will remain as a sin until heaven and earth pass away Homosexuality is a sin as taught by all prophets Premarital sex is a sin as taught by all prophets Sex outside marriage is a sin as taught by all prophets and it will remain as a sin until heaven and earth pass away Creation of male and female is one of the signs of God; marriage is the recommended relationship between male and female. Qur’an 30:21 ‘And one of His signs is that He created for you spouses from among yourselves so that you may find comfort in them. And He has placed between you compassion and mercy. Surely in this are signs for people who think’ The common ground of all religions and all different sources of wisdom is ‘the golden rule’ What you do not want done to yourself, do not do to others. Confucius Do not do unto others whatever is injurious to yourself. – Zoroaster, Shayast-na-Shayast 13.29 “Do not do to others what angers you if done to you by others.” - Socrates \"What thou avoidest suffering thyself seek not to impose on others.\"— Epictetus (55-135) \"Do not do to others what would anger you if done to you by others.\" – Isocrates Putting oneself in the place of another, one should not kill nor cause another to kill – Buddha One who, while himself seeking happiness, oppresses with violence other beings who also desire happiness, will not attain happiness hereafter. – Buddha, Dhammapeada, 10 “Resolve to be tender with the young, compassionate with the aged, sympathetic with the striving and tolerant with the weak and wrong. Sometime in your life, you will have been all of these.” Gautama Buddha No one saves us but ourselves. No one can and no one may. We ourselves must walk the path ― Gautama Buddha, Sayings Of Buddha “Remember always that you are just a visitor here, a traveler passing through. Your stay is but short and the moment of your departure unknown.” Dhammavadaka “It is a man's own mind, not his enemy or foe, that lures him to evil ways.”  ― Gautama Buddha Hatred does not cease by hatred, but only by love; this is the eternal rule Buddha One should never do that to another which one regards as injurious to one’s own self. This, in brief, is the rule of dharma. Other behaviour is due to selfish desires. – Brihaspati, Mahabharata. Hinduism Analysis of those teachings show that they are similar to the prophet’s teachings, similar spiritual fruits from similar gardens watered by the same spring, inspired and gifted by the same great creator He who sows the ground with care and diligence acquires a greater stock of religious merit than he could gain by the repetition of ten thousand prayers Zoroaster (c.628 - c.551) It is o.k. to question the purpose of life; that is a wise thing to do. What is the value of life if we do not know the purpose of that life? “It is the greatest good for an individual to discuss virtue every day...for the unexamined life is not worth living” - Socrates ",
            "date": "Answered February 16, 2019",
            "views": "187",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Zhang Seralrop",
                    "user_href": "/profile/Zhang-Seralrop"
                }
            ]
        }
    ]
}