{
    "title": "Is it right to say 'nothing is impossible' to your children? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Wyatt John",
                "href": "/profile/Wyatt-John"
            },
            "answer_text": "It’s not wrong to say nothing is impossible. As a parent, why would you want to limit your children’s potential? The problem doesn’t usually come with the dream, the problem comes with the work. If you teach your children that they have to work to obtain their dreams, then there will be some element of reality to the statement because you will be adding, nothing is impossible if you work for it. Also, the Bible teaches “I can do everything through Him who gives me strength.” Phil. 4:13 and I fall back on that all the time. I wouldn’t be who I am or where I am if it weren’t for the strength given to me by God. If you teach children to trust God and abide in Him and if they work very hard for their dreams, anything is possible. ",
            "date": "Answered July 23, 2017",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "J L Van Dijk",
                "href": "/profile/J-L-Van-Dijk"
            },
            "answer_text": "I agree with you—I have always wondered why parents tell their children that nothing is impossible for them. I know it's supposed to be encouraging, but it’s simply not true. It may cause a lot of anxiety for a child who thinks that the impossible is expected of him. Not everyone has the prowess to be a great sporting star or the intelligence to be an astrophysicist or the president of the United States. (Although …) Parents are obviously trying not to place limits on their kids. And if there is a choice between parents being falsely encouraging or unremittingly negative, encouragement is definitely the better option. With negativity, the child may not wish to strive for anything. Encouragement often spurs us on to achieve more. I don’t tell my kids they can be anything they want—however, in fields where they have ability, I tell them they can achieve wonderful things by putting in effort and following the path to success that has been laid out for that field. That might not be quite as exciting to hear, but it’s a lot more realistic. We have to remember that there’s no shame in not being able to do everything, or not being number one at whatever we do. The world is made up of people with various abilities and skills, and we need them all. ",
            "date": "Answered July 20, 2017",
            "views": "315",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Channel Chitwood",
                    "user_href": "/profile/Channel-Chitwood"
                },
                {
                    "user_id": "Norman Irving",
                    "user_href": "/profile/Norman-Irving"
                },
                {
                    "user_id": "Doreen Knight",
                    "user_href": "/profile/Doreen-Knight-1"
                },
                {
                    "user_id": "Linda L Levine",
                    "user_href": "/profile/Linda-L-Levine"
                },
                {
                    "user_id": "Tim Olofsson",
                    "user_href": "/profile/Tim-Olofsson"
                },
                {
                    "user_id": "Faith Abbott",
                    "user_href": "/profile/Faith-Abbott-3"
                },
                {
                    "user_id": "Gaurangi Patel",
                    "user_href": "/profile/Gaurangi-Patel"
                },
                {
                    "user_id": "Dave Gouldstone",
                    "user_href": "/profile/Dave-Gouldstone"
                },
                {
                    "user_id": "Raymond Tao",
                    "user_href": "/profile/Raymond-Tao"
                },
                {
                    "user_id": "Gill Bullen",
                    "user_href": "/profile/Gill-Bullen"
                }
            ]
        }
    ]
}