{
    "title": "Is it wrong to lie to make someone happy? - Quora",
    "tags": [
        "Lies and Lying",
        "Developing and Maintaining Happiness",
        "Happiness",
        "Understanding Emotions",
        "Understanding Human Behavior",
        "Interpersonal Interaction",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karen Arluck",
                "href": "/profile/Karen-Arluck"
            },
            "answer_text": "This is a very subjective question, seeking an objective answer. “Wrong”, “lie”, and “happy” are very individualized ideas that can be interpreted very differently depending on the person and context. It can be tempting to want concrete rules about what to do, and what not to do. Also, many people frequently believe that they need to give a personal opinion when they aren't actually being asked for one, or have difficulty filtering thoughts and opinions that might only hurt someone else unnecessarily. Important pivot points in deciding the answer: What is your relationship with this person, and how important is the question?For example, if a waiter asks how you're doing, it may not be necessasary to tell them, “terribly, I'm anxious about work, my kids don't get along, and I'm having a bit of a toothache.” On the other hand, if someone you’re dating asks about your feelings on an important topic, it may not be wise to lie, or only tell them what you think will make them happy. Are there repercussions if you tell the truth, or if you lie about a given topic?For example, many companies encourage employees to do 360 evaluations, that include them evaluating their boss. If a person feared that this information might be used against them, or did not trust their company to keep it appropriately confidential, there may be reasons to carefully filter their responses. Will telling the truth hurt the other person unnecessarily, and be unconstructive?For example, suppose someone has a hobby of painting and asks their spouse if they they think their artwork is good. Art is very subjective, and telling one’s spouse that you think they are untalented, and wasting their time, would probably be hurtful and unproductive. Telling them, that you prefer one painting over another might be a less hurtful or constructive way to communicate about this (if they specifically ask). On the other hand, if your spouse asks you if they think they should quit their job to instead earn income from their painting, it might be more important not to lie. However, rather than flat out answering with something hurtful based on your opinions, it might be more helpful to be empathic and supportive, and gently ask some questions about their plan in order to help them think through the practicality of this idea themselves. Is this person specifically asking your opinion or are you deciding whether or not to volunteer an honest opinion?Often people want to give their opinions, when they aren't actually being asked. Instead, many people simply want empathy and validation about whatever they are discussing. For example, if your friend gets fired and you believe they are lazy and may have deserved it. They didn't ask if you think they deserved it, they are probably just seeking support about how awful it is to be fired. Or you may find yourself in an argument with your child, and at the moment you're so frustrated you just want to scream at them about how awful they are. While this may be your angry thought at the time, this is certainly not an objective “truth”, would hurt them unecessasrily, and it is likely to change when you feel calmer and can communicate more constructively. The point is… This is a subjective question with a lot of grey area that depends on the relationship between two people, the context, and what the result of the “truth” or “lie” might be. ",
            "date": "Updated August 29, 2017",
            "views": "26",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Grayson King",
                    "user_href": "/profile/Grayson-King-1"
                },
                {
                    "user_id": "Ninja Fox",
                    "user_href": "/profile/Ninja-Fox-2"
                },
                {
                    "user_id": "Soni Drigues",
                    "user_href": "/profile/Soni-Drigues"
                },
                {
                    "user_id": "Prachant Singh",
                    "user_href": "/profile/Prachant-Singh"
                },
                {
                    "user_id": "Kusum",
                    "user_href": "/profile/Kusum-37"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Amy-Rose-97"
                },
                {
                    "user_id": "Gina Langridge",
                    "user_href": "/profile/Gina-Langridge"
                },
                {
                    "user_id": "Priyadarshni Natarajan",
                    "user_href": "/profile/Priyadarshni-Natarajan"
                },
                {
                    "user_id": "Alan Zimmermann",
                    "user_href": "/profile/Alan-Zimmermann-1"
                },
                {
                    "user_id": "Archie D’Cruz",
                    "user_href": "/profile/Archie-D’Cruz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leslie Melcher",
                "href": "/profile/Leslie-Melcher"
            },
            "answer_text": "My buddy Kant says that it is immoral to lie. So don’t ever do so. Even if the truth might harm the ones you love. But why would you harm the ones you love when a lie can save them? As in, “nope, have not seen them for a week” when answering soldiers at your door. The “Categorical Imperative” - as defined by Kant, is one of the pillars of Humanist Ethics. And Humanist Ethics guide of our current belief-system on ethical behavior. Above Religion. It states that Truth is NOT relative. That Truth isn’t an opinion or a viewpoint or defined by a context. To lie is to purposely NOT tell the truth. Hard to argue this. In theory. To purposely mislead, cheat or hurt anyone is to skew the known truth. And undermines the very notion of Ethics. If a lie is relative, then truth is relative. But myths or stories are not lies. And lies can be therapeutic, Lies can save lives. But my buddy Kant probably hoped we could leave all our emotional stuff behind. He had a theory about Humans and Human behavior. But we deal with humans in lowercase. Truth is NOT relative. It just depends on the context. Is it OK to lie to make someone happy? Sure! if you are not Kant and if you know the long term consequence of your lie. And happy? That’s overrated and circumstantial. ",
            "date": "Answered September 14, 2017",
            "views": "939",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ivonne Melcher",
                    "user_href": "/profile/Ivonne-Melcher"
                },
                {
                    "user_id": "Paul Melcher",
                    "user_href": "/profile/Paul-Melcher"
                }
            ]
        }
    ]
}