{
    "title": "Is it better to be enlightened or to be educated? - Quora",
    "tags": [
        "Enlightenment (spiritual)",
        "Spirituality"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Charles Harman",
                "href": "/profile/John-Charles-Harman"
            },
            "answer_text": "I practice Nichiren Shoshu True Buddhism • NST Nichiren Shoshu Temple I am a lay member. Please note: SGI or Soka Gakkai is not part of Nichiren Shoshu. SGI is a Cult, that was excommunicated from Nichiren Shoshu in 1991. I can offer my opinion on your question, but I would refer you to the Temple websites and encourage you to type “Ichinen Sanzen” in the search box. Obviously, both enlightenment and education are important, but using “better” implies exclusivity and that is not the case. One can be uneducated and enlightened. My Grandpa before he died used to call politicians, “Educated Fools” and I believe many would agree. Enlightenment can be within all conditions of life. A mother that gets angry at her child for bad behavior still loves her child. A teacher that teaches lies or propaganda can be fired or disaplined. Compassion which is the path to enlightenment is not always clear. The same exact policy for illegal aliens that cross the border in regards to parents and children was in place under the Obama administration. Enforcing laws at the US Southern Border is actually compassionate because that means less illegal drugs enter, women and children are not robbed, raped and even abandoned in the desert to die by the “Coyotes” that work for the drug cartels and control the Mexican side of the border. Yet, we have one political party claiming the opposite. Rape, robbery, and even death are acceptable to them as long as they can do political damage to the other party and push a “non-compassionate” narrative that children are separated from Mothers. In Brazil abortion was illegal up until recently. The government approached the issue with an educated and non emotional approach. They now allow abortions but after the first trimester they are banned unless there are serious medical issues, or the fetus is dead. In the US the arguments for abortion are based in emotions and politics, not logic or science. A fetus is “alive” at conception and any person with even a limited education can understand that. An enlightened person may worship the sanctity of life and not condone abortion yet at the same time an enlightened person may also see the need for an abortion to save the Mothers life. Education and Enlightenment are not exclusive of the other. ",
            "date": "Answered September 11, 2018",
            "views": "146",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Khrys Tapang",
                "href": "/profile/Khrys-Tapang-1"
            },
            "answer_text": "I think both are better for they complement its other. Although education tends to be more leaning into being egostistical like having a title that most people are attached to it (CEO, president, director, etc) Enlightenment on the other hand is what make us complete. It's not subjected to ego’s whimsical mood, but rather we are guided by our inner self. It is more like understanding ourselves, rather than on the thinking and behaviors of others. We shift from acquisition of information and the pursuit of status symbols to understanding and mastering ourself in any and all situation. Enlightenment is giving up power over others and replaced with our inner strength that empowers us to behave from a wisdom that inherently from our true self. It teaches us that we are responsible on our reactions in any given moment, and others will cease to have any power or control over us. ",
            "date": "Answered September 10, 2018",
            "views": "74",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Linda Schiller-Hanna",
                    "user_href": "/profile/Linda-Schiller-Hanna-2"
                }
            ]
        }
    ]
}