{
    "title": "Is intelligence, talent and creativity subjective? - Quora",
    "tags": [
        "Talent",
        "Creativity"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Ford",
                "href": "/profile/David-Ford-71"
            },
            "answer_text": "You betcha! That won’t stop some people from saying they know intelligence, talent and creativity, and what we just saw is anything but. Notice, though, that people who make judgments like this are looking for validation for their judgments. If enough people agree, then they can claim their opinion is objective. That’s not true. There’s no such thing as objectivity. But that doesn’t stop people from making the claim of objectivity. It’s a way people gain power. If they can convince others they represent an objective point of view, they will get others to follow their lead and do as they suggest, and that gives them power. I think it makes most sense to treat everyone’s opinion as subjective and to reject the notion that objectivity is possible. It’s an illusion and a power grab and I resist every notion that objectivity is possible. Having said that, I do think there is power in replicating experience by repeatedly setting up the same initial conditions, then engaging in the same action, in order to see if you get the same results. However, even if the same thing happens a billion times, I think it is important to remain aware that does not mean the same thing will always happen. Although, as a practical matter, I do assume that the same thing will happen and predict that it will happen and act as if it is going to happen. It makes sense to me to make such assumptions. But that’s as close to objectivity as I think it is possible to get. ",
            "date": "Answered March 31, 2019",
            "views": "136",
            "upvotes": " Answer requested by Sebastian Ortez"
        },
        {
            "author_info": {
                "name": "Paul Gordon",
                "href": "/profile/Paul-Gordon-16"
            },
            "answer_text": "Yes, it is mostly subjective. Perhaps certain levels of intelligence are codified, but even that is based on criteria of the times and subject to changing parameters. Talent and creativity though? 100% subjective. The other aspect to subjectivity is a difference between internal and external judgment. Does one claim to be able to assess one’s own talent or creativity? And how emotionally involved in assessing someone else’s work is one to be if one attempts to place a ruling on that other person’s abilities? Isn’t it all relative to how good you think you are at that same thing? If I understand nothing about Formula 1 racing, I might think it easy, while in fact the minute differences between the world’s best can be debated by professionals and enthusiasts for hours and hours. How often have you heard someone comment about a Rothko or a Pollack - or perhaps even better, one of Bruce Naumann’s performative video works: “I could do that.” It’s easy to say that after you’ve seen a simple idea, well executed. The fact is this: you didn’t do it, they did. The truth is that some simple ideas come from years of training and more years of exploring complex ideas until a clarity pares away the “noise” from the purity. If you and I talk about the color of something you saw and you say it was purple, and you try to get me to understand the way is was purple and how special that was, how can you be sure I am picturing the color you decribe? ",
            "date": "Answered April 26, 2019",
            "views": "105",
            "upvotes": " Answer requested by Sebastian Ortez"
        }
    ]
}