{
    "title": "Is it okay to be interested in Adolf Hitler, and what did he do with the Nazis? - Quora",
    "tags": [
        "N.S.D.A.P (National Socialist German Workers Party)",
        "People Associated With Nazi Germany",
        "Nazism",
        "Adolf Hitler",
        "Nazi Germany",
        "World War II",
        "World History",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "John Purcell",
                "href": "/profile/John-Purcell-4"
            },
            "answer_text": "I think ideally people should be interested in Hitler. Why? Because I don’t believe that only suppressing knowledge of what Hitler believed is enough to stop it all happening again somewhere. I would say the same of Stalin. When you see how Hitler’s idea arose and you try to fit them into a historical context, I think you can begin to see how so many of Hitler’s ideas struck people at the time as solutions to problems. They were emphatically not, for the most part, solutions to problems. Many of the problems that Hitler tried to tackle, did not have the causes that Hitler claimed them to have. In particular, Hitler blamed minorities for everything, especially Jews. This was simply paranoid. But the problems in themselves were sometimes real. Overpopulation did threaten to cause poverty in Germany and was arguably a factor in German poverty. Hitler’s solution was just a million times worse than the original problem, in the end. There are also questions over how the majority should relate to minorities. It would be nice to say that we have fixed all those problems by simply being anti-racist, but I don’t think we have. We have not collectively figured out how to all get along together, nor to what extent we can even be expected to get along together. Borders and walls and tight immigration policies sometimes do make for good neighbours. In fact, there’s a woman who as much said some of this and has been demonised by anti-semitic people for it. Her name is Barbara Spectre, and a clip of her talking about how we have not learned to be multicultural did the rounds on Twitter and YouTube. Spectre is Jewish, and the clip was interpreted to mean that Jews are going to make Europe more and more multicultural. I don’t know what she actually meant, but I suspect she meant that problems are arising because Europe is increasingly “multicultural” and we don’t know how to deal with each other. That is actually true. The solution of many “anti-racists” is to argue that multiculturalism never causes problems at all, which is not the case. Hitler’s solution was ultimately to murder minorities, blaming all of them for everything. While Hitler’s solution was psychopathic and wrong-headed, to say the least, neither is it true that multiculturalism brings no problems, or only problems that can be solved by “more understanding”. When people move from one country to another in large numbers, they take with them both opportunities and also problems. That has to be acknowledged. And yet, I don’t think we do properly acknowledge it. By refusing to acknowledge problems, we set the stage for more Hitlers. To my mind, the best thing we can do is effectively conduct a very clear-sighted post-mortem analysis of Naziism. What bothered the Nazis, and why? Some of it was pure irrationality, but not all of it. Some of it was a case of blaming the wrong people for problems that lay elsewhere. Jews were never responsible for Europe’s problems, and the idea of collective responsibility is highly dubious in itself. Even so, we can now see antisemitism rising in Europe. Why? That answer to that is complex, but I think a part of it is that we have never really asked ourselves why the Nazi even needed a scapegoat. And why did people who were not violent, nor consumed by hate, vote for them? Including even some Jewish people? Association of German National Jews - Wikipedia The answers that I see floating around are often just too simple. Hitler was a monster, yes, but he was also human, and was supported by many humans. I particularly find it ominous that Nazism was so very driven by polarisation, between the right and left wings of politics. I don’t think we have learned from that in the least. We still believe that polarisation solves issues. That causes both sides to become more extreme, in time. If underlying problems then intensify, only one side is going to win, and by then, that side will be radicalised. ",
            "date": "Answered October 23, 2019",
            "views": "520",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Black",
                    "user_href": "/profile/Jim-Black-86"
                },
                {
                    "user_id": "Lensei Nishizawa",
                    "user_href": "/profile/Lensei-Nishizawa"
                },
                {
                    "user_id": "Cody Murace",
                    "user_href": "/profile/Cody-Murace"
                },
                {
                    "user_id": "Scott Purcell",
                    "user_href": "/profile/Scott-Purcell-12"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Roland-DB"
                },
                {
                    "user_id": "Philip Brian Hall",
                    "user_href": "/profile/Philip-Brian-Hall"
                },
                {
                    "user_id": "Connor Garrett",
                    "user_href": "/profile/Connor-Garrett-31"
                },
                {
                    "user_id": "Alan Mcintire",
                    "user_href": "/profile/Alan-Mcintire-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Rizoli",
                "href": "/profile/Joe-Rizoli"
            },
            "answer_text": "Absolutely a person should be interested in Adolf Hitler. The only thing people got to go by now are books written by people who have who have in agenda against Adolf Hitler. I never knew much about Adolf Hitler until I started reading Mein Kampf and then I realized how this man thought and who he really was, when you come to the realization of that then you might have a different Viewpoint of why he did the things he did and why you may find out that he didn't do some things you think he did… beware of people that keep spreading the falsehoods that Hitler was a lousy artist or that he had one testicle, these are the propaganda nonsense that people spread that needs a stop. If you see a book or anything that says stuff like that I’d stop reading the book. ",
            "date": "Answered October 25, 2019",
            "views": "85",
            "upvotes": "0"
        }
    ]
}