{
    "title": "Is it normal to constantly get into political arguments with your parents? - Quora",
    "tags": [
        "Arguments and Argumentation",
        "Family Relationships and Dynamics",
        "Parents"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shruthi Sailesh",
                "href": "/profile/Shruthi-Sailesh"
            },
            "answer_text": "It may not be normal, but there is nothing wrong with it at all. The problem is, most people find it difficult to set their emotions aside when they are arguing, particularly about political issues. But if it’s healthy, intellectual debate, that’s wonderful! We all need to be able to think critically, evaluate and defend positions, and engage with opposing views. Political dissent within the family is a perfect defense against ideological echo chambers, since, more often than not, our family and close friends tend to reinforce our existing views instead of challenging them. My family is like yours. We all follow politics and love debating policy and economics. It probably doesn’t happen in most families (except for people who argue about politics for the sole purpose of rebelling against their parents). But it’s great that you and your family do this and that you’re all fine with it. ",
            "date": "Answered February 6, 2017",
            "views": "494",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raakesh Charan",
                    "user_href": "/profile/Raakesh-Charan"
                },
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Corrine Spinney Bastarache",
                "href": "/profile/Corrine-Spinney-Bastarache"
            },
            "answer_text": "Depending on your age it is normal to argue with your parents about EVERYTHING ! If politics is the ONLY THING u R currently arguing about I would lean towards it being a sign of the times and the current political agenda ! And people who tell u political arguments don't happen in their house aren't paying attention !! ",
            "date": "Answered February 6, 2017",
            "views": "146",
            "upvotes": "0"
        }
    ]
}