{
    "title": "Is it okay to not be able to solve a homework at university? - Quora",
    "tags": [
        "Homework",
        "College and University Life Advice",
        "Mathematics Education",
        "Problem Solving",
        "The College and University Experience",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Regina Kim",
                "href": "/profile/Regina-Kim-4"
            },
            "answer_text": "Nobody, not even in university, will be able to solve every problem. We don't have all the answers in the world.  I think it comes down to who you are as a person. Will you reflect upon this and learn from what you could or could not do? What will you do in the future to help you in the long run at the university? I hope that you will not be focused on what you cannot solve, and focus more about what you can get out of what you will do.  If this homework is crucial, then I suggest getting help from a TA or professor by visiting them during office hours of emailing them if that is possible. Also, try visiting websites that could help you answer your homework questions. I'm sure people have the same questions as you. Good luck! ",
            "date": "Answered October 30, 2015",
            "views": "357",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Robertson",
                "href": "/profile/John-Robertson-6"
            },
            "answer_text": "Yazan, it is okay to be unable to solve a given assignment on a given occasion but you must learn how to do it prety quickly. You may get help from a friend or from a more advanced student or from your professor. Often the difficulty is just one stumbling block which you do not understand. As soon as you grasp that you can do the whole assignment well. If you are lucky enough to be at Cambridge University you will meet with your supervisor of studies several times a week and he/she will give you all the help you need. Keep at it and you will get better at your assignments. Best wishes. ",
            "date": "Answered October 17, 2015",
            "views": "241",
            "upvotes": "0"
        }
    ]
}