{
    "title": "Is it truly possible to find a truth through lying? - Quora",
    "tags": [
        "Truth",
        "Lies and Lying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harold Totten",
                "href": "/profile/Harold-Totten"
            },
            "answer_text": "Yes, you can, but it’s sometimes squirrelly and maybe unethical. But also sometimes effective. One thing I learned from working in retail is that people lie to you all the time. The big one is that the manager told me I was supposed to get some kind of special discount (for whatever reason). I would ask which manager it was (because I would need authorization), and the liars inevitably said, “I don’t remember,” but attempt to give you a vague description. “Was it Sally?” “Yeah, yeah, that was her name!” “We don’t have anyone by the name of Sally that works here.” Now this is a liar, liar, pants on fire situation, but the scam artists persist. If you call a manager to deal with the ***hole, you will find that Bob all of a sudden becomes “Sally,” and the manager caves to the scam artist. Scam artists, especially the ones that claim to be able to talk to the dead, ask you leading questions that are so general they get you to tell them the information they need. If you reverse the role and ask questions that can mislead a scammer into revealing themselves, you may have to lie to at least get a hint at the truth. Sometimes the best way to expose a scam artist is to lie to them and see how they react. So, if you get a panicked phone call from someone who supposedly does security and updates for your computer, feel free to tell them that you don’t have a computer. ",
            "date": "Answered December 14, 2017",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rayleen Tritt",
                "href": "/profile/Rayleen-Tritt"
            },
            "answer_text": "I lied and told my ex fiance’s secretary I knew everything. I told her I knew they had been having an affair and how could she do this to me. In reality, I didn’t know the truth. I just had a hunch. She finally caved and apologized and said he’d said we were breaking up and it was only a few times. At that instant, my lying to her revealed the truth. My stomach sank and my heart broke into a billion tiny pieces. The man I was going to marry, had been sleeping with his secretary. I had wanted her to put my fears to rest and tell me I was being crazy. Instead, my lying to her and getting the truth changed my whole life and future. I left him and am now with a man that is so honest and straight forward it actually is hard to hear the truth sometimes but I love it! Lol ",
            "date": "Answered December 14, 2017",
            "views": "1",
            "upvotes": " View 27 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Petra Radajic-Tucci",
                    "user_href": "/profile/Petra-Radajic-Tucci"
                },
                {
                    "user_id": "Alice Xing",
                    "user_href": "/profile/Alice-Xing-3"
                },
                {
                    "user_id": "Paula Paziak",
                    "user_href": "/profile/Paula-Paziak"
                },
                {
                    "user_id": "Laura Calla",
                    "user_href": "/profile/Laura-Calla"
                },
                {
                    "user_id": "Hong P Ling",
                    "user_href": "/profile/Hong-P-Ling"
                },
                {
                    "user_id": "Ben Johnson",
                    "user_href": "/profile/Ben-Johnson-165"
                },
                {
                    "user_id": "Ella Green",
                    "user_href": "/profile/Ella-Green-33"
                },
                {
                    "user_id": "Christina Kennedy",
                    "user_href": "/profile/Christina-Kennedy-26"
                },
                {
                    "user_id": "Shweta Jeevan Prakash",
                    "user_href": "/profile/Shweta-Jeevan-Prakash"
                },
                {
                    "user_id": "Tomás Augusto Seeber Wybert",
                    "user_href": "/profile/Tomás-Augusto-Seeber-Wybert"
                }
            ]
        }
    ]
}