{
    "title": "Is Indian philosophy all about Hinduism? - Quora",
    "tags": [
        "Indian Philosophy",
        "Hinduism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Diwakar Kumar",
                "href": "/profile/Diwakar-Kumar-दिवाकर-कुमार"
            },
            "answer_text": "Being the land of so many religions, it is only natural that Indian philosophical tradition would incorporate many divergent tendencies that don’t fit well even in the highly syncretic Hindu tradition. A useful way to classify Indian philosophy is to categorise them under Orthodox schools and Heterodox (Śramaṇic schools). While, Orthodox schools are generally thought to be constituents of Hindu philosophy as they accept the authority of Vedas, the two surviving religions — Jainism and Buddhism — are the outgrowth of Heterodox schools, and don’t accept authority of Vedas. One way to look at Indian philosophy is to overlook sectarian differences and to examine the debate between different schools of philosophy on important questions regarding ethics, metaphysics, epistemology etc. Scholars belonging to both Orthodox and Heterodox schools, made important contributions regarding development of concepts related to important philosophical questions. Philosophical schools, belonging to Orthodox and Heterodox categories influenced each other, so it is not always useful to distinguish between them. ",
            "date": "Answered May 26, 2017",
            "views": "424",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sukrit Banerjee",
                    "user_href": "/profile/Sukrit-Banerjee-1"
                },
                {
                    "user_id": "Neeraj Dhakad",
                    "user_href": "/profile/Neeraj-Dhakad-2"
                },
                {
                    "user_id": "John Gragson",
                    "user_href": "/profile/John-Gragson"
                },
                {
                    "user_id": "Kuhu Dixit",
                    "user_href": "/profile/Kuhu-Dixit"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ratnesh Shrivastava",
                "href": "/profile/Ratnesh-Shrivastava-13"
            },
            "answer_text": "Before 1 AD Hinduism was more about, search for truth, spirituality and philosophy. All thoughts including Charvaka, Aastik and Nastik schools were all prevalent and the term Hinduism never existed. Then in between 1 AD to 300 AD significant changes occured. We see more temples built and caste system becoming endogamous and by birth in this period. Philosophy became confined to being study material and not something to implement in practicing religion. The you tube is reviving exchange of philosophy and religious debate. So define exactly what youmean by Hinduism in the historical context? ",
            "date": "Answered November 25, 2019",
            "views": "56",
            "upvotes": "0"
        }
    ]
}