{
    "title": "Is it possible that mathematical structures existed before the formation of the universe (big bang)? - Quora",
    "tags": [
        "The Big Bang",
        "Big Bang Cosmology",
        "Mathematics and Physics",
        "The Universe",
        "Cosmology",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mile Navrsale",
                "href": "/profile/Mile-Navrsale"
            },
            "answer_text": "The current consensus is that both geometry and Aristotelian logic were emergent properties after the Big Bang. If you then think about algebraic geometry, it appears that algebra is also an emergent property. And without Aristotelian logic, there is no topology. And without topology, there are no mathematical structures. So the answer could be no. But.. This questions boils down to the famous question Sartre posed decades ago, whether a possibility, through its manifestation, becomes more real than it was (before manifesting itself). This opened the door to the philosophy of existence and its basic premise that existence precedes ontology. The key problem of modern physics is that it picked up a lot from old physics. And old physics picked up a lot from even older physics, and so on. By necessity, you study, you “pick up” the current state, and hopefully, you produce some “future state”. Yet that future state resemble the current one 99.999999999%. It is about the complexity of choices that were made over the centuries. Acceptance of “time”, for example. Why does it not flow in both directions? The truth of the matter is that time, if it existed, should/must be flowing in both directions. There is just no way around that and all mainstream physics equations scream that must be true. If the time is a dimension, then why it is not “laid out” like other dimensions instead of being a “flow”? There are 3 possibilities here: Time exists. A problem: we don’t know why it flows in one direction only. If it is a dimension, we don’t know why it “flows” instead of being “laid out” (like other dimensions that do not “flow” and are “laid out”)Time does not exist. This is tied to 3), i.e. the “time” is actually a notion for something else that we only perceive as “time”.Time actually does flow in both directions, because it is a flow of entropy. The current Two-headed Time theory of Sean Carol is actually a Two-headed Entropy Flow theory. It resolves the problem of one-directional flow in 1).Existence precedes ontology. What we perceive as “time” is a bi-directional flow of entropy, a constellation of manifold. And what we perceive as “spacetime” is actually a spaceworld. Thus there is no “before”, “after” etc. Big Bang is just a point on an ad infinitum line of existence where initial conditions are set for a particular universe. These initial conditions determine whether observes are going to remember their past or their future, on either side of the Big Bang. There are multiple such lines of existence, each one corresponding to an universe. All such universes comprise a multiverse. Thus mathematical structures existence is tied to the every point on the axis of existence, except at point 0, the point of Big Bang. It is at this point of disruption where they re-emerge. ",
            "date": "Answered March 30, 2018",
            "views": "408",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adler Mow",
                    "user_href": "/profile/Adler-Mow"
                },
                {
                    "user_id": "Jet Foncannon",
                    "user_href": "/profile/Jet-Foncannon"
                },
                {
                    "user_id": "Sebastjan Leon",
                    "user_href": "/profile/Sebastjan-Leon"
                },
                {
                    "user_id": "Mikhael Bornstein",
                    "user_href": "/profile/Mikhael-Bornstein"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jet Foncannon",
                "href": "/profile/Jet-Foncannon"
            },
            "answer_text": "I’m not certain I agree with Jack Woida, although I enjoyed his argument. He says mathematics exists regardless of whether humans exist, or, as a matter fact, regardless of whether anything exists. This seems to me to be a non-demonstrable article of faith. The relevant concept here turns out to involve Nothingness. What does it mean for nothing to exist? A hoary philosophical conundrum is: “Why is there Something rather than Nothing?” But what precisely are we talking about when we talk about Nothing? We’ll see how this has a direct bearing on the OP. Lawrence Kuhn had an interesting article in Skeptic Magazine in which he posits a taxonomy of nothingness. He states: “This taxonomy is structured as a deconstruction ….. a progressive reduction of the content of each Nothing in a hierarchy of Nothings….. This subtraction argument works by imagining a sequence of possible worlds each containing one less concrete object than the world before, so that in the very last world even the very last object has vanished.” His taxonomy is intriguing and, finally, unsettling. Here are Kuhn’s levels of nothingness: (1) Nothing as existing space and time that just happened to be totally empty of all visible objects (particles and energy are permitted) -- an utterly simplistic view.2) Nothing as existing space and time that just happens to be totally empty of all matter (no particles, but energy is permitted -- flouting the law of mass-energy equivalence)(3) Nothing as existing space and time that just happens to be totally empty of all matter and energy.(4) Nothing as existing space and time that is by necessity -- irremediably and permanently in all directions, temporal as well as spatial -- totally empty of all matter and energy.(5) Nothing of the kind found in some theoretical formulations by physicists, where, although space-time (unified) as well as mass-energy (unified) do not exist, pre-existing laws, particularly laws of quantum mechanics, do exist. And it is these laws that make it the case that universes can and do, from time to time, pop into existence from “Nothing,” creating space-time as well as mass-energy. (It is standard physics to assume that empty space must seethe with virtual particles, reflecting the uncertainty principle of quantum physics, where particle-antiparticle pairs come into being and then, almost always, in a fleetingly brief moment, annihilate one another.)(6) Nothing where not only is there no space-time and no mass-energy, but also there are no pre-existing laws of physics that could generate space-time or mass-energy (universes)(7) Nothing where not only is there are no space-time, no mass-energy, and no pre-existing laws of physics, but also there are no non-physical things or kinds that are concrete (rather than abstract) --no God, no gods, and no consciousness (cosmic or otherwise). This means that there are no physical or non-physical beings or existents of any kind -- nothing, whether natural or supernatural, that is concrete (rather than abstract).(8) Nothing where not only is there none of the above (so that, as in Nothing 7, there are no concrete existing things, physical or non-physical), but also there are no abstract objects of any kind -- no numbers, no sets, no logic, no general propositions, no universals, no Platonic forms (e.g., no value).(9) Nothing where not only is there none of the above (so that, as in Nothing 8, there are no abstract objects), but also there are no possibilities of any kind (recognizing that possibilities and abstract objects overlap, though allowing that they can be distinguished)There seems to be nothing to prevent the existence of domains in which these types of nothingness prevail. What concerns the OP is the alleged primacy of mathematics. Is the Nothing of Level (7) possible— no numbers, no sets, no logic, no propositions? Both (6) and (7) hypothesize a domain without laws, physical or mathematical. Metaphorically, we might say that the Level (9) of Kuhn’s taxonomy is the mindset of a newt. The further we proceed down the list, the more difficult it is to conceptualize the object being described. This is, simply, because humans are, cognitively, context dependent. That’s the way we have evolved. We think mathematics must exist in every domain because we can conceptualize mathematical abstractions. If we maintain that the present universe evolved from nothing, what level of nothing are we talking about? Nigel Arnot’s response mentions that physical and mathematical law could be an emergent phenomenon resulting from the big bang; in other words, the universe evolved from a Nothing of type (9). Robert Kuhn's nine levels of nothing: mind-blowing ",
            "date": "Answered June 2, 2018",
            "views": "239",
            "upvotes": "0"
        }
    ]
}