{
    "title": "Is it true what Aristotle said that, 'Misfortune shows those who are not really friends?' - Quora",
    "tags": [
        "Aristotle",
        "Proverbs, Sayings and Adages",
        "Quotes And Sayings",
        "Philosophy",
        "Friendship Advice",
        "Friendship",
        "Social Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mmaduabuchi Obinelo",
                "href": "/profile/Mmaduabuchi-Obinelo"
            },
            "answer_text": "Yes, misfortunes and adversities expose people’s true colors to you. When you have much, more people come to you to pretend to be your friends, relatives and they tend to hide their inner motives. We are all victims of these one way or the other, success has many friends while failure is an orphan. It is in the days of adversity you will know who is true with you. Aristotle was right by this statement. Humans pretend a lot about their true behaviors. They tend to hide most of them because they want to get something from someone. They will do all they can to hide that hatred they have for you because they know they will get something from you. When we get trapped in life, we begin to see this fake friend disappear from our lives. We begin to be deserted and they begin to show up their true self to is because they now feel they won't get anything out of us. Families, friends, and coworkers tend to desert you when you have misfortunes. They tend to be mindful of you, they tend to be egocentric about how they relate with you the moment they see you having adversities. It is not what they do about your adversities matters, rather what you do with your life in those moments. It is better to be alone than to be with fake friends. Those who truly love you will be by your be by your side. They will motivate you, they will help you, they will make sure you make it out of the misfortune. They won't give up on you and will always cherish you even if everyone leaves. These are your true friends. ",
            "date": "Answered November 4, 2018",
            "views": "543",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nikita Kaushik",
                    "user_href": "/profile/Nikita-Kaushik-3"
                },
                {
                    "user_id": "Jhaas4 Jhaas4",
                    "user_href": "/profile/Jhaas4-Jhaas4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Toby Dillon",
                "href": "/profile/Toby-Dillon"
            },
            "answer_text": "Don’t know. But I went to my friend’s mom’s funeral today to show my love and support for her and my friend’s family, and they haven’t seen me in nearly 20 years, but were shocked when I said hi. “What are you doing here?” he asked, to which my faux-affronted reply why, “I’m not going to leave my friend hanging when his mom dies. I’m here for you.” I was somewhat disappointed that there were not many other friends there. I hope they sent their thoughts, but if not, there’s the truth of the matter. My friend and I caught up on many missed years, reminisced about old days, and had a lot of laughs, the perfect balm for a sad day. ",
            "date": "Answered November 2, 2018",
            "views": "154",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brook West",
                    "user_href": "/profile/Brook-West"
                }
            ]
        }
    ]
}