{
    "title": "Is illusion an illusion or a reality? - Quora",
    "tags": [
        "Illusions",
        "Reality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Santosh Jha",
                "href": "/profile/संतोष-झा-Santosh-Jha"
            },
            "answer_text": "Your question has import of higher explanations, as it relates to higher question of ‘dualism’, which science, philosophy and spiritualism struggle to explain in definitive terms. Yet, for your age and your current utility, we can simplify it… Illusion is both illusion as well as a reality. This is because; reality itself is rarely objective but subjective. This means, reality has two aspects or domain – 1. Observer dependent realism (As I see it)… 2. Observer independent realism (As it is)… An illusion happens because of the same brain mechanism, which perceives and accepts a reality. Therefore, in that perspective, both illusion and reality are ‘real’. It is somehow manifestation or expression of the singular reality of ‘Brain Perception Mechanism’, therefore has basis of reality. However, when something is accepted as real by someone, even when it is an illusion, for that person, the illusion is real. However, independent of the observer (I or You), there is a realism, which is real and there as it has to be. So, I may see a mirage and accept it as water. This acceptance is real because it is being caused by my brain states but it is at the same time an illusion… The larger import of your question is the golden idealism of relativity – that is, ‘Truth and realism is subjective and therefore, every one of us should be kind and compassionate towards others views and ideas about truth and realism. Also, we should be humble about our own sense of right and truth…’ … thanks and all best… remain happy and blessed… ",
            "date": "Answered September 9, 2017",
            "views": "635",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Vishnushankar Alagendran",
                    "user_href": "/profile/Vishnushankar-Alagendran"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suhas",
                "href": "/profile/Suhas-77"
            },
            "answer_text": "Hello, I will try to keep it simple here. “ I will do this work tomorrow when I have more time” “ I will exercise when I have more energy” “I will change people” These are some illusions in real life. We create these illusions in our mind. This process of assuming things is REAL. So Illusions are are real. We have Illusions; which is a Reality. BUT These real Illusions never happen; they will not give out results. Many a times, we will not accomplish out assumed illusions. “ I will do this work tomorrow when I have more time” - Which we never do, because ’Tomorrow’ becomes ‘Today’ when tomorrow actually comes. “ I will exercise when I have more energy” - We always love sleeping than working out. ““I will change people” - Hardly we can change someone else. All we have to do is change ourselves. So now Illusion is an Illusion and it is not easy to turn it into a reality and That IS THE REALITY. Did I confuse you ? ~Suhas ",
            "date": "Answered September 12, 2017",
            "views": "161",
            "upvotes": " Answer requested by Diti Patel"
        }
    ]
}