{
    "title": "Is intelligence correlated closely with our level of consciousness? - Quora",
    "tags": [
        "Cognitive Science",
        "Consciousness",
        "Human Brain",
        "Intelligence",
        "Neuroscience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeffrey Werbock",
                "href": "/profile/Jeffrey-Werbock"
            },
            "answer_text": "The concept that consciousness has “levels” is derived from our experience with sleep and chemicals that alter the manner in which we experience the signals coming into to us from outside. Consciousness is the act of paying attention to signals (plus the subjective sense this experience is happening to “me”). Intelligence is recognizing patterns. They are related cognitive functions in that without attention one cannot “recognize” anything. Recognition (cognizing then recognizing) is not the same as paying attention; in fact, we may gaze at something we cannot recognize, being cognizant of something that we haven’t yet recognized, until we finally recognize the pattern. Thus cognizing (being conscious of) something and recognizing (knowing what it is you are conscious of) are correlated but not the same at all. ",
            "date": "Answered May 6, 2019",
            "views": "90",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Parsa Akhtari",
                    "user_href": "/profile/Parsa-Akhtari"
                },
                {
                    "user_id": "Diane Shatto",
                    "user_href": "/profile/Diane-Shatto"
                },
                {
                    "user_id": "Brandon Brown",
                    "user_href": "/profile/Brandon-Brown-80"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raven Azar",
                "href": "/profile/Raven-Azar"
            },
            "answer_text": "IQ is determined by standardized testing. It’s not used to evaluate extreme mental states or altered states of consciousness. Psychiatry offers other standards for that measurement mostly just to evaluate pathology. Wisdom traditions also have their own milestones for progress in meditative or ecstatic states if that’s what you’re referring to. One thing to note though is that more educated people tend to be able to be better at empathy, which is a widely valued trait in traditions of self-cultivation. Coming from a purely western point of view, your testable intelligence can be affected by pathological neurological or psychological states, but the measure is usually one of disability. As far as I know, psychology doesn’t offer milestones for any positive extreme states of consciousness. There’s no contemporary western equivalent of positive contemplative trance or shamanic type states. ",
            "date": "Answered May 9, 2019",
            "views": "68",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Diane Shatto",
                    "user_href": "/profile/Diane-Shatto"
                },
                {
                    "user_id": "Brandon Brown",
                    "user_href": "/profile/Brandon-Brown-80"
                }
            ]
        }
    ]
}