{
    "title": "Is it possible for a person to be considered spiritual without being religious? - Quora",
    "tags": [
        "Vedic Religion",
        "Religious Behavior",
        "Spirituality of Everyday Life",
        "Spirituality",
        "Belief and Beliefs",
        "Hinduism",
        "Religion",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jacob Bonde",
                "href": "/profile/Jacob-Bonde-1"
            },
            "answer_text": "Yes. But you should think about the benefits of religion and how you use them to cultivate your own spirituality. I can only speak from personal experience, but I have a feeling that many people who have called themselves \"spiritual, not religious\" may have a similar story to mine. I grew up 'religious', or at the very least, \"with a religion\" (in my case, Lutheranism). When I went off to college, I had what I believe is a pretty typical experience, of questioning many of my previous beliefs. I no longer found reasons to believe the tenets of my religion, and no longer connected to the rituals of my church. Though at times I might have called myself atheist, I usually would define myself as agnostic, and nowadays I certainly hold a belief that, at the very least, there are meaningful aspects of the human experience that cannot be explained by science. You can call it the Divine if you would like, but the name is not particularly important to me anymore. Here's what I've found: there's a reason that \"religious\" has also come to mean \"scrupulous; exact; carefully following a ritual\". Connection with the Divine, which what I'm assuming someone who calls themselves \"spiritual\" is still yearning for, needs to be cultivated. Organized religions have evolved the way they have because, at least for some people, they help them stay connected to the Divine (they've evolved to the way they are now for other reasons too, but that's not the point of this answer). Someone who rejects religion is presumably saying that these rituals and ways do NOT help them connected to the divine (at the very least they are saying this, they are usually saying more than this). But spirituality doesn't seem to just 'happen' in my experience, especially not in american culture as it is now. So you are going to have to find your own way to cultivate your own spirituality. It will look different from person to person, but it will probably require two aspects that we find in organized religion: ritual and community. The rituals could be simple: a morning ritual of meditation, or daily walks, or time in the week set aside to express gratitude. And the community could small: your family, a few friends, a discussion group online. But I have found when I drift away from either of those things (and I personally have found myself drifting more often than not), my spirituality-without-religion simply just fades. ",
            "date": "Answered May 3, 2013",
            "views": "860",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jules Bonde",
                    "user_href": "/profile/Jules-Bonde"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karl September",
                "href": "/profile/Karl-September"
            },
            "answer_text": "Is it possible to be spiritual without being religious? Everyone is spiritual. Some people choose to use religion to express their spiritualism.   As people, we are very brand (label) conscious. We choose these brands because we want the brand to say something about “who we are”. We will choose a specific brand, because we believe that brand says something specific about “Who I am”. All of life thus becomes an attempt to express this drive of “who I am”. We become so immersed in the brand that when someone criticise “my Ferrari”, by stating for example that is a crap car, we tend to take it very personal. We tend to then interpret it as if the person is saying, I am a crap person (or full of crap). This is especially prevalent with sports and music brands.  Viewed from this perspective, it is easy to determine why an attack on a “label” is interpreted as an attack on my “belief-system”, which is perceived as an attack on “me” (as it is an attack on my belief of “who I am”).   One of the inherent problems with “brands” are the effort involved from the individual to uphold the image that is being associated with the brand. For example, someone driving around in a Bentley cannot concern himself over an increase in the price of fuel, just like someone buying a Gucci handbag cannot complain about the price of the handbag. In order then to live this branded “lifestyle”, you need to adhere to certain rules. By agreeing to the label, you agree to the rules. By agreeing to the rules, you bind yourself by these rules. In other words, you imprison yourself. We are expert image creators. That is the nature of mind.   In order to discover who you truly are, it is wise NOT to attach any labels to yourself. Even a seemingly “good” label like “spirituality” have adverse effects when boxed in to fit into the image of a brand (label).  That which is generally termed as spiritual, is in fact an attempt at discovering true “Freedom”. By attaching a label to it, you thereby achieve the opposite. (By asking a question like “is it possible to..” is proof of this).  The best way then to be spiritual is … be yourself.  If you don’t know “yourself”, then work your way back… Attempt to determine “who you are” before any of the labels of who you thought “you wanted to be”. In other words, remove all labels. (hint. hint. “Become like a child”) ",
            "date": "Answered February 12, 2018",
            "views": "5",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abdullah Jama",
                    "user_href": "/profile/Abdullah-Jama-2"
                },
                {
                    "user_id": "Valeria Armendariz",
                    "user_href": "/profile/Valeria-Armendariz"
                },
                {
                    "user_id": "Michael Brent",
                    "user_href": "/profile/Michael-Brent-11"
                },
                {
                    "user_id": "George Girman",
                    "user_href": "/profile/George-Girman"
                },
                {
                    "user_id": "Daniel Clingan",
                    "user_href": "/profile/Daniel-Clingan-2"
                },
                {
                    "user_id": "Prajna Paromita Dey",
                    "user_href": "/profile/Prajna-Paromita-Dey"
                },
                {
                    "user_id": "Phuong Phuong",
                    "user_href": "/profile/Phuong-Phuong-9"
                },
                {
                    "user_id": "Cat",
                    "user_href": "/profile/Cat-136"
                },
                {
                    "user_id": "Willa Day",
                    "user_href": "/profile/Willa-Day"
                },
                {
                    "user_id": "Charles C Restko",
                    "user_href": "/profile/Charles-C-Restko"
                }
            ]
        }
    ]
}