{
    "title": "Is it normal to want to kill small animals? - Quora",
    "tags": [
        "Killing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mario Rosselli",
                "href": "/profile/Mario-Rosselli"
            },
            "answer_text": "I don’t think it is normal and further if you read up on serial killers you’ll find that many of them after getting abused by their father or mother, seeked *revenge* by killing small animals and then progressed to humans. I killed small animals as a kid but in reality I was only fishing, in order to have some food to put on the fire later on that night and the killing or not killing was not the main point of the excercize. I was taught that if you kill something you then must eat it, otherwise killing is wrong, and still stand by it. Unless we terminate some dangerous creature, like a serial killer. ",
            "date": "Answered December 10, 2016",
            "views": "28",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erik Karlström",
                    "user_href": "/profile/Erik-Karlström-1"
                },
                {
                    "user_id": "Catherine Gauthier",
                    "user_href": "/profile/Catherine-Gauthier-1"
                },
                {
                    "user_id": "Avery Ambrose",
                    "user_href": "/profile/Avery-Ambrose-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sylvia O'Neill",
                "href": "/profile/Sylvia-ONeill-2"
            },
            "answer_text": "of course this is wrong, and rather disturbing. Deliberately going out of your way to kill any animal, either big or small, is never something that one should want to do. That indicates a great deal of apathy or misdirected anger. Both of which are of grave concern. Serial killers almost always start out small by hurting and killing small animals beforehand, and working their way up to bigger things. If a person WANTS to kill small animals it is a sign that something is seriously wrong. ",
            "date": "Answered April 18, 2017",
            "views": "25",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Denise Derrick-Jones",
                    "user_href": "/profile/Denise-Derrick-Jones"
                },
                {
                    "user_id": "Erik Karlström",
                    "user_href": "/profile/Erik-Karlström-1"
                },
                {
                    "user_id": "Jess O'Neill",
                    "user_href": "/profile/Jess-ONeill-3"
                }
            ]
        }
    ]
}