{
    "title": "Is intelligence everything? - Quora",
    "tags": [
        "Intelligence",
        "Schools",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Min Khin Kyaw",
                "href": "/profile/Min-Khin-Kyaw"
            },
            "answer_text": "Intelligence is the fundamental ability of living organism. Levels of intelligence differ. Higher intelligent organisms have an array of abilities. Human is the highest among scientifically recognized lifeforms. With highest intelligence recognized in science, humans can understand what other species don’t. Also different humans have different levels of intelligence so some understand something that others do not. That is the reason why we have views and beliefs. Intelligence is almost everything at the fundamental level. But physical body without intelligence is comatic and intelligence without physical body cannot exist. With high intelligence, we understand good and right. With low intelligence, some cannot understand good and right. For understanding, intelligence is everything. Yet, effort is required too. Without trying, intelligence alone will not arrive at understanding. The will to understand is also necessary. Without a good will, a good effort cannot happen, so understanding will not happen - intelligence is hence unused or useless. Some people often misuse their intelligence to serve their greed, anger and delusion. Instead of understanding, some serve delusion. Delusion exists due to lack of effort to understand, or being low at intelligence.  ",
            "date": "Answered May 3, 2017",
            "views": "796",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "T.C",
                    "user_href": "/profile/T-C-685"
                }
            ]
        },
        {
            "author_info": {
                "name": "Toorja chakraborty",
                "href": "/profile/Toorja-chakraborty"
            },
            "answer_text": "Never ! As far you are a human being intelligence is not everything at all, maybe it is for robots or machines. Intelligence is just another property of someone`s character, among all other. I know a lot of superb intelligent ( so called ) persons without having any kind of sensibility, sympathy or empathy. Sometimes, very awkwardly emotionless too. Who are not able to respect others or their emotions at all. So, I will never choose that sort of intelligent people. Rather, I will go for ‘dumb’ ( so called ) ones having less intelligence but care for everyone and every situation with sense and empathy. I just shared my personal opinions. Cheers ! ",
            "date": "Answered May 3, 2017",
            "views": "14",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lestari Ningratna Sari",
                    "user_href": "/profile/Lestari-Ningratna-Sari"
                },
                {
                    "user_id": "Siddharth Sisodia",
                    "user_href": "/profile/Siddharth-Sisodia-1"
                },
                {
                    "user_id": "Chakraborty Banani",
                    "user_href": "/profile/Chakraborty-Banani"
                },
                {
                    "user_id": "Arundhati V. Bhide",
                    "user_href": "/profile/Arundhati-V-Bhide"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Maryjesse-Johnston"
                },
                {
                    "user_id": "T.C",
                    "user_href": "/profile/T-C-685"
                },
                {
                    "user_id": "Min Khin Kyaw",
                    "user_href": "/profile/Min-Khin-Kyaw"
                },
                {
                    "user_id": "Joseph Parkhouse",
                    "user_href": "/profile/Joseph-Parkhouse"
                }
            ]
        }
    ]
}