{
    "title": "Is it common for narcissists to push you to be mutually exclusive with him without actually knowing you that well? - Quora",
    "tags": [
        "Exclusivity",
        "Narcissists",
        "Narcissistic Personality Disorder"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sean Michael",
                "href": "/profile/Sean-Michael-181"
            },
            "answer_text": "I would say yes. Mostly. They want you to promise to be theirs alone while they go out secretly hooking up. That’s not just Narcs but a lot of our younger generations just don’t see it the way it used to be. It’s all about ghosting and moving on but not ever deleting numbers. I am guilty of some of this behavior myself. It’s easy to do. But morally it’s wrong. Don’t take a person and demand they commit to only you while you toy them along. Be open and honest about what you want and things typically work out without anyone being scarred or hurt beyond normal. Now there is also the Narc that will then be grand with you as his dedicated arm candy. Raising his stature up and feeding that ever present need they have to be adored and envied. Also guilty of some of these behaviors too. Of course I want to show off my beautiful partner. But I’m not demanding any of my partners do anything above their normal. Sweats and tank or sexy dress is no different to me. We all have Narc traits so just pay attention to how you feel in your gut when they’re around. Them butterflies acting really really crazy is not usually a good thing all the time. It’s anxiety and doubt mixed with euphoria and elaborate future dreams. It’s dangerous when you allow someone who has severe Narc traits or full blown NPD the keys to your life and dreams. Imagine it was your dream car in mint condition they drove off in and returned with a totaled car and said here ya go. Someone smashed into me, here’s their information, good luck and goodbye forever. Like wtf kind of person would take your trust and smash it to pieces and not even attempt to help put it back Together. Or to repair it. They just wanna find the next flashy new car driving nice person to repeat the same actions. They don’t grow or care to grow and will never appreciate any pointers concerns or criticisms without a full blown tantrum. if it feels too fast and sudden listen to your body and feelings. And then look at it logically. Relationships with my horse people can succeed if you’re willing to take some random shit and drama down the line. It’s about how much of that shit can you handle. You can’t do what they do that causes you hurt because that’s a slight and you’ll be discarded surely. But if you take it and accept that fate they will lrovide some good things here and thereZ ",
            "date": "Answered July 27, 2020",
            "views": "110",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Katarina Anna",
                    "user_href": "/profile/Katarina-Anna-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jane Burkes",
                "href": "/profile/Jane-Burkes"
            },
            "answer_text": "Absolutely especially during the “love bombing phase” But not all guys are narcissists and may genuinely want exclusivity, they are gold ",
            "date": "Answered July 27, 2020",
            "views": "36",
            "upvotes": "0"
        }
    ]
}