{
    "title": "Is it true that morals don't exist? - Quora",
    "tags": [
        "Ethics of Everyday Life",
        "Ethics and Morality",
        "Existence",
        "Ethics",
        "Morals and Morality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jasmine Davison",
                "href": "/profile/Jasmine-Davison-5"
            },
            "answer_text": "(Sorry for a late answer, I just wanted to explain my take) I believe morals do not exist technically, as in “right” or “wrong”. Morals are a more complicated form of our instinct to survive. Helping other humans increases chances of survival. Morally speaking, this is wrong, as it is selfish. Existing and living is selfish, if I were to take it far. But I agree with another answer here, it exists ideologically. ",
            "date": "Answered October 7, 2018",
            "views": "170",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nick Bartlett",
                "href": "/profile/Nick-Bartlett-3"
            },
            "answer_text": "When encountering a question such as this, it is a good idea to first define its constituents. What do you mean by exist? If you meaning existing physically, in the form of matter and energy, then tenuously, as electrical activity in a few billion human minds. In terms of social interaction and collective human understanding and culture, I would argue that morals exist in ideological form. If someone falls over and asks for help, most people would view it as morally wrong to ignore another humans pleas for help. Therefore, morals exist as a social agreement between vast groups of people. ",
            "date": "Answered October 2, 2016",
            "views": "465",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yanchun Peng",
                    "user_href": "/profile/Yanchun-Peng"
                },
                {
                    "user_id": "Thomas Jones",
                    "user_href": "/profile/Thomas-Jones-199"
                }
            ]
        }
    ]
}