{
    "title": "Is John Rawls' original position a suitable device for deriving the principles of justice? - Quora",
    "tags": [
        "The Veil of Ignorance (Philosophy)",
        "John Rawls (author)",
        "Justice",
        "Ethics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rob Weir",
                "href": "/profile/Rob-Weir"
            },
            "answer_text": "Rawls is guilty of starting his thinking midstream.  In order to even motivate a thought experiment regarding the design of a society there is the assumption that there is something of value at stake in such a design, that it is worth our attention.   If we were just talking about how we distribute our toenail clippings among the population we would not bother imagining how we would design from an original position, behind a veil of ignorance.    It would be a waste of time. The things of value that motivate the discussion are obviously wealth, status and power.  But on what basis can we just assume that wealth pre-exists?  Surely it must exist before we can design rules to distribute it?  Does wealth necessarily exist?  Or is it, in itself, a product of how society works?   I think we do mischief if we merely assume it pre-exists and we're merely tasked with deciding what the just ways to share it are. If we were creatures of a giant steam engine that produced power from the movement of air in cold and hot chambers, but we knew the operations of that machine only imperfectly, would Rawls have us argue behind a veil of ignorance how we would best distribute the hot and cold air?   The error there as well would be in assuming that the engine's power is preexisting and independent of how the engine runs.  A chamber of warm air has no power to distribute. ",
            "date": "Answered July 19, 2015",
            "views": "551",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adolfo Oubiña Neto",
                    "user_href": "/profile/Adolfo-Oubiña-Neto"
                },
                {
                    "user_id": "Jim Hemphill",
                    "user_href": "/profile/Jim-Hemphill"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Dean-Laurea"
                },
                {
                    "user_id": "Anthony Zarrella",
                    "user_href": "/profile/Anthony-Zarrella"
                },
                {
                    "user_id": "Joaquín Benjamín",
                    "user_href": "/profile/Joaquín-Benjamín"
                },
                {
                    "user_id": "John Joganic",
                    "user_href": "/profile/John-Joganic"
                },
                {
                    "user_id": "Tyson Rosage",
                    "user_href": "/profile/Tyson-Rosage"
                },
                {
                    "user_id": "David Fiedeldey",
                    "user_href": "/profile/David-Fiedeldey"
                },
                {
                    "user_id": "Tikhon Jelvis",
                    "user_href": "/profile/Tikhon-Jelvis"
                },
                {
                    "user_id": "Lucas Karl Hahn",
                    "user_href": "/profile/Lucas-Karl-Hahn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daqian Gu",
                "href": "/profile/Daqian-Gu"
            },
            "answer_text": "I always thought of JR as one of the biggest pretenders of \"political scientists\"--maybe right behind Karl Marx! The problems are legion and transparent.  I like Jing's shishene thinking.  It's cleaver.  However, one can also oppose Rawls' typical ivory-tower ordinary people don't know nothing Platonism from the opposite side of what Jing has taken.   (The problem with using value to judge value is who get to decide the value, leaving alone the problem of tautology).   Rawls decides basically that justice is based on how well the \"least advantaged\" (but stopped at the human kind) are treated.  Such idea implies that the rich and smart need not appeal to justice, because it does not care how are they treated.  Even the idea, they may be allowed to keep more, is based according to JR, as Nick pointed out, how that benefits the poor.  But the idea of justice is not that complicated--it means treating all the same, the \"least\" or the \"most\".   This reaching justice through total ignorance is the same as to declare no wrong can ever be done to the privileged--all major revolutions, except the American one, have proven that is a very dangerous idea. ",
            "date": "Answered July 19, 2015",
            "views": "979",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Hemphill",
                    "user_href": "/profile/Jim-Hemphill"
                },
                {
                    "user_id": "Bob Sorrell",
                    "user_href": "/profile/Bob-Sorrell"
                }
            ]
        }
    ]
}