{
    "title": "Is Karma something made up? Is there any proof of Karma? - Quora",
    "tags": [
        "Karma",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Beligere Manjunath",
                "href": "/profile/Beligere-Manjunath"
            },
            "answer_text": "KARMA is KAR MA, Kar means action, Mama Kar is “MY ACTION” KAR springs from the dhatu KRI Every action has a reaction. This is the natural Law. And this consequence is called KARMA PHALA This is very scientific. Let me explain with examples in recent history. Crimean War lead to grouping of the Eastern European forces and Western Europena forces, and lead to World war I After the Bolshevik revolution in Russia, 14 European Nations try to invade Russia , from the White Sea, to restablish TSAR. Thus was born the European conflict. And leads to World War II World war II lead to Cold War Cold War lead to formation of Nato, Cento and Seato and Warsaw pacts Which lead to Afghan Conflict and generation of AlQuaida by the US Al Quaida lead to destruction of Word Trade Centre Which lead to Invasion of Afghanistan and Iraq Toppling of all Arab Regimes Firendly to Russia Which lead to circumvention of Russia Which lead to Syrian conflict and consequent WarEach one is KARMA and we do not see any end to this Karma or Karma Phala Even in Indian History, the Karma Phala on the destruction of Temples in Somanath, Kashi, Mathura and Ayodhya is yielding Karma Phala. Some consequences appear quickly and some others belated, but happen , they will definitely, as it is a LAW OF PHYSICS Man destroying other species to expand himself and his kind is a Karma and we will have to suffer its consequences, sooner or later, but certainly ",
            "date": "Answered October 5, 2018",
            "views": "282",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matthew Ebert",
                    "user_href": "/profile/Matthew-Ebert-2"
                },
                {
                    "user_id": "Frank Anthony Caruso, Jr.",
                    "user_href": "/profile/Frank-Anthony-Caruso-Jr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Asimendrakumar Dhirendrakumar Dechaudhari",
                "href": "/profile/Asimendrakumar-Dhirendrakumar-Dechaudhari"
            },
            "answer_text": "In ordinary sense, everyone, even the most ordinary person believes in Karma or action. Everyone instinctively believes that he can get a result or fulfil his desire and requirements only if he works. No-one, no God, will do that for him. This is the Law of Karma, As we sow, so we reap. But everything does not depend on our own action, there are many external and unknown factors which determine the result of our action because everything is not under our control. For example, I study very hard to come out first in the class but someone else comes first through competition. An unintelligent student may even fail despite working hard. The result of our action may be equal to our expectations, more or less or even opposite to our expectations. This is because of many unknown factors beyond our self-control. Praying to a God for results only means to hope that the unknown factors will be taken care of. So, the complete law of Karma must include all known and unknown factors. This is mere fact of life and not just a question of faith. We have no alternative but to believe in this. Belief in the Law of Karma empowers us by saying that I am responsible for myself, which is the key to success in life. No one else is responsible for my fate including God. Law of Karma should not make us fatalistic, then its purpose is lost. Law of Karma is also not deterministic because we always have free will to change the destiny of our life by action in the present. In Bhagvadgeeta it is said that knowledge of Self can burn up all Karma of the past in a moment. Now, question is, if there is a theft in my house, am I responsible or the thief is responsible for the theft? I am responsible in the sense that I might not have taken enough precautions to prevent the theft but I have no alternative but to accept the fact of the theft whether I like it or not. The thief is responsible for doing an immoral and illegal act for which he must punished by both human law and devine law. But, whereas my loss is a minor material loss, the loss incurred by the thief is a spiritual loss which is a much greater loss than my loss and for which he has to make a payment as per the Law of Karma in the form of mental suffering. ",
            "date": "Answered October 6, 2018",
            "views": "127",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Stanley Tai",
                    "user_href": "/profile/Stanley-Tai"
                }
            ]
        }
    ]
}