{
    "title": "Is life all about winning and losing? - Quora",
    "tags": [
        "Loss, Grief, Bereavement and Mourning",
        "Winning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Priyanka Yadav",
                "href": "/profile/Priyanka-Yadav-167"
            },
            "answer_text": "We all have had that one bad experience which helped us to get closer to ourselves. Have you read about Yin & Yang? Or how opposites compliment each other? If you haven’t read about them then go on and read, you will love it. You will learn why winning and loosing ar equally important in life.  I’m a believer of Yin and Yang. I believe what Yin & Yang describes how opposite or contrary forces are actually complementary, interconnected, and interdependent in the natural world, and how they give rise to each other as they interrelate to one another. Isn’t It so obvious that there can’t be a day without night or cold without hot? Well, it’s only obvious if you have not understood it. If I ask you the opposite of Cold, you will readily say Hot. But does it really the opposite of cold or it is complementary to cold. Now, if you will understand the dynamics of things then you will understand that it is not at all obvious. You see, cold is not the opposite of ‘hot’, in fact cold cannot exist without hot. Similarly, each and every aspect of life is Yin and Yang. It’s a law of duality. Now, look back in life and think of all the decisions that you made and what is the consequences of that decision would have been. What would have happened if you would have elected for a different decision. The answer is that every yin has a seed of yang and you would have ended in the same place where you are now, only the experience would have been different. Because this is the basic construct of our world we live in. Our world knows how to balance things in all aspects. The important thing is what you gained from it. That very thing will help you curate the purpose of your life.  The only thing that values is your purpose for life. Have you acquired the sufficient knowledge that will help you to understand your true purpose of life. Each individual is here to fulfil a special purpose and if you are not contributing towards it then you will have to take another life. Bhagwad Geeta depicts it wonderfully the struggles an individual has to undergo when embarking on a spiritual journey. Some of these struggles are related to one’s faith and the other to one’s determination to continue. ",
            "date": "Answered October 4, 2016",
            "views": "32",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Trinh Minh Duy",
                    "user_href": "/profile/Trinh-Minh-Duy"
                },
                {
                    "user_id": "Rut Naik",
                    "user_href": "/profile/Rut-Naik"
                },
                {
                    "user_id": "Rubeth Medina",
                    "user_href": "/profile/Rubeth-Medina"
                },
                {
                    "user_id": "Nida Zaki",
                    "user_href": "/profile/Nida-Zaki"
                },
                {
                    "user_id": "Lifectionery",
                    "user_href": "/profile/Lifectionery"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aishwarya Unnikrishnan",
                "href": "/profile/Aishwarya-Unnikrishnan-1"
            },
            "answer_text": "Yes!Life is all about winning and losing!The only thing is what you perceive as winning or losing.For eg. When I get all my to-do's successfully and improve myself even 0.1% I have won that day. If I have made someone sad (especially myself) or lazed around then it is a day I lost. Life is better for me when I celebrate even small success. And that's because I care about winning every game. Because that was how I was brought up. Every win was given huge significance by my parents and even a small failure, even though it may be a class test, was looked down. So I believe its just about your opinion.. Your views in about life.. Your idea of happiness.If winning makes you happy then why not make everything a game and enjoy your success.And just believe the game is not over because you haven't won yet! ",
            "date": "Answered October 3, 2016",
            "views": "18",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "PewPew Pie",
                    "user_href": "/profile/PewPew-Pie"
                },
                {
                    "user_id": "Ashwin Raj",
                    "user_href": "/profile/Ashwin-Raj-221"
                },
                {
                    "user_id": "Nida Zaki",
                    "user_href": "/profile/Nida-Zaki"
                },
                {
                    "user_id": "Alejandro Godina",
                    "user_href": "/profile/Alejandro-Godina"
                },
                {
                    "user_id": "Labhini Pagarware",
                    "user_href": "/profile/Labhini-Pagarware"
                },
                {
                    "user_id": "Mohit Sinha",
                    "user_href": "/profile/Mohit-Sinha-30"
                }
            ]
        }
    ]
}