{
    "title": "Is morality subjective or objective? - Quora",
    "tags": [
        "Religion and Morality",
        "Atheism and Morality",
        "Subjectivity",
        "Objectivity",
        "Atheism",
        "Morals and Morality",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ted Wrigley",
                "href": "/profile/Ted-Wrigley"
            },
            "answer_text": "Morality is neither purely subjective nor purely objective. It is developmental. Most people objectify morality. I mean that literally: they turn morality into an object that they have to ‘discover’ outside of themselves or deep within themselves. But morality is a mode of reasoning, not a thing, and like other modes of reasoning it (hopefully) develops and matures over time and experience. We have one conception of morality now, but with a little more experience of the world we may come to find our current conception unworkable and develop a deeper philosophy about it. That is not less moral and more moral, or wrong and right; that is less developed and more developed. We are all works in progress. We all try to do right in the world; that is the essence of morality. But we don’t always understand what ‘doing right’ means n a given context, and often have to fumble our way through it as we work it out. If you want to put this in science terms, morality is a theory and our lives are the empirical evidence we test it against. ",
            "date": "Answered October 11, 2016",
            "views": "387",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chudi Ikpeazu",
                    "user_href": "/profile/Chudi-Ikpeazu"
                },
                {
                    "user_id": "Carl Ang",
                    "user_href": "/profile/Carl-Ang-1"
                },
                {
                    "user_id": "Chris van der Walt",
                    "user_href": "/profile/Chris-van-der-Walt-1"
                },
                {
                    "user_id": "Sagun Singh",
                    "user_href": "/profile/Sagun-Singh"
                },
                {
                    "user_id": "Brian Johnson",
                    "user_href": "/profile/Brian-Johnson-429"
                }
            ]
        },
        {
            "author_info": {
                "name": "T Mischke",
                "href": "/profile/T-Mischke"
            },
            "answer_text": "Q: “Is morality subjective or objective?” A: The definition is dependent upon the perspective from which the standard is viewed/applied. Morality can be subjective in that each individual may define a set of rules (based upon whether a value judgement rendered) labels a condition either attractive or repulsive, and is deserving of penalty imposition. This person-specific set of rules has no commonality with other people, for the reason cited - it is invented by the individual, according to desires. An objective morality must (by definition) apply equally to all people, regardless of personal preferences of any individual. I contend that in order for it to be devoid of bias (which is introduced by people subject to the standard), then it must transcend human definition. It must come from outside humanity. [I disqualify any discussion of “alien” perturbation of an evolutionary development, because the “aliens” are *contingent* beings (just like human beings). The standard must apply to them a well - and they run the same bias introduction risk.] If a reasoning being is defining the standard, and humans are disqualified, then it must come from God - a singular, unique being. ",
            "date": "Answered September 22, 2019",
            "views": "88",
            "upvotes": "0"
        }
    ]
}