{
    "title": "Is Nietzsche worth reading in this day and age? - Quora",
    "tags": [
        "Friedrich Nietzsche (philosopher, author)",
        "Literature",
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frederick Dolan",
                "href": "/profile/Frederick-Dolan"
            },
            "answer_text": "Here are some reasons why Nietzsche is worth reading in this day and age. (By this day and age, I mean the contemporary Western world. Note that there are also reasons why Nietzsche is worth reading in any day and age.) Our age is characterized (or so it seems) by a large amount of anger and resentment. It could be that it’s all righteous anger at genuine injustices, but there are indications that some people are taking relatively minor annoyances as if they were attacks on their humanity. If there’s anything to this – I believe there is – we need a theory of resentment. Nietzsche has a theory of resentment. (On the Genealogy of Morals, First Treatise; Beyond Good and Evil §260.)Our age is characterized by religious conflict, especially (though by no means exclusively) among the three Abrahamic religions of Judaism, Christianity, and Islam. Nietzsche was deeply interested in the first two (and somewhat interested in the third), and more importantly he has original things to say about them. (The Anti-Christ; Beyond Good and Evil, Part Three: The Religious Nature.)Ditto for political and ideological conflict. (Beyond Good and Evil, Part Eight: Peoples and Fatherlands; The Will to Power §133.)Our age is characterized by a decline in religion. The trend in Europe, and even in America, is towards the abandonment of religious faith (at least in the case of Christianity). This is something Nietzsche both predicted and hoped for, and again he has some very original thoughts about its causes. (The Gay Science §125; On the Genealogy of Morals, Third Treatise.)In addition to the Church, there seems to be a lack of trust in other institutions: government, business, science, the university, etc. As the traditional institutions of power and knowledge wear out, people fret more and more about the meaning or purpose of life. This is also something that Nietzsche predicted and about the causes of which he speculated. (The Will to Power, Book I, Part 2: On the History of European Nihilism.)In the digitalized and globalized world, private technology and media corporations are beginning to exercise more influence than democratic governments and civic institutions. The basic premise of technology is that everyone should be able to get anything they want, whenever they want it, effortlessly. The ideal type of person implied by this project is one that Nietzsche thought and worried about a great deal: “the last [or ultimate] man” (letzte Mensch) as Nietzsche ironically called him. (Thus Spoke Zarathustra, “Zarathustra’s Prologue”; The Will to Power §868.)The modern age is characterized by rapid, continual, and comprehensive change. Nietzsche thought a lot about the pros and cons of living in a world in which everything is “up for grabs” and no value or belief is safe from questioning and skepticism. At times, he thought nothing truly great could be accomplished in such a culture. At other times, he felt that this kind of flux could lead to the emergence of individuals capable of more than any previous culture had ever seen. (“On the Use and Abuse of History for Life” (in Untimely Meditations; The Gay Science §124.)Below: Roy Lichtenstein, Modern Head #4 (1970).  ",
            "date": "Updated October 29, 2020",
            "views": "175",
            "upvotes": " View 227 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Manoj Reddy",
                    "user_href": "/profile/Manoj-Reddy-740"
                },
                {
                    "user_id": "Alyssa Morris",
                    "user_href": "/profile/Alyssa-Morris-107"
                },
                {
                    "user_id": "Stephen Batman",
                    "user_href": "/profile/Stephen-Batman-2"
                },
                {
                    "user_id": "Shreepriya Mutalik",
                    "user_href": "/profile/Shreepriya-Mutalik-1"
                },
                {
                    "user_id": "Gonçalo Melo",
                    "user_href": "/profile/Gonçalo-Melo-13"
                },
                {
                    "user_id": "Simon Randall",
                    "user_href": "/profile/Simon-Randall-24"
                },
                {
                    "user_id": "Siddharth Nigam",
                    "user_href": "/profile/Siddharth-Nigam-42"
                },
                {
                    "user_id": "Santiago Orellana",
                    "user_href": "/profile/Santiago-Orellana-3"
                },
                {
                    "user_id": "Jake Pilkington",
                    "user_href": "/profile/Jake-Pilkington"
                },
                {
                    "user_id": "Nicholas Skokos",
                    "user_href": "/profile/Nicholas-Skokos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thaddeus Lovelock",
                "href": "/profile/Thaddeus-Lovelock"
            },
            "answer_text": "Nietzsche predicted aspects of our age like no other philosopher in my opinion. He foresaw the cataclysm that would be unleashed throughout , what we call western civilization with the “death of God” .In the “Parable of the Madman”, in his book “the Joyful wisdom”, he explains this cataclysm in the following way. “The madman jumped into their midst and pierced them with his eyes. \"Whither is God?\" he cried; \"I will tell you. We have killed him---you and I. All of us are his murderers. But how did we do this? How could we drink up the sea? Who gave us the sponge to wipe away the entire horizon? What were we doing when we unchained this earth from its sun? Whither is it moving now? Whither are we moving? Away from all suns? Are we not plunging continually? Backward, sideward, forward, in all directions? Is there still any up or down? Are we not straying, as through an infinite nothing? Do we not feel the breath of empty space? Has it not become colder? Is not night continually closing in on us? Do we not need to light lanterns in the morning? Do we hear nothing as yet of the noise of the gravediggers who are burying God? Do we smell nothing as yet of the divine decomposition? Gods, too, decompose. God is dead. God remains dead. And we have killed him”. How shall we comfort ourselves, the murderers of all murderers? What was holiest and mightiest of all that the world has yet owned has bled to death under our knives: who will wipe this blood off us? What water is there for us to clean ourselves? What festivals of atonement, what sacred games shall we have to invent? Is not the greatness of this deed too great for us? Must we ourselves not become gods simply to appear worthy of it? There has never been a greater deed; and whoever is born after us---for the sake of this deed he will belong to a higher history than all history hitherto.\" ",
            "date": "Answered September 20, 2019",
            "views": "323",
            "upvotes": "0"
        }
    ]
}