{
    "title": "Is natural law theory more plausible than utilitarianism? Why or why not? - Quora",
    "tags": [
        "Natural Law",
        "Utilitarianism",
        "Ethics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Maciej Sitko",
                "href": "/profile/Maciej-Sitko"
            },
            "answer_text": "Utilitarianism is more plausible because it bases its theory on something real and substantial, i.e. concept of pleasure/pain. Utilitarians can then use statistics to calculate happiness index measures[1]. This we already do to indicate which countries are the most attractive due to their well-being. There are general flaws in utilitarian distribution because it doesn’t matter how things are distributed but counts the general index. In other words, consider John, Mary and Joe. For utilitarian, it is much better if John has $12,000 and Mary and Joe have nothing than if they have $3000 each. Natural law is metaphysical speculation that there exists some immutable law of nature that warrants (for some proponents) private property, and specific orderly behaviour of man. We know it false due to the advancement of biology; Darwinism, in particular. Mother nature is blind and its workings largely contingent[2]. Natural law posits something which is rooted in scholastic philosophers such as Aquinas. Those philosophers thought that God created the world in some essentialist way so that creatures have their essences and all things work in accordance with certain order. Later philosophers, like Locke, tried to justify this in many other ways but ended up recurring back to God. In the end, we know through anthropology (fossil records) and 20th-century science that such a lawlike vision of nature is false. Atop of that, even modern laws of physics are just models that assert extremely high probabilities or probability distributions. These “laws” might as well break, change and can in principle be replaced[3]. Footnotes[1] World Happiness Report - Wikipedia[2] The Blind Watchmaker - Wikipedia[3] There Are No Laws of Physics. There’s Only the Landscape. | Quanta Magazine",
            "date": "Answered October 23, 2020",
            "views": "158",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Will Jensen",
                    "user_href": "/profile/Will-Jensen-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jacob Koval",
                "href": "/profile/Jacob-Koval"
            },
            "answer_text": "I think that the problem with this question is that Natural Law theory and Utilitarianism are not mutually exclusive, in spite of the fact that as a matter of contingent fact they have not famously both been utilized or believed by the same philosopher (at least as far as I know). Natural Law theory is fundamentally a metaethical theory, whilst Utilitarianism is fundamentally a normative ethical theory. The field of normative ethics attempts to answer questions regarding what we ought to do in various possible scenarios: in other words, how we ought to live, behave, compose ourselves, act, and respond to various situations. According to Utilitarianism, the best way to act or behave in any given scenario is by acting in such a way that you maximize total happiness or pleasure (depending on which strand of utilitarianism you adopt). This general utilitarian maxim exists as a way of solving problems in normative ethics, such as whether or not we ought to give to charity, or whether or not it is ever okay to lie, etc. The field of metaethics attempts to answer more abstract and general questions about normativity, such as what the metaphysical status of moral properties are, whether or not moral properties exist at all, what the relationship between apprehending moral truths and being motivated to act in accord with said truths is, and how we epistemologically come to know about moral truths. Natural Law theory is the metaethical view that moral truths are objective, that moral properties are natural properties, that moral truths are apprehendable via reason, and that moral facts exist and are knowable independently of one’s cultural institutions or government. If my understanding of these two theories is correct (and I believe it is), there is nothing inconsistent about believing in natural law theory and utilitarianism simultaneously. All you have to do is believe that moral truths are objective, universal, natural, and apprehendable via reason, whilst simultaneously believing that “the right thing to do in any given scenario is that which will maximize overall happiness (or pleasure)” is one such natural moral truth. Historically, many notable natural law theorists such as Robert Nozick and Murray Rothbard have believed in normative ethical theories that are more deontological. I suspect that this is why Natural Law and Utilitarianism are not normally associated with one another. ",
            "date": "Updated August 2, 2019",
            "views": "623",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Morris Turiel aka The Natural Lawyer",
                    "user_href": "/profile/Morris-Turiel-aka-The-Natural-Lawyer"
                },
                {
                    "user_id": "Sigurd Fjeld Halvorsen",
                    "user_href": "/profile/Sigurd-Fjeld-Halvorsen"
                },
                {
                    "user_id": "John Richardson",
                    "user_href": "/profile/John-Richardson-500"
                }
            ]
        }
    ]
}