{
    "title": "Is our existence by choice or are we forced to live? - Quora",
    "tags": [
        "Existence",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sumeet DJ",
                "href": "/profile/Sumeet-DJ"
            },
            "answer_text": "This is a forced life.  Children have no choice. They didn't have a say in their parents decision to bring them into this world. Children are generally naughty and full of life. Their life is smooth, no room for logic. They have nothing to worry about, or they worry about petty things.The above phase continues till the children become teenagers. They get influenced by their friends regarding “My life, my rules”,etc. They experience flings, chrushes etc. They hit puberty, all they want is their freedom.They feel that they have been forced to be what the society needs of them. It seems true most of the time, there is also a possible arguement with family members, leading to distancing themselves from family.After the age of 25, when some maturity pops in, they realise that they have become mechanical robots. They tirelessly work from 9 to 5. It's like somebody sucked the life out of them. They make bigger life decisions, they generally feel bored all the time and eventually end up being sad.After 25, parental pressure starts to build up regarding marriage, kids,etc.Once you have married, people expect certain things from you. In order to mingle with the societal norms, we adjust ourselves to conform to these norms.All these happen while you are still dealing with the loan that you have to repay, the angry boss you have to deal with, the constant competition against your colleagues.At the age of 35, your daughter goes to school. By now, all we think about is her future, start saving towards it and life goes on.At the age of 45, you experience the generation gap when your daughter disrespects you and goes out with her lover. You feel dejected.Now, what went wrong? Even during this forced life, we can liberate ourselves from this chaos. We have to get this into our minds! We are sent to this world to live this life, make memories, enjoy till the last minute.While we sure love our spouse, daughters, sons etc., and no matter how much they matter to us, we must spend some quality time alone.Try to figure out what makes you happy. It may be long drive, world tour, strip club, thai spa, etc. Do it constantly, do it till you get satisfied. Don't stop till you have absolutely no regrets.No matter how hard life gets, try smiling more often.",
            "date": "Answered April 24, 2017",
            "views": "711",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suhas Sharma",
                "href": "/profile/Suhas-Sharma-20"
            },
            "answer_text": "I think this matter rests solely with the individual. Either you are a believer of fate, governed by circumstances or you believe in writing your own destiny. In the former case you are being forced to live. In the latter one it's living by choice. Most of us vacillate between these two existences. On some days our mindset is to take on every hurdle. On other days, we simply submit to whatever is thrown at us. Individuals on the two extremes, one that is living by force, are grossly unhappy because they have little or no control over the status quo whereas those living on the other extreme of choice are optimistic, successful and impact individuals. ",
            "date": "Answered April 23, 2017",
            "views": "536",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Wiandry Adi",
                    "user_href": "/profile/Wiandry-Adi"
                }
            ]
        }
    ]
}