{
    "title": "Is postmodernism dead? If yes, what comes after it? - Quora",
    "tags": [
        "Modernism",
        "Postmodernism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nicholas Cooper",
                "href": "/profile/Nicholas-Cooper-8"
            },
            "answer_text": "Anything that follows postmodernism must recognize and learn from both modernism and postmodernism, or we end up just rehashing the same things we have previously learned. We are not at a stage where there is a name for post-post-modernism, but whatever it is will likely be have some notion of “connectedness” in the name. Before I continue, I want to address the “connectedness” comment: The Internet has connected many of us to each other, but has also given us a way to study how such connectedness can actually lead to bias.Neural Networks and the study of the brain has taken off as research areas.Topology, the study of connectedness, has become one of the dominate mathematical areas of study. Most of this has had to do with the Internet and AI.In much of this, I believe that when people talk about holism, they are talking about an intuitive description of topological and categorical analogies to ideas.The connectedness will continue as people continue to meet, despite that there are reactions to this pluralistic connectedness happening. Diversity will continue to be studied, but it will be studied without as many absolutes. Hence, we will not advocate for diversity for the sake of diversity, but will instead advocate for inclusion. The lessons from modernism and postmodernism will lead to various themes: There is no utopia. Every day we must strive to be more understanding, more inclusive, and build better structures that are not based on “power over things”, but on usefulness together.Technological change is not going to magically make us better, nor will it destroy us all. It is up to human beings to figure themselves out before technology will be of benefit. AI will not solve all of our problems. Biomedicine will not solve all of our problems.Humans will be working together with machine and biology. We will stop seeing ourselves as separate from the things that we carry, but something that supplements us (I want to say, “is part of our identity”, but I think that word can be misunderstood and misused right now).Wisdom, compassion, confidence, trust, and belonging will all be necessary things for humans to stockpile, not just food, money, and knowledge.There are some things that just cannot be defined in a certain, black-and-white manner. On that line of thinking, the “primordial goops” that make up various fields, like epistemology and rationalism will have to be understood to require a plurality of concepts and a plurality of trusted sources to build on.We have had a tendency to distill things into memes, but we have distilled the message out of what was being said by doing so. Instead of understanding Nietsche, we get Nazism. Instead of understanding Marx, we get dictatorships. Instead of understanding Machiavelli, we end up with his parodies. Instead of understanding most holy books, we get wars and terror. Instead of critically analyzing Latour, Gödel, and Russell, we get propaganda and anti-science.Often the bad guys are the ones that think they are the good guys. We are already more accepting and understanding of the antogonists in movies and television, and sometimes even watch series about anti-heroes. However, even farther than that, we are slowly catching on that morality cannot either be deontic nor utilitarian, but often must encompass various things: intuition, rationality, intention, consequences, etc. It takes a pluralism of foundational principles to build up a morality, just as it takes a “primordial goop” of mathematical concepts to build up a strong foundation of mathematics.We will slowly understand that post-modernism was neither anti-science nor anti-faith, but that people will need to know who or what to trust.Furthermore, the philosophies that follow will emphasize everyone’s personal responsibility for how their world is: we are all responsible for our government, our media, our society, our corporations, our academia, and our environment as it is all shaped by our values.There will be a push to get us to return to getting together in communities, and talking in person again. Communication is great over the Internet, but we will see a resurgence of face-to-face communication.As it all cools down, we will all be grateful for both modernism (for giving us modern science and technology) and postmodernism (for giving us computer science through reductive and foundational mathematics and for breaking up structures that have been based solely on maintaining power).Ironically, post-postmodernist philosophy will again emphasize philosophy, where the puritanical pragmatism will be understood to have been a failure. We won’t have STEM, but STEAM + Philosophy + Life Skills. This will mean that the themes will be seen around society, such as: Many ideas for a distributed-yet-connected governmentMore automated governments such that each person has more direct and interpersonal interactionMore choices regarding where your money goes, more choices on how you are representedArtificial Intelligence complementing human creativityProgrammers and artificial intelligent agents interacting and working togetherMore arts and design, with the details (including safety requirements) checked by computerReinterpretations of spirituality through theology, psychology, and scienceFocusing on belonging to something greater than oneself.Reverting to the days when science informed, not countered spiritual thought, regardless of whether it is a materialist view or not.Recognition of the importance of the differences in interests and skillsA diverse set of interests and skills will be seen to strengthen our society, and connect us to each otherInterests and skill, not race, gender, nor sexuality, nor poverty, will continue to have more influence on what you can do with your lifeWe will begin to tackle the problem of the “elitism” vs “anti-elitism” warOnly AFTER people get tired of all of the back-and-forth attacksWe will return to seeking out other perceptions to understand our realm through other’s eyesIrony and humor will return and will return stronger than ever, and intent and consequences will both be discussed when there are uncomfortable interactions. However, when it comes to interactions that are violent, abusive, or harmful, it will not be tolerated. Other than that, we will recognize the need for learning experiences (i.e. mistakes).No topic will be taboo, but people will be candid when they are taking things too far. Yes, a balance will be struck, one that makes sense.We will begin to see our lives as connected:There will be more introspection than there currently isWe will understand that other people can see our blind spots that we cannot (Johari Window), and therefore seek out those who can help us view itMuch of what we talk about will seem like rehashing ancient ideasThe New Age thinking is partly post-modern, and partly post-post-modernHowever, with more critical thinking, we will notice that we are bringing ancient ideas back with a new light, and that New Age thinking will need to become more rigorous and require more critical thought, or risk extinction However, modernism began with sparks early in the 1700s and really took off in the 1900s, finally beginning to fade strongly in the 1980s (a contentious view, with other opinions possible). Postmodern philosophical positions had “sparks” in the 1800s (pre-civil rights) and some serious sparks (the spread of propaganda as breakdown of epistemic means) through WW2, but became mainstream (deconstructionism) in the 1950s and into serious discussion in the 1980s with Derrida. The point is that Postmodernism may still have some work to do before the next phase begins, and that all of the sparks for the new philosophical phase are already taking place.  Edit and thoughts: One can consider that if Hegel’s classifications of triadic philosophical thought are correct, then modernism is the thesis, post-modernism is the antithesis, and what comes next will be the synthesis. This synthesis will be more like Modernism 2.0 ",
            "date": "Updated November 8, 2019",
            "views": "36",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nathan Ketsdever",
                    "user_href": "/profile/Nathan-Ketsdever"
                },
                {
                    "user_id": "Alexander Edward",
                    "user_href": "/profile/Alexander-Edward-21"
                },
                {
                    "user_id": "Jonathan Crews",
                    "user_href": "/profile/Jonathan-Crews-2"
                },
                {
                    "user_id": "Richard Bennett",
                    "user_href": "/profile/Richard-Bennett-11"
                },
                {
                    "user_id": "Khabtani Tahar",
                    "user_href": "/profile/Khabtani-Tahar"
                },
                {
                    "user_id": "Michelle Lopez",
                    "user_href": "/profile/Michelle-Lopez-513"
                },
                {
                    "user_id": "Zihark Aero",
                    "user_href": "/profile/Zihark-Aero-1"
                },
                {
                    "user_id": "Yven Johannes Leist",
                    "user_href": "/profile/Yven-Johannes-Leist"
                },
                {
                    "user_id": "Jose Luis Wong",
                    "user_href": "/profile/Jose-Luis-Wong"
                },
                {
                    "user_id": "Josh McSherrod",
                    "user_href": "/profile/Josh-McSherrod"
                }
            ]
        },
        {
            "author_info": {
                "name": "T. Collins Logan",
                "href": "/profile/T-Collins-Logan"
            },
            "answer_text": "Thanks for the A2A. I think Mack Moore has an interesting take. Here’s mine: There already has been a shift into post-postmodernism, the definition of which isn’t yet settled (see: Post-postmodernism). However, I discuss some of the more broadly-held conceptions here: T. Collins Logan's answer to What is post-postmodernism? My conclusion in that post: “In my own work, I view the post-postmodern or metamodern stance as applying conceptions of multidialectical synthesis to the cultural-artistic sphere.” But what do I mean by “multidialectical synthesis?” Essentially, as I discuss in my essay Managing Complexity with Constructive Integralism (also available here: http://www.tcollinslogan.com/images/ManagingComplexity.pdf), this is a specific mode of “integralizing” diverse perspectives into a balanced, harmonious synthesis which transcends them all. Which means we can’t yet know what the landscape looks like as a endpoint, but we can begin to appreciate what it looks like as a process — it is a map but not the territory. The approach itself draws upon many different integral, dialectical and mystical thinkers — that is, it intends to practice the same process in its synthesis of method, so that it, too, will understandably evolve. Now the question of “what comes after postmodernism” also has implications for society as whole, mainly because of factors like increasing superagency, complexity, technology, consequent epigenetics, etc. What I discuss in my explorations of political economy is that whatever comes next will require our moral evolution to keep pace (which to date it has not). If we can’t become more morally mature, the human species is doomed — you can read more about this concern here: L7 Prosociality, and here: L7 Superagency. Our future is both contingent and emergent — we have some influence over our own trajectory, if we can collectively take responsibility. At this juncture in human civilization, there are powerful, competing interests who are highly motivated to disrupt moral development, the prosocial evolution of our political economy, and indeed the well-being of most human beings (you can read about them here: L7 The Case Against Capitalism, here: L7 Neoliberalism, and here: L7 The Spectacle). And part of that disruption is not allowing us to move beyond postmodernism (just as the same forces often resist moving beyond traditionalism) — or by amplifying discord, polemics and dismissive rhetoric around our most viable prosocial options. With the variables above in mind, “what I believe” is what I try to promote with my writing and activism as referenced in some of the links above. It’s the choice I want to affirm. Will this hope bear fruit? We shall see…. My 2 cents. ",
            "date": "Answered February 14, 2018",
            "views": "16",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Minh-Anh Huynh",
                    "user_href": "/profile/Minh-Anh-Huynh-2"
                },
                {
                    "user_id": "Jamal Bousrif",
                    "user_href": "/profile/Jamal-Bousrif"
                },
                {
                    "user_id": "Nicholas Cooper",
                    "user_href": "/profile/Nicholas-Cooper-8"
                },
                {
                    "user_id": "Grant Looper",
                    "user_href": "/profile/Grant-Looper"
                },
                {
                    "user_id": "Colin Brence",
                    "user_href": "/profile/Colin-Brence-1"
                },
                {
                    "user_id": "Toby David Low",
                    "user_href": "/profile/Toby-David-Low"
                }
            ]
        }
    ]
}