{
    "title": "Is philosophy a competitive major? - Quora",
    "tags": [
        "Philosophy (college major)",
        "Philosophy of Life",
        "College and University Majors",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Allen Stairs",
                "href": "/profile/Allen-Stairs"
            },
            "answer_text": "Are you asking whether it’s hard to get into philosophy programs? Or are you asking whether being a philosophy major will help you get a job? And if so, do you mean a job of some sort or a job as a professional philosopher? Or do you want to know whether philosophy majors tend to be competitive people. The first question is easy. The philosophy programs I know of are open at the undergrad level. Anyone who wants to sign up can. Grad school is another matter; more on that below. On the second question, first version (getting a job in general) it depends. Philosophy majors do particularly well on the LSAT (Law School Admissions Test) and other similar tests, and so a philosophy major can be a good first step into various professions. Philosophy majors also develop a variety of useful general skills, and the data I’ve seen suggests that philosophy majors do pretty well on average ten years out from graduation . However, if you’re asking about the chances of becoming a professional philosopher, the answer is not encouraging. It’s not easy to get into a good PhD program (and you need a PhD to have a serious chance of getting a job in academia). And even if you write a good dissertation, it’s hard to get an academic job that offers a chance of long-term employment. I would discourage anyone from trying to become an academic philosopher unless they are very motivated and very good at philosophy. Finally: are philosophy majors competitive people? Well, they like to argue; anyone who can’t tolerate disagreement is likely to find philosophy distasteful. Whether competitiveness is the best way to describe this side of philosophy is a little less clear. Good philosophers aren’t interested in winning arguments for the mere sake of winning. They are interested in getting things right, and tend to be passionate about their views. But being good at philosophy doesn’t mean being dogmatic and doesn’t require being a jerk. And at the professional level, most (not all!) philosophers are able to keep their passion for their views within the bounds of civility. ",
            "date": "Answered August 16, 2019",
            "views": "856",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ryo Sato",
                    "user_href": "/profile/Ryo-Sato-20"
                },
                {
                    "user_id": "Ulrich de Balbian",
                    "user_href": "/profile/Ulrich-de-Balbian"
                },
                {
                    "user_id": "Tom Brookins",
                    "user_href": "/profile/Tom-Brookins"
                },
                {
                    "user_id": "Paul So",
                    "user_href": "/profile/Paul-So"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Sprague",
                "href": "/profile/Sam-Sprague"
            },
            "answer_text": "I’d say it’s towards the middle. The Humanities are under-enrolled in general due to the current demand for STEM degrees, and fears about getting stuck as a barista into your 30s. Especially affected are the more arcane and ‘obsolete’ fields such as Classical Studies, Theology, and yes, Philosophy. It would be competitive to gain admittance to the Harvard Philosophy department, but much less competitive than their business or law programs. Philosophy is the ultimate “what are you gonna do with that?” major, and there’s basically no economic incentive to study it. Taking all this into account, it’s interesting that philosophy majors still have some of the most impressive academic achievements, and can also stand their own in career attainment. We’re among the highest scoring on the GRE, bested only by physics. We have high GPAs and SAT scores. Philosophy graduates are also the highest earning Humanities majors, with a median salary of ~$80,000 - higher than Business Admin. Philosophy is also a luxury study: the working class students with debt tend to go for the moneymaker degrees like nursing, and most Philosophy majors come from a middle class background where a college education is more of a ‘self-actualization’ experience. This means they may have previously attended a private school or high rated public school, which gives them an additional edge. The majority of the philosophy majors I met at UCSD would have been 3.5 GPA and above throughout high school and college. On top of this, they were enthusiastic about reading and studying outside of class, and often got involved in research. So while Philosophy is one of the least sought after majors, it’s surprisingly competitive due to the high achievements of the students who gravitate towards it. However, due to the low enrollment of Humanities in general, an average or mediocre student could gain admittance to a philosophy program at a mid ranked university without much trouble. Whether they would enjoy it and be successful is another matter. Philosophy Majors and the GRE: Updated Data (w/updates) - Daily Nous Philosophers Don’t Get Much Respect, But Their Earnings Don’t Suck Humanities Enrollment Is in Free Fall As Humanities Majors Decline, Colleges Try to Hype Up Their Programs ",
            "date": "Answered January 30, 2020",
            "views": "11",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashlyn Bell",
                    "user_href": "/profile/Ashlyn-Bell-3"
                },
                {
                    "user_id": "Alexander Finnegan",
                    "user_href": "/profile/Alexander-Finnegan"
                },
                {
                    "user_id": "Celina Ong",
                    "user_href": "/profile/Celina-Ong-4"
                },
                {
                    "user_id": "Michael Kodysz",
                    "user_href": "/profile/Michael-Kodysz"
                },
                {
                    "user_id": "Katya Yurkovskaya",
                    "user_href": "/profile/Katya-Yurkovskaya"
                },
                {
                    "user_id": "James Millikan",
                    "user_href": "/profile/James-Millikan-1"
                }
            ]
        }
    ]
}