{
    "title": "Is perception an illusion? - Quora",
    "tags": [
        "Perception of Time",
        "Illusions",
        "Perception",
        "Human Brain",
        "Philosophy",
        "Neuroscience",
        "Psychology",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Bross",
                "href": "/profile/Michael-Bross-3"
            },
            "answer_text": "No, our perceptions are not illusions, illusions occur when we make the wrong inferences from sensory/perceptual inputs. Here I’m repeating some previous points: What we call reality is a projection of our brains of what is ‘ out there’. This is done by using the input from our senses to construct objects, spaces, events, etc. We can be ‘sure’ of the accuracy of these projections because there is constant feedback from this constructed world back to our senses and thus constant updates to go along with it. When this feedback loop fails as in drug induced states or hallucinations we see the disorientation that results. Moreover, we all seem to agree on our ‘world model’, other animals with different senses and/or environments probably construct somewhat different models, but they will be as real to them, and as workable, as ours is to us Our experience of reality will always be limited by the capacity of our sense organs and the resulting perceptions. Note how our understanding of reality changes when we find means of extending our sense organs, for example the invention of telescopes and microscopes radically changed the reality of our place in the universe. All other conceptions of reality are flights of the imagination, scientific or otherwise, some of which might prove to be quite useful if and when the technical means of testing them become available- see string theory. ",
            "date": "Answered August 29, 2019",
            "views": "574",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frits van Zanten",
                "href": "/profile/Frits-van-Zanten"
            },
            "answer_text": "Perception is building an image of the outside world. That image is only an image. For example, your dogs can hear higher tones than you do, so there are more tones in reality than you know. Your cat however can’t see as many colors as you do, so the your have more reality in your image than your cat has, although the cat, like the dog can hear higher pitches than you. Bird can perceive colors in the UV-range. You can’t. So if birds, cats, dogs and you all have a different image of the outside world, say reality, what do we know about reality? And does that make it an illusion? No, not so much. It merely means it is an illusion to think reality is what we perceive. We only know some translation. And, like you may have noticed, we only talked simple sound and vision. We haven’t translated that to concepts, like a red car, a suspicious person, a spy? ",
            "date": "Answered August 28, 2019",
            "views": "175",
            "upvotes": "0"
        }
    ]
}