{
    "title": "Is Plato's theory of forms right or wrong? - Quora",
    "tags": [
        "Theory of Forms",
        "Plato",
        "Logic (mathematics)",
        "Philosophers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Allan Emery",
                "href": "/profile/Allan-Emery-2"
            },
            "answer_text": "You ask a good question. The problem with it is the term ‘true’. Let’s steal a story from James Dominic Crossan. In his story, a town named Lincoln wants to have a statue of Abe Lincoln in the town square. Two artists were asked to submit scale replicas of their ideas. One, shows Abe at the resolute desk signing the Emancipation Proclamation. The other shows Abe holding a black baby in one arm and cutting the chain of an enslaved woman, probably the mother, with an ax. The first one depicts something that happened, so it is actual. It does not tell much of a story. The second is imaginary, did not happen. But, the story it tells is ‘true’. He did free the slaves and it was very personally meaningful to each and every one. So each statue is ‘true’. The boring one is more accurate, but does that actually make it more true? Is it compelling to view a statue of a man at a desk? Or is the less accurate statue more compelling? I think the answer is simple: what message do you want to convey to those who see the statue. There is enough truth in each. So, Plato’s theory of forms is one way to represent what we observe. It is true that it does help to explain what we observe and make it more sensible. But does that make it the most accurate explanation? Not necessarily. So my answer is that it is true, but not necessarily accurate. ",
            "date": "Answered July 27, 2020",
            "views": "222",
            "upvotes": " Answer requested by Akashi Seijuro",
            "upvoters": [
                {
                    "user_id": "Nicholas Tadman",
                    "user_href": "/profile/Nicholas-Tadman-1"
                },
                {
                    "user_id": "Ethan Fleger",
                    "user_href": "/profile/Ethan-Fleger"
                },
                {
                    "user_id": "Norlito Deligero",
                    "user_href": "/profile/Norlito-Deligero"
                },
                {
                    "user_id": "Edouard Bale",
                    "user_href": "/profile/Edouard-Bale"
                },
                {
                    "user_id": "Alex Eustis",
                    "user_href": "/profile/Alex-Eustis"
                },
                {
                    "user_id": "Eli Lauze-Yesayian",
                    "user_href": "/profile/Eli-Lauze-Yesayian-1"
                },
                {
                    "user_id": "Sathyajith M S",
                    "user_href": "/profile/Sathyajith-M-S"
                },
                {
                    "user_id": "Farhad Allahverdiyev",
                    "user_href": "/profile/Farhad-Allahverdiyev"
                },
                {
                    "user_id": "Faruk Balcı",
                    "user_href": "/profile/Faruk-Balcı"
                },
                {
                    "user_id": "Omar Hadi",
                    "user_href": "/profile/Omar-Hadi-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Curtis Adler",
                "href": "/profile/Anthony-Curtis-Adler"
            },
            "answer_text": "I’m not a Platonist, but I’d resists giving a too-quick answer to this. I mean, of course Plato was “wrong” — we all know that there isn’t some special realm of pure forms, hovering up in an ethereal realm that our poor soul, scrambling its way out of the “cave” of ephemeral becoming, can behold by way of the utmost dialectical discipline if only to gain a fugitive glimpse… And yet, philosophical theories are not simple “right” or “wrong,” “correct” or “incorrect.” For indeed, if they were, what would they “correspond” to. The reality that presents itself through the senses? But in this case, “empiricism” would always already be “right” — and yet for a reason that lies beyond all experience. The true reality of things? But in that case, the correctness of the ideas would depend on an experience that, in a certain way, remains contingent. This is why philosophical truth is not representational. Philosophy does not represent some philosophical reality, the reality of reality — nor, however, is it a mere fabrication, a construct, let alone a social construct, an ideological construct. Rather, one might say that philosopher is unveiling, disclosing — it concerns the way in which things show themselves. The concept of philosophy I have offered, one will notice, is of philosophy as phenomenology, so as it was understood by Heidegger in Being and Time. But this concept of phenomenology goes back to Aristotle, and to understand what Heidegger means, you have to understand that, for him, Aristotle is already doing “phenomenology,” though he remains “held back” by certain philosophical prejudices. Moreover, Aristotle’s turn to “phenomenology” has everything to do with his recognition of both the truth, and the untruth, of Plato’s theory of the form. The truth of Plato’s theory of forms is quite clear, and yet seldom recognized by those who are too quickly inclined to an empiricist mode of thinking: the theory of forms speaks to an important aspect of experience, one that cannot be denied: namely, the self-identity of things, a self-identity which subtends change… Yet falsehood consists in the very fact that it is bound up with a kind of representationalism: that the self-identity is understood as rooted in the idea as the thing as it is in itself, and which, consequently, can be grasped by a special kind of intuition, standing off from the rest of reality. For Aristotle, by contrast, language is able to articulate being as it is, it is able to show things as they are; to disclose the phenomena as they show themselves. The special intuition , even though his doesn’t reject it altogether, loses its importance. This becomes clear, for example, in the first book of the Nicomachean Ethics, where Aristotle, putting truth before friendship, argues against the doctrine of the idea of the good. One could argue, though, that Aristotle doesn’t go far enough, since, by the tenth book of the Nicomachean Ethics, he returns to sing the praise of the vita contemplative. He cannot escape the hold of Plato — the seduction of his liberation from the cave… Heidegger’s Being and Time is, first and foremost, an attempt to resume the project that Aristotle could not carry through by explicitly demonstrating the primary of Zuhandenheit over Vorhandenheit, and relating the possibility of knowledge to existence. At the same time, though, Heidegger himself failed to embrace the more radically political dimension of Aristotle… Or maybe he was too German, too Kantian: he could not see that, for Aristotle, truth and pleasure are convergent concepts — that every mode of pleasure (physical pleasures, political pleasures, contemplative pleasures — but indeed every activity has a kind of pleasure belonging to it) is a mode of truth… ",
            "date": "Answered June 16, 2019",
            "views": "19",
            "upvotes": " View 12 Upvoters"
        }
    ]
}