{
    "title": "Is reality dualistic or nondual? - Quora",
    "tags": [
        "Duality",
        "Dualism",
        "Nondualism",
        "Enlightenment (spiritual)",
        "Reality",
        "Philosophy of Religion",
        "Spirituality",
        "Philosophy",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Nielsen",
                "href": "/profile/Eric-Nielsen-73"
            },
            "answer_text": "We are just talking about truth here. This physical world is just the projection of the mind. All is mind. With that said, in the lower realms, this physical realm and some of those above this realm, the reality is dualistic. This is again because of mind. Know that the mind has intellect, which causes us to sort out things by discriminating thoughts. Or sorting things out as to what we like or don’t like and only collecting those things that fit the ego which builds for us a false identity of our selves. Usually these things have to do with desires that stimulate us from the five senses. This dualitistic thinking has to do with universal laws in these realms. They cause relativity, which is the fact that everything we do — period, is not down by itself or by us alone. Everything happens thanks to the help of everything else. Example: say you go over to a friend’s house who owns a pool table. And it is your turn to take a shot. In doing so you cannot say that you are doing this action by itself. Or as the first created thing you are doing. To think this way is not factual. To get to the facts as they actually took place, you would have to go back to the beings of creation to the very first cause which is that of God. This would include all your accurate memories of the actions you have taken since being created and all your intentions, while taking those actions. Then there is the actions of everything else and everyone else, that has come into being, that affects everything, that you don’t know about. This is why those in their right mind know that all they do in life is due to God, as his actions are the first cause and because of this fact — which is the only non-dual action in creation — that all you see and don’t see around you is in existence. This is the difference between those that falsely see themselves, born into life, as something different from all else and then go on to struggle with why life is so hard for them and happiness seems to come and go. Then there are those that go with the flow, that see themselves as the universe itself. These are people that find contentment and true happiness; to the best that life can offer in duality. And finally this is the benefit of meditation, as it can take you within yourself, so you know your original highest self, at this point of creation, where contentment is eternal off into infinity. Why? Simply because the contentment experienced there doesn’t have any objects to point to and say: “This is why I feel content.” This is solely because there isn’t any other thing in this high place. All is the experience of what it is like to be one with creation. There is one higher place within each of us and that is the moment one merges back into where one came out of. Like a drop being returned back into the infinite ocean of creation. You then become forgotten completely. This is the difference between enlightenment as people think and the ultimate enlightenment. So, from this point of non-dual thinking, because you are beyond time and space and the intellectual mind disturbing what is true, you naturally know truth or your self as pure awareness. This means clear knowing without thought. And why some say what God does in his creation isn’t personal. Why? because there in fact is no individuals to harmed in the actions that take place in the world. Only the appearance of harm, from our standpoint. If one knows this higher place within, one then knows that only God exists and this universe (meaning all you see and don’t see) is simply one complete wholeness. ",
            "date": "Answered April 23, 2019",
            "views": "80",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sri Sri",
                    "user_href": "/profile/Sri-Sri-1009"
                },
                {
                    "user_id": "Nagarajan Ramachandran",
                    "user_href": "/profile/Nagarajan-Ramachandran-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Craig Dean",
                "href": "/profile/Steven-Craig-Dean"
            },
            "answer_text": "Yes. A whole, undivided Reality (sometimes called God) brought forth Creation as an unceasing movement of apparent polarities (light/dark, high/low, positive/negative, etc). This movement is cyclical. We see it in the movement around the nucleus of an atom, of planets around suns and in the cycle of life and death. When immersed in this cyclical, dualistic reality, it is hard to conceive of a reality without any differences. From the point of view of Oneness, Creation is like rays from the Sun. Without the Sun, the rays would not exist. ",
            "date": "Answered April 13, 2020",
            "views": "39",
            "upvotes": "0"
        }
    ]
}