{
    "title": "Is religion compatible with philosophy? - Quora",
    "tags": [
        "Philosophy of Religion",
        "Philosophy",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Katerina Bittar",
                "href": "/profile/Katerina-Bittar"
            },
            "answer_text": "Everyone is an amateur philosopher. The greatest philosphers that ever lived were only guessing at the meaning of life. Thinking never replaced the deepest need of the human heart… so in steps religion. Religion was created to control people, or to help them try to be good enough to go to heaven (and that's stupid). No one can be good enough. I know I'm not. Goodness isn't earned, it's a gift: but only if we let Jesus to take away our \"sin\". Did you know Jesus was against religion? It was one of his greatest traits. He stood opposed to the \"religious\" way of trying to please God. Instead, he said he came to ABOLISH religion and give us a way to have a direct, intimate relationship with our Creator. No longer would we have to go through institutions, rituals and religious organizations to come to God. Instead we can now \"dial direct\" and have a relationship with God through Jesus. How wonderful! :) That's why I do my best to be as \"irreligious\" as possible and stress the fact that I support the Christian FAITH, but not the Christian RELIGION. That's why the Jesus of history so attractive to me. He never came to start a new religion, but to show us how we can come directly to God through him. It's up to you whether or not you want to follow this man; He invites everyone. If you don't want to, He walks away without you. ",
            "date": "Answered November 14, 2019",
            "views": "74",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carol Willis",
                "href": "/profile/Carol-Willis-35"
            },
            "answer_text": "Religion and philosophy have always been quite compatible, especially in several of the oriental philosophies, and also in western philosophy mostly up until about ~1900 but a few exceptions beyond 1900. For example, Plato, Plotinus, Augustine, Aquinas, Averroes, Avicenna, Spinoza, Ficino, Nietzsche, Hegel, C.S. Lewis, Iris Murdoch, Simone Weil, Edith Stein, Karol Woityla (later Pope John Paul II), among others. ",
            "date": "Answered November 10, 2019",
            "views": "59",
            "upvotes": "0"
        }
    ]
}