{
    "title": "Is simulated reality real? - Quora",
    "tags": [
        "Simulation Theory",
        "Simulated Reality",
        "Simulation",
        "Augmented Reality",
        "Virtual Reality (VR)",
        "Reality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joseph Geloso",
                "href": "/profile/Joseph-Geloso"
            },
            "answer_text": "Yes, but not as reality, only as a simulation. But for anyone to interact with the simulation, it must be real at some level. Simulated realities are models of actual reality, and the model is entirely contained within actual reality. A simulation is like a map. The map is not the territory; the simulation is not the thing simulated. But since in this case the thing simulated is reality itself, the simulation must be contained within the thing simulated. I hold that there are realms of reality. The physical realm is one, but there are others, to wit, the mental realm, the social realm, the political realm, etc. Each of these has its own domain, and is real in that domain. Politics operates according to discernible principles, just as the physical world operates according to other discernible principles. In this understanding of things, a simulation is an artificial realm. Anything can be modeled, and no one ever attempts to simulate all of reality; that would be a patently absurd attempt, since obviously, there could never be enough electrons in the universe to accurately simulate all the electrons in the universe! So, any “simulated reality” is necessarily a simulation of only a part of reality. Reality, therefore, is always greater than any simulation. ",
            "date": "Answered December 13, 2019",
            "views": "99",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hudson Hales",
                    "user_href": "/profile/Hudson-Hales"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miguel Hamrol",
                "href": "/profile/Miguel-Hamrol-1"
            },
            "answer_text": "No, simulated reality is just a simulation, it isn't real. It's only real in a sense of a simulation, its reality ends there. Its reality doesn't go beyond the simulation, it cannot go beyond the simulation, since that's all that it is: a simulation, and nothing more. We can only get to the real reality once we leave the simulation. No matter how real a simulation looks, it can never be real. The real reality is always outside of a simulation. By its own definition, a simulation will always be simulated, it will never be really real. The reality is different from a simulation, it's always outside of a simulation. That's what makes it real, that's what differentiates and distinguishes both of them. ",
            "date": "Answered December 13, 2019",
            "views": "55",
            "upvotes": "0"
        }
    ]
}