{
    "title": "Is space 4 dimensional? What are those dimensions? How are they represented? - Quora",
    "tags": [
        "Dimensions (geometry)",
        "Dimensions (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Manan Rathod",
                "href": "/profile/Manan-Rathod-1"
            },
            "answer_text": "According to superstring theory, there are at least 10 dimensions in the universe (M-theory actually suggests that there are 11 dimensions to spacetime; bosonic string theories suggest 26 dimensions). That’s a bit of a mind-boggler! Most people understand the basic three dimensions, and many know that the fourth dimension is probably time. The First Dimension: Length: The first dimension is length, or x-axis—a straight line, with no other characteristics.The Second Dimension: Height: Height, or y-axis, can be added to the length to produce a two-dimensional object, such as a triangle or square.The Third Dimension: Depth: Depth, or z-axis, can be added to the previous two dimensions to produce objects that have volume, like a cube, pyramid, or sphere. This is the end of the dimensions that are directly physically perceptible by human beings. All dimensions beyond the third are theoretical. 4. The Fourth Dimension: Time: The fourth dimension is the position in time occupied by a three-dimensional object.  5. The Fifth Dimension: Possible Worlds: The fifth dimension is a world slightly different than ours, from which we could measure similarities and differences to our own world.  6. The Sixth Dimension: A Plane of All Possible Worlds With the Same Start Conditions The sixth dimension is a plane containing all possible universes with the same start conditions as ours; i.e., the Big Bang.  7. The Seventh Dimension: A Plane of All Possible Worlds With Different Start Conditions The seventh dimension expands upon the sixth by plotting all possible worlds that begin with different start conditions.  8. The Eighth Dimension: A Plane of All Possible Worlds, Each With Different Start Conditions, Each Branching Out Infinitely Are you dizzy yet? (OK, OK, look, there’s a point beyond which the mind of humanity is unable to recognize without resorting to rave flyer graphics.)  9. The Ninth Dimension: All Possible Worlds, Starting With All Possible Start Conditions and Laws of Physics In each of these dimensions, which represent all possible start conditions, the laws of physics are all completely different.  10. The Tenth Dimension: Infinite Possibilities At this level of complexity, everything that is possible and imaginable exists. ",
            "date": "Answered April 10, 2017",
            "views": "25",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pristine Ng",
                    "user_href": "/profile/Pristine-Ng-1"
                },
                {
                    "user_id": "Prasanna Iyengar",
                    "user_href": "/profile/Prasanna-Iyengar-8"
                },
                {
                    "user_id": "Martin Lee Younger",
                    "user_href": "/profile/Martin-Lee-Younger"
                },
                {
                    "user_id": "Abhy",
                    "user_href": "/profile/Abhy-12"
                },
                {
                    "user_id": "Anu Harshini",
                    "user_href": "/profile/Anu-Harshini"
                },
                {
                    "user_id": "Amarnath Kakkanat",
                    "user_href": "/profile/Amarnath-Kakkanat"
                },
                {
                    "user_id": "Keval Rathod",
                    "user_href": "/profile/Keval-Rathod-6"
                },
                {
                    "user_id": "Dipesh Somvanshi",
                    "user_href": "/profile/Dipesh-Somvanshi"
                },
                {
                    "user_id": "Arjun Singh Purty",
                    "user_href": "/profile/Arjun-Singh-Purty"
                },
                {
                    "user_id": "Bhomik Kankaria",
                    "user_href": "/profile/Bhomik-Kankaria"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sitaram Bettadpur",
                "href": "/profile/Sitaram-Bettadpur"
            },
            "answer_text": "It depends on what you mean by “represented”. If you mean by pictures, then obviously it is not possible to have a realistic representation. As it is, pictures are 2d representations, so what you are looking at is a 2d representation of a 4d object! All the same, you can have pictures (e.g. of a hypercube) which “shows” or “represents” it in 2d. Mathematically, of course, it is trivial. An n-dimensional space is a collection of n-tuples {x1, x2, …xn} with each element being a real number. You can establish results about n-dimensional geometry without ever having to draw a picture. In fact one of the greatest (and not adequately heralded) revolutions in the history of mathematics was the realization by Descartes that geometry could be done more easily using algebra! (In a sense, this was a reversal of Euclid: Euclid did arithmetic using geometry, Descartes did geometry using arithmetic and algebra.) It is trivial, for example, to work out the properties of a hypersphere in 23 dimensions, including its hyperarea and hypervolume, without being able to imagine it! ",
            "date": "Answered April 10, 2017",
            "views": "476",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Varad Kabade",
                    "user_href": "/profile/Varad-Kabade-1"
                }
            ]
        }
    ]
}