{
    "title": "Is stoicism a useful philosophy in modern life? - Quora",
    "tags": [
        "Modern Life",
        "Modern Philosophy",
        "Stoicism",
        "Philosophy of Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Spencer Alexander McDaniel",
                "href": "/profile/Spencer-Alexander-McDaniel"
            },
            "answer_text": "In case you haven’t heard, the ancient Greek philosophy of Stoicism seems to be having a bit of a cultural moment right now. It is the philosophy of choice for Silicon Valley entrepreneurs, football stars, and ordinary people. There is a whole plethora of websites promoting Stoicism as a philosophy for the modern world, including “Daily Stoic,” “How to Be a Stoic,” “Modern Stoicism,” and “Traditional Stoicism.” There are also countless other resources for aspiring Stoics, including YouTube channels and bestselling books like The Daily Stoic: 366 Meditations on Wisdom, Perseverance, and the Art of Living, The Beginner’s Guide to Stoicism: Tools for Emotional Resilience and Positivity, Stoicism: A Stoic Approach To Modern Life, and countless others. There are even events for aspiring Stoics to gather and talk about Stoicism like Stoicon. All this enthusiasm over Stoicism has left some people wondering what Stoicism is, how modern Stoicism differs from ancient Stoicism, and whether either ancient or modern Stoicism is useful for modern life. I am neither a Stoic nor an ardent critic of Stoicism, but rather an outsider who happens to know a bit about Stoicism. In my view, there are quite a few things we can learn from Stoicism, but Stoicism also has some serious pitfalls that are worth taking into account. What is Stoicism? Stoicism is a philosophical school that arose in the Greek-speaking world during the Hellenistic Period (lasted c. 323 – c. 31 BC). The name of the school comes from the stoa, or porch, in the Athenian Agora that the school’s founder, Zenon of Kition (lived c. 334 – c. 262 BC) was known for teaching under. In later times, the philosophy became very prominent throughout the Roman Empire. On the most basic level, Stoicism teaches that the way to achieve εὐδαιμονία (eudaimonía), or satisfaction in life, is by learning to be happy with one’s own circumstances at any given moment. The goal of Stoicism is to remain in a state of ἀπάθεια (apátheia), which literally means “without passion.” Our English word stoic, which refers to a person who shows no visible emotion, is derived from the name of this philosophical school. Nonetheless, the modern English use of the word stoic can be misleading, since Stoic philosophers were not interested in merely hiding emotion from others but rather in ridding themselves of it. Stoicism emphasizes the inherent insignificance of the individual and the inevitability of death. Roman Stoics were fond of the saying “Memento mori,” which is Latin for “Remember that you must die.” Stoicism teaches that the universe is deterministic and that, while a person may have control over their own actions, what happens to a person is totally beyond that person’s control. In other words, according to Stoicism, you can’t control the world; you can only control how you react to it. There’s a lot more I’m leaving out for now, but what I’ve just said is the basic premise. Now you may be wondering, “How does modern Stoicism fit in? Is it anything like the ancient Stoicism?” This is certainly a question that is worth exploring in depth, especially since I have written before about how modern authors often attempt to brand their own ideas as having come from ancient philosophers in effort to give them a veneer of legitimacy. Most people today who are promoting an ideology they call “Stoicism” know a lot more about ancient Stoicism than Ayn Rand ever knew about Aristotle. Nonetheless, most forms of so-called “modern Stoicism” are still extremely different from ancient Stoicism. In fact, modern Stoicism is actually a very watered-down version of the ancient philosophy, stripped of its cosmology along with many other elements that would seem objectionable to modern audiences.  ABOVE: Photograph from Wikimedia Commons of the restored Stoa of Attalos in Athens Stoicism on power and money Perhaps the most immediately obvious difference between ancient Stoicism and the most popular form of modern Stoicism has to do with their respective attitudes towards money and power. The ancient Greek Stoics had views towards power and money that ranged from general indifference to outright negativity. The founder of Stoicism was Zenon of Kition, who was a student of the Cynic philosopher Krates of Thebes (lived c. 365 – c. 285 BC). One of the most fundamental of all the Cynics’ teachings was that wealth and power are inherently distractions from the path of virtue. Cynicism demanded that all its adherents needed to live lives of strict asceticism, adamantly rejecting all wealth and power. Krates of Thebes and his philosopher-wife Hipparchia of Maroneia lived their entire lives in voluntary simplicity. Although Zenon had been a wealthy merchant, he lost most of wealth in a shipwreck. It was after that fateful shipwreck that he met Krates of Thebes and made the decision to completely leave his old life of wealth behind in order to live a simple, ascetic life in line with Krates’s teachings. Later Greek Stoics followed Zenon’s example and, for the most part, tried to live simple lives without seeking wealth or power.  ABOVE: Photograph from Wikimedia Commons of a marble portrait bust from the Farnese Collection of the Greek Stoic philosopher Zenon of Kition. Zenon abandoned his life as a wealthy merchant to live a simple life in line with the teachings of his teacher, the Cynic philosopher Krates of Thebes. Roman Stoics had something of a split personality when it came to matters of wealth. The Roman Stoic philosopher Seneca the Younger (lived c. 4 BC – 65 AD) was a member of the Roman aristocracy. Like his famous father Seneca the Elder, he was extremely wealthy and, on account of his aristocratic upbringing, he came from a position of immense privilege. Nevertheless, Seneca also played off old Stoic tropes about wealth and power as distractions from the way of virtue. Seneca wrote a tragedy called Thyestes, based on an earlier Greek tragedy by Euripides. Seneca’s adaptation of the story turns it into a morality tale about the corrupting influence of power. In Seneca’s tragedy, the villain is King Atreus, who is portrayed as an unspeakably evil tyrant obsessed with power and revenge. The tragic hero is Atreus’s exiled brother Thyestes, who is portrayed as a reformed man who has learned from experience about the way of wisdom. When Atreus offers Thyestes the crown as a ruse to lure him in, Thyestes refuses, having learned that power is inherently morally corrosive. Atreus, however, insists that Thyestes must accept the title of king and wear the crown, or else he himself will step down. Thyestes ultimately relents and agrees to hold the title of king and wear the royal crown. It is his willingness to listen to Atreus that ultimately leads to Thyestes’s horrific undoing.  ABOVE: Photograph from Wikimedia Commons of a Roman marble bust of Seneca the Younger inscribed with his name The later Greek Stoic philosopher Epiktetos (lived c. 55 – c. 135 AD), a former slave, condemned the desire to acquire wealth. Epiktetos’s student Arrianos of Nikomedia quotes him in his Encheiridion 12, as translated by Elizabeth Carter: “If you want to improve, reject such reasonings as these: ‘If I neglect my affairs, I’ll have no income; if I don’t correct my servant, he will be bad.’ For it is better to die with hunger, exempt from grief and fear, than to live in affluence with perturbation; and it is better your servant should be bad, than you unhappy.” “Begin therefore from little things. Is a little oil spilt? A little wine stolen? Say to yourself, ‘This is the price paid for equanimity, for tranquillity, and nothing is to be had for nothing.’ When you call your servant, it is possible that he may not come; or, if he does, he may not do what you want. But he is by no means of such importance that it should be in his power to give you any disturbance.” Some proponents of modern Stoicism, by contrast, have not only wholeheartedly embraced the idea of wealth as a worthy object to be desired, but even gone a bit further. Ryan Holiday, a wealthy media strategist who also happens to be the most high-profile of all the proponents of modern Stoicism, has advertised Stoicism as a kind of “life hack” that can enable people to be more successful in every possible way—including financially. He has repeatedly used modern billionaire capitalist CEOs, including Bill Gates, Warren Buffett, and Jeff Bezos as exempla of the Stoic lifestyle as a way of not-so-subtly implying that Stoicism will make you rich. For instance, here is an article Ryan Holiday wrote for Business Insider in June 2017 titled “7 ways billionaires like Warren Buffett and Bill Gates demonstrate the ancient philosophy of Marcus Aurelius.” Notice how he refers to Stoicism as “the philosophy of Marcus Aurelius”—even though Marcus Aurelius was not the founder of Stoicism—since Marcus Aurelius was a rich and powerful Roman emperor, which is conducive to the image of Stoicism that Holiday is trying to promote. Also notice how Holiday twists the truth about Zenon’s famous shipwreck; he mentions that Zenon was a wealthy merchant and that he joked about the shipwreck that led to him meeting Krates of Thebes being “profitable,” but he leaves out the fact that Zenon meant “profitable” in the sense that it advanced his moral and personal development, not “profitable” in the monetary sense. Now, I am sure Holiday is being a bit duplicitous here because his blog posts on “Daily Stoic” and his YouTube videos prove he knows a great deal about ancient Stoicism and he has even written a blog post warning about how wealth can be a distraction from the path of virtue. Here is how his blog post ends: “See if you can find one billionaire who isn’t trying to acquire more. See if you can find one famous person whose actions don’t indicate that they’d like at least a little more fame. Because that’s what we learn from these things—it isn’t a sense of what’s ‘enough’ it’s a sense of how much more there could be.” “Needless to say this is a path to bankruptcy, personally if not financially. It’s a hedonic treadmill that eventually breaks down…or breaks the person frantically running atop it.” “So get off while you still can.” Notice the sharp contrast between his tone in this blog post written for people who are already committed to being Stoics and his tone in the article for Business Insider written for people who are not yet committed to Stoicism. Stoicism isn’t going to magically make anyone wealthy and Ryan Holiday knows this, but he is happy to implicitly suggest otherwise to get people on board with his philosophy.  ABOVE: Photograph of marketing executive Ryan Holiday, who is probably the most prominent proponent of modern Stoicism. Holiday has repeatedly implied that Stoicism will somehow magically make people wealthy, even though he obviously knows this isn’t true. The glorification of suicide Another aspect of traditional Stoicism that is noticeably missing from nearly all modern versions of Stoicism is the glorification of suicide. The earlier Greek Stoics do not seem to have written much about suicide as far as we can tell, but the idea of “noble suicide” was certainly present within certain Greek philosophical circles during the Hellenistic Period. For instance, as I discuss in this article I originally published in May 2017, the Greek Cyrenaic philosopher Hegesias of Kyrene, who lived in the early third century BC, is famously recorded to have written a dialogue titled Death by Starvation in which he argued that everyone should just kill themselves to end all suffering. Roman Stoics were less extreme than Hegesias, because they did not advocate suicide for everyone. Nonetheless, they glorified the ideal of noble suicide, teaching that, if all hope is lost, it is not only moral but honorable for a man to kill himself. Seneca the Younger gives exempla of noble suicides in his writings and it is no accident that Seneca himself ultimately died of suicide—although he admittedly did not have much choice in the matter, since he was almost certainly going to be put to death anyways. The fact is, at the very least, Roman Stoics had an unhealthy obsession with death and suicide. This is one aspect of Roman Stoicism that I am definitely glad people like Ryan Holiday have not tried to bring back.  ABOVE: The Death of Seneca, painted in 1615 by the Dutch Baroque painter Peter Paul Rubens  ABOVE: The Suicide of Seneca, painted 1871 by the Spanish Academic painter Manuel Domínguez Sánchez Stoic cosmology Very few proponents of “modern Stoicism” accept the cosmology of the ancient Stoics. This is largely because, in general, Stoic cosmology seems rather weird to most modern people. The Stoics’ biggest rivals in antiquity, the Epicureans, denied that the gods have any involvement whatsoever in human affairs. The Stoics, on the other hand, firmly believed in the idea of Divine Providence. Not only did the Stoics believe that the universe is governed by Providence, they also believed that the universe itself is, in some sense, a living being. The ancient Stoics believed in a cyclical universe rather than a strictly eternal one. According to the ancient Stoics, in the end of days, the entire universe will be utterly destroyed in a fiery conflagration known as the ἐκπύρωσις (ekpýrōsis). Then, once the universe has been consumed in fire, it will be reborn exactly as it was originally in a spectacular cosmic event known as the ἀποκατάστασις (apokatástasis). The ancient Stoics believed that, in this new universe, the entire history of the universe would then repeat itself, just like it had infinitely many times before. In each new iteration of the universe, every person that had lived in the previous universe would be reborn in exactly the same way they had been born before, they would live their life just as they had in the previous universe, and then they would die just as they had in the previous universe. According to the Stoics, this perpetual cycle of fire and rebirth has been going on forever and will go on forevermore. Thus, each person who has ever lived has lived and died infinitely many times already and will be born and die infinitely many more times in the future, each time in a new universe. If the Stoics are right, then I have written this exact same post infinitely many times before and I will write it infinitely many times again, each time in a new universe.  ABOVE: The ancient Stoics believed that, one day, the entire universe would be destroyed in fire, but then it would be reborn exactly the way it had been originally. They believed there had been infinitely many previous universes and that there would be infinitely many future universes, all of them identical to the present one. Quotations and the veneer of antiquity Modern proponents of Stoicism love to quote ancient Stoic writers, especially Seneca the Younger, Epiktetos, and Marcus Aurelius. They are also fond of Cicero, who was not strictly a Stoic, but who had Stoic leanings. Quotations from these authors are essential to the modern brand of Stoicism; they provide a sort of veneer of antiquity to what is really a very modernized (and frankly rather watered down) form of the ancient philosophy. Not only do quotations help provide this veneer of antiquity, but so do images of the ancient writers as well. I have noticed that Marcus Aurelius seems to have quite literally become the face of modern Stoicism; images of his portraits are all over the place on Stoic websites. Indeed, the same image of the same bust of Marcus Aurelius seems to be used for about half of the videos on Ryan Holiday’s “Daily Stoic” YouTube channel. It is easy to see why Marcus Aurelius is so strongly favored by modern Stoics. Modern proponents of Stoicism are trying to market Stoicism as a way to be successful in life and they often strongly hint that it is a way to become rich and famous. Obviously, since he was literally a Roman emperor, Marcus Aurelius was about as rich and famous as it gets.  ABOVE: Roman marble bust of the emperor Marcus Aurelius on display in the Archaeological Museum of Istanbul What about the Greeks? Another thing that is interesting about the people promoting “modern Stoicism” is that they constantly talk about Stoics from the Roman Era and quote them, but they hardly ever even mention the Hellenistic Greek Stoics who came before them. After looking at a bunch of articles and videos promoting “modern Stoicism,” I have noticed that they seem to quote from Cicero, Seneca the Younger, Epiktetos, and Marcus Aurelius constantly, but earlier Stoics like Zenon of Kition, Kleanthes of Assos, Chrysippos of Soloi, and Poseidonios of Apameia are scarcely ever mentioned. Admittedly, we have substantially fewer surviving writings from the earlier Greek Stoics and mostly all we have are fragments, but we do have information on them and we do have bits and pieces of their works. It’s a shame that the Greeks are so often excluded. Not much left of ancient Stoicism in “modern Stoicism” As I think I have illustrated, there is not a whole lot left of ancient Stoicism in “modern Stoicism.” I think that most modern proponents of “Stoicism” actually know more than enough about ancient Stoicism to realize this. It isn’t necessarily a bad thing that Stoicism has been modernized. After all, I think that an attempt to revive any ancient philosophy exactly as it was in antiquity would be extremely misguided. Nonetheless, I notice that there is a degree of shallowness in some forms of modern Stoicism. The form that is being marketed by Ryan Holiday in many cases tends to particularly shallow. His frequent use of modern billionaire capitalists who do not even identify as “Stoics” as exempla of Stoic virtue is just one example of this overall shallowness. Holiday sometimes lets his genuine knowledge and appreciation of ancient Stoicism show through, but, most of the time, he isn’t so much selling a philosophy as he is selling a brand; the brand that he is selling just happens to be something that claims to be Stoicism. His background, after all, is in marketing, not philosophy. He is quoted in this article from The New York Times about modern Stoicism as saying “If you’re shameless enough, you can sell anything.” A major problem with Stoicism—both ancient and modern Stoicism—both in its ancient form and in its modern form—has a crucial problem that promoters of Stoicism tend to not notice or at least not mention. The biggest problem with Stoicism is that it emphasizes dealing with problems rather than fixing them. In fact, Stoicism’s generally deterministic outlook on the world tends to actually discourage the idea of fixing problems. There are some problems that we really can’t do anything other than cope with. With these problems, Stoicism really can be useful and beneficial. There are many problems, though, that we can do things about. With these kinds of problems, Stoicism can not only be unhelpful but sometimes even downright detrimental. Even some proponents of modern Stoicism seem to realize this. For instance, in this YouTube video from August 2018, Andrew Kirby, a proponent of modern Stoicism, recounts a personal story about how his bike broke down and he didn’t have his bicycle repair kit and he ended up having to walk two hours to his destination. He used Stoicism to reframe his situation and he managed to remain content with it. The problem is, because he merely reframed his experience to avoid getting upset, he failed to learn the lesson from it and he did not remember to bring his bicycle repair kit with him on future biking trips. Later, his bicycle broke down again and, because he hadn’t brought his bicycle repair kit, he was forced to walk two hours again to get to his destination.  ABOVE: Shot from this video of Andrew Kirby, a proponent of modern Stoicism, talking about what he sees as the most significant problem with Stoicism A larger problem This is just a small-scale example of what is actually a much larger problem with Stoicism as a philosophy. Because the emphasis of the philosophy is on coping with problems and obstacles rather than fixing them, it has a tendency to act as a band-aid solution that can help people deal with problems in the short-term while leaving the problems themselves unresolved in the long-term. To illustrate this, we can look at larger social issues. For instance, take prisons. As of 2016, roughly 2,298,300 people were estimated to be imprisoned in the United States. Many of the people held in our prison system are imprisoned for drug offenses and are not guilty of violent crimes. Meanwhile, the modern American prison system is designed in such a way that keeps people in jail as long as possible and that makes it extremely difficult for prisoners to reform and change their behavior to become law-abiding citizens. Now, the standard Stoic response to prisons is that prisoners can learn to deal with their suffering through learning about Stoicism. For instance, here is an article from The Telegraph about inmates in prisons in the United Kingdom turning to Stoicism. While it is true that Stoicism can alleviate a person’s suffering, this is really more of a band-aid solution. The root problem here is that many of the people held in our prisons probably don’t belong there and the system as it is currently designed makes it very difficult for people in prisons to reform and stay out of prison. Thus, Stoic ideas can offer some short-term benefits while ultimately failing to address the underlying issue.  ABOVE: Masquerader in the Guise of a Prisoner, sketch by Leonardo da Vinci from between 1517 and 1518 The same can be said of Stoicism’s attitude towards poverty. In 2017, the United States Census Bureau estimated that approximately 39.7 million people live in poverty in the United States. That means roughly 12.3% of Americans live in poverty. Far more than just the poor, though, struggle to make ends meet. According to a study conducted in August 2018 by the Urban Institute, roughly 39.4% of Americans reported that they had struggled to pay for at least one basic need (i.e. food, housing, health care, or basic utilities) in 2017. The traditional attitude of ancient Stoicism towards poverty is that people should learn to be happy with what they already have, regardless of whether they are rich or poor. Many modern Stoics share this view (although some may accept the view that Ryan Holiday has rigorously yet surreptitiously promoted that Stoicism can somehow magically make people wealthy). While learning to be happy with what one already has is certainly admirable, Stoicism tends to ignore the fact that there does exist a minimum threshold of things that people need in order to survive in the modern world. Meanwhile, while around two fifths of Americans struggle to pay for their basic needs, the ultrawealthy—whom modern promoters of Stoicism routinely hold up as exempla—are hoarding a large plurality of the wealth. According to an estimate from November 2017, at that time, the wealthiest one percent of people in the United States owned roughly forty percent of the country’s wealth. Again, people learning to be happy with what they have is probably a good thing for them, but the general attitude of Stoicism is one that ultimately supports the status quo. In effect, Stoicism allows the wealthy to blame the poor for not being happy with what they have while simultaneously allowing the wealthy to continue sitting on their mountains of wealth unperturbed.  ABOVE: Belisarius Begging for Alms, painted in 1784 by the French Academic painter Jacques-Louis David. Because Stoicism teaches that being rich or poor is inconsequential to being happy and therefore places little emphasis on bringing people out of poverty. Conclusion Oddly enough for a philosophy that emphasizes a person’s own inherent insignificance, Stoicism is actually, in some ways, a rather selfish philosophy that shifts the emphasis away from the ideas of helping people, doing good, and solving problems and towards the idea of personal happiness and satisfaction in spite of difficulties. To be clear, Stoicism does teach that helping others is good, but that idea doesn’t tend to get emphasized very much. The German philosopher George Wilhelm Friedrich Hegel (lived 1770 – 1831) criticized the Hellenistic philosophies of Stoicism, Epicureanism, and Skepticism as philosophies for undemocratic times. He states in his Lectures on the Philosophy of History, “Part III: The Roman World”: “Thus [during the period of the Roman Empire] man was either at war with existence, or entirely given up to mere sensuous existence. He either recognized his destiny in the task of acquiring the means of enjoyment through the favor of the Emperor, or through violence, testamentary frauds, and cunning; or he sought repose in philosophy, which alone was still able to supply something firm and independent: for the systems of that time – Stoicism, Epicureanism, and Scepticism – although within their common sphere opposed to each other, had the same general purport, viz., rendering the soul absolutely indifferent to everything which the real world had to offer.” This is a bit of a mischaracterization. Nonetheless, I do think that Hegel was right that the Stoic emphases on the ideas of personal insignificance, lack of personal control, and learning to be satisfied despite experiencing unfortunate circumstances tend to appeal to people who feel like they don’t have a lot of control in the world. Consequently, it makes sense that, in our own era of democratic backsliding, Stoicism has found such renewed popularity. So is Stoicism a useful philosophy for modern times? Well, it depends on what you are looking for, what form of Stoicism you choose, and how seriously you plan on implementing it. Like every philosophy, Stoicism has strengths and weaknesses.  ABOVE: Portrait of the German philosopher Georg Wilhelm Friedrich Hegel, who criticized Stoicism as a philosophy for people living under the rule of a despot—a criticism that is not entirely fair, but not entirely unfair either (NOTE: I have also published a version of this article on my website titled “Is Stoicism a Useful Philosophy for the Modern World?” Here is a link to the version of the article on my website.) ",
            "date": "Answered January 15, 2020",
            "views": "196",
            "upvotes": " View 584 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elsa A. Forges",
                    "user_href": "/profile/Elsa-A-Forges"
                },
                {
                    "user_id": "Rodney Eggiman",
                    "user_href": "/profile/Rodney-Eggiman"
                },
                {
                    "user_id": "Anusha Paul Choudhury",
                    "user_href": "/profile/Anusha-Paul-Choudhury"
                },
                {
                    "user_id": "Loh Chee Leong",
                    "user_href": "/profile/Loh-Chee-Leong"
                },
                {
                    "user_id": "Dennis Harold",
                    "user_href": "/profile/Dennis-Harold-3"
                },
                {
                    "user_id": "Jess Whitson",
                    "user_href": "/profile/Jess-Whitson-1"
                },
                {
                    "user_id": "Daniel Pierce",
                    "user_href": "/profile/Daniel-Pierce-1"
                },
                {
                    "user_id": "Nikhil Wankhede",
                    "user_href": "/profile/Nikhil-Wankhede-27"
                },
                {
                    "user_id": "David DuBois",
                    "user_href": "/profile/David-DuBois"
                },
                {
                    "user_id": "Swetha Rani Savala",
                    "user_href": "/profile/Swetha-Rani-Savala"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Philippus",
                "href": "/profile/Daniel-Philippus-1"
            },
            "answer_text": "I will answer assuming you mean Stoicism the philosophy, as this would be a strange question to ask about stoicism the characteristic. Stoicism is relevant in modern society because, despite its ancient origins, it remains a worthwhile system of ethics, capable of guiding one’s actions quite well in the modern day, at least in my opinion. The short version is: A person who follows Stoic ethics well will tend towards being both happy and good for those around them—an ideal situation, as I see it. Longer version: Stoic ethics are fairly broad, not a precise rulebook, which means they’re fairly versatile across time and space. Notable aspects include (based on Marcus Aurelius’ Meditations, one of, if not the most important work on Stoicism): Endurance of labor (good work ethic)Active pursuit of an objective understanding of the worldMaking decisions based on reason, not emotion or impulseUnselfish behaviorWilling acceptance of the unchangeable (complaining about it isn’t going to help)A tempered approach to interaction, not forcing things on other peopleA cheerful approach to life, in both the good and the bad parts, achieved by:Not worrying about that which can’t be changedEmphasizing internal, rather than external, rewards: take pleasure in acting with virtue, not in material rewards or fame.Unlike such external factors, you can always control your own actions, meaning that if a virtuous life is all you want you can always achieve that, regardless of anything that happens to you.This is all broadly informed by the core Stoic virtues: WisdomJusticeFortitude/CourageTemperanceSo let’s suppose we have someone living by these guidelines. What’s the result going to be? For them: (Note that the positive outcomes implied here are not necessarily in conformance with the not focusing on external factors part, but does anyone actually fully follow that? The answer is no) They will be best able to make reasonable, well-informed decisions about the world, by focusing on objectively understanding reality and making decisions on the basis of reason. This will stand them in good stead for making wise choices.By avoiding selfishness and working hard, others will value their assistance and as such will be more likely to help them out in turn.By accepting the unchangeable, they will be able to go through life with much less pain and much less wasted effort. There are some things where you can’t fight it, and where focusing on it won’t help anything. Thus, accepting it, learning from it and moving on is the least painful course of action. (Depending on where they are in life, academic failures, breakups, lost jobs, lost loved ones come to mind).By not centering their happiness and self-worth on external factors, their continued satisfaction with life is much more reliable. A good Stoic is generally going to be happy because their criterion, virtuous behavior, is always completely under their control.For others: They are always willing to help, if practical (unselfish, not selfless), and they’ll work hard when they do. This makes them a very valuable friend to have for practical reasons.With a calm, objective worldview and a tempered approach, they are likely an excellent source of counsel, and many will look to them for good advice.Given the values of justice and courage, they’ll gladly stand up for what’s right. Moreover, given the values of wisdom and temperance, they’ll do it in a way that makes practical sense, rather than, say, an aggressive approach that tends to further entrench an opponent. Given the lack of focus on external rewards (in this case, others’ opinion of them), they won’t have a problem standing up for any good idea, even an unpopular one. Very valuable to have on your side in such a dispute.Because they value virtuous action rather than material or social reward, you can be absolutely guaranteed that they’ll never betray you (though they also won’t help you with any wrongdoing) because to betray someone in order to gain something would invariably be an impediment to their goals in life.On the other hand, through the virtue of temperance, they won’t try to force virtuous behavior on you. They might gently try to convince you, but being forceful or annoying about it would be counterproductive. They’re an adviser, not a commander.So as you can see: Stoicism is relevant today because a good Stoic is a happy person surrounded by people who are happy to know them. A few Stoics make a positive impact on everything around them; if everyone was a Stoic the world would be a happy, productive, peaceful place. ",
            "date": "Answered June 22, 2016",
            "views": "37",
            "upvotes": " View 26 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Salvador Castaneda",
                    "user_href": "/profile/Salvador-Castaneda-1"
                },
                {
                    "user_id": "Nick Shaw",
                    "user_href": "/profile/Nick-Shaw-14"
                },
                {
                    "user_id": "Ryan C",
                    "user_href": "/profile/Ryan-C-271"
                },
                {
                    "user_id": "Shashwat Pandya",
                    "user_href": "/profile/Shashwat-Pandya-1"
                },
                {
                    "user_id": "Tony Richardson",
                    "user_href": "/profile/Tony-Richardson-121"
                },
                {
                    "user_id": "Michael Stevens",
                    "user_href": "/profile/Michael-Stevens-233"
                },
                {
                    "user_id": "Evaldas Nefera",
                    "user_href": "/profile/Evaldas-Nefera"
                },
                {
                    "user_id": "Laurel Willey",
                    "user_href": "/profile/Laurel-Willey-1"
                },
                {
                    "user_id": "Anglea Caldwell",
                    "user_href": "/profile/Anglea-Caldwell"
                },
                {
                    "user_id": "Jules Carr-Chellman",
                    "user_href": "/profile/Jules-Carr-Chellman"
                }
            ]
        }
    ]
}