{
    "title": "Is the Chinese concept of yin and yang sexist? - Quora",
    "tags": [
        "Yin and Yang (陰陽)",
        "Sexism",
        "Culture of China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ted Wrigley",
                "href": "/profile/Ted-Wrigley"
            },
            "answer_text": "Yin and yang are not female and male; the feminine and masculine are aspects of yin and yang. There is no value judgement in that, merely a recognition of two different forces in the world: a hot, rising, directed force (the way a tree rises from the earth) and a cool, coalescing, supporting force (the way the ground holds the roots of a tree, and provides it with water and nutrients). It’s two sides of a cycle, where things rise and fall and gather and disperse… Traditionally women have taken on yin role in society while men have taken on yang roles (and there is probably a biological root to that, which has been incorporated into and expanded by cultural practices), so there is a natural associate of yin with the feminine and yang with the masculine. But that can only be appreciated in terms of the combined dynamic. If anything, the daode leans more on the yin principle, because yang energy tends to be didactic: yang energy wants to put things into static categories and make everything definite, solid, and clear, and the daode really rails against the destructive tendencies of that ‘definiteness’. In that sense, daoism gives preference to (as some translations put it) the ‘eternal feminine’ to counteract the excessive yang energy we see in human society. Just so it’s said… ",
            "date": "Answered May 16, 2017",
            "views": "35",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fotini Koloni",
                    "user_href": "/profile/Fotini-Koloni"
                },
                {
                    "user_id": "Dey S Chang",
                    "user_href": "/profile/Dey-S-Chang"
                },
                {
                    "user_id": "Alpaca Chan",
                    "user_href": "/profile/Alpaca-Chan"
                },
                {
                    "user_id": "Varenya Waghmode",
                    "user_href": "/profile/Varenya-Waghmode-1"
                },
                {
                    "user_id": "Leonard Niblock",
                    "user_href": "/profile/Leonard-Niblock"
                },
                {
                    "user_id": "Mark O'Malley",
                    "user_href": "/profile/Mark-OMalley"
                },
                {
                    "user_id": "Tomas Riabčikovas",
                    "user_href": "/profile/Tomas-Riabčikovas"
                },
                {
                    "user_id": "Kenneth Lo",
                    "user_href": "/profile/Kenneth-Lo-14"
                },
                {
                    "user_id": "David Benoun",
                    "user_href": "/profile/David-Benoun"
                },
                {
                    "user_id": "Benjamin McGraw",
                    "user_href": "/profile/Benjamin-McGraw-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Lee (李揚靈)",
                "href": "/profile/Steven-Lee-李揚靈"
            },
            "answer_text": "Nah. Please take a look at this picture:  Is this battery sexiest? Since it has both positive (yang) side and negative (yin) side. Yin and Yang are the most essential part of Chinese Taoist philosophy, which means everything in this world is the reconciliation of both Yin and Yang, two opposites are untied in harmony and transmute into each other.  Just like our life, there are joys and sorrows, there are ups and downs, there are life and death, there are truth and falsehood, there are ugly and beauty, there are good and evil, a curse can be a blessing in disguise and the road to the hell can be paved with good intentions. Everything is balanced with Yin and Yang in this universe, diversity is essential to happiness. Live and let live. ",
            "date": "Answered May 15, 2017",
            "views": "23",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jon Breed",
                    "user_href": "/profile/Jon-Breed-1"
                },
                {
                    "user_id": "Annie Ruth Harrison",
                    "user_href": "/profile/Annie-Ruth-Harrison"
                },
                {
                    "user_id": "Christine Cruz",
                    "user_href": "/profile/Christine-Cruz-115"
                },
                {
                    "user_id": "Buck Tuckem",
                    "user_href": "/profile/Buck-Tuckem"
                },
                {
                    "user_id": "Leonard Niblock",
                    "user_href": "/profile/Leonard-Niblock"
                },
                {
                    "user_id": "Pritivesh",
                    "user_href": "/profile/Pritivesh"
                },
                {
                    "user_id": "Aravind Karthigeyan",
                    "user_href": "/profile/Aravind-Karthigeyan"
                },
                {
                    "user_id": "Hamza Karim",
                    "user_href": "/profile/Hamza-Karim-10"
                },
                {
                    "user_id": "Rander Run",
                    "user_href": "/profile/Rander-Run"
                },
                {
                    "user_id": "L Zhang",
                    "user_href": "/profile/L-Zhang-4"
                }
            ]
        }
    ]
}