{
    "title": "Is there such thing as too many coincidences? - Quora",
    "tags": [
        "Coincidences"
    ],
    "response": [
        {
            "author_info": {
                "name": "John M. Switlik",
                "href": "/profile/John-M-Switlik"
            },
            "answer_text": "We always have to consider delusion. How one copes with that is their own business, yet we have industries oriented toward getting people to conform. Fortunately, the road of the autodidact is open. As, here is the balance: one person’s delusion is another’s knowledge. And, about knowledge, part of the process of forming your own position is knowing statistics and its use (and, nowadays, misuse - especially by computers). Plus, there is thinking which brings in logic and that growing notion of fallacies. You know, methinks that the fallacy argument is interminable. So, we see coincidences. They can be fun. I have been tracing families from the east coast of the U.S. to the middle and the west coast. This activity was coincident (by the way) with the Aussie start and flourish’ment. Those folks mostly had to go through the middle. The trails. In the U.S., there were several. The famous ones are the Santa Fe and the Oregon. At a point, these were coincident (there we go again). So, I was near a divergent point where a modern road had a traffic light. It was where one trail went northwest and the other southwest. So, I am sitting at the light, looking around, imaging the wagon trains (we’re talking decades and a whole lot of people) as they traversed the area. And, what pulls up? A trailer. Not any trailer. It’s the Montana brand.  And, it was heading guess where? Out toward the northwest. BTW, I was not at a hugely populated spot. The Montana brand is not even on the top ten. Now, to me, lots of coincidences are related to synchronicity. That is where you start to look at meaning, or one can take it further. Our imaginations are quite something. The fact of the matter was that I have been reading the Memoirs of a gent who, a few decades after Lewis&Clark (sent west by Prez Jefferson), went west through Montana to the coast and San Francisco and back to Montana (horse, boat, foot) where he was involved in organizing the Territory of Montana which became several states. So, he had been through that area where I was several times. Then, the guy goes back to New England and serves as a judge for the remainder of his life. Montana is a wild west state, yet. It is funny, though, to see a modern day wagon taking the same route. Perhaps, the driver may be a descendant of someone who traipsed. Some went by boat, but that was ardous, too. Want to know one reason that he went out? Gold. Lots of tales to tell about that mineral which are still apropos. What made the reading good was that the guy was insightful enough to point out areas where Lewis & Clark had written about (1804 start, by the way, so we just celebrated this). Too, I have been all over the western U.S. It’s my birth place. Now, coincidence? Mostly, it is this: nothing new under the sun. Incidentally, we have the 400th coming up of the Pilgrims by sea. But, we have the 200th coming up of pilgrims by land (a very much larger set). ",
            "date": "Answered June 24, 2018",
            "views": "29",
            "upvotes": " Answer requested by Tash Schulz",
            "upvoters": [
                {
                    "user_id": "Mrava Wishes",
                    "user_href": "/profile/Mrava-Wishes"
                },
                {
                    "user_id": "Tash Schulz",
                    "user_href": "/profile/Tash-Schulz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sonu",
                "href": "/profile/Sonu-215"
            },
            "answer_text": "Yeah there sometimes are too many coincidences. Let me tell you my experiences out of a train compartment of 72 berths, only my berth squeaks.Next time out of the same 72, only my fan doesnt work.In a bus of 45 people, only my seat is broken.In the same 45 seats, the ac vent leaks water, just on me.Whenever I pick a choice, the other option is always the right one.Out of a class of 75 students, only I am unmarried yet.Things happen, we might not realise. ",
            "date": "Answered December 21, 2016",
            "views": "28",
            "upvotes": " View 2 Upvoters"
        }
    ]
}