{
    "title": "Is there any impossible choice situation or just choices that are hard to make? - Quora",
    "tags": [
        "Decision Making",
        "Existence Question",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Deger Erten",
                "href": "/profile/Deger-Erten"
            },
            "answer_text": "There are surely choice situations which might be called close to impossible relying on the availability of given inputs. This leads the choice situation to determinism and then its not a choice anymore. And then there are choices with possible sacrificies again relying on given inputs. The bigger the possible sacrifice with the calculated choice the harder the decision. Every choice is entangled with its sacrifice from the expected income of the other. Lets give an example. Should i marry this girl or the other one.? One is too beautiful sexy but comes but equipped with a hell making morality beside all the pleasures she could offer. The other is mediocre in beauty and sex appeal while equipped with better moral values offering a soother life. (What a condition :) A hard to make choice? well depends on how you value the inputs. May be sex appeal is everything to you. etc. Lets come the impossible choice. One of them is happily married and you are still persistent to put herself in the equation. This can be called a choice close to impossible. But hey, Everything is possible in life right.  Lets say one of them is dead already. Yes impossible choice. :) But sure there is the very small possibility in life that a time machine could be invented before you have made your choice. (Optimism might be a sickness :)  ",
            "date": "Answered January 7, 2016",
            "views": "328",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cem (Jim) Onur",
                "href": "/profile/Cem-Jim-Onur"
            },
            "answer_text": "You got it. There is no such thing as an impossible choice situation. Logically incorrect axiom right there. If there are choices that completely eradicates the impossiblity. I want to fly: not impossible, there are multiple choices. I want to take off from a flat ground, naked, without the help of any mechanical device or meteorological event and fly a few miles maneuvering at will. Impossible - there are no choices. ",
            "date": "Answered January 6, 2016",
            "views": "238",
            "upvotes": "0"
        }
    ]
}