{
    "title": "Is there anything that hits harder than reality? - Quora",
    "tags": [
        "Augmented Reality",
        "Virtual Reality (VR)",
        "Reality",
        "Truth",
        "Philosophy",
        "Experiences in Life",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lynn K. Russell",
                "href": "/profile/Lynn-K-Russell"
            },
            "answer_text": "Great question. Reality is the best teacher in life. As children are growing they need to see reality for what it is and not be protected from it. (Keep in mind I’m talking about normal life and not trama.) When kids reach their teens they act out and test life’s natural laws to find out for themselves why they can’t do something. Sadly, some of them learn the hard way. But problems come if that process is stopped. Then their growth is interfered with and they haven’t completed the course of what it is to be human. When that happens, they usually do it around the age of thirty. You may meet someone in that age bracket that is acting more like a teenager than an adult. It doesn’t always mean that they haven’t done their teens, but that could be one of the causes. Usually, if that is the case, they usually settle down around the age of 35. Oops, I do get off course sometimes. Back to your question. Life’s realities are so essential to realize because so many people want to change it. After smashing ourselves up against reality, we eventually learn it is what it is. ",
            "date": "Answered November 30, 2019",
            "views": "52",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gabriel Larson",
                    "user_href": "/profile/Gabriel-Larson-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carl Grove",
                "href": "/profile/Carl-Grove-1"
            },
            "answer_text": "If you mean our current reality, it does hit hard. But if you mean a higher reality, beyond our current conception, it mostly operates outside our perceptions. But I think what you are really suggesting is that no matter how much wiser people try to advise you, you will ignore what they say and carry on doing what you want until you eventually have to face the consequences. And this is true — this is what we are like, and maybe that is why we are here and not being allowed to make the wrong decisions in a less forgiving situation. ",
            "date": "Answered November 29, 2019",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gabriel Larson",
                    "user_href": "/profile/Gabriel-Larson-11"
                }
            ]
        }
    ]
}