{
    "title": "Is taking opposing arguments to their logical extreme a good way of determining which side is better? - Quora",
    "tags": [
        "Logical Fallacies",
        "Reasoning",
        "Logic (philosophy)",
        "Debate",
        "Arguments and Argumentation",
        "Politics",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Terra Lubin",
                "href": "/profile/Terra-Lubin"
            },
            "answer_text": "No, not at all. For one thing, we live in reality - not an abstract world in which “logical extremes” are likely to occur. For another thing, to really predict the “logical extreme” you would have to have complete information about how the world works - nobody has that - we have incomplete/current information - so while we can make inferences, and even pretty good predictions for some things - our knowledge is always incomplete. If you want to make this type of argument properly, you have to caveat with the frame of incomplete knowledge. Additionally, the idea that “logic” and “emotion” are two separate items is cute on Star Trek, but “logically” it makes no sense. We, as humans, exist in a biological context which includes all of the motivations and signals from our bodies. Ignoring our biology and emotions while making a “logical” argument, is at best disingenuous. Finally, while it might be an interesting “thought experiment” it falls short of being anything more than a story - because it is not testable. If you go around claiming that you can predict results of an untestable experiment and base your whole argument on that, then you will find yourself preaching only to the gullible and/or converted. ",
            "date": "Answered May 23, 2020",
            "views": "53",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mike Johnson",
                    "user_href": "/profile/Mike-Johnson-685"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arnie Stanton",
                "href": "/profile/Arnie-Stanton"
            },
            "answer_text": "This has proven to be a very helpful way to open the eyes of people who hold opposing views than yourself. It amazes me over and over again on how most people, even ones I agree with, have such a shallow and often inaccurate understanding of their viewpoints on different topics. What I typically have to do, is TEACH the other person their own views. Once I do that, I can then walk them down a logical path to its ultimate conclusion, and thus, show them that their view no the given topic cannot fit reality. Unfortunately, most people will not accept the teaching you give them, especially if the topic is emotionally charged, such as in the case of politics, religion and more recently, political correctness. The average person is so conditioned/brainwashed to hold the views that they hold, especially their views of those who they see as OPPOSED to them, that they will never truly understand fully their own supposed view, and understand the opposing views even less. And as stated in at least one other answer, getting a person to see the logical extreme of their view is not enough to convince them that your view is better. At best, you have gotten the other person to possibly consider your point of view better. You have to TEACH them what your view is, and what ultimate logical conclusions it leads to. Unfortunately, humans are prone to being biased toward holding onto their desired beliefs, regardless of the facts. I wrote an article dealing with this phenomena: THE MYTH OF BEING \"OPEN-MINDED\" ",
            "date": "Answered May 22, 2020",
            "views": "53",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mike Johnson",
                    "user_href": "/profile/Mike-Johnson-685"
                }
            ]
        }
    ]
}