{
    "title": "Is traveling back in time theoretically possible? - Quora",
    "tags": [
        "Time Travel Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dennis Cybulski",
                "href": "/profile/Dennis-Cybulski"
            },
            "answer_text": "No, here is my illustration, published many times on this forum to explain why time travel will not happen: Picture a large mirror on a wall in a narrow hallway. You are approaching this mirror. Your reflection is not in the mirror as you have not arrived in front of it yet (call this lack of reflection the Future). Now you step in front of the mirror your reflection is there, it will stay there as long as you are in front of the mirror (Call the reflection the Present), When you walk away from the mirror, your reflection disappears (Call this the Past). Consider the mirror to be time. It is always there, it is a constant feature and does not move from the hallway (time does not move, the Universe moves through time, time is a dimension). You cannot get behind the mirror, you must always walk in front of it (you cannot avoid time). When you first approach, your reflection is not in the mirror as you have not arrived there yet, This lack of reflection is your Future, it is not in the mirror but MIGHT be there, IF you continue to move toward it. Once you step in front of the mirror your reflection appears. Your reflection is the Present. Now you step away from the mirror, your reflection disappears, that vanished reflection is your Past. If your try to go back to your past and step in front of the mirror again, this is a new reflection and a new Present. The previous reflection of you is gone, where? You reverse direction and go past the mirror (faster than light travel?), then step back in front of it again, is that the future? No, the new reflection is a new Present. This is why time travel cannot be achieved. Any time you attempt to go back into the past or go forward into the future, it just creates a new Present. We exist in the Present at all times. We cannot go backward or forward in time as the future and past do not exist, just like those reflections in the mirror representing the Past and Future do not exist. ",
            "date": "Answered September 21, 2017",
            "views": "574",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joga Rao",
                    "user_href": "/profile/Joga-Rao-22"
                },
                {
                    "user_id": "Jiva Krishna",
                    "user_href": "/profile/Jiva-Krishna"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geoff Cox",
                "href": "/profile/Geoff-Cox-12"
            },
            "answer_text": "Its not. We have just not figured how to do it yet. If you have read my theses on time travel you will understand. Let me explain in brief. Time travel will be accomplished, but not yet. The way we are expanding our ‘intelligence’ through science and universal studies I would say time travel will be possible in about 300, maybe 200 years time. I am so glad you said ‘travel back in time’ because so many people suggest when time travel is possible we can into the future. NOT POSSIBLE. I have said so many time, no one can into the future because there is no future. Why? Because the future hasn't happened yet. OK lets calm down. The past has happened but the future hasn't. Think of throwing a pebble into a pond. There are no ripples until you have done it are there? OK so, once the pebble is thrown the events from that action can not be reversed, so everything we do NOW, effects the future and the ripples carry on into infinity. So, the past is out there but we will not be able to ‘explore it’ until we have the technology and we are far from that at the moment. I will say once more, the future is not out there so it dose not exist. Just a final thought though. In 200 to 300 years time we here now will be the past to be explored. ",
            "date": "Answered October 2, 2018",
            "views": "226",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robbie Luzi",
                    "user_href": "/profile/Robbie-Luzi"
                }
            ]
        }
    ]
}