{
    "title": "Is there such a thing as an objective definition? - Quora",
    "tags": [
        "Objectivity",
        "Epistemology",
        "Existence Question",
        "Philosophy",
        "English (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Davidson",
                "href": "/profile/Dave-Davidson-13"
            },
            "answer_text": "Objective means formed without bias. Subjective entities, such as ourselves, can only form crude renditions of that which is objective because true objectivity exists only in the objective world. We see the objective world through a restricted lens and we develop our own form of objectivity that has been made relative to our unique perceptions and orientation. Our form of objectivity is composed of rational thoughts found within the parameters of a preordained set of concepts. Our form of objectivity occurs because our conscious exists as an inner model of the objective world. This model is composed of that which has happened in the past, that which is happening now, symbols, propensities, biological processes, and agendas. This arrangement allows us to abstract reality, develop a free will, and have a specific agency so that we may integrate with the objective world. The closest we can get to being objective is to rely on facts that have been gathered in the objective world from various physical phenomena which we have labeled as the truth. These facts are bound within a conceptual structure that forms the benchmark for “that which is deemed to be objective”. This structure is the matrix for integrating and judging facts as well as the determiner of the fact’s validity and subsequent assessment’s objectivity. Having an accurate assessment of pertinent evidential truth and possessing a conceptual structure that accommodates a wide range of evidence brought forth from the objective world and which forms a construction that closely parallels the objective world, is the most connected we can get to the ability of being objective. I walk into a courtroom and I want to see a trial that is as objective as possible. I can only expect this to happen if I see a logical apparatus that values facts as the only accepted evidence and possesses well-understood laws from which judgments can be made. If I have an argument with my brother, I want my mother to see what the physical evidence is and what the parameters for judgment are. ",
            "date": "Updated May 20, 2018",
            "views": "69",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Siddharth Pathak",
                    "user_href": "/profile/Siddharth-Pathak-68"
                },
                {
                    "user_id": "Omor Igiehon",
                    "user_href": "/profile/Omor-Igiehon"
                },
                {
                    "user_id": "Caroline Rose",
                    "user_href": "/profile/Caroline-Rose-116"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Ewell",
                "href": "/profile/Ken-Ewell"
            },
            "answer_text": "The concept of objectivity (when applied to a person or their judgment) means not being influenced by their point of view (their personal feelings or opinions) in considering and representing facts. To put the question into a more general form, we might ask: can I have knowledge of the world that is not just knowledge of my ‘point of view’? Science, common sense, religion and our ordinary lives; all suppose the possibility of objective knowledge. If this supposition is unwarranted, so are most of the beliefs that we commonly entertain. ",
            "date": "Answered December 31, 2017",
            "views": "5",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Norah -",
                    "user_href": "/profile/Norah-56"
                },
                {
                    "user_id": "Shams Sayed",
                    "user_href": "/profile/Shams-Sayed-4"
                },
                {
                    "user_id": "Victor Ferrer",
                    "user_href": "/profile/Victor-Ferrer-2"
                },
                {
                    "user_id": "Tony Chen",
                    "user_href": "/profile/Tony-Chen-359"
                }
            ]
        }
    ]
}