{
    "title": "Is there such a thing as a “just war”? - Quora",
    "tags": [
        "Just War Theory",
        "Thinking",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Laderoute",
                "href": "/profile/David-Laderoute"
            },
            "answer_text": "There’s actually two facets to this question, both derived from jus bellum iustum, or “just war theory”. One involves international law, and the other is more a matter of morality. In terms of international law, there has been a steady development over the past several hundred years in thinking around a body of law intended to “regulate” armed conflicts. This body of law basically boils down to seven principles which determine if a war is considered “just”: the war must be declared openly by a proper sovereign authority (e.g., the governing authority of the political entity—normally a nation—in question);the war must have a just cause (e.g., defense of the common good or a response to grave injustice);the warring state must have just intentions (i.e., it must wage the war for reasons of justice rather than for self-interest);the aim of the war must be the establishment of a just peace;there must be a reasonable chance of success;force must be used as a last resort; andthe expected benefits of war must outweigh its anticipated costs.Assuming an armed conflict fulfilled these conditions, which are (more or less) agreed upon by the international community of nations, it would be considered “just”. Let’s run the Allied engagement in WW2 through the checklist and see how it does: war was declared by sovereign authorities/nations, so checkthe war was intended to address the territorial ambitions of Nazi Germany and its allies, and the horrible things that were being done to some segments of the population in those countries, so checkthe Allies had no specific intentions of going to war to seize territory or resources (although this one’s a little fuzzy, admittedly, since Josef Stalin seemed to develop a desire to grab territory as his forces advanced into Europe)…so we can give this one a check, with a caveat or twothe Allies wanted an unconditional surrender of the Axis powers and the end of hostilities, so checkthe Allies had a reasonable expectation of victory, so checkBritain and France probably let things go too far regarding Nazi territorial ambitions—the whole appeasement thing—so checkbringing about an end to Axis land-grabs and depredations was going to be expensive in terms of lives and resources, but allowing those things to go on would have been a far worse outcome, so…checkIt would appear, then, that the Allied entry into WW2 (i.e. the UK and France in 1939, followed by the Soviet Union and then the United States in 1941) was a “just war”, from the perspective of international law. This isn’t ENTIRELY objective, of course, but here at least we have a sort of checklist of things that should be true if you want to fight a “just war”. The other facet of this, the moral one, is more “gray”, because it’s about things like the values and beliefs of the people considering the question. A war that one might consider just another might not. Again using WW2 as an example, but this time from the Nazi side, there were almost certainly those who felt that Germany’s expansion in Europe to gain lebensraum or “living space” perfectly justified in light of the aftermath of WW1. It’s just as certain that there would be many in places Austria, Czechoslovakia and Poland would profoundly disagree. So, from this perspective, whether or not there is a such thing as a “just war” is a far more personal position, not necessarily with any objective standard of correctness and much more of what amounts to debate. ",
            "date": "Answered August 26, 2018",
            "views": "827",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Barrie Nigel Thurlow",
                    "user_href": "/profile/Barrie-Nigel-Thurlow"
                },
                {
                    "user_id": "Avneet M",
                    "user_href": "/profile/Avneet-M"
                },
                {
                    "user_id": "Ahmed Belkhouja",
                    "user_href": "/profile/Ahmed-Belkhouja"
                },
                {
                    "user_id": "David Miedzybrodzki",
                    "user_href": "/profile/David-Miedzybrodzki"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marty Shoemaker",
                "href": "/profile/Marty-Shoemaker-1"
            },
            "answer_text": "Hi Ahmed. This is a very tough question and has stumped philosophers and political scientist for centuries. I construct of “just” is short for “justified” meaning that it is morally permissible. Usually this is related to self-defence by a country against an aggressor, but has historically also been used as an argument for a country to come to the aid of another country under siege such as what the USA did in WWII to assist its allies, France, Britain and Russia which had been attacked by Germany as repeated acts of aggression by Hitler. This of course was not Germany’s view as they saw their actions as justified because of the unjust treatment they received at the treat of Versailles after WWI and their distrust of their neighbors particularly Russia. This for the allies is a total rationalization. Therefore, who is doing the analysis of the motive for the war is very self serving. The whole history of war crimes is defined only by the victor so is not objective but a form of court-sanctioned actions against the losers. Independent analysis away from the politics such as done by philosophers not necessarily defending their own countries military exploits has lead many to believing that when all diplomacy fails and their is not other course of action to protect one’s citizens that counter attacking after being attacked is “justified”. This has two parts, that ethically one can have just reasons for going to war adn secondly, for how one conducts the war. The after war ethics has also been added to guide how post-war initiatives should be conducted. But their are many grey areas such as maybe the attack was minor but the counter attack was with an entire military force, such as what the US did in the Second Iraq war based on supposed “weapons of mass destruction”. The bombing and attacks were much greater than any assault the US experienced so it was “pre-emptive” or to crush Saddam Hussein before he could launch any attack in the Middle East or through terrorists. Defenders of this war say it was justified, but in retrospect the WMD didn’t exist and it was motivated to make a regime change in Iraq that had become anti-American. So critics of the Second Iraq war say it was not “just” by any of the propositions of self-defence. Certainly, Russia’ and England’s attempts to counter-attack Germany would have been seen as “just” by most military historians and philosophers as they were attacked in an imperialistic way unprovoked by either country. A book I have ordered and have seen reviews of is War is a Lie by David Swanson. It is an expose that all wars are based on false premises even those for self-defence. This may be a hard argument to accept, but I will be more able to answer this question after reading it. Let’s take a crack at it again in a few months after I read this book. You should have a look at it also. ",
            "date": "Answered July 14, 2019",
            "views": "235",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ajay Krishnan",
                    "user_href": "/profile/Ajay-Krishnan-19"
                }
            ]
        }
    ]
}