{
    "title": "Is there a scientific or logical explanation for luck? - Quora",
    "tags": [
        "The Bastion Initiative",
        "Scientific Explanations",
        "Luck"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saquib Siddiqui",
                "href": "/profile/Saquib-Siddiqui-1"
            },
            "answer_text": "Yes, there is scientific and logical explanation. The role of luck for a successful life is far greater than we think. There is something profoundly wrong in the way we perceive or are supposed to perceive success. Of course factors like hard-work, passion, perseverance, creativity and focus are significant in making a successful person but is that all? Every successful person- a billionaire, a politician, an artist, an entrepreneur, an actor or anyone who the world labels successful has the same story to tell about how he/ she was born in mediocre circumstances and how by virtue of his/ her hard work and struggle through some very difficult times they achieved success. They often are interviewed on how they became the “self-made man”. Everything they say, even something mundane like ‘I read one article everyday’, becomes the golden words of success with fan-boys making their life mission to follow that rule religiously. Often the world sings the songs of that person and concludes that if such and such person can rise in such hardships coming from nothing, you definitely can do it too. You just need to choose your favorite successful idol and copy what they did. The success will be yours. Simple! What is often overlooked is that nobody rises from nothing. Every successful person has some hidden advantages or extraordinary circumstances that makes them who they are. Not every hard working person becomes what they dream of becoming. There is something else missing from ‘hardworking ordinary man’. It is luck and opportunities that are not in his control. In the book Outliers, Malcolm Gladwell argues about how being born in certain months of the year or period of time can dramatically improve your chance of being successful. Some examples: He analysis thousands of successful Canadian Hockey players from junior level to the professional championship. He was surprised to find out that:in any elite group of hockey players – the very best of the best – 40% of the players will have been born between January and March, 30% between April and June, 20% between July and September, and 10% between October and December. There are very higher chances of becoming a successful hockey player in Canada if you were born in the first quarter compared to the fourth quarter of the year. The reason: it has to do with the junior team selection cut-off date of 1st Jan at the age of 10. So, if you were born on 31st Dec, you must wait another year to get selected. By that time the person born just a day after you, would has the advantage of one-year worth of professional coaching.Same thing repeats in every selection process that has to do with a cut-off date based on age: sports, schools or university.In another analysis of the 75 richest people in human history from around the world, Malcolm finds out that 14 were born in America within 9 years of each other in the mid of 19th century. That’s 20% of the list, born within a very unique time between 1930 and 1940. Of course each had talent and vision but their extraordinary circumstances and opportunities played a huge role in their success.Another interesting example of such kind is the unique timing of birth of the Silicon Valley giants. Ideally to ride the success of the computer revolution, you must be about 21 years of age, born around 1955/56, in the year 1975. This was the year when famous magazine Popular Electronics ran a cover story that sparked the silicon race: Guess what, most were born around the sweet spot of 1955. Here is the list of the year of births of the poster boys of silicon-valley: Bill Gates, Microsoft– 1955 Paul Allen, Microsoft – 1953 Steve Ballmer, Microsoft -1956 Steve Jobs, Apple - 1955 Eric Schmidt, Novell & Google – 1955 Bill Joy, Sun Microsystems – 1954 Scott McNealy, Sun Microsystems- 1954 Vinod Khosla, Sun Microsystems – 1955 Andy Bechtosheim, Sun Microsystems - 1955 A big reason for their success was that these people were in the right place at the right time in the right country. Of course, they had talent but so does many others who could not make it . You being born in certain country, religion or circumstance defines a lot of your success. Several studies strongly suggest that luck and opportunity play an underappreciated role in determining the level of individual success. Luck is not everything but an important ingredient of success that is not in your control. ",
            "date": "Answered March 19, 2020",
            "views": "305",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lorena Fabiana",
                    "user_href": "/profile/Lorena-Fabiana"
                },
                {
                    "user_id": "Dylon O. Thomas",
                    "user_href": "/profile/Dylon-O-Thomas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Engel",
                "href": "/profile/Joshua-Engel"
            },
            "answer_text": "\"Luck\" means two different things. (Well, more than that, but I'm going to focus on two of them.) The first sense is the aggregation of unknowns. Ten thousand equally talented young people will go to Hollywood; one will become rich. They were all equally talented; in fact, the one who made it rich is probably not the one who is most talented.  Instead, that was the one for whom the unknowns all came together in the right way. Nobody could know that the producers were looking for a certain look at a certain place at a certain time. If that information had been known, 9,999 of those people would have stayed home. In the face of the unknown, people have to take their best guesses, and the unknowns are treated as random variables. You can aggregate that as \"luck\" for short. The second sense is the notion that one's luck is persistent, that some people reliably have the unknowns fall in their favor more than others. In this sense, there is no such thing. Instead, there is just confusion and confirmation bias. No gambler has especially good luck or especially bad luck, aggregated over time. A person may remember the times they won more than the times they lost, or vice versa. That's not a feature of the dice; that's a feature of their memory. An objective count would show that the dice did what the dice always do: exhibit behaviors that is unpredictable due to factors that are deterministic but unknown, such as precise angles and momenta. Some people have had many things go their way, but it would be a fallacy to believe that indicates that future unknowns will also go their way. And it's important to note that not all \"unknowns\" are going to be independent: those who have had the fortune to be born wealthy, for example, are going to have other fortunate things happen to them because of the way they've deployed their wealth in the past.  But for a true unknown, such as a die roll, the events will always be randomly distributed (at least to the best of anybody's ability to make it unknown), for all individuals. Luck of that kind for any individual does not exist. ",
            "date": "Answered January 5, 2013",
            "views": "5",
            "upvotes": " View 102 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Garry Jenkin",
                    "user_href": "/profile/Garry-Jenkin"
                },
                {
                    "user_id": "Roger Oliveira",
                    "user_href": "/profile/Roger-Oliveira-17"
                },
                {
                    "user_id": "Rahul Pawar",
                    "user_href": "/profile/Rahul-Pawar-3"
                },
                {
                    "user_id": "Kamil Nidamudin",
                    "user_href": "/profile/Kamil-Nidamudin"
                },
                {
                    "user_id": "Rameesh Paul",
                    "user_href": "/profile/Rameesh-Paul-1"
                },
                {
                    "user_id": "Sazi Smith",
                    "user_href": "/profile/Sazi-Smith"
                },
                {
                    "user_id": "Kirsy Pina",
                    "user_href": "/profile/Kirsy-Pina"
                },
                {
                    "user_id": "Ninad Jadhav",
                    "user_href": "/profile/Ninad-Jadhav-13"
                },
                {
                    "user_id": "Tejas Sodage",
                    "user_href": "/profile/Tejas-Sodage"
                },
                {
                    "user_id": "Matt Demon",
                    "user_href": "/profile/Matt-Demon-12"
                }
            ]
        }
    ]
}