{
    "title": "Is the The Venus Project really achievable? - Quora",
    "tags": [
        "Jacque Fresco",
        "Resource-Based Economy",
        "The Venus Project"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sid Kaskey",
                "href": "/profile/Sid-Kaskey"
            },
            "answer_text": "Some variation of it is inevitable. No one, including Jacque Fresco himself, suggest it will come about exactly as he foresees it. But if technology keeps evolving massive employment displacement will occur and society will have to deal with it. That means essentially the world will move from a scarcity environment to one which can be called resource based [aka abundance.] That evolution is the core of his vision. So to answer your question: Is the Venus Project really achievable the answer is yes. ",
            "date": "Answered February 23, 2015",
            "views": "772",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mayou Nkensa",
                    "user_href": "/profile/Mayou-Nkensa"
                },
                {
                    "user_id": "Ashika Umanga Umagiliya",
                    "user_href": "/profile/Ashika-Umanga-Umagiliya"
                },
                {
                    "user_id": "Erica Kemmitz",
                    "user_href": "/profile/Erica-Kemmitz"
                },
                {
                    "user_id": "Sunita Lall",
                    "user_href": "/profile/Sunita-Lall-8"
                },
                {
                    "user_id": "Lazar Momcilovic",
                    "user_href": "/profile/Lazar-Momcilovic-2"
                },
                {
                    "user_id": "Kyle Roche",
                    "user_href": "/profile/Kyle-Roche-4"
                },
                {
                    "user_id": "Alan Smith",
                    "user_href": "/profile/Alan-Smith-1105"
                },
                {
                    "user_id": "Randy Silver",
                    "user_href": "/profile/Randy-Silver-4"
                },
                {
                    "user_id": "Shreyansh Dixit",
                    "user_href": "/profile/Shreyansh-Dixit-श्रेयांश-दीक्षित"
                },
                {
                    "user_id": "Kat",
                    "user_href": "/profile/Kat-844"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Kolber",
                "href": "/profile/Jonathan-Kolber"
            },
            "answer_text": "While I credit Jacques Fresco for important thinking that constitutes a foundation stone of our Celebration Society proposal, the Venus Project has, in our view, several deficiencies: Lack of a detailed plan for getting from here to there. Excessive reliance in AIs for governance. Lack of a historical, proven antecedent. Lack of understanding that a scientific society must, like a Silicon Valley startup on a grand scale, be a series of experiments leading in the direction of perfection while never expecting to actually attain it. Finally, failure to provide a scaffolding that is able to accommodate multiple, in some cases very different, societies. While I believe that our proposal successfully addresses these concerns, we (I, in particular) have made our own mistakes-- some of which have been discovered; others of which have yet to be discovered. The evolutionary nature of our proposal is key to recovering from mistakes. ",
            "date": "Answered May 30, 2020",
            "views": "70",
            "upvotes": "0"
        }
    ]
}