{
    "title": "Is temptation a sin? Explain your answer. - Quora",
    "tags": [
        "Temptations",
        "Seven Deadly Sins",
        "Understanding Sin",
        "Sin",
        "Morals and Morality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Katerina Bittar",
                "href": "/profile/Katerina-Bittar"
            },
            "answer_text": "Temptation is not a sin. Jesus was tempted.   God warned Cain... \"Sin is crouching at your door. It desires to have you.\"  Eeeew!.... so creepy!  Sin wants to have you. It wants you to want it.  Temptation is always attractive. By definition, it's tempting. Evil is beautiful, or no one would want it.  Falling into temptation means you took the bait. You decided to want it. This happens by considering what is being presented, and coming to the conclusion that it's not wrong.  The lie of sin says \"immediate gratification with no long term repercussions\". But there is always a price to pay. Anything that feels good can become addictive. The cravings constantly increasing while the level of satisfaction constantly decreases.   Once it has you, it takes you farther than you ever wanted to go, and enslaves you. Once you love it, you are it's slave for we are slaves of what we love. ",
            "date": "Answered September 28, 2020",
            "views": "48",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steven Hoover",
                    "user_href": "/profile/Steven-Hoover-9"
                },
                {
                    "user_id": "Brett Passmore",
                    "user_href": "/profile/Brett-Passmore"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Golding",
                "href": "/profile/Aaron-Golding-7"
            },
            "answer_text": "No not if you don’t give in and you don’t want it. It isn’t a sin temptations are allurement to sin. So it isn’t a sin unless you give in but if you reject whatever it is that’s tempting you it isn’t a sin. Their are 3 things that need to be done in order for it to be sin: 1. Grave Matter: The act itself is intrinsically evil and immoral. 2. Full Knowledge: The person must knowthat what they’re doing or planning to do is evil and immoral. 3. Deliberate Consent: The person must freely choose to commit the act or plan to do it. ",
            "date": "Answered September 21, 2020",
            "views": "17",
            "upvotes": "0"
        }
    ]
}