{
    "title": "Is time matter or energy? - Quora",
    "tags": [
        "Matter (physics)",
        "Time (physics)",
        "Energy (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kaiser Tarafdar",
                "href": "/profile/Kaiser-Tarafdar"
            },
            "answer_text": "Time is neither one of the above. Matter and energy exist within the confines of time, or within the existence of time. Time is considered the 4th dimension stemming from Einstein’s general theory of relativity. Time is a measure of the continuity of existence of space and everything that exists within the space, with itself having to exist as a dimension. This article will refer to the above and expand on these ideas with respect to the Big Bang, absence of time before, inception of time later, and other ideas… Before the Big Bang time is thought not to have existed. Stephen Hawkins has pointed that out sometime back. It is believed to have all started from the moment of the great detonation, with endless ‘spacetime-field’ formation. It appears that ‘space-time’ must be a singular phenomenon that we tend to separate to try to understand it. One does not exist without the other. Space is reasonably well defined as volume described by x, y, and z axes that exist in time, and I must say also that time exists for space, and the dimensions mentioned, as it may have no meaning without the existence of space, neither will space have any meaning or existence or continuity without time. It can get really confusing but the fundamental relationship is inseparable. Now as we know there are innumerable other dimensions, thought to be up to twenty six dimensions as of now. Einstein and David Hilbert theorized that there could be an infinite number of dimensions over a hundred years ago after postulating the existence of at least 15 of them back then. We are at 26 now and counting… There is high degree of certainty that we will never find all the ones that exist during our human existence !! String theorists are into these other ‘ultra-dimensions’ to try to find an unified field theory, and get relativity tied to quantum theory. This is proving to be a most formidable task, which has brought attention to the super-complex mathematical theorems, and the advanced K-3 elliptical functions of the great Srinivasa Ramanujan. This may eventually succeed in the most rigorous mathematical sense, but gravitation continues to defy the incorporation with the other fundamental force fields in nature, which is the greatest hurdle that string theorists have still. They have not toppled it yet, and may not for a long time to come still ! Einstein, it appears knew that it would be very difficult to incorporate gravitation due to certain unique aspects of it, though he might not have fully divulged that before his passage. Could gravitation be the most fundamental ‘manifestation-continuum’ in nature, the mother of all other needed manifestations in nature for nature to exist as it is, and hence defying incorporation as it is not being viewed that way fundamentally still causing (un)expected mathematical asymmetries and difficulties ?? If anyone knew and delved into it intellectually more than anyone before, or since, it would be Albert Einstein. He worked on his visionary unified field theory till the last day of his life. Einstein left a large number of papers and notes with extremely advanced mathematical physics concepts and equations that were incomprehensible by others for a long time. Most physicists could not comprehend the last papers he left behind for decades. I am not sure what lessons the string theorists have been able to glean from his last papers and notes, or whether they understood any of it ?? Einstein had always pointed out the need for more powerful mathematical approaches to take care of deep scientific dilemmas, especially in the mathematical structuring of quantum theory, which he always thought was sub-optimal due to over-reliance on probability and statistics, and the difficulty in the unification process of the known force fields in nature. String theorists are finally getting into this with the discovery of what Srinivasa Ramanujan, a mathematical genius of the ages, did over a hundred years ago in new areas of pure mathematics that were his creation, but were not picked up or understood by mathematicians for decades !! Going back to time and space, the other 22 dimensions that I am referring to(totaling 26 now), also exist within time, with time and space manifolds that are being taken into account painstakingly, making it imaginatively highly abstruse. It has been an ‘intellectual blue whale’ that is still proving to be highly elusive with some hopeful light on the horizon… As fascinating and complicated as all these appear to be, the fundamental truth is that ‘space-time’ exists and is interdependent to the degree that one can not exist or have any meaning without the other. All considered, till today, Einstein’s general theory of relativity remains the most brilliant, and accurate exposition of ‘space-time’ field along with gravity, gravitational field due to presence of mass, its fundamental effects on ‘space-time’, dynamic distortions of space-time field by accelerating bodies, displacement of ‘space-time field’ as gravity waves, the existence of singularities in nature such as black holes, worm holes, existence of a ‘cosmological constant’,(what we now refer to as the mysterious ‘dark energy’ that exists as an all important factor in Einstein’s field equations), the relativity of time with respect to the speed of light, time itself, and the relativistic effects with fast moving and accelerating bodies, and the list goes on… Going back to time, it is not matter or energy but a measure of the continuity of existence of each of these in ‘spacetime’ field and the measure of continuity of existence of space and ‘space-time’ itself. ‘Spacetime’ continuity is not believed to have existed before the Big Bang, thus making it possible for a singularity like the ‘cosmic egg’ to be there as an infinitely small entity, ‘as if without existence’, unperturbed by any flow of time, ‘being there outside of space and time’ as we know it… The postulated energy present in the singularity we refer to as the ‘cosmic egg’ may have been in a ‘time-less state’, or in a ‘locked-in-state’ undisturbed by time, which somehow nature unlocked, perhaps in a preordained manner to unleash everything that exists including time and space, and all that is within its field… Kaiser T, MD. ",
            "date": "Updated May 15, 2020",
            "views": "29",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fran Batton",
                    "user_href": "/profile/Fran-Batton"
                },
                {
                    "user_id": "Uday Shetty",
                    "user_href": "/profile/Uday-Shetty-75"
                },
                {
                    "user_id": "Shashi Kiran",
                    "user_href": "/profile/Shashi-Kiran-323"
                },
                {
                    "user_id": "Eric Gaynor Butterfield",
                    "user_href": "/profile/Eric-Gaynor-Butterfield"
                },
                {
                    "user_id": "Elif Ece",
                    "user_href": "/profile/Elif-Ece-3"
                },
                {
                    "user_id": "Tiffany Cheng",
                    "user_href": "/profile/Tiffany-Cheng-2"
                },
                {
                    "user_id": "Arun Ghosh",
                    "user_href": "/profile/Arun-Ghosh-33"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Pemsi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikola Milovic",
                "href": "/profile/Nikola-Milovic-1"
            },
            "answer_text": "The universe is infinite, filled with substance AETHER, from which matter is formed, and from the matter of various energies. A substance with its two states has a relationship with Aether. One relationship causes gravity, and the second relationship with Aether causes magnetism. This does not make science and therefore there are many theories and inventions in this field. Space is a place for the accommodation of matter and its movement according to the given natural laws, and time is only a measure of motion of matter in the space. Discard Einstein's Fatamorgans about time and space, because it is a deadly pesticide for our awareness, of course, whoever has it, that can be cured of those dangers. No matter or energy, they have no physical connection with time. MI people have adopted a unit of time. ",
            "date": "Answered January 10, 2018",
            "views": "550",
            "upvotes": "0"
        }
    ]
}