{
    "title": "Is the truth or lying better in a relationship (by lying, like white lies)? - Quora",
    "tags": [
        "White Lies",
        "Truth",
        "Relationships",
        "Lies and Lying",
        "Relationship Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anna Ylims",
                "href": "/profile/Anna-Ylims"
            },
            "answer_text": "I prefer total honesty.. absolute honesty.. no lies and deception should come in-between two souls that truly love each other.. true love is about loving the good and the bad in another person.. if we love only their good side, then it is not a complete acceptance and complete understanding and love.. so, honesty is essential.. we can love only what we know and understand.. if we love a fake image of someone it is fake love.. sometimes we idealize the person, sometimes they might deceive us and pretend to be better than they are, and usually both things happen when two people realize they are attracted to each other.. that is why it is important to be true to ourselves, to be genuine, authentic person.. people with a “mask” on their face will attract the wrong person and the relationship will fail.. if for some reason one person doesn't want to say something (if it is too private, too embarrassing, detrimental in some way for the relationship, or the other person would understand it the wrong way, etc then we can say “I don't want to talk about it”.. no lies are necessary.. lies are always wrong.. even as a joke, they are still wrong.. we all have our own insecurities, childhood wounds, fears, mistakes, failures, etc and some of them we can keep to ourselves (regarding us, as an individual, not as some sort of deception and portraying a false image of ourselves).. some people can abuse honesty.. and use it as a weapon to hurt others, that also is a bad thing.. why say something, that is correct, like “you gained much weight” to someone? no need.. they probably know very well that they gained weight.. so in that case saying “you look good today” is acceptable, even if a person doesn't totally think so.. but if a husband says to his wife how great she looks, and how he adores her, and at the same time he is cheating on her, that is wrong.. his intentions are evil.. he keeps her in a fake reality.. relationship based on lies will not last long, and even if it does last it is fake.. not real.. so it is a waste of time (life)..      ",
            "date": "Answered October 5, 2020",
            "views": "106",
            "upvotes": " Answer requested by Minnie Chae",
            "upvoters": [
                {
                    "user_id": "Barbara Gendron-Greene",
                    "user_href": "/profile/Barbara-Gendron-Greene-1"
                },
                {
                    "user_id": "Oleta Spiceland",
                    "user_href": "/profile/Oleta-Spiceland"
                }
            ]
        },
        {
            "author_info": {
                "name": "Johan Erasmus",
                "href": "/profile/Johan-Erasmus-1"
            },
            "answer_text": "It isn't as clean cut as that, you see, relationships have another side. Some people lie because they are dishonest people, we are not talking about them. The question one should ask is why honest people would lie in a relationship. The problem is that the other party doesn't always make it a save environment in which one can be totally honest. In many modern relationships, when one party wants the other party to quit an annoying habit and that person agrees to quit, you often notice that the person who requested the change takes on a zero tolerance policy. The problem is that few people manage to quit bad habits instantly. There will be many slip ups and when you fave someone with a zero tolerance policy on you attempt to quit, then it isn't easy to be honest. I have been biting my fingernails for as long as I can remember, I'm nearly 40 years old and my wife has been trying to get me to quit doing it for more than eight years. I have found it extremely difficult to quit the habit, but I have overcome some serious challenges in the last year and I decided I could do this. It's been about 2 months now, but last week I had a bad slip. I was watching a tense moment in The Punisher on Netflix when I caught myself to late, I had bitten one fingernail off, fortunately not to the level I used to. What did I do the next day, I told my wife about my slip and how upset I was about it, because I was really starting to think that is was beating the habit. Why was I honest about it, because my wife provides me with a safe environment to be honest. I can't help but think about the movie: He's just not that into you. The one woman forgave her husband for cheating and blamed herself, then she figured out he didn't quit smoking and threw him out. I understand her father died of lung cancer, but I seriously thought that she had her priorities crossed. You see it often, when someone tries to quit smoking, they have to go do it in secret if they slip up. It all boils down to the environment. I have kept things from my wife because I didn't feel save telling her, just to tell her a few days later because it was eating at me. She often laughed and told me that she knew because it was written on my face. So far that have always been it. No condescending replies, just being made aware that my my marriage is a safe environment and I don't have to lie or hide stuff. I would often sneak a sausage roll when I go shopping and the I eat it carefully in the parking lot and dispose of the wrapper in our outside bin when I park the car back home. And then I kiss my wife hello when I walk in and think that got away with it. My wife always allowed me to get away with it because it was harmless and she knew it was more like a black ops mission to me than being dishonest, even though I am on a diet. Then later I would feel bad and tell and she always knew I had a sausage roll because you do not kiss someone after you have eaten a sausage roll and expect them not to know. Kind of ruined my black ops missions when I figured out her secret, her counter intelligence was just to good. It is more important to provide a safe environment for your spouse to be honest in. ",
            "date": "Answered October 9, 2020",
            "views": "59",
            "upvotes": " View 2 Upvoters "
        }
    ]
}