{
    "title": "Is there spiritual relevance to Plato and the Forms? - Quora",
    "tags": [
        "Plato",
        "Metaphysics",
        "Spirituality",
        "Philosophy",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Trejo",
                "href": "/profile/Paul-Trejo-1"
            },
            "answer_text": "In my reading, Plato’s theory of the Ideal Forms is itself spiritual. To begin, I note that the German word for Mind (Geist) also means Spirit. Plato placed Ideas (Ideals) at the highest point in the Cosmos. Ideas are Invisible, but they control the world. This was his teaching. The most powerful Ideas in human society are the Ideas of Ethics. These Ideas include Virtue, Honesty, Courage, Moderation, the Good, the Right, the Beautiful, Honor and Justice. All of these Virtues are Invisible Ideals. This was one of the abiding themes of the dialogues of Socrates. He would ask an intelligent person, “Do you know what Virtue is?” The person would answer, “Of course I do!” Socrates would ask, “Would you please define it for me?” As readers of Plato know, the persons were able to describe individual instances of Virtue — but it was different for the wealthy compared with the middle-class. It was different for men compared with women. It varied depending on age. There were many variables — many kinds of Virtue. But nobody could nail it down succinctly. We can see examples of Ideas — but not the Ideas themselves. The Ideas exist in an Eternal Dimension which will outlast the Material Universe itself. All Divine beings exist in this Eternal Dimension. To call this Eternal Dimension “heaven” is not a stretch. To call the Mind the Spirit itself is only a stretch for those who insist on defining the Mind as animal reflexes of the material nervous system. Most modern folks seem to have lost touch with Plato’s Realm of Ideals. ",
            "date": "Answered May 17, 2019",
            "views": "107",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Todd Smith",
                    "user_href": "/profile/Todd-Smith-439"
                },
                {
                    "user_id": "Stephen Hambleton",
                    "user_href": "/profile/Stephen-Hambleton"
                }
            ]
        }
    ]
}