{
    "title": "Is there anything truly objective? - Quora",
    "tags": [
        "Objectivity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jaekwan Lee",
                "href": "/profile/Jaekwan-Lee"
            },
            "answer_text": "\"Nothing can be objective\" is also not true because its a relative term. Everything can be objective in terms of the place where you are viewing.  The objectivity and subjectivity are relative terms between systems that is either included or including relationship. If your system includes another system, say the subsystem is governed by your system, and all the phenomena observed in the subsystem are same, it is objective in the perspective of your system. But if you are out of your system and say it cannot be objective, yes you are right because the assumption that your system includes subsystem is invalid.  Let me put more explanation. The below represents two independent system hierarchies.              1                      A          |     |                  |     |        2      3              B      C Let say you have two systems 1 and A. The system 1 has subsystem 2 and 3 on the left likewise the system A on the right has subsystem B and C. We can say whatever observed in subsystem 2 and 3 is objective in terms of system 1. We can say whatever observed in subsystem 2 and 3 is subjective in terms of subsystem 2 or 3 looking at the other.  But if you are out of system 1 and look at A or B or C, objectivity or subjectivity are gone in terms of any system on the left tree.                     #Mother                   |                 |            1                      A          |     |                  |     |        2      3              B      C But let say you have another system, #Mother, that includes the system 1 and A. Now whatever happens in the either inside of system 1 or A is objective in terms of the perspective of system #Mother. So the objectivity changes based on the relationship between systems.  Here is the answer based on your categories  a) individually subjective (a single person's experience/belief)b) mass subjective (a group of people experience/belief)c) objective (applicable to all beings & objects everywhere in every universe)                    #Human                   |                 |            Group 1     Group 2            |         |         |       |           P1     P2      P3    P4 a) Individuals are subjective as they are independent system. (P1 looks at P2)b) But a person is belongs to a group, it creates objectivity like norms a group think that is right. For example, if you're in religious community, there are things objectively you must not do. (Group1 looks at P1). But it is invalid if you shift your religion to other one. (Group 1 looks at P3)c) We say mostly something is objective when it is belongs to human or under human's system. (Everything is explainable in terms of #Human. You can replace the #Human to #Nature but this is not the point) Objectivity is a view point from the higher system down to lower system. ",
            "date": "Answered November 30, 2015",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Affe Nowu",
                    "user_href": "/profile/Affe-Nowu"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Rubín de Celis Leal",
                "href": "/profile/David-Rubín-de-Celis-Leal"
            },
            "answer_text": "Congrats! One of the deepest questions I've seen in Quora! Let me babble an answer. In order to be able to talk about knowledge and truth, we have to assume that there is a reality. Ideas can be coherent with that reality, in which case they are called truth. There is no such thin as a single sentence that is \"the truth\", but specific ideas about the reality that can be truth. When you say that \"my head hurts\", or \"the earth spins around the sun\", both sentences are describing reality, specific aspects of reality. When those descriptions are coherent with reality, then they are truth, regardless if they can be proven or not. They successfully describe their specific and limited aspect of reality, and in such sense they are objective. All the ideas that describe the universe are possibly truth and false, and objective in their own limited aspect. But not all the ideas describe the universe. Most of the ideas in our mind are actually assessments of the reality, and in such way, they are subjective. That \"your head hurts\" is objective. That that is bad, or important or beautiful, etc., is subjective because it depends on purposes, and as long as we know nothing determines the purposes of minds. ",
            "date": "Answered January 3, 2014",
            "views": "41",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Francis",
                    "user_href": "/profile/Steve-Francis-8"
                },
                {
                    "user_id": "Samantha Vitela",
                    "user_href": "/profile/Samantha-Vitela"
                },
                {
                    "user_id": "Chandrika Kautha",
                    "user_href": "/profile/Chandrika-Kautha-2"
                },
                {
                    "user_id": "Emma Rose",
                    "user_href": "/profile/Emma-Rose-412"
                },
                {
                    "user_id": "Nicklas Vidisson",
                    "user_href": "/profile/Nicklas-Vidisson"
                },
                {
                    "user_id": "Saugat Kandel",
                    "user_href": "/profile/Saugat-Kandel-4"
                },
                {
                    "user_id": "Sean Yablunsky",
                    "user_href": "/profile/Sean-Yablunsky"
                },
                {
                    "user_id": "David Wood",
                    "user_href": "/profile/David-Wood-375"
                },
                {
                    "user_id": "Affe Nowu",
                    "user_href": "/profile/Affe-Nowu"
                },
                {
                    "user_id": "Pulkit Advani",
                    "user_href": "/profile/Pulkit-Advani-2"
                }
            ]
        }
    ]
}