{
    "title": "Is the existence of mathematics and natural laws logically prior to the Big Bang? - Quora",
    "tags": [
        "The Big Bang",
        "Big Bang Cosmology",
        "The Universe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Villa",
                "href": "/profile/Frank-Villa-2"
            },
            "answer_text": "That is tricky philosophy right there. Not my speciality, but allow me to try anyway: There are two different ways of understanding “mathematics”: The science that we humans are developing when doing mathematics.The concepts that we discover and describe when doing mathematics.Trivially, the former has only existed for as long as we humans have been doing it. So let’s pick the latter instead. Mathematics, in that sense, has no physical relationship with time. Mathematics doesn’t “exist” in the sense that our universe and the physical objects in it exist. So yes. In a way, the concepts of “zero”, “one”, “plus” etc. do not need our universe in order to exist. They are there regardless. Same with more advanced mathematical concepts. There would be 26 sporadic finite simple groups even if there was no universe and no humans to talk about them. As for natural laws: Nope. They started existing when the universe started to exist. And we’re really not even too sure about the first very short time after the Big Bang. ",
            "date": "Answered March 11, 2018",
            "views": "126",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matt Acutt",
                    "user_href": "/profile/Matt-Acutt"
                },
                {
                    "user_id": "Xander de Vries",
                    "user_href": "/profile/Xander-de-Vries-2"
                },
                {
                    "user_id": "David W. Vogel",
                    "user_href": "/profile/David-W-Vogel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Acutt",
                "href": "/profile/Matt-Acutt"
            },
            "answer_text": "As eloquently espoused in another response to this question, it’s important to define the terms we’re going to use before we begin. Subjective mathematics and the subjective model of the laws of nature are both dynamic and change according to our evolving understanding of the environment in which we are contained. As we acquire new information and re-interpret what we thought we knew, our subjective description of mathematics similarly requires re-interpretation. The structure which is being described by subjective math and subjective scientific inquiry is the structure of reality, which is immutable and eternal, as well as entirely independent of subjective perceptions of it. This structure, what I would call objective logic, entails the objective mathematics which we attempt to represent linguistically in our formal mathematical systems. These laws of nature, which inherently include mathematics, are necessarily existent and do not exist ‘prior’ to the Big Bang per se, because there was no prior to the start of spacetime. Rather, these laws of nature transcend the physical system in which we are contained, and so too transcend temporality. Thus, yes, the existence of the laws of nature and the laws of mathematics are logically superordinate to the front-end manifestation of our specific physical system, which constitutes a mere minuscule aspect of the totality of reality which is entailed by the laws of nature. ",
            "date": "Answered March 11, 2018",
            "views": "208",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frank Villa",
                    "user_href": "/profile/Frank-Villa-2"
                },
                {
                    "user_id": "Sebastjan Leon",
                    "user_href": "/profile/Sebastjan-Leon"
                }
            ]
        }
    ]
}