{
    "title": "Is the liar paradox a proof that knowledge has limits? - Quora",
    "tags": [
        "Liar Paradox",
        "Epistemology",
        "Paradoxes",
        "Logic (philosophy)",
        "Proofs (mathematics)",
        "Lies and Lying",
        "Knowledge",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Flom",
                "href": "/profile/Peter-Flom"
            },
            "answer_text": "No. It’s an indication of the problems of language and that not all statements are true or false (even if it appears that they should be). There are a bunch of variations of the liar paradox. Perhaps the “tightest” is This statement is false. But if it’s false, it’s true and if it’s true, it’s false. Is this really a “paradox”? No. It’s just that the statement is meaningless. Another version is All Cretans always lie. I am a Cretan. Is this true or false? I’d say the two are just incompatible. But that “knowledge has limits” is clear from other things. Every time we learn something new, we learn more things that we don’t know. For example, before we knew light had a speed, we didn’t wonder about what its slowest possible speed was (yes, I know, it is constant in a vacuum, but it is not constant outside of a vacuum). No one, 100 years ago, wondered about how quantum computing could work, or about how to best encrypt e-mail. ",
            "date": "Answered October 6, 2020",
            "views": "1",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jon Stewart",
                    "user_href": "/profile/Jon-Stewart-13"
                },
                {
                    "user_id": "Martin Jansche",
                    "user_href": "/profile/Martin-Jansche"
                },
                {
                    "user_id": "Dmitri Wells",
                    "user_href": "/profile/Dmitri-Wells"
                },
                {
                    "user_id": "David Croft",
                    "user_href": "/profile/David-Croft-6"
                },
                {
                    "user_id": "Rey J. Weiler",
                    "user_href": "/profile/Rey-J-Weiler"
                },
                {
                    "user_id": "Paul Olaru",
                    "user_href": "/profile/Paul-Olaru"
                },
                {
                    "user_id": "David W. Vogel",
                    "user_href": "/profile/David-W-Vogel"
                },
                {
                    "user_id": "Ahmet Caliskan",
                    "user_href": "/profile/Ahmet-Caliskan-4"
                },
                {
                    "user_id": "Karal Daskin",
                    "user_href": "/profile/Karal-Daskin"
                },
                {
                    "user_id": "Eric Platt",
                    "user_href": "/profile/Eric-Platt-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Brilliant",
                "href": "/profile/John-Smith-46456"
            },
            "answer_text": "No, it’s a proof that logic has limits. Just as arithmetic has operations like dividing by zero that make no sense, logic also has operations that make no sense. “This statement is false” is a prohibited statement just as 3/0 is a prohibited expression. Self-referential statements like “this statement is true” and “this statement is false” should be avoided. The first is meaningless and the second is impossible. Is the liar paradox a proof that knowledge has limits? ",
            "date": "Answered October 11, 2020",
            "views": "643",
            "upvotes": "0"
        }
    ]
}