{
    "title": "Is the law a reliable guide to what is morally good or bad? - Quora",
    "tags": [
        "Morals and Morality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alice Baker",
                "href": "/profile/Alice-Baker-31"
            },
            "answer_text": "No. It is incredibly easy to come up with a list of things that are legal but immoral. It is equally easy to come up with a list of things that are “wrong” only because the law prohibits them. Some things are both morally wrong and illegal. MurderArsonTheftSome things are morally wrong, but completely legal. AdulteryBeing mean to peopleLying to your parentsSome things are “wrong” only because they are prohibited by law. If the law were changed tomorrow, those things wouldn’t be “wrong” any more. Driving on the left side of the road (in the U.S.)Driving 30 miles per hour in a 25 mph zoneJaywalking at 2:00 a.m. on a street where there is no traffic at all",
            "date": "Answered April 28, 2018",
            "views": "875",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lithudzha Mulisa",
                    "user_href": "/profile/Lithudzha-Mulisa"
                },
                {
                    "user_id": "Abulele Mdzanga",
                    "user_href": "/profile/Abulele-Mdzanga"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michaelangelo Dippolito",
                "href": "/profile/Michaelangelo-Dippolito"
            },
            "answer_text": "No. Laws are put in place to maintain the current social structure. For example, in slavery there are laws governing the master and the slave. Most of those laws are bad/ immoral. Which brings us to a larger question. What is the definition of good and bad conduct or moral and immoral conduct? Here's mine: any act or inaction, in general, that maximizes the length and quality of human life is moral and act or inaction, in general, that makes human life shorter and/or less happy is immoral. You can apply this definition to your individual, family, community to come up with code of conduct that is, in general, good. ",
            "date": "Answered April 23, 2018",
            "views": "754",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cynthia Uwah",
                    "user_href": "/profile/Cynthia-Uwah"
                },
                {
                    "user_id": "Virginia Moher",
                    "user_href": "/profile/Virginia-Moher"
                }
            ]
        }
    ]
}