{
    "title": "Is telepathy real? Can you really do it from a distance? - Quora",
    "tags": [
        "Telepathy",
        "Supernatural Phenomena"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frances Haddick",
                "href": "/profile/Frances-Haddick"
            },
            "answer_text": "YES!!! Telepathy IS REAL!!! And you can do it from a distance. On 3 occasions in 2017, my fiance and I were living about 5 miles from his families house and neither one of us had a phone to call one his brothers over, so I decided to do an experiment with mental telepathy to call his brother over to our trailer and bring some ice cream, because I wanted some real bad and we didn't have any money. So, I told my fiance exactly what I was doing with my experiment and he was like, “Yeah, Okay?”. So, I went to my quiet place and I meditated for about an hour calling his brother with my mind and asking him to bring a half gallon of chocolate ice cream. He doesn't know thats my favorite ice cream either. His brother NEVER brings anything with him, EVER!!! So, after I finished using mental telepathy on his brother, he showed up 48 minutes later with a half gallon of chocolate ice cream. I timed him to see how long it would take him to receive my message, get on his bike, stop at the corner store and grab the ice cream then bicycle over to the trailer and in 48 minutes time is pretty much how long it was supposed to take him upon him being receptive and boy was he ever! When he got to the trailer, I went and told my fiance, “Guess who's here and guess with what?”, he says, “no f n way?” I said, “yeap, it worked!” There was no way that could have been coincidence, because there are none, everything happens for a reason I used mental telepathy on my finances brother and he did exactly what I asked of him to. I was SUPER EXCITED!!! ",
            "date": "Answered April 30, 2020",
            "views": "23",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carina Møller",
                    "user_href": "/profile/Carina-Møller"
                },
                {
                    "user_id": "Sherie Oh",
                    "user_href": "/profile/Sherie-Oh-2"
                },
                {
                    "user_id": "Debbie DePaul",
                    "user_href": "/profile/Debbie-DePaul"
                },
                {
                    "user_id": "Doug Mac",
                    "user_href": "/profile/Doug-Mac-4"
                },
                {
                    "user_id": "Anita Lee",
                    "user_href": "/profile/Anita-Lee-83"
                },
                {
                    "user_id": "Jesse Wayne Blenn",
                    "user_href": "/profile/Jesse-Wayne-Blenn"
                },
                {
                    "user_id": "Jo Stong",
                    "user_href": "/profile/Jo-Stong"
                },
                {
                    "user_id": "MARK Richford",
                    "user_href": "/profile/MARK-Richford"
                },
                {
                    "user_id": "Kate Azuma",
                    "user_href": "/profile/Kate-Azuma"
                },
                {
                    "user_id": "Adam Berlin",
                    "user_href": "/profile/Adam-Berlin-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lois Thompson",
                "href": "/profile/Lois-Thompson-60"
            },
            "answer_text": "Telepathy, intuition, visions, hearing voices, clairvoyance, sixth sense, ESP, NDEs, astral projection - are they real? Of course they are. BUT, to those who have never experienced any of these, they will tell you No. To those who have, they will tell you Yes. Seeing and Hearing IS believing. IF one never gets to experience this, they will deny it BECAUSE THEY NEVER SAW OR HEARD. That's ego. \"Well if it was true I would know about it.\" Guess what? No body knows every thing. And no one is an expert on the unknown. Some people believe strongly in God and others deny His existence. So what is true? What is real? For the naysayers, they're right, it isn't real (to them.) For those who know, they're right, because they've experienced it and they know it's real. It's hard, and sometimes dangerous, to take someone else's word for something unless you know that person and know you can trust them. For a preacher or anyone to come up and say \"Jesus said...and you're supposed to move to...\" I wouldn't believe them. So taking another person's word for something is a cautionary tale, watch for motive and intent. If you've experienced it, don't deny what you just saw and heard, otherwise you're lying to yourself. Question the source and get confirmation. ",
            "date": "Answered April 29, 2020",
            "views": "90",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Adam Berlin",
                    "user_href": "/profile/Adam-Berlin-3"
                }
            ]
        }
    ]
}