{
    "title": "Is there any practical use of philosophy? - Quora",
    "tags": [
        "Existence Question",
        "Software and Applications",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Gi",
                "href": "/profile/Tom-Gi"
            },
            "answer_text": "Philosophy is extremely useful. But it’s not easy to see why. For many, philosophy is a mental exercise. It has no more practical application than a strategy board game. Some might see it as an art form, a playful pastime to satisfy the soul. Others contend that philosophy can be therapeutic, ameliorating human sorrow. We can learn from Boethius (477–524 CE), for example, how to ‘take life philosophically’. The Consolation of Philosophy: Boethius, David R. Slavitt, Seth Lerer While these descriptions of philosophy are all very well and good, philosophy has a much more useful role in our lives. Plato’s The Republic, Machiavelli’s The Prince, and Thomas Moore‘s Utopia —these are wild speculations on the art of governance. Eventually this theorizing would give birth to a discipline we now call political science. Isaac Newton was practicing ‘natural philosophy’ in his own time – not physics. Adam Smith never took a course in economics. In his time he was known as a ‘moral philosopher’. The mathematician Georg Cantor’s work in the late 19th century was too weird to be considered mathematics at first. It had to go through a philosophical stage before it revolutionized 20th century mathematics. The philosopher William James once said that the first lecture he heard on psychology was one that he gave. He was one of the architects of modern psychology. Many fields of study must go through a hazy, almost mystical stage, before they crystallize into a discipline. Once a group of individuals agrees on what it is they wish to study, and agree on what methods are acceptable, and what methods are unacceptable, a ‘subject’ or ‘discipline’ is born. At that point the philosopher becomes an unwelcome guest at the table. He may be thanked but then told that his services are no longer needed because now there is ‘real’ work to do. American philosopher John Searle summed it up when he said, “Philosophy is what you do when you don’t know what to do next.” Here is another way to look at it. Many subjects of study can be thought of in two aspects: the theoretical and the practical. Consider these pairings of professionals: physicists /engineersbiologists / physicianseconomists / businessmentheologians / preachersliterary critics / writerspolitical scientists / politiciansThere may be some tension, but always a mutual respect between the theorists and practitioners. Professors who spend most of their time theorizing are sometimes thought of as living in their own little world, removed from the practical world. So where does philosophy fit into this? Philosophy is to the theoretical, as the theoretical is to the practical. Philosophers can be thought of as ‘meta-theorists’. No question is too outrageous to consider. Other subjects must limit themselves in order to maintain their integrity. Philosophy is necessary, it is important, and it is useful. But its influence is so very general and fundamental, we have trouble appreciating its profound effect. ",
            "date": "Updated April 12, 2019",
            "views": "68",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Utkarsh Chatterjee",
                    "user_href": "/profile/Utkarsh-Chatterjee"
                },
                {
                    "user_id": "Scott Womack",
                    "user_href": "/profile/Scott-Womack-11"
                },
                {
                    "user_id": "Veronica Moore",
                    "user_href": "/profile/Veronica-Moore-89"
                },
                {
                    "user_id": "Ali Garoosi",
                    "user_href": "/profile/Ali-Garoosi"
                },
                {
                    "user_id": "Mehbubul Alam",
                    "user_href": "/profile/Mehbubul-Alam-2"
                },
                {
                    "user_id": "Anmol Bage",
                    "user_href": "/profile/Anmol-Bage"
                },
                {
                    "user_id": "Prasurjya Kashyap",
                    "user_href": "/profile/Prasurjya-Kashyap-2"
                },
                {
                    "user_id": "Olli Parviainen",
                    "user_href": "/profile/Olli-Parviainen-2"
                },
                {
                    "user_id": "Prithu Halder",
                    "user_href": "/profile/Prithu-Halder"
                },
                {
                    "user_id": "Lenka Jacek",
                    "user_href": "/profile/Lenka-Jacek"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Augros",
                "href": "/profile/Peter-Augros"
            },
            "answer_text": "First of all, I love you. I used Plato’s republic to prop open my door once. There really isn’t much practical use to philosophy, but that doesn’t mean it has no purpose. Philosophy gets you thinking for yourself. It takes you right out of your safe belief system ready to admit that really we know very little, but we make ourselves big in our minds. Philosophy dares to challenge the very way we interpret life, it asks the questions that lead to transformation. The philosopher dares to answer those questions by experimenting on his own mind and psyche. Philosophy may never get you a paycheck, but it will challenge you to live life to the full, in a way the rest of society cannot even imagine. To be a lover of wisdom does not mean, “oh, yeah, wisdom. I’m a big fan.” It means to seek answers with your very life, not to think interesting things from an armchair, or having arguments to show off how much you know. Philosophy is the generator of ideas, which in turn make the world move and evolve. If philosophy were a ship, then history would be its wake. Blessings! ",
            "date": "Answered May 1, 2018",
            "views": "16",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jemma Galecio",
                    "user_href": "/profile/Jemma-Galecio"
                },
                {
                    "user_id": "Tom Gi",
                    "user_href": "/profile/Tom-Gi"
                },
                {
                    "user_id": "Olli Parviainen",
                    "user_href": "/profile/Olli-Parviainen-2"
                },
                {
                    "user_id": "Cole Reister",
                    "user_href": "/profile/Cole-Reister"
                },
                {
                    "user_id": "John Alan",
                    "user_href": "/profile/John-Alan-6"
                },
                {
                    "user_id": "Abbas Al-Hassani",
                    "user_href": "/profile/Abbas-Al-Hassani"
                }
            ]
        }
    ]
}