{
    "title": "Is there an alternative to set theory? - Quora",
    "tags": [
        "Metamathematics",
        "Set Theory",
        "Logic (mathematics)",
        "Logic (philosophy)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrés Occhipinti",
                "href": "/profile/Andrés-Occhipinti"
            },
            "answer_text": "Logic is not founded on set theory. The axioms of axiomatic set theory are formulated using a logical language (typically first-order logic with a binary predicate [math]\\in[/math] for membership). This language is then interpreted over a matching class of models. So formal logic is used in developing axiomatic set theory, rather than the other way around. For example, ZFC is a theory in first-order logic, that is, a collection of well-formed sentences in the language. Moreover, within ZFC you can formalize first order logic. This allows you to consider questions about whether ZFC can prove its own consistency. Principles of logic, in a more general sense, are also naturally used in the meta-theory, which consists of results about the language and structures considered in axiomatic set theory. That being said, there are some proposed alternatives to set theory as a foundation of mathematics. One of them is Category theory. Another one is the so-called Univalent Foundations program. This approach is based on Homotopy Type Theory, which is a link between Martin Löf's intuitionistic type theory and the homotopy theory from topology. ",
            "date": "Answered November 14, 2016",
            "views": "18",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Joyce",
                    "user_href": "/profile/David-Joyce-11"
                },
                {
                    "user_id": "Dolev Dabush",
                    "user_href": "/profile/Dolev-Dabush"
                },
                {
                    "user_id": "Benedict Bede McNamara",
                    "user_href": "/profile/Benedict-Bede-McNamara-2"
                },
                {
                    "user_id": "Prakhar Pratyush",
                    "user_href": "/profile/Prakhar-Pratyush-3"
                },
                {
                    "user_id": "Steven Matosu",
                    "user_href": "/profile/Steven-Matosu"
                },
                {
                    "user_id": "Lorenzo Wormer",
                    "user_href": "/profile/Lorenzo-Wormer"
                },
                {
                    "user_id": "Santiago Renteria",
                    "user_href": "/profile/Santiago-Renteria"
                },
                {
                    "user_id": "Mark Gritter",
                    "user_href": "/profile/Mark-Gritter"
                },
                {
                    "user_id": "Y. Gonzalez",
                    "user_href": "/profile/Y-Gonzalez-4"
                },
                {
                    "user_id": "Uri Granta (אורי גרנטה)",
                    "user_href": "/profile/Uri-Granta-אורי-גרנטה"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Coppedge",
                "href": "/profile/Nathan-Coppedge"
            },
            "answer_text": "I will go out on a limb and say that perfect geometry, taxonomy, and countability are moderately equivalent to set-theoretic validity, although perhaps less formally consistent. Geometry that is modelled on graphs, taxonomy that is unified or complex, and countability that has a qualific corollary, all seem to relate to category theory. The appeal of set theory is that it is so consistently applicable (in my own work I do not use it mathematically, but philosophically). In my mind this consistency already assumes category theory of some type (if we want results for super-formalistic things that have qualities such as psychology or knowledge). To a philosopher set theory and Calculus are little more than a way of having intelligence and proving formal qualities. Formal qualities remain within the rational domain, and so mathematics will never provide evidence of every type of ultimate knowledge. In fact, if knowledge is a quality, we at least require categories to prove it, whether the categories are naive realist or not. ",
            "date": "Answered November 15, 2016",
            "views": "635",
            "upvotes": " Answer requested by Federico Savoy"
        }
    ]
}