{
    "title": "Is there any philosophy that can overcome materialism? - Quora",
    "tags": [
        "Materialism (philosophy)",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin Millen",
                "href": "/profile/Martin-Millen"
            },
            "answer_text": "Is there any philosophy that can overcome materialism? Metaphysics is a branch of philosophy that attempts to explain what reality is and why it is the way it is. In effect, metaphysics explores the relationship between mind and matter – between reality and consciousness. Materialism is one way of describing the relationship between mind and matter. Broadly speaking there are four ways to define the relationship between mind and matter, but they all give rise to problems – apart from the last one: Mind and matter are two totally distinct types of substance. This is called dualism, but dualism can’t explain how mind and matter can interact with each other if they are totally different.This is known as the mind - body problem.Mind is an emergent property of matter. This is called materialism or realism, but realism can’t explain how matter - which is solid and physical - can give rise to subjective experience which is not.This is known as the hard problem of consciousnessMatter is an emergent property of mind. This is called idealism, but idealism can’t explain how subjective experience – which is immaterial and intangible - can give rise to physical matter which is not.I refer to this as the hard problem of realityMind and matter are co-emergent properties of something else which contains them both. This is called neutral monism (or monadism) - where ‘monad’ is the one thing that ultimately exists.I regard the one thing that ultimately exists as “Isness” or BeingDon’t assume that one of these perspectives is right and the others are wrong. All four of these metaphysical perspectives are based on philosophical assumptions. There is no question that one day, one of these will be proved right and the others proved wrong. That’s just not possible. Proof doesn’t go that deep. These assumptions operate at a level below the level where proof takes place. You must choose whichever metaphysical belief you find most convincing. For my part, I favour neutral monism. What neutral monism does is pick up dualism and put it into a new perspective. Neutral monism says: there is a difference between mind and matter but this difference is not ultimate. Mind and matter are simply alternative expressions of isness or being There is mind, matter and monad, where monad resolves into mind and matter. By providing a context in which to place the relationship between mind and matter, monism resolves many problems: Heisenberg’s uncertainty principle: neutral monism sees mind and matter as interdependent, so a particle is not seen to have position and momentum prior to the attempt to establish them. There is no uncertainty – only the inexorable fact that we can establish either one or the other but not both.Schrodinger’s cat: neutral monism doesn’t require the concept of superposition. There is no mind-independent reality, so neither the cat nor the particles comprising it have any state at all - until we make the observations that determine their state.Quantum entanglement: no problem – ultimately all is one, so quantum entanglement is not a difficulty to be explained away – on the contrary it is a property of matter to be expected, on account of the underlying unity of all things.Relativity: neutral monism would say that there is no such thing as a velocity until it is measured, so it follows unavoidably that velocity is always relative to the observer measuring it.Free Will: neutral monism regards causality as a methodology constructed by mind in order to get a handle on reality. Intention and purpose - i.e. having determination - are aspects of mind, so they will necessary be part of that methodology. In other words, determination is an aspect of determinism.In my opinion, Neutral Monism is the metaphysics of the future.  Some links to my related Quora answers: 10 Questions that neither Science nor Religion can answer Is it possible that physics, as we know it, could be fundamentally flawed? What is the latest view on the hard problem of consciousness? Three kinds of consciousness and three realities What is the most interesting fact about human consciousness? Proof doesn’t go that deep What is enlightenment and how it can be achieved? ",
            "date": "Updated June 9, 2020",
            "views": "337",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Michael Dixon",
                    "user_href": "/profile/Michael-Dixon-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Pearce",
                "href": "/profile/David-Pearce-18"
            },
            "answer_text": "“It is the chief characteristic of the religion of science that it works.” (Isaac Asimov, ‘Foundation’) Scientific materialism is unique among the world’s major ideologies. Materialism is the only belief-system inconsistent with the entirety of the empirical evidence. For all one ever knows, except by speculative inference and conjecture, are the subjective contents of one’s own conscious mind and the phenomenal world-simulation it runs. Yet if physicists and chemists correctly understand the properties of matter and energy, and if neuroscientists correctly understand the properties of packs of membrane-bound neurons, then none of this empirical evidence should exist. You should be either a p-zombie or a micro-experiential zombie. Materialists will be exasperated at this response. Science works. Quantum theory works. Chemistry and molecular biology work. Our entire technological civilisation rests on a rigorous quantitative understanding of fields of matter and energy as formalised in the Standard Model. For example, the anomalous magnetic moment of the electron can be calculated using QED. It matches with experimental measurements up to 14 decimal places. No other belief-system can compete with this level of precision and success. All science reduces to the Standard Model plus General Relativity. Scientific materialism is the only game in town. Yet there is an empirically successful alternative to materialism – although I struggle to take it seriously. Non-materialist physicalism transposes the entire mathematical apparatus of modern science to an idealist ontology. The mathematical machinery of quantum field theory (QFT) describes fields of sentience rather than insentience. What distinguishes biological minds from the hypothetical external world isn’t subjective experience per se, but rather non-psychotic phenomenal binding (cf. The Binding Problem). Unlike materialism, non-materialist physicalism has immense explanatory and predictive power. Unlike materialism, non-materialist physicalism is empirically adequate.Just conceivably, it might even be true:If consciousness is fundamental, what predictions does it make?  ",
            "date": "Updated May 26, 2020",
            "views": "89",
            "upvotes": " View 84 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Luis Rodrigues",
                    "user_href": "/profile/Luis-Rodrigues-25"
                },
                {
                    "user_id": "Guyton Jingle",
                    "user_href": "/profile/Guyton-Jingle"
                },
                {
                    "user_id": "Amnon Eden",
                    "user_href": "/profile/Amnon-Eden"
                },
                {
                    "user_id": "William Emtage",
                    "user_href": "/profile/William-Emtage"
                },
                {
                    "user_id": "Vatsal Limbachia",
                    "user_href": "/profile/Vatsal-Limbachia"
                },
                {
                    "user_id": "Mark Antony",
                    "user_href": "/profile/Mark-Antony-40"
                },
                {
                    "user_id": "Johnny Blaze",
                    "user_href": "/profile/Johnny-Blaze-100"
                },
                {
                    "user_id": "Andrew Allen (Student)",
                    "user_href": "/profile/Andrew-Allen-Student"
                },
                {
                    "user_id": "Halle Nicole",
                    "user_href": "/profile/Halle-Nicole-9"
                },
                {
                    "user_id": "Justin Henry",
                    "user_href": "/profile/Justin-Henry-18"
                }
            ]
        }
    ]
}