{
    "title": "Is there any relationship between concept and reality? How do you define 'concept'? - Quora",
    "tags": [
        "Philosophy of Mind",
        "Augmented Reality",
        "Concepts",
        "Reality",
        "Philosophy",
        "Psychology",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pausha Foley",
                "href": "/profile/Pausha-Foley"
            },
            "answer_text": "A2A Are you familiar with the way that internet browsers work? You type in a web address and your browser finds the website and displays it on your monitor. The next time you go to that website the browser does not go and find the website again - the browser retrieves a memory of the website it stored. Your browser stores the memory of the website and shows you that memory instead of logging into the original site every time you visit it. The mind works the same way. It perceives reality and then it creates an image of what it perceives. This image is a concept. The next time the mind experiences the same thing it no longer pays attention to what it experiences, it just pulls out the concept and relates to the concept. When the mind encounters something new it hasn’t experienced before, it reaches for all the relevant existing concepts in order to make up a new concept that explains the new experience in a way that fits existing concepts. In this way the mind tends to get more and more involved with concepts, and less and less aware of the actual experience. The web browsers do “check in” with the actual websites to update their memories periodically, so that the memories that are displayed are always more or less up to date and reflect the reality of a website more or less accurately. The mind is periodically forced to “check in” with reality to update it’s concepts, though the mind is usually reluctant to do so. For the most part the mind tends to stick to concepts as they are. It gives it a sense of knowing, of stability, security that humans quite enjoy. Usually a concept is updated when reality intrudes and contradicts the old concept in ways that can’t be ignored, or else when one is intentionally examining one’s concepts. Reality will force one to keep the concepts more or less aligned with it. If there is no pressure to update concepts though, they can stay what they are throughout the human’s entire lifetime and they will become progressively more and more distant from reality. Also when one chooses to stick to one’s concepts and ignore reality that contradicts them, the concepts will become farther and farther removed from reality. It is the nature of reality to change. It is the nature of concepts to remain unchanged. This disparity causes the miss-alignment between concepts and reality. ",
            "date": "Answered October 1, 2019",
            "views": "218",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jorge Regalado",
                    "user_href": "/profile/Jorge-Regalado-1"
                },
                {
                    "user_id": "Yashasvi Acharya",
                    "user_href": "/profile/Yashasvi-Acharya"
                },
                {
                    "user_id": "Vadim Begin",
                    "user_href": "/profile/Vadim-Begin"
                },
                {
                    "user_id": "Saul Carreter",
                    "user_href": "/profile/Saul-Carreter"
                },
                {
                    "user_id": "Chaz Beauchamp",
                    "user_href": "/profile/Chaz-Beauchamp"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carol Willis",
                "href": "/profile/Carol-Willis-35"
            },
            "answer_text": "Consider 2 definitions or uses of “concept”: For Plato, “concept” might at its best be construed as the eidos — the eternal Ideas, ideals, “forms,” or we might call them something like concept designs, blueprints or templates in today’s language. The highest of the eidos are the Good, the True, and the Beautiful, with all other ideas and ideals deriving in some way from those. In some Buddhist inspired traditions, concept might be construed as “added-on meaning,” attributed meaning, or significance placed on top of “what-is,” distracting us from seeing things simply, as they are. So in the first case, we have concept as eternal Ideas that are in many ways more “real” than impermanent objects in the physical world. And in the second case, we have many or most concepts devalued as superfluous and distracting. ",
            "date": "Answered September 30, 2019",
            "views": "92",
            "upvotes": "0"
        }
    ]
}