{
    "title": "Is there a way of living life without money? - Quora",
    "tags": [
        "Advice About Wanting and Making Money",
        "Personal Finance Advice",
        "Existence Question",
        "Wanting and Making Money",
        "Personal Finance",
        "Money",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Marx",
                "href": "/profile/James-Marx-3"
            },
            "answer_text": "I can approach this question with an honest answer or a mythical fairy tale one. The honest answer is you can’t. This is why when someone is without money somehow some office will provide you with a check from the County, State, or Federal government in the form of assistance. There must be something being added to your coffers, sometimes. There must be eventually something sold, traded, or borrowed (rented by the hour/day). Sometimes, there is just a large pile of money there to live from. This is always a fortunate thing for anyone. When someone is lucky in this way they can be empty and miserable still. It depends on how they feel about that money. Many treat it like a blessing and some like an entitlement. This is about character and a little bit about nobility and family. There are many fortunate people who still make a huge difference by how they give of themselves and how they spend their time. Perhaps in the bigger picture there are exceptions. There is always an exceptional boy somewhere who was sent off to the university like his siblings before him. He stopped going to classes and after two semesters he was brought back home to try the local city college. He was asked to find work but his hip or his knee or shoulder or something hurts. He didn’t receive a grade for Introduction to Art. The only other class he signed up for, Tennis for Beginners met with the same results. He stopped participating in the life part of existence. He played video games very passionately. He is just given a space in his boyhood room and he mostly keeps the door closed. He basically is going to be a cost to someone or something in the bigger picture. Everyone can give back, somehow. Yet, there are exceptions. It’s about how you want to feel about how you exist. It’s a personal choice for everyone. I try not to judge by how a person gets his money or how he spends it. The mythical fairy-tale method to living without money is found deep in the woods but you probably should buy some provisions. Also, don’t plan on having anything to return to unless you’ve bought and paid for storage. ",
            "date": "Updated November 25, 2019",
            "views": "27",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Thurber",
                    "user_href": "/profile/Mark-Thurber-1"
                },
                {
                    "user_id": "George Clem",
                    "user_href": "/profile/George-Clem-4"
                },
                {
                    "user_id": "Adam Schiff",
                    "user_href": "/profile/Adam-Schiff-9"
                },
                {
                    "user_id": "Kat Yan",
                    "user_href": "/profile/Kat-Yan-3"
                },
                {
                    "user_id": "Kim Ce",
                    "user_href": "/profile/Kim-Ce"
                },
                {
                    "user_id": "William Harold Hinkson II",
                    "user_href": "/profile/William-Harold-Hinkson-II"
                },
                {
                    "user_id": "Julia Doherty",
                    "user_href": "/profile/Julia-Doherty-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathanael Garrett Novosel",
                "href": "/profile/Nathanael-Garrett-Novosel"
            },
            "answer_text": "Yes and no. You could technically live on a commune with others and never manage a dollar in your life. However, someone is interacting with money on your behalf, and you are benefitting from money that others have spent. This is the same as if you went to the extreme and lived in the wilderness; while you would never use money yourself as you scavenged for food, you would be safer than you would otherwise because of police and park rangers being paid to keep the area free from dangers, etc. Examples of people who live without using money directly but benefit indirectly include people in psychiatric hospitals, children with special needs, and the elderly who have given over their power of attorney to someone else. Pretty much every other example you can think of involves direct monetary exchange. Note that there’s nothing wrong with that since money is just a medium of exchange to hold value from (potentially perishable or time-sensitive) goods and services that you provided to others. Final note (in case there’s an assumption here that money is bad): If you have no money, you could either complain that the system is rigged against you or realize that you get back what you put into life. People complain all the time about how much things cost when—thanks to technology—things are getting better and cheaper all of the time. It’s amazing that someone can pick a banana, for example, from hundreds or even thousands of miles away and deliver it to your door for $0.28. That’s absolutely astounding in the grand scheme of things, yet because we’ve done it for so long, it seems pedestrian. So think of money as just a way to store the value you deliver to other people for when you need others’ help. Sure, you could live on a commune and have everyone contribute in whatever way you deem appropriate or fair, but money is a great way to tally and manage contribution to ensure that someone’s work is valued based on what people are willing to pay for it. That’s not to mention the fact that there’s practically no way that a communal system could’ve found a way to secure goods from thousands of miles away without some form of exchange system. ",
            "date": "Answered July 28, 2020",
            "views": "784",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Thurber",
                    "user_href": "/profile/Mark-Thurber-1"
                },
                {
                    "user_id": "Kat Yan",
                    "user_href": "/profile/Kat-Yan-3"
                }
            ]
        }
    ]
}