{
    "title": "Is there any ancient Egyptian philosopher known? - Quora",
    "tags": [
        "Ancient Egyptians",
        "People of Egypt",
        "Ancient Egypt"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joseph Holleman",
                "href": "/profile/Joseph-Holleman"
            },
            "answer_text": "“Known” you say? Some would argue that the Greeks “borrowed” their philosophy from the Egyptians. And it is a known fact that most Greek philosophers (Two in particular being Pythagoras and Thales who owe much of their work and teachings to the Egyptians. Pythagoras in fact spent years begging to be admitted into the Priestly schools of Egypt to learn what they knew), or their teachers who spent copious amounts of time studying in Egypt. There were many Egyptian philosophers that preceded the Greeks by thousands of years. Most are nameless as they were part of the various priestly schools that existed throughout Egypt, but a few do stand out. Just to name a few: Imhotep: Imhotep lived in the 28th century B.C. and is the earliest known person to deal with questions regarding space, time, volume, illnesses both physical and mental, and immortality. Some would say he was the “first” philosopher and the true father of not only that discipline but also medicine, architecture and politics.Ptahhotep: Ptahhotep lived in the 25th century B.C. He was an influential and powerful priest who produced the first known ethical teachings to do with aging. He taught that life was about making harmony and peace with nature.The Kagemni Sage: Living in the 24th century B.C., the Kagemni Sage is considered the first teacher of ethics.Merikare: Lived in the 20th century B.C. Merikare taught the value of being able to speak well and the importance of common sense.Sehotepibre: Lived in the 20th century B.C. One of the first “nationalist” philosophers who believed in the divine right of Kings.Amenemhat: Lived in the 20th century B.C. One of the first teachers of “Cynicism”.Amenhotep of Hapu: Lived in the 15th century B.C. One of the most revered of ancient Egyptian philosophers and teachers and only the second of which to be deified other than Imhotep.Duauf: Lived in the 14th century B.C. Considered the first “intellectual” in philosophical history and a strong advocate of reading and literacy.Akhenaten: Lived in the 14th century B.C. Called the “heretic king” and the father of Egyptian monotheism. Akhenaten believed in “one God”, the “Aten”, a belief that was very similar to Abrahamic worship of “Adonai”.Amenemope: Lived in the13th century B.C. Promoted the philosophy of manners, etiquette and success.For more information see the book “The Egyptian Philosophers” by Molefi Keti Asante. ",
            "date": "Answered November 9, 2017",
            "views": "16",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adonis Michael",
                    "user_href": "/profile/Adonis-Michael-2"
                },
                {
                    "user_id": "Daniel Klos",
                    "user_href": "/profile/Daniel-Klos-1"
                },
                {
                    "user_id": "Atumra Hermes",
                    "user_href": "/profile/Atumra-Hermes"
                },
                {
                    "user_id": "Rizal Saputra",
                    "user_href": "/profile/Rizal-Saputra-5"
                },
                {
                    "user_id": "Abdelrahman Mustafa",
                    "user_href": "/profile/Abdelrahman-Mustafa-1"
                },
                {
                    "user_id": "David Sørensen",
                    "user_href": "/profile/David-Sørensen-7"
                },
                {
                    "user_id": "Ali Sadek",
                    "user_href": "/profile/Ali-Sadek-6"
                },
                {
                    "user_id": "Stephen Kuhn",
                    "user_href": "/profile/Stephen-Kuhn-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Robert-TNJR"
                },
                {
                    "user_id": "Sultan Al-Issa",
                    "user_href": "/profile/Sultan-Al-Issa"
                }
            ]
        },
        {
            "author_info": {
                "name": "Otto Isaacs",
                "href": "/profile/Otto-Isaacs"
            },
            "answer_text": "The only name I can think of is that of Hermes Trismegistus “a name variously ascribed by Neoplatonists and others to an Egyptian priest or to the Egyptian god Thoth, to some extent identified with the Grecian Hermes: various mystical, religious, philosophical, astrological, and alchemical writings were ascribed to him.” ",
            "date": "Answered November 9, 2017",
            "views": "225",
            "upvotes": " Answer requested by Mohamed Elserngrawy"
        }
    ]
}