{
    "title": "Is there any meaning to our life and existence? - Quora",
    "tags": [
        "Meaning of Life",
        "Existence",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ekjot Singh",
                "href": "/profile/Ekjot-Singh-19"
            },
            "answer_text": "Hello. There are two ways to answer this Universal Question. First is Scientifically and Second includes everything else that science cannot explain. I am going with the former. Firstly I would like to answer “existence” question. Science says we exist just because of happenstance.Some organic matter (may be from asteroids and meteors) coalesce to form long chains and finally DNA like structures.It took millions of years to form first single cell organism and then to multi-cellular beings like us.Check my answer on the question “meaning of life”. Ekjot Singh's answer to If I am going to die, then why was I born? Hope you like the answer. ~ਏਕਜੋਤ ਸਿੰਘ ",
            "date": "Updated September 9, 2017",
            "views": "306",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richu Hameed",
                    "user_href": "/profile/Richu-Hameed"
                },
                {
                    "user_id": "Simran Jeet Singh",
                    "user_href": "/profile/Simran-Jeet-Singh-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harshpal Singh",
                "href": "/profile/Harshpal-Singh-23"
            },
            "answer_text": "Hello everyone Without one’s existance this universe could not have been perfect. As we are negligible when compared with infinite universe but observe a tree how big it is and just try to count the leaves -they are uncountable, but just think that how each leave counts in the growth of tree. That one leaf is also a part of that tree likewise we are also a part of this universe without you and me this universe is not in its fullest. ",
            "date": "Answered September 1, 2017",
            "views": "29",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Prakriti Pathak",
                    "user_href": "/profile/Prakriti-Pathak"
                }
            ]
        }
    ]
}