{
    "title": "Is trusting research an appeal to authority fallacy? - Quora",
    "tags": [
        "Appeal to Authority",
        "Logical Fallacies",
        "Logic (philosophy)"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Mckee Nowell",
                "href": "/profile/William-Mckee-Nowell"
            },
            "answer_text": "This is not as easy a question as it may seem, but the short answer is “\"no.” A fallacious appeal to authority has no means of independent verification. One believes something simply because an authority says it is true. Good research (methodologically sound, rigorously conducted), in both hard and soft sciences, produces something that can be replicated. It doesn't matter who conducts the research, a recognized authority or your grandmother’s cat, if you can follow in his/her footsteps, you can confirm (or disprove) the results. My self-reflexive critique of this is, “how do we know that a piece of reseach is good if we don't know the field? In such cases, don't we still, ultimately, have to rely upon authority?” That sounds compelling, and we might have to rely on authority of a sort, but the key is still replicability. I do not understand nuclear physics. If someone makes a claim, and shows me the research, I probably won't understand it. I certainly wouldn't have the facilities or knowledge to replicate the study myself. But I don't have to. It must be replicable, but I don't personally have to do it. The strongest use of research requires that one consider how specialists in the field view the research in question. If the research is published in a respected peer-reviewed nuclear physics journal, I can act with with confidence that the results represent a high level of accuracy, the state of art in that field. But be cautious because excellent research is only as good as the representation in your own work. The greatest risk with academic research is that one either intentionally, or through ignorance, misrepresents the results. To sum up, feel free to use research published in respected peer reviewed journals without risk of a fallacious appeal to authority; but be careful not to commit other fallacies when interpreting and representing the results. ",
            "date": "Answered February 22, 2017",
            "views": "290",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Luke Andris",
                    "user_href": "/profile/Luke-Andris"
                },
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                },
                {
                    "user_id": "Steve Roberts",
                    "user_href": "/profile/Steve-Roberts-83"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Jermey",
                "href": "/profile/Jon-Jermey"
            },
            "answer_text": "Most of the things we believe are told to us by other people; and since other people are generally trustworthy, that usually works perfectly well. The point at which trusting others becomes irrational is the point at which we have evidence from our own observation and experience that what we are being told may not be true. Science works partly by giving kudos to people who prove previous scientists to be wrong. An important scientific result that doesn’t tally with real-world experience is like an infected spot in the body: it attracts a great deal of attention, and many people will spend a lot of time and money trying to establish whether it is in fact wrong, and if so how and why. So ‘research’ is constantly checking itself in those situations where it’s not tallying with real experience. That doesn’t mean that any scientific result is going to be correct or trustworthy. On the contrary, my estimate is that at least 50% of reported results will turn out over time to be inaccurate, based on incorrect assumptions, or just plain false. But it does mean that if you generally trust science, you will know that a large number of trained and highly skilled professionals are working hard to cover your ass. If you trust religion, you’re on your own. ",
            "date": "Answered February 22, 2017",
            "views": "157",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pete Swanie",
                    "user_href": "/profile/Pete-Swanie"
                },
                {
                    "user_id": "Steve Jones",
                    "user_href": "/profile/Steve-Jones-235"
                }
            ]
        }
    ]
}