{
    "title": "Is there a question which has never been asked before? - Quora",
    "tags": [
        "Questions and Answers",
        "Asking Questions",
        "Existence Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joe Andros",
                "href": "/profile/Joe-Andros-1"
            },
            "answer_text": "Can you ask me a question that has never been asked before? Yes. I ask: “Why did you intend that I, Joe Andros, king of misanthropic optimism, bewitch you with another one of my stunning questions given that we all know humanity’s search for meaning and belonging is in large part quite vain?”Well, it is. If not always “vain” in the fruitless sense, it’s pretty arrogantly self-centering. To think we command or determine or descry (true) meaning? To think we are so important that the fit of reality must adjust to our presence, such that we belong? I call that quite vain. At least a little. Vain on the sly, perhaps. We all do it, arguably. DON’T JUDGEI didn’t say it would be a good question. I would say in some senses, it is “any good.” It isn’t a no good question, but when you sound the call for novelty, you shouldn’t expect any good to come of it. Novelty is not a virtue. Novelty is just some really particular crap the world has thus far seen fit to have left as yet undone, and for the most part: wisely. Disclaimer: there is no sense in which I am “king of misanthropic optimism.” Unless one can attain to such lofty station while being oneself neither misanthropic nor optimistic. Pretty knotty, if so. Yet as we have seen on Quora, some questions may contain deceptive elements - and these elements do not disqualify them as questions! Their validity as questions inheres, and it incumbs upon the answerer to point out any little points of invalidity or falsity, should they wish. If they think it’s pertinent to the best answer they’ve got to give. Hey that was fun! Thanks for the question! Yarinail Zaki, cool name! Exclamation mark. ",
            "date": "Answered September 29, 2020",
            "views": "24",
            "upvotes": " Answer requested by Yarinail Zaki",
            "upvoters": [
                {
                    "user_id": "John Caporaso",
                    "user_href": "/profile/John-Caporaso-1"
                },
                {
                    "user_id": "Stephen Sibbald",
                    "user_href": "/profile/Stephen-Sibbald-1"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Kevin A Chong",
                    "user_href": "/profile/Kevin-A-Chong"
                },
                {
                    "user_id": "Rafael Maia",
                    "user_href": "/profile/Rafael-Maia-15"
                },
                {
                    "user_id": "David Deitsch",
                    "user_href": "/profile/David-Deitsch"
                },
                {
                    "user_id": "Jarrod Jeffrey Ingram",
                    "user_href": "/profile/Jarrod-Jeffrey-Ingram"
                },
                {
                    "user_id": "David Devalera",
                    "user_href": "/profile/David-Devalera"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Moore",
                "href": "/profile/David-Moore-408"
            },
            "answer_text": "Sure, but in doing so I want to make a serious point. Many original questions are merely trivial. The nature of time is such that ‘what time is it now’ is always an original question, because the present it refers to is always novel. Questions which remain relevant despite the passage of time are likely those which pertain to things that really matter. What is love? Such a question is an eternal enterprise. Hence, I could ask you ‘what is the temperature of David Moore’s Chai Latte this morning?’ No-one has ever asked that - because no-one cares. Things that a lot of people care about will be the subjects of questions that keep being asked.  ",
            "date": "Answered October 24, 2020",
            "views": "116",
            "upvotes": " View 8 Upvoters "
        }
    ]
}