{
    "title": "Is there any evidence that the brain causes consciousness and conscious states and does not just correlate with them? - Quora",
    "tags": [
        "Consciousness",
        "Human Brain",
        "Neuroscience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Denethorn",
                "href": "/profile/Alex-Denethorn"
            },
            "answer_text": "Traumatic Brain Injury is what you’re looking for: though scans suggest that brain activity correlates to consciousness, a causal link is more evidenced by dysfunction rather than neurotypical function. When damaged, the brain presents significant changes to consciousness: If the brain is damaged to a severe extent, consciousness can be lost altogether, or at least pushed into a dormant state (coma, vegetative state etc).Moderate to severe damage causes severe cognitive impairment, in the form of memory loss, lack of concentration, sensory inhibition, irritability, aggressive tendencies, and so on.Since consciousness tends to be defined by an individual’s thoughts, attitude and behaviour, the fact that these can be so dramatically altered by changes to the brain indicate that there is more than a casual correlation between the two. TBI: Severe Traumatic Brain Injury Symptoms You’ll also note the same when using psychotropic drugs: perception, sensory input, thought patterns and behaviour are altered as a consequence of neurochemical changes in the brain, brought on by the drugs/medications. This is part of how mental illness (disorders of the brain that result in negatively-impactful disturbances to one’s conscious mind) are treated: recognising that behavioural changes and psychological outlook are caused by neural activity in the brain means that use of psychiatric medications (such as anti-depressants or anti-psychotics) can result in a return to neurotypical brain activity, and therefore to psychologically neutral behaviour. All would indicate a direct causal link between the brain and one’s consciousness. This isn’t, however, necessarily conclusive that there isn’t an aspect of consciousness independent of the body (e.g. religion’s ‘soul’) - this could technically be possible (though lacking any evidence that would lead to such a conclusion), but you could argue that the brain is the soul-to-body interface (much like a computer keyboard, interfacing between user input and the computer hardware), and damage to the interface (keys missing!) would result in issues with how the hardware interprets input (can’t type in fully-coherent sentences if letters are missing!). That said, there’s no evidence pointing that way, so that’s where we step beyond scientific evidence towards personal unsubstantiated belief. ",
            "date": "Answered July 10, 2017",
            "views": "438",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Crystal Gillis",
                    "user_href": "/profile/Crystal-Gillis"
                },
                {
                    "user_id": "David Eugene Wilson",
                    "user_href": "/profile/David-Eugene-Wilson-1"
                },
                {
                    "user_id": "Tim Moss",
                    "user_href": "/profile/Tim-Moss-8"
                },
                {
                    "user_id": "Peter Tatford",
                    "user_href": "/profile/Peter-Tatford"
                },
                {
                    "user_id": "Pavle Gartner",
                    "user_href": "/profile/Pavle-Gartner"
                },
                {
                    "user_id": "Laslo Kovacs",
                    "user_href": "/profile/Laslo-Kovacs-2"
                },
                {
                    "user_id": "Harry Haller",
                    "user_href": "/profile/Harry-Haller-10"
                },
                {
                    "user_id": "Matthijn Dijkstra",
                    "user_href": "/profile/Matthijn-Dijkstra"
                },
                {
                    "user_id": "Alon Kaplan",
                    "user_href": "/profile/Alon-Kaplan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michelle de Kwiatkowski",
                "href": "/profile/Michelle-de-Kwiatkowski"
            },
            "answer_text": "Is there any evidence that God exist ? God and consciousness are the same thing. God is consciousness and consciousness is God. We experience consciousness because we are consciousness. Everything is formed from consciousness. It is an impossibility that anything can exist outside of consciousness. When the brain goes unconscious, it is experiencing a different level of awareness. Everything is conscious but everything is experiencing different levels and scopes of awarenesses (or of God). The brain does not make consciousness. Consciousness makes the brain. Think of the brain as a computer and wifi as conscious states of awareness. The computer taps into wifi, it does not make wifi. ",
            "date": "Answered July 12, 2017",
            "views": "181",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Manoj Kumar",
                    "user_href": "/profile/Manoj-Kumar-3860"
                }
            ]
        }
    ]
}