{
    "title": "Is there a generally accepted view among scientists concerning the actual possibility of developing a complete understanding of the laws of physics? - Quora",
    "tags": [
        "Laws of Physics",
        "Scientists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alec Cawley",
                "href": "/profile/Alec-Cawley"
            },
            "answer_text": "I don’t think there is a generally accepted view. Because nobody would know how to prove or disprove such a view. The only way we will ever know that there is an “end” to physics is when we find it. Until then, round every unexplored corner there may be a whole world of new physics. Scientists tend not to think much about unanswerable questions - they leave that to philosophers. My personal view is that there is no findable end to physics. We may reach an end to the research we can do because the cost rises to high (in a deep sort of way - equipment larger than the visible universe required, timescales longer than the lifetime of our civilization). So there will always be unanswered questions. ",
            "date": "Answered November 23, 2017",
            "views": "167",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Li",
                    "user_href": "/profile/Jason-Li-181"
                },
                {
                    "user_id": "Robert Reiland",
                    "user_href": "/profile/Robert-Reiland"
                }
            ]
        },
        {
            "author_info": {
                "name": "Petr Frish",
                "href": "/profile/Petr-Frish-1"
            },
            "answer_text": "NO and NO. Are you talking about understanding of currently known laws, or about future of physics? In general - a ‘complete understanding’ of the real world is impossible. The future scientists will be writing theses and papers and our understanding will expand - but expansion will not stop - as long as people are here ",
            "date": "Answered November 23, 2017",
            "views": "41",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Larry Isaacs",
                    "user_href": "/profile/Larry-Isaacs-1"
                }
            ]
        }
    ]
}