{
    "title": "Is there a higher consciousness? - Quora",
    "tags": [
        "Hard Problem of Consciousness",
        "Philosophy of Mind",
        "Cognitive Science",
        "Consciousness",
        "The Mind",
        "Existence Question",
        "Philosophy",
        "Hinduism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alan Gordon",
                "href": "/profile/Alan-Gordon-48"
            },
            "answer_text": "Everyone talks about higher consciousness as if it is part of another dimension. Higher Consciousness is very real - and yes there is a higher consciousness. As I explain in this Podcast, we are polar in our nature. We have two poles - the first is to protect our own safety and interests, and the opposite pole is to protect and help others. This polarity is designed into our nature. On one side we have Self-Interest (Donald Trump pops into my head for some reason…) And on the other side we have Compassion. (Jesus, the Buddha, Ghandi - they pop into my head). Most people have no Consciousness - they are not aware of their thoughts. They are living on auto-pilot and unconscious habit. Most people are drifting - some people you meet are very nice, others are not very nice. Lower consciousness means to fill your Mind with thoughts of selfishness. Higher consciousness means to fill your Mind with thoughts of Compassion. This is the message of every true wise man that has ever lived - serve others above yourself, and your life will be filled with blessings beyond your imagination. When we think of Compassion we immediately come to another higher truth that we are all connected, we are all one. That is the definition of higher consciousness - intentionally pointing your Mind to higher thoughts. And the definition of lower consciousness - intentionally pointing your Mind toward Greed, Hate and Cruelty. ~ The Cycle of Mind ",
            "date": "Answered November 5, 2019",
            "views": "279",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shree Krishna",
                    "user_href": "/profile/Shree-Krishna-59"
                }
            ]
        },
        {
            "author_info": {
                "name": "Glyn Williams",
                "href": "/profile/Glyn-Williams"
            },
            "answer_text": "No. No there is not. Consciousness is defined in lots of different ways. But one way is to describe it as the awareness we all have, but perceived from the first person point of view. If we look at human awareness it’s pretty impressive. We can look at things and understand them on a deepish level. A physicist can look at a rainbow, and see not only colours, but understand why those colours are being created. Whereas a mouse might have far less awareness of their surroundings. But plenty enough understanding do perform the job of being a perfectly good mouse. But when people talk of higher consciousness, they are attemting to sell supernatual nonsense. They will talk about an awareness of spirits and souls and chakras and lay lines and auras and whatever other mythology that they indulge in. These are fictions. They have no demonstrable evidence. No actual utility. Other than a placebo type effect. People claiming higher levels of consciousness cannot do magical things. They have no magical insights. And frequently are using magicians tricks to pretend to be something they are not. ",
            "date": "Answered June 28, 2017",
            "views": "14",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gabriel Otilio Vega Maldonado",
                    "user_href": "/profile/Gabriel-Otilio-Vega-Maldonado"
                },
                {
                    "user_id": "Mark Werner",
                    "user_href": "/profile/Mark-Werner-4"
                },
                {
                    "user_id": "George Harrison",
                    "user_href": "/profile/George-Harrison-45"
                },
                {
                    "user_id": "Donald Ciriacks",
                    "user_href": "/profile/Donald-Ciriacks-2"
                },
                {
                    "user_id": "Anupam Nayak",
                    "user_href": "/profile/Anupam-Nayak-12"
                },
                {
                    "user_id": "Anoorag Nayak",
                    "user_href": "/profile/Anoorag-Nayak"
                },
                {
                    "user_id": "Anand Reddy",
                    "user_href": "/profile/Anand-Reddy-11"
                },
                {
                    "user_id": "Rohit Sinha",
                    "user_href": "/profile/Rohit-Sinha-61"
                },
                {
                    "user_id": "Barry Hampe",
                    "user_href": "/profile/Barry-Hampe"
                },
                {
                    "user_id": "Pete Ashly",
                    "user_href": "/profile/Pete-Ashly"
                }
            ]
        }
    ]
}