{
    "title": "Is the point of proofs just forcing the statement to be true? - Quora",
    "tags": [
        "Proofs (mathematics)",
        "Mathematics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Eustis",
                "href": "/profile/Alex-Eustis"
            },
            "answer_text": "No no no. The truth or falsity of a statement has nothing to do with “forcing.” That word implies some measure of control, but if you think that anyone has any control over which statements are true or false, then you're ascribing godlike powers to that individual. When I was a child and first heard about the the Four color theorem - Wikipedia, I didn't believe it. I spent hours and hours trying to draw a map that couldn't be colored with four colors. I would draw a map that definitely required four colors, then attempt to “force” it to require five colors by drawing snaky peninsulas between countries with the same color. A couple times, I got really excited, thinking I had done it. But then on closer inspection I'd realize I hadn't. One of two things would always happen: A: it would turn out that in my original map, the two same-colored countries didn't have to be the same color. There was an alternative coloring in which they weren't. B: It wasn't possible to draw a snaky peninsula, because one of the countries was totally surrounded by other countries. I could fiddle with the map and make it un-surrounded, but that would disconnect other pairs of countries and make the map 4-colorable in some other way. Eventually my dad saw what I was trying to do. He was impressed, but also not surprised that I hadn't succeeded. I asked him, “Dad, wouldn't it be cool if I found a map that needed five colors?” I will never forget his answer. He said: “Alex, it would be the greatest discovery of all time. You would have proved that logic doesn't work, and Mathematics as a whole is invalid.” Greatest discovery of all time? Logic doesn't work? At the time, I didn't fully understand what he meant. I thought he was just being Dad — kind of overly dramatic sometimes. But now, I understand that it was not an exaggeration. He said that because the Four-color theorem has a proof. That was the part I didn't understand at the time — or perhaps not the implications of what that meant — but he did. If a statement has a proof, it means no one will ever find a counterexample. Not ever. Not me, not you, not the greatest genius who ever lived, not the hyperintelligent aliens from the Andromeda Galaxy. No one will find it, because we can prove that it doesn't exist. (And so can they). You might as well be looking for a whole number n such that [math]n+n=3[/math]. No, not 1.5, because I said whole number. We explicitly stated that in the rules. Just like in the Four-color color theorem, we explicitly state that the map must be drawn on a flat sheet of paper, rather than one wrapped into a cylinder or sphere or other shape. (In those cases, the minimum number of colors may well be greater than 4.) Did we “force” every plane map to be 4-colorable? Of course not. We had nothing to do with it. Our preferences had nothing to do with it. The amount of effort we put into searching had nothing to do with it. It simply is. As a matter of fact, the proof of the four color theorem relies on (roughly speaking) reducing the problem to a finite number of maps, and then running a computer search to check those. Because we trust the logic that reduces the problem to a finite one, and we also trust our ability to program a computer to check those cases, and because every computer search reliably says that none of those cases work, we can therefore conclude that every map is 4-colorable. Now and forever. So, as I hope this example demonstrates, proof is not at all about forcing something to be true. Rather, it is about understanding why something is true. You can understand why the sky is blue (during most of the day), but you can't force it to be a different color. You can understand why water has a higher melting point than helium, but you cannot force water to have a different melting point than it has. The very idea is nonsense — just as it's nonsense to imagine that when your math teacher proves some theorem, she's actually bending the laws of Mathematics to her will — or that another, “more powerful” teacher could bend them differently. So, why is it that we can put so much stock in Mathematical proof? Well, that's another question entirely which would require a book-length answer. But the basic reason is, it's significantly easier (in almost all cases) to read and check a mathematical proof than it is to come up with the proof in the first place. That's what the peer review process is all about. In the end, it doesn't matter who came up with the proof or how; the proof itself is its own certificate of authority. If enough expert mathematicians (that is, people with a demonstrated ability to read and write proofs) all agree that the proof is correct, then the chance they're all wrong becomes vanishingly smaller and smaller. This is especially true for famous theorems that are reviewed by lots of mathematicians, all of whom stand to win instant fame and recognition if they can find even the smallest gap in said proof. If you imagine a scale of statements that we're “unlikely to be wrong about” (which would have to be a logarithmic scale), every mathematical theorem is very near the top. Furthermore, if the theorem has been around for awhile and is part of the undergrad math curriculum (which is when students first become truly capable of verifying proofs for themselves), then it gets a “certainty score” that might as well be infinity. Famous theorems like the four-color theorem, that are capable of being verified by a typical grad student, are not far behind. Some of the more obscure theorems in lesser known journals could have errors that slip through the cracks, however — individual mathematicians and reviewers are not infallible. But over time, it's likely that even these few errors will be discovered and corrected (especially pending any advances in computer-assisted proof checking). ",
            "date": "Answered October 22, 2018",
            "views": "12",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Francis Miniati",
                    "user_href": "/profile/Francis-Miniati"
                },
                {
                    "user_id": "Ale Ballester",
                    "user_href": "/profile/Ale-Ballester"
                },
                {
                    "user_id": "Carlos Zepeda Rosas",
                    "user_href": "/profile/Carlos-Zepeda-Rosas"
                },
                {
                    "user_id": "Ano Nym",
                    "user_href": "/profile/Ano-Nym-35"
                },
                {
                    "user_id": "Wes Whiting",
                    "user_href": "/profile/Wes-Whiting"
                },
                {
                    "user_id": "Sebastiano Argenti",
                    "user_href": "/profile/Sebastiano-Argenti"
                },
                {
                    "user_id": "Alexander Farrugia",
                    "user_href": "/profile/Alexander-Farrugia"
                },
                {
                    "user_id": "Kabir Belgikar",
                    "user_href": "/profile/Kabir-Belgikar"
                },
                {
                    "user_id": "Nazım Kemal Üre",
                    "user_href": "/profile/Nazım-Kemal-Üre"
                },
                {
                    "user_id": "David Brown",
                    "user_href": "/profile/David-Brown-1015"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Farrugia",
                "href": "/profile/Alexander-Farrugia"
            },
            "answer_text": "No. The point of a proof is to make a valid argument that demonstrates that the statement in question is true. If a statement is true, then your valid argument is simply uncovering this fact. The statement was true even before you proved it; we just didn’t know it yet. For example, before Fermat’s Last Theorem was proven true, it was already true; we just didn’t know that it was true. In fact, the statement was always true; it was true even before Fermat was born, and even before any rational being roamed the universe. The same thing holds for false statements, of course. They were always false; they didn’t commence ‘being false’ as soon as someone demonstrated this fact by a valid proof. ",
            "date": "Answered October 25, 2018",
            "views": "581",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sebastiano Argenti",
                    "user_href": "/profile/Sebastiano-Argenti"
                },
                {
                    "user_id": "Samuel Teague",
                    "user_href": "/profile/Samuel-Teague-6"
                },
                {
                    "user_id": "Tyler McMann",
                    "user_href": "/profile/Tyler-McMann"
                },
                {
                    "user_id": "Muhannad Ayoubi",
                    "user_href": "/profile/Muhannad-Ayoubi"
                },
                {
                    "user_id": "Abhiram",
                    "user_href": "/profile/Abhiram-77"
                },
                {
                    "user_id": "Alex Levine",
                    "user_href": "/profile/Alex-Levine-8"
                },
                {
                    "user_id": "Travis Brauer",
                    "user_href": "/profile/Travis-Brauer"
                },
                {
                    "user_id": "Roger Hood",
                    "user_href": "/profile/Roger-Hood-1"
                },
                {
                    "user_id": "Mariano Zomeño",
                    "user_href": "/profile/Mariano-Zomeño"
                },
                {
                    "user_id": "Anupam Nayak",
                    "user_href": "/profile/Anupam-Nayak-12"
                }
            ]
        }
    ]
}