{
    "title": "Is there a book to explain the Tao Te Ching in a manner that I can understand? - Quora",
    "tags": [
        "Dao De Jing (道德經)",
        "Tao (Chinese philosophy)"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Tuffley",
                "href": "/profile/David-Tuffley-1"
            },
            "answer_text": "Tao Te Ching: Lao Tzu's Timeless Classic for Today. A plain English rendering of this ancient classic. The Tao Te Ching, or Book of the Tao, is a how-to guide for creating harmony in your life. It describes a force called the Tao that operates uniformly throughout the universe and is the causal agent of everything that happens. The Tao can be understood as being analogous to the laws of Nature, or Physics. The Tao Te Ching has the distinction of being perhaps the oldest book in the world that is still in print, having been written around 2,500 years ago. Today, there are more editions of the Tao Te Ching than ever. There is something about this book that makes it a perennial favourite. Its longevity comes from the fundamental truth and simplicity of its message. It illustrates the truth of the old saying that the greater the truth, the more simply it can be stated. The Tao Te Ching has always had the power to transform the reader, but the reader must first be able to understand the underlying message. Phrased, as it was, by its ancient Chinese author, the language and imagery were products of that far off time and place. Not easy for people in the modern world to understand. This edition presents this timeless message in plain English for all to understand. The author of this edition has spent over 20 years getting to the essential, underlying, timeless message of the Tao Te Ching. He presents it here for a generation of new readers and for those already familiar with it from earlier editions. YOU DO NOT HAVE A LIFE, YOU ARE LIFEThe trillions of life-forms on this planet -- animal and plant -- are all expressions of the same life-force. This life-force lives through each life-form. We are possessed by the life-force, rather being the possessor of the life-force, which is an expression of the Tao. We are all subject equally to the laws of Nature that govern Life -- we are born, gather strength, reach a peak, go into decline and then die. There are no exceptions, only variations in outer form and duration of lifecycle. The same can be said of the weather, politics, relationships and everything else in the observable world. These laws of Nature -- the Tao -- are also expressed on a higher level in our minds and in the patterns of our social behaviour. enlightened people gain influence by learning to live in harmony with these underlying laws of Nature. That way, they can predict future trends and take early action, placing them in the right place at the right time. ACCEPTING THE INEVITABILITY OF CHANGEWhen you come to know the Tao, you understand that everything in the universe is in a state of flux. The emotional and intellectual structures that you build for your comfort and security will be subject to change by external forces that are largely beyond our control. The challenge is to accept the inevitability of change. We should not waste our energies propping up what one day must surely fall, defending them against criticisms, and convincing others to believe so that they are recognised as permanent truth. Grasping the reality of the impermanence allows us to align ourselves with the forces of Nature that bring about incremental progress in the social and physical world. We learn to embrace change whenever it occurs. BECOMING A FORCE OF NATUREOur alignment with the forces in Nature makes us a part of those forces, gives us the momentum of those larger forces. Our perceptions become more finely tuned because they are now based on evolving reality, not upon orthodox thinking that may be out-of-date. We see the world as it is, not as we believe it should be. Finding and following the Middle Path is how to create peace and tranquility in your life. A person whose life is chaotic, lurching from one disaster to the next, is unable do much more than merely survive. Tao Te Ching: Lao Tzu's Timeless Classic for Today. ",
            "date": "Answered May 9, 2018",
            "views": "14",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Damon Bennett",
                    "user_href": "/profile/Damon-Bennett-20"
                },
                {
                    "user_id": "Morrison Goodwin",
                    "user_href": "/profile/Morrison-Goodwin"
                },
                {
                    "user_id": "Roger Smith",
                    "user_href": "/profile/Roger-Smith-632"
                },
                {
                    "user_id": "Namma Huduga",
                    "user_href": "/profile/Namma-Huduga"
                },
                {
                    "user_id": "Shyam Kumar",
                    "user_href": "/profile/Shyam-Kumar-908"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tiger Soune",
                "href": "/profile/Tiger-Soune"
            },
            "answer_text": "Is there a book to explain the Tao Te Ching in a manner that I can understand? I think the following one may be the one you are looking for : Tao Te Ching: The New English Version That Makes Good Sense: Yuhui Liang: 9781727252248: This book stands out of the crowd because the author lets TTC be understandable to readers. And this is in line with Lao Tzu’s saying “my teaching is easy to understand and easy to practice” (chapter 70). As what I’ve learned from his book, there are three close related aspects about what the Tao Te Ching expresses: The words that it used.The imageries that it used.The philosophy that it based on.Therefore, in order to obtain an accurate translation/interpretation of TTC, a translator needs to know the meaning of each of the important Chinese characters used in TTC, needs to know why a specific imagery used in the sentence, and needs to understand Lao Tzu’s philosophy very well. Unfortunately, most of the translators may not have all these abilities, what they did usually is just using others’ translations to come up their own versions. Although every translation has its own value, but in such a way the translation may be far from accuracy. And without accuracy, the translation/interpretation will be confusing to readers. And as an expert in the subject, Mr. Liang has made significant research progress in the above mentioned aspects: by having reexamined the most important Chinese characters (Tao,Te,Ming, etc.) used in Lao Tzu's book by analyzing their oldest written forms and figured out their true meanings in the context of the Tao Te Ching; by having discovered that Lao Tzu had used an ancient nine-type system (the ancient Chinese version of the Enneagram) to form a system of eighty one pairs of symbols and drawn creative inspiration for the Tao Te Ching from them, thus he know why a specific imagery was used in the sentence; and by having successfully revealed the relationship between Non-Being and Being, as well as their dynamic structures, thus he can understand Lao Tzu’s philosophy systematically. And based on these research breakthroughs, he has successfully corrected all the centuries-old misinterpretations of Lao Tzu's book and translated the Tao Te Ching into English by himself. Thus he has a pretty reliable way to be true to Lao Tzu's original intent and is able to introduce Lao Tzu's teaching in form of a system of philosophy in a way that it’s quite comprehensible. And after comparing his translation/interpretation with many others (I’ve read more than thirty of them), I believe his explanation is the most accurate and comprehensible one. Therefore, this is the book to explain the Tao Te Ching that we cannot afford to ignore. ",
            "date": "Answered January 19, 2019",
            "views": "355",
            "upvotes": "0"
        }
    ]
}