{
    "title": "Is your reality my reality? - Quora",
    "tags": [
        "Philosophy of Language",
        "Relativism",
        "Realism",
        "Epistemology",
        "Reality",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Latta",
                "href": "/profile/Robert-Latta-5"
            },
            "answer_text": "I will get to your question, but here is the one I have answered in draft: Doesn’t your opinions define your reality? The grammatical subject, “opinions,” is plural, and hence the auxiliary verb, “do,” must be plural, too: Don’t your opinions define your reality? No, they do not, for the following reason: There is no such thing as my reality or yours, There is only reality, period, and any opinion that diverges from it is simply a mistake, misperception, or false belief, nothing more and nothing less. It is nothing so grand as a second reality, or an element of a second reality. To adduce a case in point: The correct English is “Don’t your opinions …, “ not “Doesn’t your opinions …” The former represents reality, but the latter does not represent your private reality. Rather, it is simply a mistake. So it is with reality in general. A mistaken opinion represents a failure to come to grips with reality, the one unique reality, not a second, subjective reality. Here is the conceptual price you pay for denying this: If it is not so, if there is no one unique reality, if your opinions define a second, subjective reality, then there is simply no such thing as reality at all, no stable standard against which to judge the truth or falsity of an opinion. Do you want to take that position, that there is no such thing as reality, and pay that price? That way lies chaos and nightmare. Not to mention monumental error, for it is simply not so. And that, by the way, that there is no such thing as the one unique reality, is the position the Italian and German fascists took early in the twentieth century, and that certain members of the US government and their supporters take now, insofar as they think about such things. Hold on to the one unique reality! Without it, you have nothing. You asked this: Is your reality my reality? Yes, in a manner of speaking, since there is only one reality. But it is best to speak simply of reality, not of yours or mine. On the other hand, you can, of course, speak of your perception of reality and mine, and so on. ",
            "date": "Answered September 21, 2018",
            "views": "376",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kathy Jenkins",
                    "user_href": "/profile/Kathy-Jenkins-72"
                },
                {
                    "user_id": "Tom More",
                    "user_href": "/profile/Tom-More-2"
                },
                {
                    "user_id": "Paul Barends",
                    "user_href": "/profile/Paul-Barends"
                },
                {
                    "user_id": "Helen Von Schrottky",
                    "user_href": "/profile/Helen-Von-Schrottky"
                },
                {
                    "user_id": "Jim Lloyd",
                    "user_href": "/profile/Jim-Lloyd"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anna Emdenborg",
                "href": "/profile/Anna-Emdenborg"
            },
            "answer_text": "If your reality - that you might or can share with others that can be in the same realm would not be perceived in a subjective and particular way by your self - then you would not have it. I guess you do. If now you do not have that notion of being in that particular way of interpreting and being in the reality in which you are right not - you probably suffer from some sort of psychological delusion. All humans have their own particular and very private reality - that even when we share the space we are in with other humans we will not share this inner private “space” and the way we interpret and undertand and receive the happenings and space that surrounds us. That is why humans communicate and tell other about how they - in their particular way - see moments and issues and happenings. To not have the capability of understanding this - that is primordial and all small children know the moment when they detach from their mother - is a flaw in the psychological mindset in a person. That is because we are strictly self aware that we have the capability of entering in relationships with others - at all. Others that may occupy the same space and time as we do - but that do not feel, perceive or view things the way we do. You must have that notion of being your own person - to be capable of entering in relationship with other beings. Even God. If and when you do not have that - there is a serious flaw in the “system”. ",
            "date": "Answered April 18, 2018",
            "views": "222",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rod Vessels",
                    "user_href": "/profile/Rod-Vessels"
                }
            ]
        }
    ]
}