{
    "title": "Is your concept of yourself compatible with how the philosophers conceived the self? - Quora",
    "tags": [
        "Philosophers",
        "Concepts",
        "Identities",
        "Self-Awareness",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "J. Austin Tomlinson",
                "href": "/profile/J-Austin-Tomlinson"
            },
            "answer_text": "Kind of. You will find a spiritual vein throughout history of adept realizers. This traditional lineage in no way begins or ends with Jesus, however he is the prime representation of what I am talking about. The Self is situated in eternity, consciousness, and bliss. This much is true. The difference is, I know how unique I am. I am not just a replica of universal awareness, but I am a reincarnation from a past life. I am awake today, having lived for many aeons prior to this life. The before life I believe is so important because we have existed forever, shouldn't we know about this? Not everyone has. They claim only a Supersoul, Paramatma can know if he or she has truly existed forever. It has nothing to do with humankind, or ego. It is a spiritual identity that cannot be shaken or altered it is a sovereignty of mind, a fourth state of consciousness talked about by the ancient rishis. This self is ancient and eternal, it is infamous and hidden veiled by it's own light to itself. Philosophers in the past conceived this as the stone of immortality, the philosophers stone, the holy grail, the fountain of youth. In reality it is a person, a consciousness of self. Even the ancients knew this. ",
            "date": "Answered September 8, 2020",
            "views": "161",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Meaghan-Markle-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jef Nichols",
                "href": "/profile/Jef-Nichols"
            },
            "answer_text": "How the philosophers conceived of the self is not compatible with how the philosophers conceived of the self. Each major philosopher has a different conception of the self. Philosophy is not a coherent body of knowledge, the way sciences are. It is rather, a body of wildly divergent attempts to tackle a group of related intellectual problems. But to answer your question, my concept of the self is currently in transition. What I’m leaning towards is that the self is largely a fiction that the conscious mind creates to integrate the events of ones life. But I still need a lot of work to feel good about it. ",
            "date": "Answered September 8, 2020",
            "views": "94",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Meaghan-Markle-1"
                }
            ]
        }
    ]
}