{
    "title": "Isn't time just illusionistic and relative? - Quora",
    "tags": [
        "Philosophy of Physics",
        "Time (physical quantity)",
        "General Relativity",
        "Special Relativity",
        "Time (physics)",
        "Relativity (physics)",
        "Physics of Everyday Life",
        "Philosophy",
        "Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Owen Godfrey",
                "href": "/profile/Owen-Godfrey"
            },
            "answer_text": "“Isn't time just illusionistic and relative?” Illusionistic implicitly means that at the hands of an artist the artwork is made to resemble the reality, usually a 2d representation of something 3d. To answer that question as regards the intention of the creation of time, you’d have to find and ask the artist. The true illusion of time is that it is separate from space and only exists in the moment. Relativity has shown us that “now”, separating future and past, is determined by the frame of reference of the observer, so every point in four dimensional spacetime can equally be a part of any frame’s “now”. As I write this there’s lots of little “however”s occurring to me. Some things in spacetime can never be simultaneous to each other. We can calculate a spacetime interval value that will hold constant in all frames of reference, and if it is positive we call the relationship “time-like” and if it is negative we call it “space-like”. A space-like relationship means that two events can be simultaneous and will usually have some three dimensional offset. A time-like relationship means that the the two points will in all cases be future and past with respect to each other, regardless of distance apart, and may share a causal relationship. An interval of zero would mean that they are separated in time and space by the speed of light. For instance, if we send a signal to a planet three light years away and that signal is received there three years later, those events have a zero spacetime interval value. Sorry that was so opaque, but in four dimensional spacetime, the spacetime interval is the only thing we can use to clearly define future and past. Anything with a positive value definitely has a temporal component, either past or future, anything with a negative value definitely has a spacial component, but temporally can be either pass or future depending on the frame of reference. ",
            "date": "Answered May 1, 2019",
            "views": "24",
            "upvotes": " Answer requested by Jace Kim",
            "upvoters": [
                {
                    "user_id": "Zane Scheepers",
                    "user_href": "/profile/Zane-Scheepers-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Victor Record",
                "href": "/profile/Victor-Record"
            },
            "answer_text": "Allow me to make a prediction. In a few decades the physics will introduce the speed of time - instead of time dilation or time contraction - which are confusing terms. They result from the fact that we put the carriage in front of the horses. We correct the observation to be according to the theory instead of correcting the theory to be according to the observation. For instance: We consider in theory that we need to have a constant, invariant universal speed of light which is the same in all the Universe regardless of the reference frame. For that, we have to correct our clocks because “they are wrong.” If we do not correct they will measure different speeds of light. Nice! Isn’t it? But in the future, we will consider what the clocks will show: different speeds of time. Why the speed of time? Because it is a also confusion to explain that in a space ship which flies with a very high speed ( near the speed of light) everything moves slower than on Earth. It is easier to say that the speed of time in that spacecraft is slower than on Earth. But the Earth is just another system, not the absolute one. There are other systems in which the speed of time is faster than on Earth. If we look from the Earth to the spaceship we see the crew moving slower than we on Terra. But if we look to another system with a faster speed of time than ours we see those habitants moving faster than we do. (The afterlife might have a different speed of time, too. ) Why the speed of time? Because we will work with that speed in physics and we will represent it like a vector. So, if we will work with a speed of time as any other speed, we might say that the time is as real as the notion of speed is….. ",
            "date": "Updated May 13, 2019",
            "views": "85",
            "upvotes": " View 1 Upvoter "
        }
    ]
}