{
    "title": "Kant's Critique of Pure Reason seems to be one of the most important works of modern philosophy. Why? Do philosophers still read it? Is there universal agreement on its meaning? Can people not trained in philosophy understand it? - Quora",
    "tags": [
        "Immanuel Kant (philosopher, author)",
        "Philosophers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ian Heckman",
                "href": "/profile/Ian-Heckman"
            },
            "answer_text": "It is the most important work of modern philosophy. But it is not for the faint-hearted. It is a massive text with the most recent translation totaling over 700 pages. But it doesn’t read like any regular old 700 page volume of philosophy. It reads like 700 pages of the most dense and difficult writing you could ever encounter. But it’s not written like this because Kant was a bad writer. Kant wrote perfectly sensibly elsewhere. But it was written like this because of how pioneering and ambitious the work was and still is. The Critique of Pure Reason isn’t 700 pages of nonsense. It’s 700 pages of golden insight which leads you ultimately to unraveling and re-raveling our basic understandings of the world. It challenges you. It pushes you like no other work of philosophy I know of. Kant had a tremendous mind who really knew how to explore and scour the depths of human consciousness while barely ever leaving his hometown. Of course there is the unprecedented nature of the first Critique which others have helped explain in their answers, but the work isn’t important just because of its historical context. It shows us a compelling path of doing philosophy and gaining knowledge about the world which doesn’t rely on the sciences nor logic and reason alone. It proposes to us a third path. We can like or dislike this third path or even alter it in our own way, but the way Kant is able to use this third path to illuminate the world and ourselves is powerful. The fact that we even can search for answers in the Kantian mold is like a whole new method of inquiry has been opened up for us. And re-reading the Critique of Pure Reason is a lesson in how to think like this every single time. So yes, philosophers still read it. No, there is not universal agreement on its meaning. If there was, no one would read it more than once. And yes, people not trained in philosophy can understand it. But only if they wish to put in the sustained effort to do so. It’s not for those who just engage in philosophy for catchy quotables. It’s there for those who are really serious in exploring the interesting questions about our lives. ",
            "date": "Answered August 5, 2017",
            "views": "517",
            "upvotes": " View 551 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Theunis Holthuis",
                    "user_href": "/profile/Theunis-Holthuis-1"
                },
                {
                    "user_id": "Leandro Aliseda",
                    "user_href": "/profile/Leandro-Aliseda"
                },
                {
                    "user_id": "Daniel Payne",
                    "user_href": "/profile/Daniel-Payne-5"
                },
                {
                    "user_id": "Jinesh Sheth",
                    "user_href": "/profile/Jinesh-Sheth-11"
                },
                {
                    "user_id": "Edward Hicks",
                    "user_href": "/profile/Edward-Hicks-12"
                },
                {
                    "user_id": "Hunter Yield",
                    "user_href": "/profile/Hunter-Yield"
                },
                {
                    "user_id": "Joshua Copracr",
                    "user_href": "/profile/Joshua-Copracr"
                },
                {
                    "user_id": "Gerry Van Heerden",
                    "user_href": "/profile/Gerry-Van-Heerden"
                },
                {
                    "user_id": "Robert Hudson",
                    "user_href": "/profile/Robert-Hudson-8"
                },
                {
                    "user_id": "Ryan Walston",
                    "user_href": "/profile/Ryan-Walston"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harry Haller",
                "href": "/profile/Harry-Haller-10"
            },
            "answer_text": "I wish I could answer this for you in a detailed well-organized, intellectually satisfying way. I really, really do. Alas I am miserably ill-equipped to do so. Nevertheless, I have read Kant’s Critique of Pure Reason as a layman (I’m a chemist, not a philosopher) and found it to be the MOST important book I have ever read. Why is it important? I think you will get your response after reading the book … I should say The Book. It is that important. After Kant effectively destroyed the basis for all metaphysical ramblings passing for philosophy with his Transcendental Idealism mmuch of the non-analytical philosophy up to this day is basically about whether Kant is correct or not. To wrap up, Kant is still very relevant, and Critique of Pure Reason is a critically important revolutionary masterpiece which continues to be, and will always remain important. Nevertheless, I found The Book to be quite accessible if you read it (study it) with an open mind. I found my scientific training to be useful (but by no means necessary). Now, there are tricks to reading The Book. Writing books against Kant seems to be a profitable cottage industry (consider “Ayn Rand”) and supposed Kant experts are dime a dozen. So beware and be very vigilant. I say this because you may need (I did) some secondary sources to guide you through The Book. If so, please let me know and I will send you a list of the books which were quite helpful to me. On the matter of translation: consider ONLY Norman Kemp Smith’s translation. The newer, specially more recent translations are written by the “Kant experts” who don’t think much of Kant (Paul Guyer and Allen Wood come to mind). Here are two guides which were very helpful to me while I was reading the book (again, please beware of the “guides” written by Kant’s so called “critics”): Karl Aschenbrenner A Companion to Kant's \"Critique of Pure Reason\" 1st Edition 1983 ISBN-13: 978-0819132307, ISBN-10: 0819132306 This is a wonderful little book which covers only Transcendental Aesthetics and Transcendental Analytics parts of the Critique of Pure Reason. A must have. It is out of print, but you can find copies of it through Amazon sellers. Sebastian Gardner Routledge Philosophy GuideBook to Kant and the Critique of Pure Reason (Routledge Philosophy GuideBooks) 1st Edition 1999 ISBN-13: 978-0415119092, ISBN-10: 041511909X This is an over all excellent guide, but left me wanting more at times. Highly recommended. The following book is not a guide per se, but helps to clarify some of the points AFTER you have read Critique of Pure Reason. Henry E. Allison Kant's Transcendental Idealism: An Interpretation and Defense Rev Exp Edition 2004 ISBN-13: 978-0300102666, ISBN-10: 0300102666 This one is an excellent work to read after you have read Critique of Pure Reason. You will certainly have your own interpretation of the book and may not quite agree with everything that Allison says. It is nevertheless an excellent work. I hope this helped a little bit. ",
            "date": "Answered August 5, 2017",
            "views": "19",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cmethyst Hyanx",
                    "user_href": "/profile/Cmethyst-Hyanx"
                },
                {
                    "user_id": "Abyad Mabsur Rafid",
                    "user_href": "/profile/Abyad-Mabsur-Rafid"
                },
                {
                    "user_id": "John Clinch",
                    "user_href": "/profile/John-Clinch-1"
                },
                {
                    "user_id": "Rob Simpson",
                    "user_href": "/profile/Rob-Simpson-36"
                },
                {
                    "user_id": "Jersey Genon",
                    "user_href": "/profile/Jersey-Genon"
                },
                {
                    "user_id": "Nikola Popović",
                    "user_href": "/profile/Nikola-Popović"
                },
                {
                    "user_id": "Stefan Hensel",
                    "user_href": "/profile/Stefan-Hensel-2"
                },
                {
                    "user_id": "Tarciziu Tancau",
                    "user_href": "/profile/Tarciziu-Tancau"
                },
                {
                    "user_id": "Dwight Dunker",
                    "user_href": "/profile/Dwight-Dunker"
                },
                {
                    "user_id": "Sean M Hare",
                    "user_href": "/profile/Sean-M-Hare"
                }
            ]
        }
    ]
}