{
    "title": "Knowledge vs wisdom? What is what? And which comes first? - Quora",
    "tags": [
        "Enlightenment (philosophical)",
        "Wisdom",
        "General Knowledge",
        "Knowledge",
        "Intelligence",
        "Philosophy",
        "Important Life Lessons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amitesh Chaurasia",
                "href": "/profile/Amitesh-Chaurasia"
            },
            "answer_text": "Knowledge relates to facts that you have learned; wisdom is the ability to put that knowledge to good use. Let me quote an example so we can properly sink in the real difference between the two. Let's say we have a friend who has lot of knowledge about nutrition, diet and fitness. And He always tells you “You shouldn't eat this/that. It will make you fat” But Seldom he follows a strict diet and is painfully overweight. Even though he has lot or knowledge but he lacks wisdom. Lots of People Seek Knowledge. Fewer People Gain Wisdom ",
            "date": "Answered April 3, 2020",
            "views": "68",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Haley Halyena",
                    "user_href": "/profile/Haley-Halyena"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephan Erasmus",
                "href": "/profile/Stephan-Erasmus-6"
            },
            "answer_text": "Knowledge is the data you have accumulated in your mind and wisdom is how you apply that knowledge to your life. Ever met a ‘streetwise' person? They obtained a knowledge of the streets and they are using the knowledge to navigate through life and the streets. A ‘book smart' person has all the knowledge they could have obtained from a theoretical point of view, but they have not yet obtained the skill to use this knowledge practically. Wisdom usually comes with mindful experiences and maturity. Wise people tend to reflect on their experiences and knowledge to obtain a deeper understanding of both these aspects and how they could complement each other. ",
            "date": "Answered April 2, 2020",
            "views": "68",
            "upvotes": "0"
        }
    ]
}