{
    "title": "My dog is going to die soon. How do I deal with this emotionally? - Quora",
    "tags": [
        "Dogs (pets)",
        "Death and Dying",
        "Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jacob Hall",
                "href": "/profile/Jacob-Hall-9"
            },
            "answer_text": "Cherish all the moments with your dog that you have left all the more. They are more precious now than ever before. Make them special. It is disrespectful to the dog you obviously love to waste yours and theirs last moments together being sad. This feeling that you have is understandable, but in reality it is utterly useless to your dog and the precious time you both have left with each other. There will be plenty of time to mourn afterwards, and you can spend all the time you want with that feeling if you want when it doesn’t come at a cost to the pet you love. As animals are more intuitive than you think… they feel these things from you instinctively. But beforehand, it is a waste of your last opportunities to give your dog happiness and to create more happy memories of moments together for yourself. Find the strength to do this for your dog… for them it is obviously worth the effort. The end is as important… if not more important, in all things. *(Side Note) - I remember seeing some videos on youtube of people taking their dogs out for a “last day” before they have to get put to sleep (terminal illness that will cause them great pain in the long run). Morning at the beach with all her favorite “doggy” friends, all her favorite snacks, treats and food, dog spa and pro massage… 100% focus of all the attention for the entire day from her family etc etc. They are truly beautiful and touch on exactly what I am talking about. The owners attitudes are perfect, no sadness during their special day at all because it is about the dog… not them. They refuse to taint such an important day because they understand just how important it is to not do so. The perfect way to say goodbye, but also the dogs are obviously having their “perfect day” which they probably felt were all behind them. The dogs are obviously so happy. There is even one where after their dog had passed on, the owners go down to a popular dog beach in the morning once once a year with a large bucket overflowing with balls and leave it on the sand with a picture of their dog and a note saying something like “in honour of our beloved *insert dog’s name here* please feel free to take a ball and continue to spread the joy that she gave us” (or something similar). Things like this are not just simply kind of cool… they are actually kind of awesome. You really should watch these videos. Fortunately, you still have more time than just a day… but these videos may still provide you with some clarity. ",
            "date": "Updated March 3, 2020",
            "views": "16",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tom Baxter",
                    "user_href": "/profile/Tom-Baxter-42"
                },
                {
                    "user_id": "Genosha Zakari",
                    "user_href": "/profile/Genosha-Zakari"
                },
                {
                    "user_id": "Marianne Seltzberg",
                    "user_href": "/profile/Marianne-Seltzberg-1"
                },
                {
                    "user_id": "Bob Walker",
                    "user_href": "/profile/Bob-Walker-37"
                },
                {
                    "user_id": "Liana Randazzo",
                    "user_href": "/profile/Liana-Randazzo"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Britten Stokes",
                "href": "/profile/James-Britten-Stokes"
            },
            "answer_text": "If you truly love your dog, it is going to hurt you for a long time, maybe several years! If he (or she) has been your responsibility all these years, then it is the equivalent of losing a child. There are self help books that you should start to read now, and even groups here on the net for just this purpose. IT WILL TAKE TIME! Coping with Losing a Pet: Grieving the Loss of a Dog, Cat, or other ... Coping with Losing a Pet Feedback About this result • 10 Common Questions - Pet Loss Help - Mourning the Life of Best Friend Mourning the Life of Best Friend What is “normal” when grieving the loss of an animal companion? Below are questions frequently asked regarding the process of mourning an animal ... Coping with Losing a Pet: Grieving the Loss of a Dog, Cat, or other ... Coping with Losing a Pet Some people start to feel better in weeks or months. For others, the grieving process is measured in years. Whatever your grief experience, it's important to be patient with yourself and allow the process to naturally unfold. Feeling sad, shocked, or lonely is a normal reaction to the loss of a beloved pet. How to Cope with Losing a Pet: 13 Steps (with Pictures) - wikiHow How to do anything › ... › Pets and Animals › General Pet Health › End of Life Pet Care How to Cope with Losing a Pet. Since we live a lot longer than our pets, it stands to reason that we will, at some time or another, come face to face with losing ... Grieving the Loss of a Pet | Psych Central Grieving the Loss of a Pet | Psych Central Grieving the Loss of a Pet. By Julie Axelrod ~ 6 min read. When a parent, spouse, child or someone close to us dies, our loss is usually met with sympathy, ... Ten Tips on Coping with Pet Loss Ten Tips on Coping with Pet Loss Coping with grief on the death of a pet; tips on pet loss bereavement. Coping with the loss of a pet - American Veterinary Medical Association Coping with the loss of a pet Coping with the loss of a pet. When someone we love – such as a beloved pet – dies, the loss often causes grief and intense sorrow. By physically showing your grief, you actively mourn the death of your beloved pet. This active mourning will move you on a journey toward reconciling with the loss of your pet. How to deal with the death of a pet - The Washington Post https://www.washingtonpost.com/...death...pet...loss.../gIQALXTXcS_story.html Mar 26, 2012 - How could a dog's death hurt as much as that of a relative? The author assesses that feeling. Coping with the death of your pet : The Humane Society of the United ... Coping with the death of your pet When your pet dies, it's natural to feel sorrow, express grief, and need understanding and comfort from friends and family. Sometimes it's hard for others to ... 5 Strategies for Surviving the Loss of a Pet - Vetstreet Vetstreet.com is the Internet's Leading Pet Care and Health Resource / Find a Veterinarian › Dr. Marty Becker Sep 6, 2012 - Grieving a pet's death can be hard, particularly when friends and family don't understand. Dr. Marty Becker gives advice on how to deal with the ... The grief of losing a pet is traumatic and universal. So why don't we ... News, sport and opinion from the Guardian's US edition | The Guardian › Lifestyle › Pets Dec 21, 2016 - Animals are accepted as part of the family but there is an overwhelming perception that mourning their loss is not truly valid. That needs to ... 12345678910 ",
            "date": "Answered June 11, 2017",
            "views": "4",
            "upvotes": "0"
        }
    ]
}