{
    "title": "Newton was wrong about gravity. What was Galileo wrong about? - Quora",
    "tags": [
        "Galileo Galilei",
        "Isaac Newton",
        "Gravity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ed Smiley",
                "href": "/profile/Ed-Smiley"
            },
            "answer_text": " Newton was wrong about gravity only in the sense that there was more to discover. His theory essentially passed all the tests that could be done at the time. He was incorrect about absolute space and absolute time. He did distinguish between absolute space and measured space so that he held that the absolute state of motion could not be determined, which is essentially Galilean relativity with an unobservable philosophical quibble. It did cause later scientists to go down a rabbit hole with that one by causing a hope that the motion of the ether could be detected, but Newton never held out any hope in his position. In the case of time, however, he held that time was absolute in two senses. In the philosophical sense that there was an absolute time, as distinguished from measured time. But he held also, unlike position, that time was the same for all frames, which turned out later to be incorrect. This asymmetry between time and position was compatible with all observations that Newton had available at the time. I can’t really fault Galileo for thinking that Saturn appeared to have a couple of lobes attached. His telescope was simply not that accurate to make out the rings: he reported what he saw.* What he did make a mistake about was the circular motion of the planets. He was a follower of Copernicus who proposed them with his heliocentric model. It works kinda OK in a few cases; Mars and Earth have roughly circular orbits. But even they are a little bit off. But you can’t take the motion of the planets fit circles exactly. He had all the work already done for him by Kepler, who had shown that the obits are ellipses. Why did Galileo discount him?  This is why. Kepler wanted to have a unified theory of the planets. He had the three laws, which were terrific, But he wanted something more. He wanted to know why they had the orbits they had. He thought that the five planets were connected to the only five possible Platonic solids. He thought the sizes of the orbits had something to do with fitting them inside each other with spheres. Of course today we can dismiss this idea, but actually it’s often hard to know at first what things are laws of nature, and other things are just like, shit happens, man. Anyway, Galileo looked at this and concluded this man is a crank, And so he didn’t take Kepler’s other good—no great—ideas seriously. (And no— that individual who keeps angrily posting about perpetual motion machines on Quora is probably not a genius.) Kepler had years of Tycho’s insanely accurate observations to work with**, and was actually a pretty clever mathematician. OK, a genius actually. In fact fair to say, some of Galileo’s ideas about orbits and falling bodies anticipate Newton—what would have happened if he had combined these with Kepler’s three laws? * Galileo is the first astronomer to use a telescope. ** Tycho Brahe had very good eyesight it seems and used astronomical instruments and his naked eyes to form his highly accurate observations. ",
            "date": "Answered July 26, 2019",
            "views": "165",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carl Smotricz",
                    "user_href": "/profile/Carl-Smotricz"
                },
                {
                    "user_id": "Bernard Peter Gore",
                    "user_href": "/profile/Bernard-Peter-Gore"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Wrixon EurIng",
                "href": "/profile/David-Wrixon-EurIng"
            },
            "answer_text": "Newton was not really wrong. He gave an approximation of the truth. His version is almost as valid as Einstein’s because Relativity is not really about Gravity at all, it is about explain the consequences of Energy Conservation. Einstein did not get this. He could not explain Quantum Mechanics correctly through Relativity or even at all. Ultimately, his theory only really explain Planetary Gravity. And to say explain is a bit of an exaggeration, he did not explain anything really. He did not explain what Energy Quanta are or how they distribute they energy through different fields as they interact with one another. He did not come up with a meaningful model of the subatomic or correctly describe atomic structures. He clung to the asinine philosophy of wave particle duality. He got rid of the Aether which is real and replaced it with Spacetime which is not. He got rid of the Absolute Reference but sneaked it back into GTR. He failed to explain the constancy of the Speed of Light correctly because it is not really constant in the Absolute Reference where nothing actually happens. He did not explain what goes on in the distorted Space of the Aether where everything that does occur happens relativistically. ",
            "date": "Answered July 26, 2019",
            "views": "114",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Evert De Ruiter",
                    "user_href": "/profile/Evert-De-Ruiter-1"
                }
            ]
        }
    ]
}