{
    "title": "Now that I'm a teenager, should I stop interacting with my father? - Quora",
    "tags": [
        "Fatherhood",
        "Parenting and Raising Teenagers",
        "Fathers",
        "Family Relationships and Dynamics",
        "Parents",
        "Teenagers and Teenage Years",
        "Family",
        "Parenting",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Angela Omo-Dare",
                "href": "/profile/Angela-Omo-Dare"
            },
            "answer_text": "Your interaction with your father has nothing to do with your age. Obviously, as I have no background to your question, I can only speculate as to why it is being asked. If you feel that once you become a teenager, you are a man and therefore don't need to interact futher with the dominant male in your home, then you are making a big mistake. Your father still has so much to teach you about being a man and it's a lesson that will last your whole life. If however your father is abusive, then you need to manage this situation. You should let your mother ( or if she can't or won't help). someone in authority know about the situation so they can take steps to ensure your contact with your father is minimized. If he is an abuser, your father has failed in his duty to show you how to be a man and unless that changes he is surplus to your requirements. ",
            "date": "Answered February 15, 2020",
            "views": "180",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Katsuki Bakugo",
                    "user_href": "/profile/Katsuki-Bakugo-80"
                },
                {
                    "user_id": "Emily Maxtonegraham",
                    "user_href": "/profile/Emily-Maxtonegraham"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Hammond",
                "href": "/profile/Mary-Hammond-25"
            },
            "answer_text": "That depends on whether he is abusive or controlling or if you think that just because you are 13, you ought to man up or some silly nonsense like that. If he is a decent dad, why would you want to stop being around him? Nobody ever stops needing a parent. Ask questions, talk to him, include him in your life. Learn from him. Ask about his childhood. After he's gone, you'll be glad you did. ",
            "date": "Answered February 14, 2020",
            "views": "206",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jason Staley",
                    "user_href": "/profile/Jason-Staley-18"
                }
            ]
        }
    ]
}