{
    "title": "Plato says that poetry is the imitation of reality and the idea is reality (truth). How can we accept an idea as reality? - Quora",
    "tags": [
        "Plato",
        "Metaphysics",
        "Philosophers",
        "Reality",
        "Poems",
        "Truth",
        "Poetry",
        "Literature",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rey Blanco",
                "href": "/profile/Rey-Blanco"
            },
            "answer_text": "Well there is “invisible virtual reality” and “physical reality.” An “upper case” IDEA is distinct from a “lower case” idea. That is, the lower case is an “impression” a “copy,” and sometimes a “cheap imitation” of the original IDEA. The lower case idea include “conceptualization” in the imagination. That is, we get a “concept of ‘it,’ whatever ‘IT’ is.” We try to get a symmetric MIRROR image but we are fortunate if we could get crude anthropomorphic asymmetric grasps that reflect/reflex the “equivalences,” “the same,” and/or “similar” expressions between the two aspects of the same reality. When we are cognizant and recognize the “cross connections” between the invisible idea and physical manifestation, then we can identify and accept that the idea is “reality” and not in the upper case IDEA and/or lower case idea dimension without a physical equivalence. For example, let us pretend that the “earth thinks.” Now we have some approach to watching the earth transform into poetics.  The sonnet above was composed between 1981–1983, which less than four revisions. The “idea” that the earth is a thinking articulate planet and a poem “imitates” AS IF the expression of the names of physical geographical locations and persons are true. Mythologist Joseph Campbell, during an interview with Bill Moyers, suggested that we “look beyond the physical and see the world as a poem.” But, if we do so, the mind boggling events are so far spread out, it appears as if “invisible” because most people stare at the physical objects, rather than how they all are part of a broader picture, the World as Idea and Will, for example. ",
            "date": "Answered October 21, 2020",
            "views": "203",
            "upvotes": " Answer requested by Irfan Baloch"
        },
        {
            "author_info": {
                "name": "Jon Jermey",
                "href": "/profile/Jon-Jermey"
            },
            "answer_text": "If you accept the idea that steak and potatoes are nutritious, you will probably remain alive. If you accept the idea that drinking bleach is a good thing, you probably won’t. Anyone who is alive and outside protective custody clearly accepts enough ‘reality’ for their ordinary purposes. If they didn’t, they wouldn’t be. ",
            "date": "Answered October 21, 2020",
            "views": "217",
            "upvotes": " Answer requested by Irfan Baloch"
        }
    ]
}