{
    "title": "Should I continue sharing my opinions with people who disagree with almost everything I say? - Quora",
    "tags": [
        "Working and Dealing with Difficult People",
        "People Skill Advice",
        "People Skills",
        "Social Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Olga Baranovska",
                "href": "/profile/Olga-Baranovska"
            },
            "answer_text": "If someone disagrees with your opinion it means you have different opinions or one of you is wiser than the other. Both is ok but what to do is a unique decision to be made.  The other thing is: How that person disagrees? By just stating their own opinion on what you shared or aggressively stating you are wrong? If first, then it is normal and you are the one to decide continue sharing your opinions with that person or not. Sometimes debates can lead to a great final result. Sometimes not. This is learning process by sharing opinions and choosing the right one for you. It is ok not to get to some point of view but find something interesting and helpful in opinions of others.  If second, then maybe it is time to stop sharing as obviously that person showing their opinion is most important.  My personal opinion is - share until you are tired of debates and if you are not enjoying the debates --> stop sharing. There is no point if sharing your opinions with those who cancels your point of view and is not interested to discuss for self development purposes. Spend your energy for discussions with those who deserve it! ",
            "date": "Answered July 12, 2012",
            "views": "23",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dorothy Brown",
                    "user_href": "/profile/Dorothy-Brown-118"
                },
                {
                    "user_id": "Gabriel Seah",
                    "user_href": "/profile/Gabriel-Seah"
                }
            ]
        },
        {
            "author_info": {
                "name": "Annie Wang",
                "href": "/profile/Annie-Wang-4"
            },
            "answer_text": "I personally wouldn't waste my breath on anyone who constantly disagrees with me. There would be probably one of two reasons: they either dislike me and therefore disagree with everything I say, or else they just have a combative personality. Neither is something I can fix, so I won't try.  I enjoy a friendly debate as much as anyone else, but I consider being chronically combative a character flaw... especially in the professional world. ",
            "date": "Answered July 11, 2012",
            "views": "24",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leo Severus",
                    "user_href": "/profile/Leo-Severus"
                },
                {
                    "user_id": "Roderick Chow",
                    "user_href": "/profile/Roderick-Chow"
                },
                {
                    "user_id": "Francis Chen",
                    "user_href": "/profile/Francis-Chen-2"
                },
                {
                    "user_id": "Gabriel Seah",
                    "user_href": "/profile/Gabriel-Seah"
                },
                {
                    "user_id": "Toby Thain",
                    "user_href": "/profile/Toby-Thain"
                },
                {
                    "user_id": "Krutikaa Jawanjal",
                    "user_href": "/profile/Krutikaa-Jawanjal"
                },
                {
                    "user_id": "Garrick Saito",
                    "user_href": "/profile/Garrick-Saito"
                },
                {
                    "user_id": "Sandeep Bali",
                    "user_href": "/profile/Sandeep-Bali"
                }
            ]
        }
    ]
}