{
    "title": "Should natural law ethics be considered as the basis of morality? - Quora",
    "tags": [
        "Natural Law",
        "Ethics and Morality",
        "Ethics",
        "Morals and Morality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Dumas",
                "href": "/profile/Christopher-Dumas"
            },
            "answer_text": "Introduction I believe so. I have already answered this question from a a logical, rational, inescapable point of view[1][2]— i.e. why you must follow natural law/respect other’s natural rights, and why, from that perspective, they’re valid — but this time around I’m going to cover it from a different perspective. In this new perspective, I will endeavor to show you that natural law is the only fully integrated system of ethical thought — integrating the reality of our lives as humans with virtue and reason and logically provable ethics. It is the only system which allows us, with clear eyes, to understand what will truly make us fulfilled as human beings, and to unerringly follow that in a consistent way while granting others the right to do the same. In other words, any other system of ethics is fundamentally incomplete, and cannot measure up. Concerning the logically proven part of this consistent and integrated whole, that is in the first two answers which I linked above — here, I will attempt to show how the whole thing integrates what actually makes us fulfilled as human beings, positive virtues, and the natural law. Human Nature To have a nature is to have two primary things: capabilities — those things which something is physically capable of doing, and tendencies — those things that, if the object is not interfered with, it will tend to do given certain circumstances (circumstances might also relate to the presence of other objects). Both of these things are based on the physical structure of the object; thus we might say that the nature of a rock consists of its physical structure as an assortment of mineral molecules that are in their solid state, we might say that the rock’s capabilities are that it can melt or be shattered, and the rocks primary tendency is to fall when let go from a height (if it is not interfered-with by catching it mid-fall). This is obviously not an exhaustive list, but you should get the picture. Everything in this world has a nature, and it is simple to see why: f nothing had a nature, after all, nothing would have any properties unique to itself, and everything would have to be an undifferentiated blob of homogeneous matter. Furthermore, the entire field of science relies on the concept of different things in reality having rationally discoverable and understandable natures — ways in which they act and react, and the physical structures they are composed of, which remain the same yesterday, today, and tomorrow. In this framework, then, we can see that humans must have a nature. Both because we are obviously distinct from other things in nature, because we do in fact act in certain ways, and because to assume that homo sapiens, a material construction in the mammal class of animal, would be the only things in the universe that did not have a nature would be special pleading in the extreme. So far, I have simply been rehashing, in long form, the argument in the first natural law link I’ve put in the footnotes. But from here on out, instead of defending the concept of human nature in abstractum, I will take on the much tougher task of defining what human nature is, and how it should influence our conception of what morality should be. This is similar to the approach I took in the second link in the footnotes, only instead of assessing why the necessary conditions of human action (in light of our nature) logically require certain rights, I will instead talk about why we should care, intuitively, and why natural rights is actually a beneficial thing as an entire system instead of a coldly rational conclusion. So what is human nature? These are our human capabilities: Rationality: the human species is the only one that seems capable of conscious, explicitly logical or rational thought, and conceptual abstractions. Furthermore, since humans do not have instincts nor an automatic knowledge of how to do things — or even an automatic knowledge of what things we need to survive — rationality is our fundamental means of survival; alone in the wild (in the “state of nature”) a human must rely only on his own mind to understand the world around him, the patterns in it, and what he must do.Sociability: our rationality allows us to achieve a much more organized, broad, and intense form of social life — while other species are indeed social, no other species are capable of rational communication to plan ahead and achieve goals to the degree that humans are. Other animals might communicate or even plan on the basis of instinct, but our unique human abilities let us form huge and complex hierarchies and cooperate at a high level.Labor: humans are also the only creatures, thanks to the first two, that are capable of working towards a goal — modifying the things in the natural world to an express purpose, long in advance and at a highly complex level. Other animals might do this to a degree, like the nest-making of birds or the tool-making of some apes, but the birds are acting purely on instinct, and the apes act on direct empirical trial-and-error, not on a true rational understanding (this is why they could not hope to achieve the level of foresight and complexity of human achievements).I will use the word “potentiality” hereafter to refer to a use of a capability — to “fulfill a potentiality” is to make use of a capability granted to us by our human nature; however, to make use of a capability not granted to us by our nature, but instead by our lower animal nature, is not a fulfillment of a human potentiality, but an animal one, as would make sense — although animal capabilities are part of our nature as humans, they are not our unique nature or human nature. They are our lower, animal nature — our base nature — and things which animals could also do. Thus the use of our human capabilities — when not prevented by the misguided concepts of philosophy or the coercive interference of others (in fact, the definition of coercion in this case is simply the prevention, on the part of others, from a human using their natural capabilities) — represent our best life as a human. To best analyze this, it is useful to think of a human alone on a fruitful island: such a human must arrive at an understanding of the world about him using his rationality and senses, and likewise understand himself in order to assess his own individual capabilities (his own strength and stamina, for instance). Such an isolated person would also use the labor of his hands to modify the environment for his use — both as tools, and for consumption. Introducing another person or a few people to this island, it is the fulfillment of our natural human potentiality to cooperate in a mutually beneficial manner — to use our reason to understand our ends and the ends of the others, and to construct a society which understands these things. To use words before violence, in short, and to rationally recognize that the other human’s nature is like our own, using the senses and mind that make us human. If we fulfill our potentialities qua human, if we use the capabilities that our uniquely ours (while not, of course, starving the underlying animal nature which our mind was created to sustain) we will be fulfilled in feeling. This is why natural law is important even aside from all its cold and towering logical factors: it is a way to understand our own natures as humans and figure out a way to act within them so that we can live a good life — good for ourselves and good for others: and not good in the ascetic, self-denying way, but in the truly selfish, self-interested way — what will truly satisfy you? In other words, natural law shows us the way to live a fulfilled life. What Is Fulfillment? Why is our fulfillment important — since, if it is not, we could ignore our natural capabilities/potentialities entirely? A common response, after all, to the things I said above would be: yes, we would not be fulfilling our natural potentialities, using our natural capabilities, but why should we? “Why do I care?” The reason one should care about this fulfillment is that it is the most fundamental directional goal in human existence — as is indicated by the very word I have chosen. We often see “happiness” defined as the ultimate goal of life — we must find a way to be happy, to understand ourselves so that we can work towards happiness. However, if you think about it more deeply, there is some other concept lurking behind this concept of happiness: for instance, imagine someone were to offer you a head-apparatus that would make you happy at all times, with no effort needed — would you take it? Most people would answer no. Why is this, if our primary pursuit in life is happiness? We have just been offered a free ticket to achieve it! This is because happiness is actually a byproduct of something deeper in the human psyche. We desire that deeper thing, but we often mistake it for the byproduct. If you think about this neurologically, it is even more apparent: not only are we as humans not wired to be happy all or even most of the time[3](our wiring being part of our nature!), we also build up a resistance to the chemicals in our brains that make us happy at all.[4]Think of it as if happiness is a superficial paint-job: you paint your brain with an experience-produced chemical, and for awhile it might stick, but in the end you will return to your unhappy state — and even while you are experiencing this happiness, you will not necessarily be fulfilled. You can feel happy (and this is a common experience) while feeling a more fundamental emptiness below it. What is this experience? It is the lack of fulfillment. You are not, and did not, use your capabilities, and fulfill your potentiality as a human being with a unique nature. You see, fulfillment is not a superficial experience like happiness is — it is a deep-seated habit of life or a process that you either do or don’t go through to arrive at the current moment. If you work with your mind, or your hands, with a plan in mind, and do so with the cooperation of others, you will find that whatever happiness you experience will be meaningful, because you have used your potentialities — you have actually acted qua human; you have affirmed your human existence, your human nature. Think of the rich kid who never had to work for all the money and all the privilege he has. He parties all day long, but is he truly happy underneath? We all know the answer to this one: no! But at the same time, he can be truly happy — you see, it is not hardship and the working through it that fulfills our human nature (although it can and often is a method through which we do that), it is the use of our human nature directly that makes us feel that we are truly human beings. The rich kid can truly be happy if he finds a challenge that allows him to exercise his nature — this is why we see happiness increase in countries with more riches: money allows you to pick and choose those challenges which best fulfill your nature both as a human and as yourself. And this brings up another point: while most natural law philosophers in history have constructed elaborate and tight systems of human nature, which dictate our every action in every part of life, I refuse to do that — we all, as humans, do have some things in common; but at the same time, not every facet of our existence is defined in terms of that common human nature. We are each born with our own potentialities, our own capabilities, over and above, based on yet increasing or modifying, our natural versions. Some men might be more inclined to use their rational potentiality, some their labor, some their social. What makes us human is that we all share some of each capability. Keeping that in mind, I prefer to construct a natural law system that is simple and general, allowing every human being the maximum freedom to realize themselves within it. How Do We Construct a Law Out of This? I have already argued, in the formerly linked answer, why we should respect the natural rights of others, as a matter of reason which can be proved. I will not go over that again. This answer is based on a much softer question: why is natural law good. Why should it be considered the basis of morality — not why must it. My softer case is this: any good law must take into account the nature of the subjects it purports to judge. If it does not, it is a bad law, and a useless one primarily. The same goes for ethics: if an ethic is impossible, or operates without basis in the nature of reality or the things it purports to lead, it will be without anchoring, without mooring, and useless.[5] A good morality, then, will take into account the nature and fulfillment of the beings it seeks to dictate the actions of: humans. However, keep in mind that in nature no human is guaranteed these things — we cannot be guaranteed that our life situation will be such that we can exercise our potentialities and be fulfilled. Thus, a natural law must protect the rights necessary to survive as a human, and must allow a fulfilled life, but it cannot grant it, for the requirements necessary to grant such a thing cannot be universal — cannot apply equally to all humans and cannot apply no matter the time or place.[6] Fundamentally, since we are constructing a system of law, we must be concerned with the question of when violence is tolerable: after all, laws are enforced with such violence, and the code of law therefore simply dictates when violence is allowable. Anything beyond that is beyond the scope of true law: questions that do not pertain to when violence is allowed simply cannot become part of a law, since they cannot be enforced. In addition, all of the capabilities of humans are self-regarding: rationality is the capability to use our own mind and sense to apprehend the world and consider it, sociability is the capability to use your own voice (and mind) to interact with people — in a way which does not contradict their ability to use their reason or labor, sociability does not require force — and labor is the capability to use your own body for the rational production of value for yourself and/or others. Since each capability is only self-regarding, between each human and the natural world, any attempt to use our capabilities to get others to produce for us, or use their reason for us, or to essentially act as a parasite, is against what will fulfill us, for instead of using our own capabilities in the way they were meant to be used, we are using them to force others to use their capabilities for us. Human nature is not not that of a parasitic race — for if we were all parasites, stealing from everyone else, who would produce to allow us to steal? A parasite requires a host, thus production is prior and more fundamental; it is the only option that makes sense to consistently apply to all humans. I cannot stress enough that simply because humans are capable of, and have a tendency to, interact with others of their kind for mutual cooperation does not imply that they can be forced to do so — since it is a tendency, it will manifest itself when and if it is proper, and the use of coercion negates the idea that it is cooperative, stemming from the rational understanding of both parties, since the reason of one party — the coerced one — has be abridged in favor of the reason of the one doing the coercing. In conclusion, natural law is a law that takes into account the nature of humans — capabilities, what fulfills them, what allows them to survive — and constructs a rational system dictating what humans therefore should or should not do, that is applicable because of our nature and is thereby universal in time, place, and regarding all types of people; this law dictates only when violence is or is not justified. It is justified in protecting the ability of humans to survive, and the rights that allow them, but do not ensure them, fulfillment. We ask what justice is, what ethical actions are, what the law is, and it is primarily nothing but the refusal to curtail the natural capabilities of those you interact with, as you would not desire them to be curtailed in yourself, and to recognize their capabilities just as you recognize your own — thus, you refuse to curtail their rational faculties by using coercion (as I mentioned above) in order to force them to use your rational faculties instead of your own; you refuse to steal, which would be using their labor instead of your own and curtailing their own capability to labor, and you refuse to force them to submit to the pressure of the community because that is not cooperation but submission. What Would a Person Following this Law Look Like? Let me open this section with a small factoid: the word for “virtue” in Latin — virtūs, virtūtis — means, literally, “excellence,” “courage,” or “strength.” Even more importantly, it is cognate with vir, the word for man. I think this indicates that at least the Romans had the right idea about what virtue was: it was excellence or strength, courage, as befits a man — or a human. The unerring pursuit of being a good human, fulfilling our potentialities. We seem to have lost that. Consider, for a moment, what makes a “good” human — how would we define the goodness of another being? The answer to this question can be found in how we answer this question about other things — a good chair is a chair which fulfills the natural potentialities of a “chair” well: in this case, holding up the rear ends of bipedal beings. For any inanimate object, we define its goodness in reference to how well it fulfills its the potentialities of its nature within its own special capabilities. A good tree is simply a tree that is well-grown, full, healthy. Likewise, we might say that a good human, then, is a human which fulfills his own capabilities and potentialities. Looking back to that list of three originally, we can get these seven virtues: Rationality: the cardinal virtue, just as it is the cardinal capability of human nature — if you refuse to be rational, to use your senses and reason to apprehend reality, you are failing at living qua human and will, inevitably, fail.Honesty: honesty with yourself is fundamentally important, being the basis of proper rationality and self-understanding; with others, it is the refusal to cloud purposely their own means of survival, and refusal to act in a manner inconsistent with reality, which will hurt you as much as the person you are lying to.Integrity: consistency in the application of reason.Independence: being first-handed, or refusing to leave one's thinking to others.Productivity: means working to create one's values — the use of your proper capability as a human to labor rationally, to fulfill your own values.Justice: the principle of applying reason to the actions of other men, or giving other people what they deserve, understanding and respecting their natures — crucial, even cardinal, in the capability of social interaction.Pride: loving yourself, not as you are now, but as you could be, and understanding that it is possible for you to achieve the virtues that come with the fulfillment of your potentiality as a human being — understanding that you are your own highest value, yes, but that — like every other value external to you — you must work to achieve that value, you do not receive it right off the bat; having the self-esteem to understand that you are not a wretched creature, that the good things you achieve as a result of your virtue are yours to keep.Any understanding of human nature and proper action within it must create both an understanding of these virtues, and also (as described above) an understanding of what natural law is correct, what our ethics should be: fundamentally, that idea of peaceful non-aggression. The Reciprocity of Ethics and Virtue One of the most fascinating ideas that I have had the ability to come up with in my own meditations on this subject is this: ethics, specifically natural law ethics and its related ethical systems, and the concept of virtues, are reciprocal. What do I mean by this? Simply, that if you arrive at the moral conclusion that humans have the right to act independently from coercion — that they have the right to be able to use their own reason to assess their situation and act on it, and to use their labor for the production of values for the purposes indicated to them by their reason — it comes from the recognition of humans as rational creatures capable of acting reasonably and producing value. If you do not view humans as creatures that should be rational, that should produce — in short, that these are virtues, or good things about human nature — then you will not find it attractive to allow these potentialities to manifest themselves. And if you do not view these things as possible — if you think humans are not rational, that they do not have free will, are not capable of purposive choices, are easily swayed by the wills of others — then you will not consider it necessary to consider their wills in the matter, and coercion will not find issue with you; moreover, if you believe that they are only sometimes free, then you will find coercion eminently allowable to create the conditions of their freedom from influence — if you believe that advertisements subliminal make people act against their own rational interests and that therefore they are not free if advertisements exist, then how can you disagree with the use of coercion to create the conditions of freedom for people? Thus, having a freedom-focused, libertarian view of ethics naturally implies viewing people, humans, as creatures of these virtues. Likewise, having these ethics implies another thing: that you must view humans as fundamentally heroic beings! What do I mean by this? It means that you think that humans are capable of overcoming obstacles, of improving their lot. If you did not believe this, then what would be the use of allowing them to remain free to try and fail over and over again to improve themselves, when it is fundamentally impossible? But if people can indeed surpass, overcome, rise above their hardships, by the use of their virtues alone, then what better thing is there to leave them free to do that? What need is there for coercion — for virtue-destructive force — if there is a chance for those that would be willing to exercise those same virtues? Because libertarian ethics are so tied to these virtues, this thinking about human nature, then, if you arrive by some other path, not related to the virtues or nature of humanity, through pure logic or through politics, you will be inevitably led back through intuition towards a conception of man as a creature capable of being a rational, productive, heroic being. And likewise, if you start with this understanding of humans — even intuitive — you will be unerringly led to a libertarian conception of ethics. Specifically, the natural law one. This is why, I think, Ayn Rand — for all her intelligence — failed to mount a proper and logically sound defense of her natural rights stance: she made the same make virtue ethicists have made for the thousands of years since Aristotle and the beginning of that ethical school — in short, they confused the tight connection between an understanding of nature, virtue, and ethics for a proof of any of the three. Nature, Ethics, and Virtue are like a triangle:  They are intimately related, and if you have a conception of one you are lead, almost inexorably, to a conception of the other two — however, on the other hand, having one neither ensures that you will have an understanding of the other two, nor implies you have a proof of the other two — if I know what the nature of a person is, I can say that I wish or think ethics is this or that, and the same for virtues, but the burden of proof for ethics is higher and harder — you must bootstrap it out of logic with no assumptions for it to be convincing philosophically. Likewise, if you have a conception of ethics you must do the logical thinking necessary to conclude whether it is in line with human nature — you cannot conclude directly from ethics, without thinking empirically about actual humans, what human nature is or whether it is in line with your ethics at all; and if you know what ethics is, you are not guaranteed to be able to dictate virtue — some ethics speak only to what is bad, not what is good. Virtue is a bid of a special case here — in order to understand virtue you must already have understood one of the other two — but in general, if you know a priori what virtue is, you cannot conclude from that what the nature of the thing you are ascribing virtue to is (even that it is possible for that thing to have that virtue, for some conceptions of virtue are definitionally impossible) and you cannot conclude from ethics what must be done. In Conclusion Natural law is the only proper basis for a coherent ethics if you wish to understand the nature of humans, and construct a system of ethics that works in favor of their fulfillment, that makes it possible for them to be happy and flourish; if you desire this, you will choose natural law — more specifically, in light of what the nature of humans is, natural rights. Not only that, but natural law has a positive relationship with a humanistic conception of people, a benevolent understanding of virtues, and a clear apprehension of reality. If you want a tightly constructed argument for what these rights are, and why we cannot cast them aside, check the first two links I mentioned. Footnotes[1] Christopher Dumas's answer to Is private property morally justifiable?[2] Christopher Dumas's answer to Where do American atheists believe that unalienable rights come from? On what basis do we have unalienable rights if they are not rights inherent from a larger system or God?[3] You Aren't Built to be Happy[4] Dopamine Addiction: A Guide to Dopamine's Role in Addiction[5] Christopher Dumas's answer to What is the purpose of ethics?[6] Christopher Dumas's answer to What's the difference between a right and a freedom?",
            "date": "Updated March 4, 2020",
            "views": "865",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Oliver Stone",
                    "user_href": "/profile/Oliver-Stone-58"
                },
                {
                    "user_id": "Andrew Hagen",
                    "user_href": "/profile/Andrew-Hagen-20"
                },
                {
                    "user_id": "Joshua P. Schubert",
                    "user_href": "/profile/Joshua-P-Schubert"
                },
                {
                    "user_id": "Jim Lowder",
                    "user_href": "/profile/Jim-Lowder-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Ketsdever",
                "href": "/profile/Nathan-Ketsdever"
            },
            "answer_text": "Human dignity is the basis of ethics and should be the basis of public policy. Natural law recognizes humans as dynamic beings that exist in community with multiple strengths and capabilities. What are the alternative exactly? Positive law? Well, thats just the status quo. Contactian answers? Well, contrarian answers (or attempts at solutions) don’t really solve the key modern challenges. That is they are kind of question begging. For instance, which contract is best or most just? Nozick, Locke, or perhaps Rawls? Well, that’s an ongoing debate. I would suggest that Martin Luther King Jr’s infamous “Letter from a Birmingham Jail” helps make the case for natural law theory, particularly given the alternatives don’t measure up. I tend to think natural law also integrates well with virtue theory, such that it coheres to our core intuitions about human purpose and ethics. ",
            "date": "Answered February 28, 2020",
            "views": "80",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Christopher Dumas",
                    "user_href": "/profile/Christopher-Dumas"
                },
                {
                    "user_id": "Ronniel Padua",
                    "user_href": "/profile/Ronniel-Padua"
                }
            ]
        }
    ]
}