{
    "title": "Should I major in philosophy or psychology (assuming I can't major in both)? - Quora",
    "tags": [
        "Philosophy of Psychology",
        "Advice About College and University Majors",
        "College and University Majors",
        "Philosophy",
        "Psychology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Olivia Newan",
                "href": "/profile/Olivia-Newan"
            },
            "answer_text": "Thank you for the a2a.  You definitely need to do what you'd enjoy, but I'll offer my experience...do with it what you will. :)  I would choose Psychology  if I were you. I loved my degree, and the experience, but doing Psych can make a transition to another field (which you will inevitably have to do should you not want to go into academic Philosophy) so much easier once you're out of undergrad. Psych offers the opportunity to become more well-versed in Statistics and lab settings, for example.  I ended up doing my senior thesis on a philosophy of mind topic, and so I would've very much enjoyed a Psych degree. The learning curve was very steep for my transition into the hard sciences, and in many ways I think that a Psych degree would've helped me. If you want to go into advertising or telecomm, I think Philosophy is the easy choice. I landed an advertising acct exec position straight out of undergrad because my organized and disciplined  thinking as a product of an analytical dept's undergrad degree experience allowed me to research advertising and sales information. I learned all that I needed for the interviews in that month and beat out advertising and telecomm majors for the job. ",
            "date": "Answered September 11, 2015",
            "views": "132",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "KM Demegillo",
                    "user_href": "/profile/KM-Demegillo"
                },
                {
                    "user_id": "Robin Khoury",
                    "user_href": "/profile/Robin-Khoury-1"
                },
                {
                    "user_id": "Taqdis Ansari",
                    "user_href": "/profile/Taqdis-Ansari"
                },
                {
                    "user_id": "Tapomita Mallick",
                    "user_href": "/profile/Tapomita-Mallick-1"
                },
                {
                    "user_id": "Jing Zhang",
                    "user_href": "/profile/Jing-Zhang-396"
                },
                {
                    "user_id": "Daniel Saldanha",
                    "user_href": "/profile/Daniel-Saldanha-1"
                },
                {
                    "user_id": "Dency Sakku",
                    "user_href": "/profile/Dency-Sakku"
                },
                {
                    "user_id": "Praepes",
                    "user_href": "/profile/Praepes"
                },
                {
                    "user_id": "Ryan Sowers",
                    "user_href": "/profile/Ryan-Sowers-7"
                },
                {
                    "user_id": "Staroslav Nejc Iztokovič Žilavec",
                    "user_href": "/profile/Staroslav-Nejc-Iztokovič-Žilavec"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chetna Sharma",
                "href": "/profile/Chetna-Sharma-12"
            },
            "answer_text": "Philosophy and Psychology, are both quite different fields from each other. So, it would be better if do an extensive research on both and make up your mind for one. It also depends on the Education System in your country if you can do both or not. From where I come from, Psychology is later prospect once you choose the medical line whereas Philosophy would be next step if you opt for Arts. So, If I were you and decided to do both I would have to start with the medical subjects right from my high school, then graduating and then moving ahead with an masters in Psychology. Once done with that I can easily switch to Philosophy  (Assuming you want to do a complete extensive course in both)because here I can move to Arts fields from Science fields but not the other way around.So, you need to make sure that if you want to pursue both, what would be the best way. Opting for psychology first, completing it and then taking class for Philosophy after that.There is another way to pursue one while doing the other. Take a diploma. I am not sure if it is an option where you stay  but it is certainly being followed by many people here in India, especially by those who have majored in a particular field and are also passionate about any other thing. If you want to do both go for it search the options you have and plan it. If you really want to do both then you can make it happen this way or the other, it will be done.Good Day :) ",
            "date": "Answered September 16, 2015",
            "views": "7",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anu Nush",
                    "user_href": "/profile/Anu-Nush-1"
                },
                {
                    "user_id": "Bonita Loca",
                    "user_href": "/profile/Bonita-Loca-1"
                },
                {
                    "user_id": "Robin Khoury",
                    "user_href": "/profile/Robin-Khoury-1"
                },
                {
                    "user_id": "Dipak Shete",
                    "user_href": "/profile/Dipak-Shete"
                },
                {
                    "user_id": "Tapomita Mallick",
                    "user_href": "/profile/Tapomita-Mallick-1"
                }
            ]
        }
    ]
}