{
    "title": "Should we always tell the truth? Why or why not? - Quora",
    "tags": [
        "Truth",
        "Lies and Lying",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Danny Balaji",
                "href": "/profile/Danny-Balaji"
            },
            "answer_text": "Tell the truth!!! Yup. Tell him the truth that you spent some of your quality time for him by creating a marvelous picture.With or without software,It doesn’t matter as far as you have spent your time,imagination and creativity for your favorite teacher. He will even forget that as time pass by…but the appreciation which he will give you at the time of revealing that you are the one that created it will last forever. Do it only if you want to be appreciated /acknowledged by your teacher for your work. Better sign the picture next time you present one to your loved one.. Adieus…!!!! ",
            "date": "Answered March 25, 2017",
            "views": "31",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sela Sella",
                    "user_href": "/profile/Sela-Sella"
                },
                {
                    "user_id": "Aadhy Shrivastava",
                    "user_href": "/profile/Aadhy-Shrivastava"
                }
            ]
        },
        {
            "author_info": {
                "name": "Portgas D. Ace",
                "href": "/profile/Portgas-D-Ace-36"
            },
            "answer_text": "yup you can tell him about that painting that you gave him and u can also tell him that you used a software it’s no big deal at least you made some effort for him but it would be better if he reminds you on his own you will feel more happy if he reminds you on his own rather than u making him remember and even if do not remember you there’s no problem. There are many people who believe we will never forget them still will lost the memories made with them ",
            "date": "Answered March 3, 2017",
            "views": "973",
            "upvotes": "0"
        }
    ]
}