{
    "title": "Should philosophers stop philosophizing? - Quora",
    "tags": [
        "Philosophers",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ulrich Balbian",
                "href": "/profile/Ulrich-Balbian"
            },
            "answer_text": "You ask a meta-philosophical or second-order question about first-order doing of philosophy and philosophers. This in fact is one of the themes of meta-philosophy about philosophy and philosophers and the reasons for doing philosophy, or not. Then you go further - after these topics have been dealt with you wish to make a judgment if philosophers should stop doing philosophy. What are the standards or norms or tools of measurement by means of which you can assess if this should or must happen? Your question is a question of evaluation - There are at least 7 to 9 types of questions - to see what they are, their functions, meanings and purpose see this FREE for download piece of mine (in the top 0.5% of 1 million researchers). You will see questions of judgment and evaluation comes near the end, after the asking of many other questions. Reading this will show you what kind of question really ask, what its meaning, aims, purpose and functions are and why you ask a questions of evaluation. And, what sort of answers will be deemed meaningful and relevant when asking that type of questions. PHILOSOPHY – Aims, Methods, Rationale I wrote the following for another question, but I suggest you read that to see and think about what philosophers do and how they proceed doing it. Then when you are aware of that, you return to your questions of judging and evaluation after that. So as to judge and evaluate what are the reasons and motives for philosophizing and is they are meaningful, functional and sufficient reasons for the execution of that socio-cultural practice, or not. I suppose you talk about the Western tradition of philosophy? There are a few distinctions you should make for example academic philosophy vs original- and creative thinkers. Among the roles of academic, institutionalized philosophy there are teachers, students, scholars, publishers, editors of journals, etc. They deal with already existing idea, philosophers, subject-matter, domains, methods, etc. On the opposite pole of the continuum there are original- and creative thinkers such as Kant, Spinoza, Wittgenstein, Plato, Marx, Hegel, et al. The latter may or may not also work in one of the institutionalized roles associated with the first pole of academic, derivative philosophy. The roles associated with academic philosophy will do research in the habitual, institutionalized ways of writing essay, doing degrees eg PhD’s, writing articles for journals or for books. You can read anywhere on How to write a PhD. The original-creative thinker might sometimes be puzzled by an idea, a concept, questions or problem. For different kinds of questions and the meaning and function of these see this FREE for download piece of mine where I am in the top 0.5% of 1 million researchers - PHILOSOPHY – Aims, Methods, Rationale I work and research in meta-philosophy (and have since being a student worked as researcher in different disciplines as I preferred that compared to teaching and merely talking about the idea and work of others). Some of the themes of meta-philosopher are: the aims, objectives, methods, subject-matter, issues of philosophy, philosophy and philosophers and art and sciences, etc. One of my books suggest that Philosophizing is part of the processes of Theorizing. And, that students of philosophy must be taught what theorizing is and how to do theorizing. See this FREE for download work of mine here - Philosophizing is part of the Process/es of Theorizing This process , theorizing, will show you what the different steps, levels, aims, objectives, purposes, rational, dimensions, features of theorizing are. THIS in fact is what your questions attempts to ask when you write :How do philosophers perform their research? In short, they are involved in and execute the different features of theorizing. ",
            "date": "Answered December 23, 2018",
            "views": "316",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alvin Rodriguez",
                "href": "/profile/Alvin-Rodriguez-3"
            },
            "answer_text": "My friend by asking this question you're Philosophizing. You’re asking a deep question, should philosophers stop inquiring about everything? If you are asking the question to why inquiry should be stopped then you have possibly pondered the possibilities of benefits of this. This to me is like asking if we should stop questions which the answer is a big NO. ",
            "date": "Answered November 27, 2016",
            "views": "672",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christopher Wood",
                    "user_href": "/profile/Christopher-Wood"
                },
                {
                    "user_id": "James Henry Smith",
                    "user_href": "/profile/James-Henry-Smith-2"
                },
                {
                    "user_id": "Matthew",
                    "user_href": "/profile/Matthew-815"
                },
                {
                    "user_id": "Michael McClennen",
                    "user_href": "/profile/Michael-McClennen"
                }
            ]
        }
    ]
}