{
    "title": "Since Chalmers’ “hard problem” distinction, have consciousness researchers made any substantial conceptual progress? - Quora",
    "tags": [
        "Hard Problem of Consciousness",
        "Philosophy of Mind",
        "Consciousness",
        "Artificial Intelligence",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Haines",
                "href": "/profile/Michael-Haines-10"
            },
            "answer_text": "All ‘things’ (‘trees’, ‘squirrels’, ‘skyscrapers’, ‘sunsets’, ‘stars’…) have form and meaning from the ‘human perspective’ which exists at a certain ‘scale’, ‘place’ and ‘time’ within the ‘universe’. All these terms too are defined from the human perspective. The appearance of ‘the universe’ from the perspective of, say, a ‘microbe’, or a ‘fish’, or ‘worm’, or an ‘intelligent interstellar cloud the size of the Milky Way’, is each very very different. The universe (whatever it is) in itself has no scale, place or time. It has no ‘perspective’. From the viewpoint of QFT ‘the universe’ is a single field in ‘superposition’. Based on this theory, as humans are part of the QF so they too are simply part of the superposition. There is, on this view, no separate ‘thing’ to do the ‘observing’, and no separate ‘things’ to be observed. All form, behaviour… and meaning is relative. Each ‘thing’ is defined in human terms by the ideas that give it meaning. Every idea takes its meaning by reference to other ideas. In the ultimate, each idea is defined within the set of all ideas, a bit like ‘superposition’ of all ideas except ideas have no spatial, temporal or sensory aspect. You cannot sense ideas. Take the idea of the number 4. This ‘4’ is not the idea-Known, nor this ‘four’, nor this ‘quatre’, nor this ‘****’, nor this ‘6–2’, nor any ‘sound’ (speech), nor any ‘feeling’ (braille). It is the idea-Known that gives the sensory representation it’s meaning. As no sensory representation is the number known, it is impossible to learn the concept from ‘experience’ as all experience consists of sensory images, combined with the ideas that give them meaning. No sensations (colours, odours, flavours, feelings, sounds) can ‘be’ in the absence of the capacity to Sense. Can you imagine a ‘feeling’ being that is not Felt? Sensing-sensations is an inseparable aspect of Consciousness. Ideas are simply Known, inseparable from the Knowing. (Can you imagine an idea ‘being’ that is not Known’? What is Sensing-sensation? What is Knowing-ideas? No idea! That it is, is plain :) All scientific theories are simply ideas about reality. QFT (and all scientific theories) simply describe (in terms of mathematical ideas) the theoretical behaviour of theoretical forms (fields, sub-atomic particles, atoms, molecules, etc). We say a theory is valid when the behaviour of the theoretical forms maps or predicts the behaviour of apparent forms… apparent in and to Consciousness (whatever it is). In short, the ‘laws of the universe’ simply describe the behaviour of theoretical forms. They tell us zero about, and can never reveal the nature of this Consciousness that is aware of the sensations-Sensed and the meaning ascribed to the forms imaged by sensations that appear as every ‘thing’. Science is all about ‘measurement’ But notice, the world as it appears is very different to how it is measured. Notice in looking along a straight road how the sides appear to converge, though they are measured to be parallel. A thing that converges cannot be parallel. It can only appear so as the idea of parallel is associated with the image. A thing appearing to be what it is not (parallel) is the definition of illusion. Or how a thumb that is held up appears larger than things measured to be orders of magnitude bigger than it. Again, a thing appearing to be larger than things bigger than it can only be an illusion. Or how a cube that is measured to have six sides all the same that never change, appears as a 2D projection (distorted by perspective) where only 1–3 sides are apparent with all sides constantly changing shape and size depending on the viewpoint. A thing that constantly changes shape and size cannot be a thing that does not, it can only appear so as the idea of the unchanging thing (the cube) is associated with the ever-changing 2D sensory image. It is a truism that a thing that appears to be what it is not is an illusion. In the absence of any idea being associated with any image in Consciousness, the experience is ‘what’s that?’ At first, if the idea of ‘snake arises’, that is what is seen. If then the idea of ‘old rope’ arises, then without any change in the sensory image, the experience is of ‘seeing a rope on the ground’ Plainly, all sensory experience is illusory, depending upon the ideas associated with the ever-changing flux of sensory images. All theories arise as ideas within this field of illusion. And no idea can ‘be’ the reality that Knows the idea! As such, no theory can ever say anything about ‘Sensing-sensations’ or ‘Knowing-ideas’ (ie Consciousness) as it is in Reality. Consciousness is not an object. It is the ultimate subject, in which and to which all objects appear… as in a dream, just as Shakespeare said :) Theories about Consciousness simply map the behaviour of theoretical forms (neurones, synapses, neuro-transmitters, etc) to the reported experience of perceived forms of bodies and brains… all appearing in Consciousness! Science is great for understanding how bodies and brains work, in the same way it has evolved understanding of how computers, and cars, and all other devices ‘work’: as a set of components that are linked in specific ways to output specific behaviours based on specific inputs. In the process, new surgical techniques, and chemical and gene therapies have been/are being developed to cure diseases of the body and brain with least harm to the patient. Why some scientists want to extend the reach of science beyond its bounds is a mystery :) ",
            "date": "Answered May 17, 2019",
            "views": "302",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Roger Hunt",
                    "user_href": "/profile/Roger-Hunt-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hans Werner Hammen",
                "href": "/profile/Hans-Werner-Hammen"
            },
            "answer_text": ">>>Since Chalmers’ “hard problem” distinction, have consciousness researchers made any substantial conceptual progress?<<< Thank you for your confidence in my knowledge. I don’t have any clue what you are talking about, though. HOWEVER! Consciousness aka mind, itself, as such cannot be researched. Consciousness is the entirety of INFORMATIONS=subjective constructs, being elicited momentarily and continually during the wake state. All that we CAN research, on this occasion is, where in the brain specific subjective constructs are being made up. Since I am already in a stream of writing here comes: All that is realis-able is “our reality”, we can call it Information-SOURCE All that our brain is making up from the realis-able, is “our reality”, we can call it realised-hood or: INFORMATION. It is not MY fault that the symbol “reality” has two meanings = INFORMATIONS, opinions, existenceS TO IT! Namely, as already indicated: Outside-brain cause… and inside-brain effect Now, the inside-brain effect, the reality with the meaning “realised-HOOD” or “Information” is my favorite subject for a good reason: The entirety of them momentarily- and continuously being elicited Informations is nothing else than our individual consciousness aka mind. Information is merely elicited, fabricated, made up that is, during individual brain actions, an individual detecting-, observing-, realizing-, perceiving-, experiencing-process inside the individual brain that is. Please allow me to call them: Detected-, observed-, realised-, perceived-, experienced-HOODS, existenceS. From the individuality of the brain / the individuality of the brain actions it follows logically, that the perceived-hood is a subjective construct. The subjective construct, aka thought, it has many names (manifestations, labels, symbols, written words: INFORMATION, awareness, idea, concept, PROPERTY, truth. My own favored terms are: Detected-HOOD, per-/conceived-HOOD, observed-HOOD, realised-HOOD, very real illusion. My own praeliminary listing of these subjective constructs = very real illusions: !!!ALL!!! sensations, emotions, problems, values (such as beauty and usefulness), ought-, should-, and must-HOODS, necessities that is; intentions, purposes, wills - and the respective counteremotions. Such as: Love and hate, appreciation and disgust, bright-NESS and dark-NESS.!!!ALL!!! parameters in the language of physics: MASS, distance, area, space, density = mass per space, time, velocity, acceleration (gravity is an example), force, impulse, pressure, power, ENERGY, temperature!!!ALL!!! Constants, Axioms, fields in the language of physics. And all LAWS - of legislature, !!!AND!!! of logic, morality, physicsALL them so very well !!!KNOWN!!! G-Ds such as YHWH, Jesus (THE) Christ, AllahThe immediate subjective construct giver is the brain. It elicits momentarily, and continuously during the perception process the subjective constructs, as an imaginary end-effect of the physical perception-process TO-, ON-, OF, obtained/acquired FROM-, ABOUT- cause, the eventual objectIVE template = Information- ****SOURCE **** which is the [entirety of] matter [aka cosmos] The entirety of momentarily- and continuously being fabricated subjective constructs comprises the “consciousness” aka “mind” Any subjective construct can, as indicated, not be realized, detected, observed, per-/conceived as such Any subjective construct can merely be proclaimed, asserted, symbol-ized, objec-ified, determined, laid down… for example on the patient paper. Or… on the screen. Which is exactly what I did. If you or anyone who reads is aware of a systematic listing of subjective constructs (see above) please notify me. ",
            "date": "Updated May 22, 2019",
            "views": "176",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Roger Hunt",
                    "user_href": "/profile/Roger-Hunt-16"
                }
            ]
        }
    ]
}