{
    "title": "Sometimes I feel everything in this world is fake. I feel that this world is just an imagination of someone else or maybe a dream and we're just a character of someone else's dream or imagination. Will anyone help me to understand this world? - Quora",
    "tags": [
        "Imagination",
        "Dreams and Dreaming",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gagandeep Luthra",
                "href": "/profile/Gagandeep-Luthra-1"
            },
            "answer_text": "Once there existed a saint named Zhuang Zhou. He was known for always being happy for no reason. But one day, he was sitting outside his home with a sad face. And people were wondering what had happened to him. A person came to him and asked what had happened? To which he replied that he was facing a problem that no one could solve. That problem had left him puzzled and no one seemed to have a solution to it. He said, “Last night, I was dreaming of hovering over flowers in a garden as a butterfly.” The person asked,”What is the problem in that?”. He said,”I was sleeping and in my dream I had become a butterfly. It could also be that the butterfly had gone to sleep and is dreaming that she had become me. My life could just be a dream of that butterfly. It’s possible. Now, I don’t know whether my dream is true or that of that butterfly? How do I solve this problem. It has put a question on my life, my reality. And no one seems to have an answer to it”. ~ An excerpt from Osho’s discourses. ",
            "date": "Answered December 16, 2019",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Indranil Dutta",
                "href": "/profile/Indranil-Dutta-88"
            },
            "answer_text": "Meditate a little every day. You can understand that yourself then. You are fortunate to have those feelings. You can benefit from the meditation programs of the Art of Living. ",
            "date": "Answered December 2, 2019",
            "views": "27",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gagandeep Luthra",
                    "user_href": "/profile/Gagandeep-Luthra-1"
                },
                {
                    "user_id": "Deepika",
                    "user_href": "/profile/Deepika-606"
                }
            ]
        }
    ]
}