{
    "title": "Someone is trying to set me up to either hurt me badly or kill me. What do I do? - Quora",
    "tags": [
        "Killing",
        "Social Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eren White",
                "href": "/profile/Eren-White"
            },
            "answer_text": "I know im realllyyy late but this is for anyone else out there who come across this message. Back in my days of high school i was dating this guy, lets call him James. We started dating in September. Now within the first week of the month there was this girl lets call her Mary got into a fight with James and they were sworn enemies. New years came and before you knew it my boyfriend at the time and Mary became sudden best friends. Start hanging out together and stuff, apparently what i was blind too was the fact that he was cheating on me with Mary’s cousin. From since that affair i guessed she made him happy so he probably was starting to find ways to eliminate me rather than just a simple break up. He kept telling his new mistress all sorts of lies about me and things i said about them and stuff. Which means he was getting them ready to fight me. Now im not a fighter at all so most likely it never happened . But what was really over board was that the cousin came to our school and was looking for me. Surprisingly when she saw me she do anything. But that never stopped my ex. Everywhere he knew i would be, he walked with her and Mary to try and make a scene, but i was smarter than that and walked away over the 20 plus times he tried. It was only after 3 years i found out they were trying to set me up but i never lose my cool. He was abusive towards me and that's what drived me to leave. I have reported him multiple times of all is attempts and abuse but obviously the police did not a thing. The best thing i did was move far away for my life’s purpose and hopefully im safe where i am now. ",
            "date": "Answered May 20, 2020",
            "views": "767",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gregory Pierre",
                    "user_href": "/profile/Gregory-Pierre-3"
                },
                {
                    "user_id": "Darci Freeman",
                    "user_href": "/profile/Darci-Freeman"
                },
                {
                    "user_id": "Pedro Munoz",
                    "user_href": "/profile/Pedro-Munoz-47"
                },
                {
                    "user_id": "Medina Abdullah",
                    "user_href": "/profile/Medina-Abdullah-3"
                },
                {
                    "user_id": "Sankalp Suradkar",
                    "user_href": "/profile/Sankalp-Suradkar"
                },
                {
                    "user_id": "Eric Campos",
                    "user_href": "/profile/Eric-Campos-17"
                }
            ]
        }
    ]
}