{
    "title": "The Mind: What is a rational mind? - Quora",
    "tags": [
        "Rationality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Winter",
                "href": "/profile/Andrew-Winter-54"
            },
            "answer_text": "A rational mind seeks to use logical processes to analyze and understand the world around them. One gains understanding by looking at a thing, situation, or condition and eliminating the impossible or near impossible from the list of possible explanations. For instance, a person is accused of using “excessive force” in defense of their person during a violent encounter. Pictures of the aftermath show that the accused suffered facial injuries during the encounter where force was used in self defense. The rational mind understands that if the force used was insufficient to prevent injury it could not have been excessive. You simply cannot have excess if you do not have enough, or sufficient of whatever is in question, in this case “force”. The terms are mutually exclusive. The foundation of rationality is the syllogism. Syllogism - Wikipedia Remembering that this is just a starting point. ",
            "date": "Answered July 8, 2019",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sara Flores",
                    "user_href": "/profile/Sara-Flores-119"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Gover",
                "href": "/profile/Martin-Gover-1"
            },
            "answer_text": "What is a rational mind? - a myth We are subjective emotion driven creatures that ( for fun?) have this frontal cortex that imagines it is in charge and quite logical. How something that has little or no control over what we do believe it is in charge is why we live in delusional states a lot of the time - I guess. The ‘rational' (sic) part of us makes us focus on what we see ( and we only see and are aware of a tiny part of the reality spectrum) or what we can put a word around. The ‘ rational' mind thinks power and ego are all.Even though it's functions are powerless - though we have to say it does a very good job of being egocentric. So there's that. ",
            "date": "Answered July 7, 2019",
            "views": "493",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sara Flores",
                    "user_href": "/profile/Sara-Flores-119"
                }
            ]
        }
    ]
}