{
    "title": "There is so much sadness and misery in this world. How do I help other people and not feel extremely depressed at the same time? - Quora",
    "tags": [
        "Mental Health Advice",
        "Coping and Living with Depression",
        "Understanding and Improving Mental Health",
        "Depression",
        "Understanding Emotions",
        "Mental Health",
        "Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dorin Stefan",
                "href": "/profile/Dorin-Stefan"
            },
            "answer_text": "Well, i'll tell you to do some things, and please try to do them, and maybe you'll understand how and why some small acts may be actually big. Think about you, and your daily life. About what you know, about what have you experienced and about what you experience every single day, Think about your friends, about your parents, about all the people you know and about all the places you visited. Isn't that a 'big' life? A long one? I mean, you did so much until now, that your life seems pretty long. And not only that, but everything related to you, that's related to you, seems like another world. You have your own world, you know the people in that world, you are able to change thing in that world, and so on. You are the God of your own world.  Now, if your life it's like this, it means that other people have the same thing, right? Every man has its own world. I have my own world, and i'm the God of my world, i can create something in it, or I can destroy as much as I want, no matter if i have a reason or not. If i go to my a friend and i say \"I hate you, i don't want to see you again\", a lot of things will change. With a few words, a lot in my world changed.  If everyone has its own world, why do you think that by helping just one person, aren't you helping an entire world? Think about it, one person can change your life, your world, and you can do the same. Go to a homeless people and give him $5000. You don't have to do that, just imagine you did that. You then go home, eat something and sleep, almost nothing changed in your world.  But think about that men. With those $5000 he can buy clothes, he can change his image, he can rent a room in a motel, and he can find a job. Or at least he can buy enough books to learn a lot of new things and find a job. With a job he'll have money, with those money he'll take care of himself, maybe find a woman, creating a family and have a happy life.  All that with $5000, with a gesture. You changed an entire world, an entire life, by just giving someone paper. Because money are paper.   So keep in mind, little acts may not change the world as it is, because there is a lot of evil in it. But a simple act of kindness can change someone's world.  Next time when you find a homeless person, give him money, or hire him. Tell him you have work to do at your home, and if he does it, you'll pay him.  A simple act of kindness may change the world in someone's life. ",
            "date": "Answered August 16, 2015",
            "views": "16",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amy Khan",
                    "user_href": "/profile/Amy-Khan-56"
                },
                {
                    "user_id": "Devashrut Bharadwaj",
                    "user_href": "/profile/Devashrut-Bharadwaj"
                },
                {
                    "user_id": "Abhi Pandey",
                    "user_href": "/profile/Abhi-Pandey-182"
                },
                {
                    "user_id": "Mirza Shayer",
                    "user_href": "/profile/Mirza-Shayer"
                },
                {
                    "user_id": "Malvika Singh",
                    "user_href": "/profile/Malvika-Singh-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Lynge",
                "href": "/profile/Daniel-Lynge"
            },
            "answer_text": "I am a Patient, not a Doctor. My advice is not necessarily the best, but I am still alive, and I relate to the asker. If you are prone to depression, and it is caused or enhanced by a medical condition, \"ask about treatment options from a medical professional\" are my first words of advice. My plethora of medical and mental conditions includes lifelong (since childhood, so as far back as I can remember (other than Star Wars IV: A New Hope)) depression and anxiety.Other than knowing if you have medically induced or enhanced tendencies towards depression, and possibly treating it, I find that helping other folks makes me feel much better about my own place in the multiverse. Knowing your own capabilities is key, as overextending one's self can cause more general harm (due to one needing help, as opposed to providing it) than taking a slower approach.If you get frustrated that you are not \"helpful/useful\" enough, take a half second to look for volunteer opportunities in your area that are critically needed, but Low-Effort. There are annual and semiannual and monthly and weekly events that are asking for help from sorting paperwork, digging ditches, picking up trash, crowd management, flyer handling, bake sales, and more. Try going Political. Try Learning a new Skill, or begin a new Hobby.  Choose Happiness. ",
            "date": "Answered August 16, 2015",
            "views": "768",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Devashrut Bharadwaj",
                    "user_href": "/profile/Devashrut-Bharadwaj"
                }
            ]
        }
    ]
}