{
    "title": "There's a difference between right and wrong (people have their own opinion of right and wrong). So why do people do the wrong thing, when they know it's not right? - Quora",
    "tags": [
        "Right and Wrong",
        "Ethics and Morality",
        "Ethics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marcus Geduld",
                "href": "/profile/Marcus-Geduld"
            },
            "answer_text": "Because people are not primarily moved by what they know. The human brain is not unified into a single personality. It’s modular, and the modules fight for dominance. Emotional and algorithmic processes tends to outmatch intellectual ones. Intellectualism is expensive and can’t be kept up for long. Cheaper processes were generally good-enough for our ancestors to survive long enough to raise viable children, and we’ve inherited their brain architecture. I do all sorts of things I know are wrong? A more colloquial explanation for my behavior than what I’ve written above is that I’m weak willed. I give into temptation. The “hedonistic modules” and “terrified modules” of my brain win out over the “intellectual modules” and even, sometimes, over the “empathic modules.” (The quotations are to indicate metaphors. There isn’t literally an empathic module, but there are lots of semi-independent brain processes that push and tug at each other.) I’m 52 and I became a vegan two years ago. All the way back in my 20s, I realized that killing cows was morally equivalent to killing people. It doesn’t matter—to this answer—whether that’s true or false. The point is, I believed it, yet kept on eating meat. For decades! I was absolutely convinced that I was an accessory to murder, and yet I went right on doing it. Why? Because I had an intense craving for meat that overpowered my ethics. Sure, I felt guilty, but the guilt wasn’t as strong as the cravings. And even when I finally gave up meat, it was for health reasons. I had a health crisis that scared me so much, I changed my diet. I’m very glad that I’m no longer paying people to kill cows and chickens, but I can’t pretend that I changed because I knew it was wrong. My reasons were as selfish as my former reasons for eating meat. It’s worth noting that ethical behavior isn’t a switch you just flip on and turn on. Each hamburger was a new moral crisis. If I resisted temptation on Monday, that didn’t help me resist it on Tuesday. I had to keep re-choosing to be good over and over and over again. It was simply too daunting for me. (It’s true that one can form good habits. But there’s a hump one has to get through first. Until the behavior is habitual, it’s a battle that has to be won many times.) I’ll give you another example: I know—or at least I believe—that I could cut my income nearly in half and be just as happy as I am now. And research backs me up on that. Every year, I throw lots of my disposable income away on trifles—on movies I don’t like and gizmos that wind up gathering dust on my shelves. Meanwhile, there are people in the world—in my city—who are starving. Starving! The money that I’m wasting on stuff that doesn’t even make me happy is money that could be saving lives. It could save a child’s life. I know this. I know (or I believe—you and it’s fine if disagree with me) that what I’m doing with my income is wrong. Deeply wrong. If I know it’s wrong, but I do it anyway. Why? See above. ",
            "date": "Answered June 26, 2018",
            "views": "19",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Craig",
                    "user_href": "/profile/Michael-Craig-6"
                },
                {
                    "user_id": "Eric Silver",
                    "user_href": "/profile/Eric-Silver-15"
                },
                {
                    "user_id": "John Savidge",
                    "user_href": "/profile/John-Savidge"
                },
                {
                    "user_id": "Smar Tan",
                    "user_href": "/profile/Smar-Tan"
                },
                {
                    "user_id": "Yamini Ayyagari",
                    "user_href": "/profile/Yamini-Ayyagari"
                },
                {
                    "user_id": "Lu Ana",
                    "user_href": "/profile/Lu-Ana-6"
                },
                {
                    "user_id": "Steven Pratt",
                    "user_href": "/profile/Steven-Pratt-9"
                },
                {
                    "user_id": "Arpit Singh",
                    "user_href": "/profile/Arpit-Singh-19"
                },
                {
                    "user_id": "Jignesh Patel",
                    "user_href": "/profile/Jignesh-Patel-67"
                },
                {
                    "user_id": "Anant Pai",
                    "user_href": "/profile/Anant-Pai-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dick Johnson",
                "href": "/profile/Dick-Johnson-125"
            },
            "answer_text": "First, it’s important to recognize that all humans engage in behaviors that are considered wrong. It’s actually quite natural. Like all other living things, we are genetically mandated to act in our own best interest, to exhibit the behaviors that we perceive will benefit us most. Right and wrong are merely adjectives that represent the group’s point of view, how someone’s behavior affects the group. Human beings are a species of social animals, which means that we instinctively engage in two different and mutually exclusive types of behavior. We do things that benefit us individually, and we do things that benefit us by facilitating our acceptance into the group (i.e., social behaviors). We naturally engage in the behavior that we perceive at the time will provide the greatest benefit. The more aware we become of the often subtle, complex, and distant benefits associated with being part of a group, the more likely we become to engage in social behaviors. Accordingly, every person exhibits a different ratio of individual and group behaviors based largely on their awareness. When someone engages in a behavior that benefits them self at the expense of the group, we adopt the perspective of the group and refer to it as wrong or bad. ",
            "date": "Answered June 26, 2018",
            "views": "226",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rob Brown",
                    "user_href": "/profile/Rob-Brown-13"
                }
            ]
        }
    ]
}