{
    "title": "They say there is a 97% consensus on climate change. What is the consensus, exactly? - Quora",
    "tags": [
        "Consensus",
        "Climate Change Debate",
        "Climate Change Skepticism",
        "Environmental Science",
        "Climatology",
        "Environmentalism",
        "Climate Change"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Evans",
                "href": "/profile/Richard-Evans-213"
            },
            "answer_text": " The central counterargument I hear from supporters of dangerous AGW is that there is a 97% consensus among scientists — this is repeated by them ad nauseum as though they were in a hypnotic trance impervious to facts and reason alike. But if anyone does the smallest amount of research into these studies they always turn out to be fallacious and manipulated. And they never quantify AGW. All sceptics agree with the factual reality of AGW, but disagree with its magnitude. These 97% studies always ask questions such as ‘Is AGW real?’ without quantifying the degree and even skeptics agree AGW is real, so it doesn’t tell us anything we don’t already know. Let’s go through some of the consensus studies and pick them apart. Let’s start with the most popular, John Cook (2013) and explain why it was essentially meaningless. One of the most cited papers purporting to demonstrate a 97% consensus on AGW was John Cook (2013). This paper referenced a total of 12,271 papers and these papers were split up into 7 categories. Category 1 included 65 papers that claimed humans were the “primary cause” of global warming. Category 2 included 934 papers that acknowledged AGW was a “known fact”. Category 3 included 2,933 papers that acknowledged “greenhouse gases cause warming”. Category 4 took no position and 5, 6, 7, either implicitly or explicitly rejected AGW. The 97% consensus was arrived at by taking the first 4 categories (which had around 12,000 papers) and counting them as “for” AGW. However, most skeptics would agree that AGW is a “known fact” and that “greenhouse gases cause warming” and therefore skeptics could be included in the 97%. Category 1 was the only one which included papers that claimed that humans were the “primary cause” of global warming (i.e. over 50%) and that included only 65 papers. The 97% consensus that humans are the “primary cause” of global warming is really a 0.5% consensus (i.e. 65 papers of 12,271) because category 1 was the only category that explicitly endorsed the idea that humans were the “primary cause” of global warming. Also, Cook’s study was so skewed he included various well-known AGW-skeptics in the 97% (see here). Click on the image below from John Cook (2013) to enlarge (red and yellow highlights added by me). The next one is Doran and Zimmerman (2009). This pair of researchers from the University of Illinois sent out an online survey to 10,000 Earth scientists asking them two questions: 1) “Do you agree that global temperatures have generally risen since the pre-1800s?” and 2) “Do you think that human activity is a significant contributing factor?” Out of the 10,000 Earth scientists, 3146 responded. Of these respondents, 90% said yes to the first question and 82% said yes to the second question. However the 97% figure came from only 77 scientists (of unknown credentials) of which Zimmerman (2009) essentially handpicked, out of which 75 agreed to both questions. The ratio of 75:77 thus produced the 97% consensus. 75 scientists hardly constitutes a “worldwide consensus” and the questions that Zimmerman (2009) asked were pretty silly too. Terms like “significant contributing factor” is vague and apparently many of the scientists who were asked the question protested on the grounds of the unscientific and subjective question style.The next study is from James Lawrence Powell (2014) who claimed there was a 99% consensus on anthropogenic global warming. Powell scoured the web for scientific articles under the search-terms “global warming” and “climate change” and supposedly reviewed a grand total of 25,182 articles. He then claimed that based on these articles he had found a 99% consensus based on “whatever combination of titles, abstracts, and entire articles was necessary to identify articles that ‘reject’ human-caused global warming”. After apparently searching through thousands of articles, Powell claims to have found only 24 articles that rejected AGW or observed a better cause for the warming than CO2 (out of 13,950 articles). But the problem is, AGW-skeptics do not reject the factual reality of AGW and agree that anthropogenic CO2 might be causing some warming, even if that warming is very small. We do not reject AGW. I think warmists must have been reminded of this fact over a thousand times and yet still refuse to accept it and insist on painting skeptics as “deniers of AGW”. By obtaining a 99% consensus through those who reject AGW, Powell (2014) conveniently and illegitimately disregarded the colossal amount of AGW-skeptic papers that would have otherwise massively deflated the 99% figure.Then there’s the study by Naomi Oreskes (2004). This was an unattributed “analysis” of 928 peer-reviewed papers which allegedly showed that 75% of those papers agreed with the “consensus position” on AGW while the remaining 25% neither agreed nor disagreed with it. Like John Cook (2013), it was not a survey of scientists, but papers (published between 1993 and 2003). Oreskes used the Web of Science engine using the keyword phrase “global climate change” to search through peer-reviewed papers to see whether they endorsed the IPCC’s consensus view that “Earth’s climate is being affected by human activities” and that “most of the observed warming over the last 50 years is likely to have been due to the increase in greenhouse gas concentrations”. Oreskes’ study was later misrepresented by Al Gore. Some media outlets claim her study showed a 100% consensus. This was based on her claim that she had found no papers that rejected the idea that “global climate change is occuring and human activities are at least part of the reason why”. Of course, AGW-skeptics do not disagree with this and thus could be included in the 100% figure. It’s perhaps important to point out that Oreskes’ “analysis” was unattributed and when Peiser (2005) re-ran her survey he found dramatically different results. Instead of a 75% consensus he found only a 1.2%. Oreskes’ survey was also based on papers that are now 17 to 27 years old (as of 2020) and climate science has made vast improvements in climate sensitivity estimates since, with seemingly more and more scientists finding lower values (see graph below). All the 97% consensus studies are meaningless for one reason or another. ",
            "date": "Updated August 8, 2020",
            "views": "443",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Roy Weiler",
                    "user_href": "/profile/Roy-Weiler"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Tu-Fur"
                },
                {
                    "user_id": "Vincent Moreau",
                    "user_href": "/profile/Vincent-Moreau-5"
                },
                {
                    "user_id": "Walter P. Wieland",
                    "user_href": "/profile/Walter-P-Wieland"
                },
                {
                    "user_id": "Igor Rouzine",
                    "user_href": "/profile/Igor-Rouzine-1"
                },
                {
                    "user_id": "John McLean",
                    "user_href": "/profile/John-McLean-72"
                },
                {
                    "user_id": "Torben Mølgaard",
                    "user_href": "/profile/Torben-Mølgaard"
                },
                {
                    "user_id": "Keith Berry",
                    "user_href": "/profile/Keith-Berry-6"
                },
                {
                    "user_id": "Robert Stumreiter",
                    "user_href": "/profile/Robert-Stumreiter"
                },
                {
                    "user_id": "George Branagh",
                    "user_href": "/profile/George-Branagh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lee Thé",
                "href": "/profile/Lee-Thé"
            },
            "answer_text": " Scientific consensus is not achieved democratically. The process is more like gladiatorial combat: last one standing wins the “consensus.’ The combat takes place in dueling research papers published in peer-reviewed journals and attacked and defended at professional conferences. More accurately, it’s like dozens or even hundreds of such combats going on with the publishing of many different avenues of research, with different methodolical tools and models, different data sets. When all those avenues converge on one underlying theory, that theory wins acceptance. This is called “consilience.” It’s the most fault-tolerant way of proving something, because even if one of those avenues turns out to be a dead end, it doesn’t touch the validity of those other ones—and it also doesn’t affect the validity of the overall conclusion. But another kind of combat takes place when the research threatens the profits of major industries. The industries invariably fight back with ferocious propaganda campaigns that seek not only to discredit the research but if possible to destroy the careers of the scientists involved. This combat is not conducted in the scientific journals and conferences, but in the public and political spheres. And the purpose is not to advance a competing theory, but simply to cast doubt on the real one. Here the methods are not scientific but propagandistic, lifted from the playbooks of two governments that honed their propaganda tools to a fine art: the Third Reich and the USSR. More recently the Russian government and the Republican Party in the USA have adopted these tools and integrated them with Internet-based social media. These forces have spent decades grooming voters to fear and distrust government and “elites”—by which they don’t mean rich people; they mean smart, educated people—topped by scientists. Conversely they’ve groomed voters to trust big business; for every American, no matter how lowly, to think of himself as a “temporarily embarassed millionaire.” A big part of this campaign is the production and dissemination of fake science—produced by real scientists who lack the skills or the discipline to produce real science. They crank out prodigious amounts of this chaff—over 193 denial myths are listed and debunked by one climate scientists’ site ( Global Warming and Climate Change skepticism examined ). These are disseminated by astroturf websites—those that pretend to be represented “concerned private citizen” efforts but are in fact funded and directed by the fossil fuel industry through money laundering cutouts with anodyne patriotic names. The amount spent in this century alone approaches a billion dollars. Dangerous, man-caused global warming via greenhouse gases was first speculated about in the 1820s, but there was no way to prove or disprove it them. Late in the 19th century saw the beginnings of good, continuous data collection. By the late 1970s, a majority of climate scientists had accepted AGW (anthropogenic global warming) as what was happening to the climate. It took a few decades more for the general science community to buy off on it. By 2005, only 3% of climate scientists were challenging AGW (hence the 97% part), and practically every national science association of every developed nation had agreed and published supporting statement of their own, like this one from the AAAS: “The overwhelming evidence of human-caused climate change documents both current impacts with significant costs and extraordinary future risks to society and natural systems. The scientific community has convened conferences, published reports, spoken out at forums and proclaimed, through statements by virtually every national scientific academy and relevant major scientific organization — including the American Association for the Advancement of Science (AAAS) — that climate change puts the well-being of people of all nations at risk.” http://whatweknow.aaas.org/get-the-facts/ A few years ago the Pew Foundation polled AAAS member scientists (the cream of the crop—no lab techs with pretensions) and found that 87% accepted AGW. But meanwhile the Merchants of Doubt were working their mojo on the American public, with the result that only 50% (mostly Democrats) accepted the following statement: “The earth is getting warmer mostly because of human activity” Major Gaps Between the Public, Scientists on Key Issues The truth will out, though, as it did against the lead industry’s campaign to keep lead in paints and fuels, and the tobacco industry’s campaign to keep cancer sticks in our mouths:  But even as the general public moves toward agreeing with the science, the Republican deniers double down on their fantasy version of reality. And the deniers aren’t bland about this. They’re angry. Steamed. Those double-domed egghead so-shul-ists are evil people trying to turn ‘merica into the Soviet Union. And other countres. Look at the lengthy screed here by Canadian lawyer James Matkin. He has zero training in science, yet he’s 100% certain that AGW is a hoax perpetrated by scientists (I’m guessing he doesn’t know a single scientist personally) and socialists who want to cheat the public and steal their God-given rights. He’s mad as hell and he isn’t gonna take it anymore. And look at all those facts and charts and charts and facts! He must be right, right? Only it’s all a house of cards. But you have to know something about the science to knock it all down. And scientists are not, as a rule, crusaders willing and eager to mix it up in the public forums. Only a handful of actual climate scientists are active on Quora—like Katherine Hayhoe. But the Merchants of Doubt crank out dozens of denier-questions every day, and the scientists have day jobs. Plus they’re daunted by the fury of the deniers and weight and authority of the Republican politicians backing them up. The 4th Annual Climate Assessment, by 13 federal science agencies, released the day after Thanksgiving in hopes of burying it, gives us the state of the art regarding AGW and America in 2019. The science is solid, and utterly consilient. 4th National Climate Assessment report Yet the Denier In Chief, when asked about it, said simply “I don’t believe it.” And that was good enough for the fossil fuel industry’s tools and fools. Our only solution, here in America, is to vote out every single Republican officeholder. Their party has been completely corrupted by the fossil fuel industry, and they will do nothing—absolutely nothing—about this crucial issue as long as they’re in power.  Factio Republicanus nulla est. ",
            "date": "Answered January 24, 2019",
            "views": "97",
            "upvotes": " View 213 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tim Wilson",
                    "user_href": "/profile/Tim-Wilson-30"
                },
                {
                    "user_id": "Ian Saxby",
                    "user_href": "/profile/Ian-Saxby-3"
                },
                {
                    "user_id": "William Roddy",
                    "user_href": "/profile/William-Roddy-10"
                },
                {
                    "user_id": "Michael Greeson",
                    "user_href": "/profile/Michael-Greeson"
                },
                {
                    "user_id": "Tom Mattei",
                    "user_href": "/profile/Tom-Mattei"
                },
                {
                    "user_id": "John Greene",
                    "user_href": "/profile/John-Greene-128"
                },
                {
                    "user_id": "Micha Trautweiler",
                    "user_href": "/profile/Micha-Trautweiler"
                },
                {
                    "user_id": "Blaine Coleman",
                    "user_href": "/profile/Blaine-Coleman"
                },
                {
                    "user_id": "Aaron Grimes",
                    "user_href": "/profile/Aaron-Grimes-6"
                },
                {
                    "user_id": "Peter Langley",
                    "user_href": "/profile/Peter-Langley-20"
                }
            ]
        }
    ]
}