{
    "title": "To what extent is morality absolute and to what extent is it relative or subjective? - Quora",
    "tags": [
        "General Ethics",
        "Philosophy of Morals",
        "Peter Singer (philosopher)",
        "Moral Philosophy",
        "Immanuel Kant (philosopher, author)",
        "Ethics and Morality",
        "Ethics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nathan Ketsdever",
                "href": "/profile/Nathan-Ketsdever"
            },
            "answer_text": "Relationships are a two way street, Ethics is a two way street: Ethics are a two way street. When we set up system of ethics—it helps codify shared rights, priviledges, and expectations. It helps create norms so that we can predict the behavior of other people. The Paradox of Freedom: Even some regulations, like speed, stop signs, and traffic lights serve as regulations, but are ultimately freedom enhancing. That is without these we would ultimately have less freedom. Having shared agreements make our exercise of freedoms—more in light with our shared values—but creates predictability and security to our exercise of our mobility via our cars. Otherwise all speeds and even stopping at random places in the middle of the road would be legitimate. This would actually create net-less freedom. This gets I think to Aristotle’s notion of the idea of the archimedian point. When we have moderate regulations—it can serve as a shared floor for establishing relationships and expecations. Without that shared floor—we have no basis and no floor. For instance, the shared notion that dinner is going to be between 6 and 6:30 as a general rule in your house helps provide clearer expectations about how family members act. It allows you to reach shared goals together and to experience shared times together, ideally without being too restrictive. That regularity means you can optimize your use of the other time you have available. There are core agreements we have as communities: Shared expectations about boundaries. This in turn creates a shared expectation which optimizes both freedom and perceived security.In the case of the United States this means rights (life, liberty, and property) and privacy, specifically.Shared notions of fairness and justice.Overall notions of telling the truth and keeping your commitments and keeping contracts. These are the core notions of relationship and business. Integrity and trust and in turn relationships are built on these pillars.Human value. The need to avoid dehumanization.Most people agree that less poverty is a good thing. Most people agree that some balance between freedom and security is a good thing. Although not everyone agrees about the Universal Rights of Man (for instance paid vacation is hardly agreed upon as a right). Whereas recognition of the inherent dignity and of the equal and inalienable rights of all members of the human family is the foundation of freedom, justice and peace in the world, Whereas disregard and contempt for human rights have resulted in barbarous acts which have outraged the conscience of mankind, and the advent of a world in which human beings shall enjoy freedom of speech and belief and freedom from fear and want has been proclaimed as the highest aspiration of the common people, Whereas it is essential, if man is not to be compelled to have recourse, as a last resort, to rebellion against tyranny and oppression, that human rights should be protected by the rule of law, Source: Universal Declaration of Human Rights Again, we may not all disagree on the exact human rights, but we can agree that respecting and honoring human beings is important. In fact, such is the very basis of freedom and justice and any hope of living peacefully together. ",
            "date": "Answered March 9, 2017",
            "views": "272",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bryan Rosander",
                    "user_href": "/profile/Bryan-Rosander"
                },
                {
                    "user_id": "Tim Kidd",
                    "user_href": "/profile/Tim-Kidd"
                },
                {
                    "user_id": "Isaac McPherson",
                    "user_href": "/profile/Isaac-McPherson"
                },
                {
                    "user_id": "Jason MacDonald",
                    "user_href": "/profile/Jason-MacDonald"
                }
            ]
        },
        {
            "author_info": {
                "name": "Isabel Danner",
                "href": "/profile/Isabel-Danner"
            },
            "answer_text": "Humans learn what is right and wrong from experiences of others or their own. It is not a textbook material that you can read about and memorize how to act in every probable situation that a person might encounter in life. Society is the moral compass for individuals to go through trial and error period when morality is shaped in the minds of the general population. It is subjective to the extent of the damage that is caused by immoral act. Limits are set so that society can reach an agreement and label witnessed degradation of behavior as intolerable to population and identify the wrongs against the benevolence. Morality is not absolute to any extent because it is subjective by nature where we contrast wrong relative to righteousness. ",
            "date": "Answered March 10, 2017",
            "views": "83",
            "upvotes": " Answer requested by Matthew Shearin"
        }
    ]
}