{
    "title": "Was Ludwig Wittgenstein a Christian? - Quora",
    "tags": [
        "Ludwig Wittgenstein",
        "Christian Theology and Philosophy",
        "Christians",
        "Philosophy of Religion",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ulrich de Balbian",
                "href": "/profile/Ulrich-de-Balbian"
            },
            "answer_text": "According to a family tree prepared in Jerusalem after World War II, Wittgenstein's paternal great-grandfather was Moses Meier, a Jewish land agent who lived with his wife, Brendel Simon, in Bad Laasphe in the Principality of Wittgenstein, Westphalia. In July 1808, Napoleon issued a decree that everyone, including Jews, must adopt an inheritable family surname, and so Meier's son, also Moses, took the name of his employers, the Sayn-Wittgensteins, and became Moses Meier Wittgenstein. His son, Hermann Christian Wittgenstein—who took the middle name \"Christian\" to distance himself from his Jewish background—married Fanny Figdor, also Jewish Ludwig Witgenstein, Being from a Jewish family he probably is a distant relative of Jeshua himself. The name Jesus is derived from the Latin Iesus, a transliteration of the Greek Ἰησοῦς (Iesous). The Greek form is a rendering of the Hebrew ישוע‎ (Yeshua), a variant of the earlier name יהושע‎ (Yehoshua), or in English, \"Joshua\". They had 11 children—among them Wittgenstein's father. Karl Otto Clemens Wittgenstein (1847–1913) became an industrial tycoon, and by the late 1880s was one of the richest men in Europe, with an effective monopoly on Austria's steel cartel. Thanks to Karl, the Wittgensteins became the second wealthiest family in Austria-Hungary, only behind the Rothschilds. And there you have all about Ludwig also known as “Richie Rich”. He did not accept any religious faith. William Child (2011). Wittgenstein. Taylor & Francis. p. 218.ISBN 9781136731372. \"Was Wittgenstein religious? If we call him an agnostic, this must not be understood in the sense of the familiar polemical agnosticism that concentrates, and prides itself, on the argument that man could never know about these matters. The idea of a God in the sense of the Bible, the image of God as the creator of the world, hardly ever engaged Wittgenstein's attention..., but the notion of a last judgement was of profound concern to him.\" – (Engelmann)Jump up^ Edward Kanterian (2007). Ludwig Wittgenstein. Reaktion Books. pp. 145–146. ISBN9781861893208.[214] [215] Wittgenstein was said by some commentators to be agnostic, in a qualified sense. [216] [217] He and his suicidal family Ludwig Wittgenstein - Wikipedia  Wittgenstein on his death bed, a photo taken by my father. There is much debate about the extent to which Wittgenstein and his siblings, who were of 3/4 Jewish descent, saw themselves as Jews. The issue has arisen in particular regarding Wittgenstein's schooldays, because Adolf Hitler was, for a while, at the same school at the same time. [73] Laurence Goldstein argues it is \"overwhelmingly probable\" the boys met each other: that Hitler would have disliked Wittgenstein, a \"stammering, precocious, precious, aristocratic upstart ...\" [74] Other commentators have dismissed as irresponsible and uninformed any suggestion that Wittgenstein's wealth and unusual personality may have fed Hitler's antisemitism, in part because there is no indication that Hitler would have seen Wittgenstein as Jewish. [75] Wittgenstein and Hitler were born just six days apart, though Hitler had to re-sit his mathematics exam before being allowed into a higher class, while Wittgenstein was moved forward by one, so they ended up two grades apart at the Realschule. [76] have fallen in love with at least three men, and had a relationship with the latter two: David Hume Pinsent in 1912, Francis Skinner in 1930 Wittgenstein and his lover Skinner were going to emigrate to the USSR . In 1934, the two made plans to emigrate to the Soviet Union and become manual labourers, but Wittgenstein visited the country briefly and realised the plan was not feasible; the Soviet Union might have allowed Wittgenstein to immigrate as a teacher, but not as a manual labourer. Below Wittgenstein and Skinner.  , and Ben Richards in the late 1940s. One of his male lovers - Pinsent  [11Wittgenstein's relationship with David Pinsent (1891–1918) occurred during an intellectually formative period, and is well documented. Bertrand Russell introduced Wittgenstein to Pinsent in the summer of 1912. A mathematics undergraduate and descendant of David Hume, Pinsent soon became Wittgenstein's closest friend. [113] The men worked together on experiments in the psychology laboratory about the role of rhythm in the appreciation of music, and Wittgenstein delivered a paper on the subject to the British Psychological Associationin Cambridge in 1912. They also travelled together, including to Iceland in September 1912—the expenses paid by Wittgenstein, including first class travel, the hiring of a private train, and new clothes and spending money for Pinsent. In addition to Iceland, Wittgenstein and Pinsent traveled to Norway in 1913. Upon determining their destination, Wittgenstein and Pinsent visited a tourist office in search for a location that would fulfill the following criteria – small village located on a Fjord, a location away from tourists, and a peaceful destination to allow them to study logic and law. [114] Suggesting Øystese, Wittgenstein and Pinsent arrived in the small village on 4 September 1913. With their vacation lasting almost three weeks, Wittgenstein was able to work vigorously on his studies. The immense progress on logic during their stay led Wittgenstein to express to Pinsent his idea to leave Cambridge and return to Norway to continue his work on logic. [115] Pinsent's diaries provide valuable insights into Wittgenstein's personality – sensitive, nervous and attuned to the tiniest slight or change in mood from Pinsent. [116] Pinsent also writes of Wittgenstein being \"absolutely sulky and snappish\" at times, as well. [109] In his diaries Pinsent wrote about shopping for furniture with Wittgenstein in Cambridge when the latter was given rooms in Trinity; most of what they found in the stores was not minimalist enough for Wittgenstein's aesthetics: \"I went and helped him interview a lot of furniture at various shops ... It was rather amusing: he is terribly fastidious and we led the shopman a frightful dance, Vittgenstein [sic] ejaculating \"No—Beastly!\" to 90 percent of what he shewed [archaic spelling] us!\" [117] ",
            "date": "Answered March 26, 2018",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrei Heilper",
                    "user_href": "/profile/Andrei-Heilper"
                },
                {
                    "user_id": "Gantan Etika Murty",
                    "user_href": "/profile/Gantan-Etika-Murty"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michel Paul",
                "href": "/profile/Michel-Paul-1"
            },
            "answer_text": "No, but sort of. His family had been Jewish but converted. He himself was adamantly anti-religious while Russell's student, according to Russell's account, but he later had a kind of 'conversion' experience while reading Tolstoy during WWI. After this experience he found that it made sense to think of religion as the attainment of peace in oneself. He spent some time working as a gardener in a Benedictine monastery. He was attracted to monastic life, but he just could not accept a lot of the dogma.  He never specifically became a Christian, but he did arrive at a perspective that spirituality in this sense of an inner practice wasn't something meaningless. Ray Monk's The Duty of Genius describes this very well. ",
            "date": "Answered August 12, 2015",
            "views": "18",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Web Mason",
                    "user_href": "/profile/Web-Mason"
                },
                {
                    "user_id": "Salam Sh.",
                    "user_href": "/profile/Salam-Sh-2"
                },
                {
                    "user_id": "Anders Aspelin",
                    "user_href": "/profile/Anders-Aspelin"
                },
                {
                    "user_id": "Tintiri Mintiri",
                    "user_href": "/profile/Tintiri-Mintiri"
                },
                {
                    "user_id": "Hossein M. Bojnordi",
                    "user_href": "/profile/Hossein-M-Bojnordi"
                },
                {
                    "user_id": "Daniel Lakata",
                    "user_href": "/profile/Daniel-Lakata"
                },
                {
                    "user_id": "Aaron Goldbird",
                    "user_href": "/profile/Aaron-Goldbird"
                },
                {
                    "user_id": "Ron Jones",
                    "user_href": "/profile/Ron-Jones-50"
                },
                {
                    "user_id": "Arielle Dublin",
                    "user_href": "/profile/Arielle-Dublin"
                },
                {
                    "user_id": "Chad Grant",
                    "user_href": "/profile/Chad-Grant-1"
                }
            ]
        }
    ]
}