{
    "title": "What are some criticisms of Plato’s dualism? - Quora",
    "tags": [
        "Dualism",
        "The Republic (Plato)",
        "History of Philosophy",
        "Plato",
        "Philosophy of Mind",
        "Political Philosophy",
        "Philosophers",
        "Philosophy of Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Bross",
                "href": "/profile/Michael-Bross-3"
            },
            "answer_text": "As far as I know there are three types of dualism, a) straight forward dualism a la Plato and Descartes, b) occasionalism a la Malebranche, and c) double aspect dualism a la Leibniz. (I’m keeping it simple here ignoring more recent philosophical acrobatics about epiphenomenalism and emergentism and the like). The basic tenet of Plato’ dualism is that matter and mind (psyche) are totally separate entities which intersect in our bodies, and by some means or other interact. Here is the key criticism of this stance to be found, namely how is it possible that an insubstantial psyche, soul, or mind can interact with a material body. An easy out is to postulate a higher entity that enables this, like a divinity. This remained a challenge for more scientifically oriented thinkers, like Descartes - yes he was - and he started to investigate to see if he could find the nexus of mind and matter. And he did, at least he thought so. Being familiar with the advances in medical anatomy after Vesalius, as well as conducting his own investigations, he noticed that the two cerebral hemispheres were for all purposes identical except one structure, the pineal gland. Being singular he attached the special role to it that was the site of mind/body interaction. Moreover, he declared (erroneously) that only humans have it and animals didn’t. Having previously stated that living bodies are essentially biological machines (he used the term automata), it followed that only humans have minds, psyche, or soul.  Here all visual information visual goes to the pineal gland first Once it was established that animals too have pienal glands it was a short step for materialists like de la Mettrie to cut the Cartesian knot and do away with his dualism. Others tried to save it, Malebranche proposed that mind and body are separate but occasionally a divine bolt united the two to guide action. Leibniz proposed a system where we have a universe composed of two types (there is also a third kind, a mixture we’ll ignore here) of monads (from ‘mono’, a nod to Lucretius’ principiantes, (i.e. first beginnings), material and mind (soul) which just happen to always be in perfect harmony because the creator designed it so. This is thus known as pre-established harmony dualism.  The basic criticism remains: how can something insubstantial act on substance. Nobody has found a satisfactory answer and this is the major reason why so many reject dualism. ",
            "date": "Updated March 17, 2019",
            "views": "573",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christopher Faille",
                "href": "/profile/Christopher-Faille"
            },
            "answer_text": "One important criticism of Plato’s form of dualism comes from Immanuel Kant. (Kant was peddling his own significantly different form of dualism — but that wasn’t your question — we’ll stick with Kant as a critic here.) Kant wrote: “The light dove, cleaving the air in her free flight, and feeling its resistance, might imagine that its flight would be still easier in empty space. It was thus that Plato left the world of the senses, as setting too narrow limits to the understanding, and ventured out beyond it on the wings of the ideas, in the empty space of the pure understanding. He did not observe that with all his efforts he made no advance…” What does that mean? Plato believed that the really real world, the Good half of the dualism, is distinguished in that IT is the world of which we have reliable knowledge. Of the provisionally-real world, THIS world, there is only familiarity and opinion. Kant believed the opposite — the really real is unknown to us. Plato thought that, say, the Pythagorean theorem was an example of our knowledge of the really-real. A squared + B squared = C squared. THAT is true of any triangle anywhere, it is true of the Idea of a Triangle. We’re out of the cave at last, hallelujah. Kant is responding here that we “make no advance” by such reasoning, We only spin out the results of our premises in a closed system of analytical statements. Trying to get to Reality like that puts us in the position of a dove who believes it could fly really fast in a vacuum. ",
            "date": "Answered April 5, 2019",
            "views": "653",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gary Herbert",
                    "user_href": "/profile/Gary-Herbert-16"
                },
                {
                    "user_id": "Sheldon Rokeach",
                    "user_href": "/profile/Sheldon-Rokeach"
                },
                {
                    "user_id": "Bert Veerman",
                    "user_href": "/profile/Bert-Veerman"
                }
            ]
        }
    ]
}