{
    "title": "What are the characteristics of a sociopath? - Quora",
    "tags": [
        "Sociopathy and Sociopaths",
        "Behavioral Psychology",
        "Social Psychology",
        "Character and Personality",
        "Mental Illness"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nobody Noone",
                "href": "/profile/Nobody-Noone-9"
            },
            "answer_text": "The primary traits of a sociopath are an inability to actually honestly care for another human being, to feel another's pain, to feel sorry (deeply, truly sorry) for the pain he/she causes you (or others), to feel real love, to feel any real obligation to the well being of anyone but himself/herself, to have a conscience, period. Some say sociopaths tend to be “very charming”. I disagree with this characterization. I believe, rather, the sociopath mimics what he/she has observed as “charming” behavior tailored specifically to the individual upon whom he/she decides to prey. Sociopaths get off on “getting one over on you”, on interacting with you long enough to figure out what you like/care about (be that your kids, your pets, your family, your music, your hobbies, whatever), then tailoring their comments and conversations with you to those topics to “reel you in”, feigning similar interests or interest in general, playing you like a fiddle until you think they're so cool or so funny … then, once they've gained your trust, start testing you little by little in more sick ways to see if you'll do things to please them. To a sociopath, who is easily bored, it's all a game. You are a joke to them. They are getting pleasure at your expense, even though it may take you awhile to catch on. But you should have some early instinctive feelings that “something just doesn't feel right about this”. Trust your instincts IMMEDIATELY. The longer you stay involved with a sociopath, the more you will come to feel demoralized and broken and, quite possibly, suicidal. To the sociopath, you (and the countless others upon whom they are preying - because, make no mistake, they typically have multiple victims going at one time, “the others” - who they're keeping secret from you), you are a source of ego inflating supply. Everytime he/she can get you to come running when they say they want you, get you to believe them when they say “they're done with all that ” (referring to whatever bad behavior you've discovered and confronted them with, behavior that has deeply hurt you), whenever you react to the pain they cause you by crying /breaking down/ pleading/screaming/cursing/sobbing … they are LOVING it. It's like you're giving them the best drug, the best high they've ever had. And they know they've got you … and you become an even bigger joke to them than what you were to begin with. You're no longer a challenge, though, frankly, which makes you easily dismissed by them. Just when you think you wont hear from them again, though, you suddenly will, with a text that seems innocent enough … and you may be tricked into thinking, at that moment, “See, he/she does really care!” But again, watch and live it out, if you must, but you'll only find yourself right back at devastation and heart shattering pain. The sociopath cares about NO ONE, period. Sadly, deep inside, not even himself/herself. They are people who harbor a deep inner self-loathing, whose core is made of empty nothing and hateful insecurity. But NEVER make the mistake of thinking - if only you could show the socipath how committed YOU are to him/her, how much you love him/her, how YOU believe they are worthy of love, you can fix their inner wounded child …. Blah, blah, blah. Just stop yourself, for the love of all that is sane. I beg of you. Because your best efforts WILL NOT work to achieve this end. Your best efforts, your repeated coming back to them like this, in fact will only affirm the sociopath’s view of you as a pathetic pawn from whom he/she can continue to get “supply” (the ego feed they desparately need to survive). You mean NOTHING to him/her. You never did. You never will. A sociopath is not curable. There is no medicine, no anti-psychotic, no antidepressant, no therapy (the sociopath would never engage it anyway) that can ameliorate this condition. The only thing you must do is take steps toward SELF PRESERVATION. And you must, because a sociopath will kill you eventually. Truly. Psychologically damage you so profoundly, if you stay engaged in any relationship with him/her over a substantial period of time, that you may never recover. I know this. I allowed myself to stay committed to one for 22 years. And I'm intelligent. But my belief in my own self worth plummetted to the most dangerous lows a person's self-value could plummett. If you recognize these traits in whomever you've begun a relationship with, just RUN. and never, NEVER, look back. Block all contact. Don't fool yourself, as I did for years after I finally said, “Get out!”, into thinking, “Well, he sent me this text. I mean, I guess we could be friends.” It doesn't work! A sociopath doesn't have friends. A sociopath gathers people for “supply”, and any acts of reaching out to you is an attempt by the sociopath to see if they can still hook you, whether you will stil be an easy source of “supply” to them. It is ALL at your peril and expense and ALL designed for his/her benefit. Run, run, and run. And never, never, never look back. Trust me. I KNOW the truth of which I speak. ",
            "date": "Updated February 14, 2017",
            "views": "78",
            "upvotes": " View 96 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Venkatesh Kadari",
                    "user_href": "/profile/Venkatesh-Kadari"
                },
                {
                    "user_id": "Kattar Hindu Raj",
                    "user_href": "/profile/Kattar-Hindu-Raj"
                },
                {
                    "user_id": "Cray Dee",
                    "user_href": "/profile/Cray-Dee-2"
                },
                {
                    "user_id": "Lindsey Fillion",
                    "user_href": "/profile/Lindsey-Fillion"
                },
                {
                    "user_id": "Landon Mckethern",
                    "user_href": "/profile/Landon-Mckethern-2"
                },
                {
                    "user_id": "Seda Işık",
                    "user_href": "/profile/Seda-Işık-2"
                },
                {
                    "user_id": "Mary Meyer",
                    "user_href": "/profile/Mary-Meyer-131"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Justin-628"
                },
                {
                    "user_id": "Jenny Schiavone",
                    "user_href": "/profile/Jenny-Schiavone-1"
                },
                {
                    "user_id": "Ann Brown",
                    "user_href": "/profile/Ann-Brown-481"
                }
            ]
        }
    ]
}