{
    "title": "What are basic world and historic facts every person should know? - Quora",
    "tags": [
        "World Facts",
        "Must Know",
        "Facts and Trivia",
        "General Knowledge"
    ],
    "response": [
        {
            "author_info": {
                "name": "Murali Krishnan",
                "href": "/profile/Murali-Krishnan-27"
            },
            "answer_text": "We open and close doors everyday and everywhere -- at home, work, and social environment. We usually don't expect something as common and familiar as a door to pose a safety hazard.  Be aware of the door-related accidents that take place in various forms ranging from car doors to garage doors.  Some alarming facts about door-related accidents,  Every year, 300000 injuries are attributable to door-related accidents in the United States [1]. 28000 children under the age of 15 suffered injuries to their fingers from doors in the United Kingdom every year. [2]  The U.S. Consumer Product Safety Commission states that 26000 fingers are amputated or broken in door accidents every year. The majority of these victims are under the age of 5 years. [3] Finger trapping accidents in doors are the most common door-related accidents. Common injuries include bruised, cut, or smashed fingers, torn or cracked fingernails, broken bones, and even amputations on children.What causes the accidents and how to prevent them? Hazard:  The opening between the door and the doorframe is an inviting place for little fingers. A closing door can exert up to 40 tons per square inch of pressure between the hinges. Doors are shut on someone's fingers by mistake without realising that fingers are not clear of the door.  Prevention:  Install Anti Finger Trapping Devices to reduce finger trapping accidents in doors especially among children. The hardware you select should prevent (not just discourage) the entry of a finger into the danger zone from both sides of the door. Hazard:  Whenever a door is opened outwards there is a risk that it could strike another person.   Prevention:  Open the doors slowly. When opening a door into traffic areas, always assume someone is on the other side.  If feasible, provide windows in the door to aid visibility.  When walking past or standing around a closed door always assume the door is going to open. Give it plenty of room to avoid hitting you if someone opens it.Hazard:  Glass doors pose special problems. There is a risk of collision if a person believes the door to be open when it is closed, or is unaware there is a door at all.   In news: An 83 year-old visitor to the Apple retail store has filed a lawsuit claiming she suffered injuries when she walked head-long into the glass front doors, which she claims were not sufficiently marked to warn of the hazards of clear glass. [4] Prevention:  You can prevent injury from glass doors by providing stickers or other types of warnings on the glass surface to make it more visible.Hazard:  There is a risk of trapping hands or fingers in car doors.   Prevention:  Mind your fingers. Take great care while closing car doors and encourage children to do the same.Be aware that doors can pose a hazard but we can avoid accidents by taking adequate precautions. Sources: [1] Doors - Wikipedia[2] Doors - Fingershield.co.uk[3] Indianapolis Stairlifts | Childproofing | Senior Safety |[4] Senior Citizen Claims Injury, Window Glass Too Clear ",
            "date": "Answered May 7, 2014",
            "views": "762",
            "upvotes": " View 135 Upvoters",
            "upvoters": [
                {
                    "user_id": "Al-Nadheem Tadus Alawaddin",
                    "user_href": "/profile/Al-Nadheem-Tadus-Alawaddin"
                },
                {
                    "user_id": "Mircea Cretu",
                    "user_href": "/profile/Mircea-Cretu-1"
                },
                {
                    "user_id": "Eugene Mandolo",
                    "user_href": "/profile/Eugene-Mandolo"
                },
                {
                    "user_id": "Alooshi Singh",
                    "user_href": "/profile/Alooshi-Singh"
                },
                {
                    "user_id": "Janson Hendryli",
                    "user_href": "/profile/Janson-Hendryli"
                },
                {
                    "user_id": "Nikhil Bhavar",
                    "user_href": "/profile/Nikhil-Bhavar-1"
                },
                {
                    "user_id": "Stacey Rosser",
                    "user_href": "/profile/Stacey-Rosser-1"
                },
                {
                    "user_id": "Aditya Baliga",
                    "user_href": "/profile/Aditya-Baliga-2"
                },
                {
                    "user_id": "Junius Wisnumurti",
                    "user_href": "/profile/Junius-Wisnumurti"
                },
                {
                    "user_id": "Martin Devasia",
                    "user_href": "/profile/Martin-Devasia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeffrey Levy",
                "href": "/profile/Jeffrey-Levy"
            },
            "answer_text": "A circle's perimeter is proportional to its diameter, and the ratio is pi. That fact explains all kinds of things, but the most fascinating I know of is that it leads directly to a northern hemisphere hurricane's worst damage occurring on the right side (facing the direction it's moving) toward the front of the storm's center. Here's why. 1) The bigger the radius of a circle, the bigger the perimeter of the circle. Imagine a record, with a termite standing on the edge and an ant standing one inch from the center. Pretend they walk at the same speed and tell them to walk around the circle. The termite's got further to go. This is why runners are staggered on indoor tracks: the people who have to go around the outside start further forward so the total distance ends up being the same. As a result ... 2) When a disk spins, spots on the edge move faster than spots near the middle. Go back to the record we imagined above and set it spinning once around every minute, telling the bugs to stand still. As the disk spins, the termite has to go a longer distance around than the ant, so since they both spin in one full circle in the same minute, the termite's moving faster: it'll feel more wind in its face than the ant. With me so far? 3) The same relationship holds on the surface of the Earth. Distances around the planet going eastward are the biggest at the Equator and zero at the North Pole (bonus fact: the distance varies as the cosine of the latitude). Imagine two people walking eastward until they return to their starting point: someone at the Equator has to go about 24,000 miles, while someone about a foot from the North Pole has to walk about 6 feet. Now, tell them to stand still while the Earth rotates once (which takes 24 hours, of course). The person at the Equator literally moves eastward at about 1000 mph (24,000 miles in 24 hours)! It's a good thing air moves with the ground, or nothing could exist at the Equator: it'd literally be blown away. So you folks further from the Equator are moving a lot slower than those closer. By the way, this is why it's better to launch rockets a) to the east and b) as close to the Equator as possible. The ISS, for example, moves about 17,000 mph, so starting with as much eastward speed as possible means you don't need to build up as much with a rocket. Ok, so places close to the poles move slower than places near the Equator. So what? 4) Things don't go where you point them, that's what. Imagine you fire a bullet from the Equator northward. The minute it leaves the barrel of the gun, it's moving eastward at about 1000 mph. Imagine it could carry all the way north to a point that's moving east at only 500 mph. The bullet's flying freely through the air (we'll ignore air resistance), so as it gets to that spot, what does it do? It's still trying to go north, but it also moves eastward relative to the ground at 500 mph! It's moving WAAAAY faster eastward than the ground there, so people on the ground will see it zipping off to the east of due north, even though it was fired due north. it'll actually move somewhat northeast. From the bullet's perspective, it moves to the right of which way it was aimed. Now fire a bullet from New York due south. What happens? The bullet is moving eastward at some speed and goes toward a part of the planet that's moving eastward much faster. It can't keep up with the ground's rotation, though, so relative to the ground, it falls behind, drifting westward. From the bullet's perspective, guess what? It again moves to the right of which way it was aimed. Exactly the same thing happens if you aim the bullet in any direction OTHER than due east or west: it will always move to the right of where you aimed it. And in the southern hemisphere, it'll always move left of where it was aimed. If you're still with me, congratulations! You now know what the Coriolis effect is. Now, it's not that strong of an effect. It doesn't control which way water swirls in the toilet, for example; residual currents from how the water flows into the bowl waaaaay overwhelm any Coriolis effect. But it definitely affects planetary-scale motions. For example ... 5) The Coriolis effect controls how winds move. Storms are areas of low pressure (just trust me on this; the reasons why will only make this discussion even longer). Air will flow into an area of low pressure from areas of higher pressure. Ever heard \"nature abhors a vacuum\"? That's what that means. It's also why your vacuum cleaner works: the machine pumps air outward, leaving a partial vacuum, so surrounding air flows in through the nozzle, carrying dust and dirt (and pins, and buttons, and the cat's tail). Imagine you're a bit of air in the northern hemisphere and off in the distance you notice a low pressure area. \"Hey,\" you think, \"I'm getting sucked over there.\" And you start to move. But since you're not connected to the ground, and you're almost never moving directly east or west, you drift to the right. Meanwhile, your buddy on the other side of the low pressure area has the same bright idea, but she also drifts to her right. You both miss the low pressure area, veering right. Now imagine all of your air buddies missing to the right. Which way are you collectively swirling around the low pressure area in the middle? Counterclockwise. And south of the Equator, where everything misses to the left, it's clockwise. So we started with a circle's perimeter being proportional to its radius and now we know why northern hemisphere storms swirl counterclockwise, while southern hemisphere storms go the other way. What do we call ENORMOUS FRICKIN STORMS? Hurricanes, cyclones, or typhoons, depending on the part of the world we're in. But since they're just big storms, now you know why they take the shape they do: circular, spinning one way or the other depending on the hemisphere. One last step: how does this affect which parts of a hurricane produce the worst damage? 6) Imagine you're a Caribbean hurricane, merrily spinning away in place, wiping out everything underneath you. Since you're not moving, you're an equal opportunity source of destruction. Your winds are, say, 100 mph counterclockwise. Now you start moving northward at 15 mph. How strong is the wind on your right? It's moving 100 mph around your center, but it's also picking up an additional 15 mph from your forward motion, so the ground feels 115 mph winds. On your left, your winds are moving opposite your center's motion, so the ground feels 85 mph winds. So: everything on your right feels stronger winds than everything on your left. But winds aren't the worst part of hurricanes: storm surge is. And where does that happen? In front, where winds pile up a huge hump of water. Stronger winds build up more of a hump, so the front right sees the biggest storm surge AND the strongest winds. And now you know why that's the worst place to be in a northern hemisphere hurricane (and why it's front left south of the Equator). Now, there are always local variations based on tides, the exact shape of the sea bottom, whether there are wetlands and what kind, etc. But in general, that conclusion holds. ",
            "date": "Updated June 1, 2017",
            "views": "61",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harsh Chan",
                    "user_href": "/profile/Harsh-Chan"
                },
                {
                    "user_id": "Joe Wilder",
                    "user_href": "/profile/Joe-Wilder-10"
                },
                {
                    "user_id": "Sushanta Sengupta",
                    "user_href": "/profile/Sushanta-Sengupta-1"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta"
                },
                {
                    "user_id": "Prathap Ptp",
                    "user_href": "/profile/Prathap-Ptp"
                },
                {
                    "user_id": "Prateek Kumar",
                    "user_href": "/profile/Prateek-Kumar-213"
                },
                {
                    "user_id": "Jaganraj Palanivel",
                    "user_href": "/profile/Jaganraj-Palanivel"
                },
                {
                    "user_id": "Mayur Kumbhar",
                    "user_href": "/profile/Mayur-Kumbhar-1"
                },
                {
                    "user_id": "Krishna Sharma",
                    "user_href": "/profile/Krishna-Sharma-97"
                },
                {
                    "user_id": "Michael Jones",
                    "user_href": "/profile/Michael-Jones-161"
                }
            ]
        }
    ]
}