{
    "title": "What are some good introductory books on philosophy? - Quora",
    "tags": [
        "Introductory Book",
        "Philosophy",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce R. Bain",
                "href": "/profile/Bruce-R-Bain"
            },
            "answer_text": "If you wish to read a helpful introduction online before you get a book, see: https://www.oocities.org/athens/rhodes/3543/cause.htm You may wish to read the following recommended books. The reason is that if one seeks to actually know about the subject, a number of resources are so much better than a single book. The shortest book I can suggest, and an easy book to read, is: If you start with this brief book, it will be good preparation for all that follows. “Space And Spirit: Theories of the Universe And The Arguments For The Existence of God” by Edmund Whittaker (143 pages / paperback) —————————- \"The Naturalist and the Supernatural\" by William M. Shea ISBN 1432590294 ===================================== “The Popular History of Philosophy” by Teodoro De La Torre ISBN-10: 089555481X and ISBN-13: 978-0895554819  “Hooked on Philosophy: Thomas Aquinas Made Easy” by Robert A. O’Donnell, Ph.D. ISBN-13: 978-0818907401 ——————————————————————- “The Complete Idiot's Guide to Philosophy,” Third Edition by Jay Stevenson Ph.D. ISBN-10: 1592573614  “The Everything Guide to Understanding Philosophy: Understand the basic concepts of the greatest thinkers of all time” by Kenneth Shouler, Ph.D. ISBN-13: 978-1598696103 ————————— “Philosophy in Seven Sentences: A Small Introduction to a Vast Topic” by Douglas Groothuis, Ph. D. ISBN-13: 978-0830840939  ——————————- \"Introducing Greek Philosophy\" M. R Wright Ph. D ISBN-10: 1592573614 ———————————————— \"Philosophy of Mind\" (A Beginner's Guide) by Edward Feser Ph. D. ISBN 9781851684786 (This is not necessarily an easy read for a beginner, but it is a very important explanation for any consideration of Mind.) ———————————————————- \"The Limitations of Scientific Truth; Why Science Can't Answer Life's Ultimate Questions\" by Nigel Brush, Ph.D. ISBN-10: 0825422531 ——————————————————  “Writing Philosophy Papers” by Zachary Seech ISBN 0–534–50652–6 and also by Zachary Seech, “Open Minds and Everyday Reasoning” ISBN 0–534–61348–9 Also, a person might want to establish a foundation in understanding Aristotle’s Three Laws of Logic. For a review of those principles, See Bruce R. Bain’s answer:  See also for quick references: Will we ever be able to understand logic? For a website, see online the Archive of Jonathan Dolhenty, Ph.D. Archive of Dr. Jon Dolhenty ",
            "date": "Updated July 29, 2020",
            "views": "2",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rejoy Panakkal",
                    "user_href": "/profile/Rejoy-Panakkal-1"
                },
                {
                    "user_id": "Haseeb Asif",
                    "user_href": "/profile/Haseeb-Asif-9"
                },
                {
                    "user_id": "Redika Riasari",
                    "user_href": "/profile/Redika-Riasari-1"
                },
                {
                    "user_id": "Aisha Qadoos",
                    "user_href": "/profile/Aisha-Qadoos"
                },
                {
                    "user_id": "Evgeny Bondar",
                    "user_href": "/profile/Evgeny-Bondar"
                },
                {
                    "user_id": "Zach Driediger",
                    "user_href": "/profile/Zach-Driediger"
                },
                {
                    "user_id": "Clyde Booker",
                    "user_href": "/profile/Clyde-Booker-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chloe Cohn",
                "href": "/profile/Chloe-Cohn"
            },
            "answer_text": "Other people have for sure said this but… Bertrand Russell’s A History of Western Philosophy does a wonderful job of explaining and introducing the philosophy you most likely are looking for. If you’re thinking Eastern, there’s, of course, The Tao of Pooh which is very easy to understand, short, and, as an added bonus, funny. It’s not as broad as Russell’s but it’s a great start nonetheless. If you want to take the fictional route, I recommend The Stranger by Albert Camus. I think this might have been the book that initially got me into philosophy in the first place. Plus it’s short. Also, I know this is about books, but if you’re a podcast person (I am), then you should definitely check out Stephen West’s Philosophize This! podcast. Stephen is great at explaining philosophy and he starts right from the beginning. On top of that, he’s super committed! He uploads the transcript to every episode of his podcast and has extra background information on his website (Philosophize This!). He’s got a good voice too (not that that’s important but it’s a bonus). Wish you luck! ",
            "date": "Answered March 7, 2019",
            "views": "493",
            "upvotes": "0"
        }
    ]
}