{
    "title": "What are Eastern and Western perspectives about self? - Quora",
    "tags": [
        "Eastern Culture"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mohammad Montazeri",
                "href": "/profile/Mohammad-Montazeri"
            },
            "answer_text": "That's an interesting topic and amazingly no one answered. The Original Question is: What are Eastern and Western perspectives about self? This is a very controversial subject to go through, but I'll do my best to make it short. First, let's forget everything about the contemporary understanding of the notion of \"east\" and \"west\". There is nothing like a whole unpenetrable leveled union west against those of the east. Mystical orient vs rational west is a fabrication of the colonial scholars. Both cultures and civilizations have many in common so it is difficult sometimes to recognize and separate cultural elements. Second, the motives of human beings that run human thoughts and deeds are almost the same everywhere. So we need a comprehensive study of the case and take an interdisciplinary view to find the differences. But I will try to face the notion of the \"Self\" from a religious perspective which is more related to my studies. East: If we assume that the religious tradition was the mainstream in the east, accepting the concept of a superior being (Allah, Nibbana, Ha Shem, Lord, etc) was a necessity for being religious. As a follower, you should live in a way that God demands. Every single aspect of a follower's life will be defined by the concepts of obedience, submission, and dedication. They should surround their will to the Lord’s irresistible one. The ultimate aim of a worshiper is the contentment and the satisfaction of the worshiped. How? By eliminating their will and following His commandments. Denial of their personal self and becoming a God-oriented self is the first step toward His eternal and glorious kingdom. As an eastern, the concept of the \"self\" stands for something which always exists somewhere out of you. You are not an individual person anymore, but a servant who serves along with His other servants. So in the east, the community of the followers is always more important than individuals. The Ummah of Islam, the nation of the Jehovah, the Church of Christianity, the Sangha of Buddhism are some of these communities which their interests always come first, so the followers need sometimes even sacrifice themselves to protect it. In one word, \"self\" direction in the east is outward.  West: Let's assume that we can associate the west with the concept of rational atheism. By this, I mean the religious tradition like what we have in the east, is not dominant as a school of thought in the west, and also I don't mean the eastern theism is irrational. Well if we put the age of mythology away, (which we can't actually categorize it as religious ideology in the eastern sense) then we have a bunch of the philosophers who they generally didn't believe in kind of personal god(s) or at least not a god who be able to change our human ways of life. Their approach to the world was formed around a materialistic view with a rational realism that seeks the reality of the nature of everything by studying their attributes and properties. The human being was part of this world, the only difference about human was his cognition and awareness. The human is the only creature who can be studied by very him/herself. The journey of the western people into the depth of their most inner labyrinth of \"self\" started right here. Looking to the ancient Greek and its political system based on a kind of democracy (Although slaves, women, and a majority of low-level citizens couldn't vote!) shows the importance of the concept of individuality. Even the aristocracy of Plato had a kind of self-oriented approach to governing over the political system, however, it wasn't based on the people votes but it is highly depended on elite individual's opinions over the issues. While in the east the vote only belongs to the God or His messengers or a council of his chosen servants which decided based on His will which interpreted through His revealed message, not based on worshipper's opinion. We can see the sparks of what we call humanism in the enlightenment era back in ancient Greek. The well-being and joyful life of the individuals (not the society unless we consider society a gathering of the individuals) are the main priority of western societies. (In the theory, of course, I won't go through all those disputes over the capitalism and modern slavery blah blah) You should make yourself happy in this world, It's the ultimate goal of life. In one word, \"self\" direction in the west is inward.  P1: I considered Christianity as an eastern tradition and of the east, I meant cultural east, not geographical. P2: We have many examples of democracy systems also in the east. Like the term of Bay'ah in Islamic tradition which means swear an oath to the ruler by people of the Muslim society (Ummah) which gives him the authority to rule over them. (something like the election) P3: I'm not evaluating the inward or outward direction which I mentioned above. Democracy has its flaws as the theocracy has. By democracy, the institution of power can control people's free will using media for instance, and theocracy, on the other hand, can simply lead the authorities to a holy dictatorship. P4: There is an inward journey in religious traditions in which disciple seeks God by knowing him/herself. There are some amazing and heretic reports of many of these spiritual travelers to the realm of the soul, in which they meet God in their own faces. (I won't judge!) respecting that, could be God and \"self\" be the same? So can we recognize the concept of the \"self\" in the east and west as identical? ",
            "date": "Updated October 20, 2019",
            "views": "396",
            "upvotes": " View 32 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kyra Jane Bacasno",
                    "user_href": "/profile/Kyra-Jane-Bacasno"
                },
                {
                    "user_id": "Enashe Igano Cuyno",
                    "user_href": "/profile/Enashe-Igano-Cuyno"
                },
                {
                    "user_id": "Freya Mabelle Torres",
                    "user_href": "/profile/Freya-Mabelle-Torres"
                },
                {
                    "user_id": "Soraka Main",
                    "user_href": "/profile/Soraka-Main"
                },
                {
                    "user_id": "Jennifer Luna Tuazon",
                    "user_href": "/profile/Jennifer-Luna-Tuazon"
                },
                {
                    "user_id": "Ryuji Maco",
                    "user_href": "/profile/Ryuji-Maco"
                },
                {
                    "user_id": "Brenton Gaming",
                    "user_href": "/profile/Brenton-Gaming-1"
                },
                {
                    "user_id": "Shinn Jii",
                    "user_href": "/profile/Shinn-Jii"
                },
                {
                    "user_id": "Elver Tadeo",
                    "user_href": "/profile/Elver-Tadeo"
                },
                {
                    "user_id": "Diana Galang",
                    "user_href": "/profile/Diana-Galang-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abdul Haqq Sam Bailey",
                "href": "/profile/Abdul-Haqq-Sam-Bailey"
            },
            "answer_text": "That’s such a broad topic books could (and have been) written on it, so I’ll be brief, and let you research beyond the clues I provide. Western perspectives about self are inherently dualistic. Eastern perspectives about self are inherently non-dualistic. Not only does the evidence not support a dual, separate self that exists in isolation from other selves, materialist science has never been able to pin down a self. If I were you, I’d look into teachings from traditional Vedanta philosophy on the related topics of advaita (Sanskrit for nondualism) and its relation to infinite consciousness… as well as traditional Buddhist ideas on “anatman” or the doctrine of no self (implying no permanent, dualistic self). Additionally, you may wish to inform yourself on the subject that in science, is called the “hard problem of consciousness.” You’ll be better off simply looking into these matters and wrestling with what you find there, yourself… than receiving explanations I might give from my own manner of grasping it. ",
            "date": "Answered September 11, 2019",
            "views": "95",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dame Crystal Faye Poon",
                    "user_href": "/profile/Dame-Crystal-Faye-Poon"
                },
                {
                    "user_id": "Jennifer Luna Tuazon",
                    "user_href": "/profile/Jennifer-Luna-Tuazon"
                },
                {
                    "user_id": "Jason Jerome M. Orias",
                    "user_href": "/profile/Jason-Jerome-M-Orias"
                },
                {
                    "user_id": "Rechel Corre",
                    "user_href": "/profile/Rechel-Corre"
                }
            ]
        }
    ]
}