{
    "title": "What are non-moral values and ethics? - Quora",
    "tags": [
        "Tolerance",
        "Civil Rights",
        "Ethics and Morality",
        "Values and Principles",
        "Ethics"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Miller",
                "href": "/profile/David-Miller-707"
            },
            "answer_text": "What are non-moral values? I’ve been thinking about this. Morality has to do with right and wrong. Right and wrong are relative terms—right or wrong for whom or what? If the answer is for humanity, we arrive at the concept of natural morality. Broadly, that says that anything that enhances and encourages survival and continuation of the human species is moral. It bases our fundamental morality on healthy interpersonal relationships, such that nothing we do must interfere with the natural facilitation of survival of the human race. Right, then, non-moral values. Immoral values: that’s easy. But values that are completely divorced from the service of humanity? I wondered whether love might qualify. But not really: sexual love, parental love, brotherly love, even self-love; everything but love for material possessions, all are moral by that definition, and arguably even the latter. What about derivative values like patriotism, reliability, loyalty, punctuality, respect, obedience, deference, truthfulness, politeness…? All devolve on morality in one way or other, not necessarily always positively. Even misplaced loyalty and selfishly motivated politeness have moral dimensions. What about wealth, display, fame, greed, idleness? It is hard to divorce any of those entirely from morality either, because they all affect others positively or negatively, and that’s what natural morality is about. All I can think of is to take your question out of context and think of the current value of bitcoin or of planting carrots in spring. That’s the best I can come up with. ",
            "date": "Answered June 18, 2018",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sid Kemp",
                "href": "/profile/Sid-Kemp"
            },
            "answer_text": "Some values have moral implications. Others do not.  Many cultures have statements that express this idea. In English, we say “To each his own.” In French, “chacun a son gout,” to each his own taste. Going back in time, in Latin, “de gustibus non disputandum est,” there is no disputing matters of taste. Values are simply things we like, things we appreciate, seek out, or promote. One great symbol of this idea is a buffet. A table is laden with many foods, many flavors. Either it is free, or it is at a fixed price. And whatever you like, as much as you want, you choose. What you don’t like, you don’t take. What you don’t know, you may try, if your curious, or not. It’s all up to you. We can explore this idea further with the example of a buffet. It would seem thatthe choices on a buffet are non-moral choices, that they are matters of taste. But some would disagree. A religious vegetarian might see the meat options as immoral. An Orthodox Jew or Muslim might find pork or foods not prepared under proper religious supervision to be immoral. This shows the fact that different cultures and sub-cultures have different morals. What is a matter of moral indifference in one culture - a matter of taste, a non-moral value - may be a matter of moral significance in another. How do we sort out this mix of cultures to decide what is a moral issue, and what is a non-moral matter of taste?  This brings us to the realm of ethics, were we can look at fundamental values across all cultures and decide what is, and is not, a moral issue. We may not come to any final conclusions. But we can create an atmosphere and relationships based on mutual respect. Just as we allow each person to have his or her own preferences of taste, so we respect each culture’s moral values. Then we find common ground, such as agreeing not to harm, not to kill, not to steal or lie, not to break promises, or act with deceptive intent. From this basis, we can create many forms of mutual cooperation. One of the most wonderful of these is Fair Trade, where workers receive appropriate compensation for crafts and foods from their culture and they are sold at reasonable cost to consumers. Then we have a wider set of choices to choose from - by our own taste - without harming anyone, and while doing our best not to offend anyone, either. Fare Trade is a social institution that expands non-moral choice. Enjoy! Coffee  chocolate  music  jewelry  decor  art  ",
            "date": "Answered June 8, 2016",
            "views": "76",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Quan",
                    "user_href": "/profile/John-Quan-1"
                },
                {
                    "user_id": "Dennis Ware",
                    "user_href": "/profile/Dennis-Ware-5"
                },
                {
                    "user_id": "Horatio Oswald",
                    "user_href": "/profile/Horatio-Oswald"
                },
                {
                    "user_id": "Ibrahim Maidaula",
                    "user_href": "/profile/Ibrahim-Maidaula"
                }
            ]
        }
    ]
}