{
    "title": "What are the key concepts of Socrates' philosophy? - Quora",
    "tags": [
        "Socrates",
        "Philosophers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ramazan Fidan",
                "href": "/profile/Ramazan-Fidan"
            },
            "answer_text": "There is an important problem to answer this question: we do not have his own writing, in fact it is said that he intentionally did not write and whatever we can say about him is via other people's accounts. It looks like his main contribution was an ethical one, that is we are ignorant more than we think, if we start to question the things that we think we know and discuss our accounts for them critically with other people we can become better people. Sophists (who were teachers of children of rich people with high payments in that time, literally “wise man”) claim that they “know” so that they have right to “teach”. It seems like Socrates was first in his time to say that it is wiser to be the person whose aim is wisdom and best life, and it is wiser to develop skills, virtues to achieve knowledge, rather than directly jumping into arguments as sophists teach. Aristotle says that (1078b, Metaphysics) Socrates was the first person to seek definitions for moral virtues. This shows that he incorporated morality and inquiry for knowledge for the first time. Socrates's contribution is generally marked as a starting point of a shift from an understanding of world in which knowledge and moral order is given by Gods, to an understanding that we should focus on what is the right way to be subject of knowledge and moral order, a shift from being wise/sophist, to being lover of wisdom/philosopher. Though we should not forget that Socrates was a religious person, arguably conservative about traditional values and appreciated the wisdom Delphic oracle, especially the famous phrase in her temple: know thyself. However, reason for his death penalty was corrupting youth and introducing new gods. Plato describes Socrates's answer for introducing new Gods in Apology 31d as a daimonion (literally something divine) in his mind that warns him as a voice but never tells what to do. Since this “something divine” is not like a person or being, today Socrates's description of daimonion is interpreted as an attempt to conceptualize consciousness or soul in the sense that Delphic oracle advises to understand. This was a key concept in development of philosophy (that is, it is essential to give an account for soul in order to understand world) and affected almost all of the later thought including Plato and Aristotle. ",
            "date": "Answered June 19, 2018",
            "views": "3",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mymy Martos",
                    "user_href": "/profile/Mymy-Martos"
                },
                {
                    "user_id": "Muneeb Khan",
                    "user_href": "/profile/Muneeb-Khan-297"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sven Lundqvist",
                "href": "/profile/Sven-Lundqvist"
            },
            "answer_text": "We received Socrates teachings thru Plato’s dialogues: key concepts of what we inherited from his words are dialogues themselves, and the beliefs that truth can only be part of a process that is made among men and women as a by-product of their confrontation, free from biases and prejudices. To obtain this, by means of dialogue, one shall imitate the act of the obstetrics and give birth to the truth with hir interlocutor: philosophy as the search of truth is therefore compared to midwife, μαιευτικός (maieutikós, “obstetric”). This method had a great fortune throughout history: maieutics, or Socrates debate, is still now a valid procedure in courtlaws. Other concept one shall remember the master for is irony, and ironically enough Socrates has been sentenced to death by a court law, against which he could only propose his unwritten truths and himself as a model of virtue: his pupils tried to defend him (Plato’s Apology of Socrates is the account of this defense), thou he decided to accept and undergo the sentence; he could have chosen the way of exile, but the great attachment to his community and the strong ethic he committed to made him accept his fate. Coherence to his moral was more important than his own life.  ",
            "date": "Answered October 2, 2018",
            "views": "27",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Muneeb Khan",
                    "user_href": "/profile/Muneeb-Khan-297"
                }
            ]
        }
    ]
}