{
    "title": "What are the various types of determinism? - Quora",
    "tags": [
        "Determinism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Johnnie Lockett",
                "href": "/profile/Johnnie-Lockett"
            },
            "answer_text": "As many as people can think of. Determinism—or any other ism—is a mental construct. A philosophy. It has no tangible and discrete existence outside of human thought. It does not persist of its own substance or volition. It’s made up purely of thoughts and concepts. None of us can see into the depths of another person’s psyche to identify all the mental abstractions therein contained. Neither can any of us limit just how many of those abstractions they may harbor. Existing answers have named a few types that have arisen in public discourse, none of which I can contend people can hold and believe to be valid. Again, they’re all philosophies—that is, personal opinions. One answer separates them into two categories—philosophical and scientific—but they’re all, by definition, philosophical. They’re also, in my opinion, all flawed. But that’s not the main point of this answer. I will say that many of these contrivances are based on valid physical facts. And this can confuse many people into equating the resulting philosophy itself with being factual. For example, one answer speaks of “Biological determinism” and “Genetic determinism,” no doubt because what happens biologically and genetically determines many attributes and conditions that befall living organisms, and given the prerequisite behavior or states of the basic constituents of organisms these outcomes are often predictable. And both answers (as of this posting) mention “Physical determinism.” This refers to the fact that because of the laws of physics inanimate matter behaves in predictable ways. Unfortunately, people make the philosophical error of thinking these laws can affect the nonphysical—that is, the mind itself. In other answers I have explained why this is flawed thinking. Here, I’ll just say that any mentally competent person can form philosophies and give names to them. But the ideas behind them are not necessarily written on reality. There are, however, rules by which reality does operate—laws that matter and energy themselves cannot violate. The laws that govern human relationships—or spiritual laws—can be violated, yet, not without consequence. But the laws of physics can’t touch the intentions of a rational mind. Which means there’s no limit to the ways people can see things to be deterministic. But none of these are binding upon humanity. And none protrude irresistibly into the common reality.  Related: Johnnie Lockett's answer to What makes a brain do something against it's will? Johnnie Lockett's answer to Do you believe in Causal Determinism, Free Will, or Compatibilism? What is your best explanation for your belief? Johnnie Lockett's answer to If our wants determine our actions, and if we cannot choose what we want, then does this result in free will being false? Johnnie Lockett's answer to To what extent is a human life deterministic, or is it in any degree at all? Johnnie Lockett's answer to Is there any way that we can disprove that everything is predetermined? Johnnie Lockett's answer to What is the evidence for and against determinism? ",
            "date": "Answered March 28, 2019",
            "views": "207",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Avinash Suresh",
                    "user_href": "/profile/Avinash-Suresh-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sabri Shahin",
                "href": "/profile/Sabri-Shahin"
            },
            "answer_text": "God has empowered each of us to be happy and blessed. God has enabled people to choose their own destinations. God does not predetermine plans for us. God has delegated that task to us, it is up to us to be blessed or to be cursed. The message that God has revealed to all prophets is: ‘Blessings for obedience and curses for disobedience’ All prophets taught that we can earn salvation by obedience, repentance, and good deeds to help others. “In obedience and repentance is your salvation” Isaiah 30:15 Based on the above, the obedient believer should be blessed in this life and should be saved in the afterlife. That is the truth which should set you free. Prophets did not teach predestination. Jesus did not teach predestination or predetermination. The only exceptions are the teachings of Paul who was not educated by Jesus and who taught the distorted teachings of predestination, original sin, atonement, and salvation by grace without obedience to God’s law. The teachings of predestination were taught by Paul in Romans 8 , Ephesians 1, and 1 Corinthians 2:7 The distorted teachings of predestination and election of Augustine and Calvin are not based on the teachings of Jesus but are based on the wrong teachings of Paul. Jesus did not teach that a man is justified according to God’s plan or by faith without the deeds of the law; In Matthew 16:27 and John 5:29, Jesus has confirmed that God will reward each person according to his deeds; those are the basic teachings of the old testimony like the verses taught in Psalm 62:12, Ecclesiastes 12:14, and many other old testimony verses. Bad scholars do not teach the true teachings like Matthew 10:8 ‘Freely you have received; freely give’; they teach that it is o.k. to reap the financial gifts in exchange of the spiritual gifts and teach the attractive ones ‘And those he predestined, he also called; those he called, he also justified; those he justified, he also glorified’ Romans 8:30 They try to make people feel happy by such attractive teachings in order to receive more donations. “If we have sown spiritual seed among you, is it too much if we reap a material harvest from you?” 1 Corinthians 9:11. Most Christians do not follow the strict teachings like If your eye causes you to stumble, pluck it out and throw it away which is taught by Jesus in Matthew 18:9, Matthew 5:29 and Mark 9:47, but they prefer the attractive teachings of Paul like: ‘God has chosen us before the foundations of the world’ - Ephesians 1:4 ‘God hath from the beginning chosen you to salvation’ - 2 Thessalonians 2:13 ‘For God hath not appointed us to wrath, but to obtain salvation’ - 1 Thessalonians 5:9 ‘But let me reveal to you a wonderful secret. We will not all die, but we will all be transformed!’ 1 Corinthians 15:51 ‘God has saved us and called us’ - 2 Timothy 1:9 ‘we have been justified through faith’ - Romans 5:1, Romans 5:9 Most Christians do not follow the strict teachings which urge us to obey God as taught by Jesus in Matthew 22:35-40, Luke 10:25-28, Mark 12:28-34, but they prefer the attractive teachings of Paul like: ‘We are saved by grace through faith apart from works’ - Ephesians 2:8-9 ‘Even when we were dead in sins, we are saved by grace’ - Ephesians 2:5 ‘A man is justified by faith apart from the deeds of the law’ - Romans 3:28 ‘A man is not justified by the works of the law, but by faith’ - Galatians 2:16 ‘For all who rely on the works of the law are under a curse’ - Galatians 3:10 Most Christians believe that Jesus death was necessary for the forgiveness of sins. But Jesus, like all other prophets, taught that we can earn salvation by obedience, repentance, and good deeds to help others. No sacrifice is necessary for salvation. No bloodshed is necessary for salvation. No savior should die for the salvation of others; everyone is responsible for his own salvation. Jesus has confirmed the same in Matthew 18:21-35, 6:14-15, Mark 11:25-26, Matthew 25:31-45, Luke 15:11-32 , and Luke 6:36-37 https://www.quora.com/What-can-you-say-and-feel-about-Jesus-Christ-and-his-atonement/answer/Sabri-Shahin The wrong teachings about predestination, original sin, atonement, and salvation by grace without obedience to God’s law were taught by Paul who was not educated by Jesus. ",
            "date": "Answered March 28, 2019",
            "views": "117",
            "upvotes": " Answer requested by Jorgen Elven"
        }
    ]
}