{
    "title": "What are some examples of misapplications of Occam's razor? - Quora",
    "tags": [
        "Occam's Razor",
        "Logic (philosophy)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Kapitola",
                "href": "/profile/Peter-Kapitola"
            },
            "answer_text": "Bob: I keep hearing about Occam's razor, but I don't know what it is. Alice: Same. Most likely, it's just a razor owned by someone named Occam. OK, so this is a joke, but it illustrates the principle well. People often misapply Occam’s razor when they prefer the simplest theory, not the simplest theory that explains all the evidence. In this case, the fact that both Bob and Alice have heard about this razor is evidence that this razor is probably more that just some common object owned by some random person. You can only effectively apply Occam’s razor when the two theories are otherwise equal and both explain all the evidence equally well. In reality, this is rare. E.g. if you discover $100 lying on the ground, what is more likely: A: someone dropped itB: someone dropped it there to be picked up by someone later as part of a covert and illegal deal.There seems to be no reason to prefer theory B, since it involves additional entities that aren’t required to explain the situation. And it seems like a poor method of transferring money covertly if other people can stumble upon it. We know that people accidentally dropping money is relatively common. So it would be appropriate use Occam’s razor here. That doesn’t mean that B is ruled out. That’s another misapplication of Occam’s Razor. But it does mean that we can consider A more likely. However, if you found $100 placed in an envelope and stuffed into a crevice in an alleyway, the evidence is no longer equally well explained by A and B. Someone would be very unlikely to accidentally place some money there. There is now reason to suspect that someone intentionally placed the money there. So it would be a misapplication of Occam’s razor to prefer A just because it’s a simpler theory and involves fewer entities. Theory B is more likely. But beware here of another misapplication. Just because B is more likely than A, that doesn’t mean B is the most likely theory of all. Yes, it’s very likely that somebody placed the money there intentionally. But there are still other options to be considered. Perhaps: C: someone placed it there so that they could collect it later.This is a simpler option than B, since it involves fewer entities. We don’t have to introduce another party, and some sort of illicit deal. So we should not use Occam’s razor to settle on B without considering all the possibilities. But can we use Occam’s razor to prefer C over B? Again, that only works if we have no further evidence. Why not instead try and find some more evidence? Have there been illicit deals conducted in this area before? Or have people stashed cash in this area before? Given the risks of someone else finding the money, would people be more likely to meet up instead? These are all more useful questions than just blindly slashing away with Occam’s razor. Summary Occam’s razor can be misapplied in many ways: Not considering all the evidence and what is inherently more likely.Using it to definitely rule out less likely theories, which may still be true.Using it as part of a false dilemma and not considering other possible optionsSo be very careful when using it. In fact, do you really need to use it at all? There are very few real-life situations where you are presented with theories that are equally likely. In almost all cases, digging a bit deeper will provide evidence that leads you to prefer one or the other based on something more practical than just a general principle. In my experience, despite its air of intelligentsia and philosophy, it tends to be over-used by the sorts of people who don’t like thinking too much and just want to make a decision as quickly as possible. ",
            "date": "Answered July 21, 2020",
            "views": "69",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aryan Prabhudesai",
                    "user_href": "/profile/Aryan-Prabhudesai-2"
                },
                {
                    "user_id": "Chavoux Luyt",
                    "user_href": "/profile/Chavoux-Luyt"
                },
                {
                    "user_id": "Lucas Quidera",
                    "user_href": "/profile/Lucas-Quidera"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jostein Johnsen",
                "href": "/profile/Jostein-Johnsen"
            },
            "answer_text": "The typical way it is misused, a way in which it also was misused by Occam (who the principle is misnamed after), is to claim that an apparently simple and certain explanation should be favoured over a reserved judgement that asks for a more thorough investigation, or over a more specific explanation that introduces entirely needed context. The proposal here really is that the simplest explanation for an occurrence that can be formulated, will eventually found to be true. Your prejudices are correct, your hunch is the truth, and so on. And it’s simply a question of time before the evidence to support it will turn up (just look more carefully, and fit the facts around the theory). While any counter-proposal or criticism is cast as a very uncertain and untested fancy. The witch is the cause of the plague, and the black book is proof, and so on. Another way it’s misused is when one wants to dismiss the significance of an occurrence by itself. You might say that the occation of such and such an event nearby the pallet of explosives before the rapid, uncontrolled conflagration is interesting and curious. But it is not connected to the study at hand, which is a very separate and sophisticated discipline having to do with controlled detonations of highly explosive powder. Which is entirely different from this uncontrolled blast. Analytical philosophy is frequently blighted by this misfortune: “No, I can in fact not see the connection between this word I use and the similar looking word in the dictionary. How odd!”. Yet another way it’s misused is when a standard explanatory model is given, and the apparent simplicity of this model is used against any other model, even models that extend the standard model to successfully include previously unexplained data. Obviously, any explanation is going to appear more contrived than the one we uncritically assume is already true. Occam’s razor could also be used against this answer: what is more probable? That Occam’s razor is always a useful tool, and has always been, just like my arrogant teacher says? Or that this contrived philosophical sophism has validity instead? “Oh, it might be true, of course, but I’m going to trust Occam and not bother with looking into it”. A much better question to ask is when Occam’s razor can ever be trusted to actually give you the right answer. Because even though that question is possible to answer, and it is eminently possible to construct such scenarios (like explained above, and I’m assuming the other answers have a multitide of them) it is a very curious proposition to assume that you know for a fact something for so certain that it cannot be explained by an alternate, equally probable, explanation. That’s the one thing you cannot do as a philosopher, to simply claim something is unconditionally true on a simple statement. So, you escape this untenable position by only positing against a counter-argument to something established as plausible. But if you turn the principle around and look at what you’re doing, you’re really favouring a specific solution on the basis that you simply believe you have sufficient evidence to completely exhaust all other possibilities, even the ones you cannot come up with yourself, or that others might in the future. Obviously, I’m being difficult here. Occam’s razor is supposed to be a tool used for simplification. And of course prudence can be a tool for such. And it is prudent to introduce theories and arguments that are possible to survey, and that are free of elaborate obscurity that misleads or confuses. This principle of simplicity is known back to the Greeks, and through most known philosophical schools before and since. Prudence in this meaning is essential to the whole trade - one cannot introduce “pluralities” to theories when they are not needed (or more to the point, when they are not argued well for: see “analytical philosophy”). But when applying the “prudence”-principle to practical situations, the proposed claims given after the principle is applied will have an exhaustive requirement for the remaining claim that you cannot possibly meet. A frequent counter-proposal to this idea is that, well, then every conspiracy theory must be reasonable, and any excuse is equally likely as any established theory. But such theories would not qualify as a theory on the same level as proper hypothesis that can be tested. By definition, a conspiracy cannot be proven. Any contrivance that can be thought up also has the added benefit of specifically breaking any number of principles that could be used long before any use of a razor was even thought of. Literally all examples that purport to explain Occam’s razor based in forensic evidence are in actuality done away with in this way: you rule out contrived explantions because the contrivances trip people up and cause unlikely scenarios that are implausible. But an exhaustive timeline consistently wins out over the simpler narrative. And at no point will the detective say (unless we’re in the start of a terrible miscarriage of justice), that the simplest explanation with the fewest, most prudent number of relevant facts, can rule out other explanations on the basis of aesthetics. In the same way, no honest investigator - that is unless they work in the US State Department, of course - will skirt over these inconvenient details to fashion a seemingly true narrative, ready for popular consumption and delivery in 10 second sound-bites. Meaning that the only seemingly valid occurrence you could use Occam’s razor in, in a practical situation, is when you have two equally incomplete and half-unlikely explanations next to each other, and you’ve correctly pointed out that the simplest explanation seems the most difficult to rule out, on the basis that it has fewer unlikely contortions than the other groundless superstition next to it. Then when one cannot dismiss such theories any more, one is sadly left with simply the least unlikely scenario based on the evidence available to you at the moment, because you can’t really rule it out. So in that case, we finally have the answer: for all we know, God did it. Maybe. Given, of course, that you haven’t overlooked something obvious; that you need more research, but you don’t have the means to do it properly, so you’re simply guessing, or giving up, instead. Optionally, that you’re unable to structure the problem in such a way that you can avoid having to simply go with the best guess you have. Prudence in argument is in other words very different from prudence in dismissing practical theories on the basis of their lack of simplicity. Although I’m sure at least one of my philosophy-teachers would scream in anguish if they read this, I would happily propose that “Occam’s razor” should really be known as a formalisation of a very common logical error: to assume a simple explanation has more than merely aesthetic appeal, on the grounds that there might exist other more contrived and unappealing explanations for the same occurrence. ",
            "date": "Answered July 26, 2020",
            "views": "26",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lucas Quidera",
                    "user_href": "/profile/Lucas-Quidera"
                }
            ]
        }
    ]
}