{
    "title": "What concepts of physics are not counterintuitive? - Quora",
    "tags": [
        "Counterintuitive",
        "Concepts"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shiva Meucci",
                "href": "/profile/Shiva-Meucci"
            },
            "answer_text": "All of the non-magical ones. All of the practical physics that actually work and do things are not “counter-intuitive.” That phrase is just an analog to religion’s “god is just beyond human thought” that comes up whenever they assert something irrational. It’s the same line to keep you in your “humble” place. How dare you question god? …erm SCIENCE! The only things in theoretical physics that are “counter-intuitive” (read magical) have valid mathematically rigorous rational alternatives. Let’s take Bell inequalities, for instance, from Bell’s own mouth: (the thing they always use to prove their irrational blather is valid) “But in 1952 I saw the impossible done. It was in papers by David Bohm. Bohm showed explicitly how parameters could indeed be introduced, into nonrelativistic wave mechanics, with the help of which the indeterministic description could be transformed into a deterministic one. More importantly, in my opinion, the subjectivity of the orthodox version, the necessary reference to the ‘observer,’ could be eliminated… But why then had Bohm not told me of this ‘pilot wave’?... Why did von Neumann not consider it? More extraordinarily, why did people go on producing “impossibility” proofs, after 1952, and as recently as 1978?... Why is the pilot wave picture ignored in textbooks? Should it not be taught, not as the only way, but as an antidote to the prevailing complacency? To show us that vagueness, subjectivity, and indeterminism, are not forced on us by experimental facts, but by deliberate theoretical choice?” -J. S. Bell. (1987), p. 160. (emphasis mine) You’re just being misled by acolytes of magical thought. Same is true of relativity as well. There’s a mathematically equivalent version that has nothing irrational about it but you’ve never heard about it because people have more reverence for an illusionist’s trick if they don’t know how it works. Some parrot is going to pop up with “Raaagh GPS! GPS!” It’s their only single fallback and when you look with ANY depth you find out that while there are effects that would show from the perspective of the prior workable theory I mentioned (Lorentz and Poincare) the practical considerations overshadow the tiny alterations that would be made because of clock error and synchronizations. So no… it’s just a popular excuse and it’s their only one. The problem is that metaphysical assertions that are part of a culture are passed off right along real results. The two are so closely intertwined that only intense study can extricate the actual effects described from the belief systems they describe them with. There’s tons of real workable science based on prior art that extends back into the 1800s but none of the magical beliefs that have entered science since 1905 have any bearing on the real effects they are describing magically. Science that was developed entirely to describe a fluid is still used today while they assert there is no fluid. “The electromagnetic field behaves as if it were a collection of wheels, pulleys and fluids.” - James Clerk Maxwell The only magical assertions in theoretical physics: 1) In relativity: Light speed constancy is crap that casts waves - a collective action of a substances -as existing without substance and propagating at every possible speed simultaneously. Relativity exists without constancy and Einstein abandoned constancy as early as 1912 but nobody remembers, somehow. Mostly because they don’t know the historical alternative and how it works as an optical illusion with the same math. \"This is, in my opinion, not the limit of validity of the principle of relativity, but is that of the constancy of the velocity of light, and thus of our current theory of relativity.\" - Albert Einstein 2) In Quantum Mechanics: Probability as some real existing thing instead of just a behavior (see a theme here?) when tons of modern experiments and an understanding of chaos theory have blown away any possible need to explain things with probability, collapses, or other magical action at a distance. Probability is a blunt tool we use, not the underlying reality. “What we observe is not nature itself, but nature exposed to our method of questioning.” -Heisenberg “The conception of objective reality of the elementary particles has thus evaporated not into the cloud of some obscure new reality concept but into the transparent clarity of a mathematics that represents no longer the behavior of particles but rather our knowledge of this behavior .” - Werner Heisenberg That’s all that’s “counter-intuitive,” the magical belief systems. NOTHING else. They’ll try to shove their cultural belief systems and metaphysical assertions down your throat like they are inseparable from the results of experiment but they quite different. They are opinions about the results that a lot of people believe in. They are just like religion and miracles: Opinions about the reasons for real events. The events can be real while the opinions are crap and people will pretend they are one and the same. Don’t buy it. ",
            "date": "Answered September 6, 2018",
            "views": "201",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Duffield",
                    "user_href": "/profile/John-Duffield-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Duffield",
                "href": "/profile/John-Duffield-5"
            },
            "answer_text": "What concepts of physics are not counterintuitive? None of them. They’re all intuitive once you understand them. For example gravity is intuitive, once you know that the speed of light is not constant. So is mass and charge and how a magnet works. Plus other things too. Of course, some people will tell that quantum mechanics surpasseth all human understanding when it doesn’t. Or that things are counterintuitive when they’re not. Such as the ascending photon. Einstein said this in 1920: “As a simple geometric consideration shows, the curvature of light rays occurs only in spaces where the speed of light is spatially variable”. The speed of light varies. That’s why optical clocks go slower when they’re lower. Because light goes slower when it’s lower. What that means is this: the ascending photon speeds up. ",
            "date": "Answered September 21, 2018",
            "views": "73",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shambhavi Chaturvedi",
                    "user_href": "/profile/Shambhavi-Chaturvedi-7"
                }
            ]
        }
    ]
}