{
    "title": "What are some practical applications of philosophy? - Quora",
    "tags": [
        "Phronesis",
        "Best Practices",
        "Habits",
        "Philosophy",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harshal Deokar",
                "href": "/profile/Harshal-Deokar"
            },
            "answer_text": "For the scientist, specialization is a great temptation, but for the philosopher, it is a mortal sin. - Karl Popper Philosophy is generally all encompassing field. Philosophy can be termed as science of everything as in if you look at the field of study. The question is about practical applications of Philosophy. For example let’s take philosophy of Thomas Kuhn. Thomas Kuhn came up with an Philosophical proposition of “Paradigm Shift”. Paradigm shift is basically fundamental change in approach or underlying assumptions. So as to make it easy , consider you are in New York city and you have to reach one destination in New York city but you have been handed map of say Chicago and you are completely unaware about it. Will you be able to reach the desired location in New york with the map of Chicago in hand? No. Even if you try very hard , you most probably won’t reach desired location.Then how can you reach to desired location? Off-course, you need map of New york then only you can reach your destination. This is Paradigm Shift philosphy in general. Once you get the map of New york city suddenly everything gets clear and ta-daa its Paradigm Shift. Paradigm Shift has found multiple applications in field of Science itself. if you cannot prove something with the existent set of believes in Science then there is need of Paradigm shift. For example ,the transition in cosmology from a Geometric cosmology (Earth is at the center of all planets) to a Copernican one. (Sun is at the center) This was classic example of Paradigm Shift in science. As there was revelation of “Sun is at the center of all planets and all planets orbit around the Sun and not the earth”. Many things got clear to us humans and further progression of astronomy in right direction continued. Similarly Paradigm shift as a philosophical theory found applications in multiple fields, Like in medicine, the transition from \"clinical judgment\" to “evidence based mechanism” Applications of Philosophy are like this, Comprehensive and subtle but vital. ",
            "date": "Answered February 17, 2018",
            "views": "3",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Komal Chopra",
                    "user_href": "/profile/Komal-Chopra-9"
                },
                {
                    "user_id": "Waleed Qureshi",
                    "user_href": "/profile/Waleed-Qureshi-3"
                },
                {
                    "user_id": "Yevgeniy Kizhner",
                    "user_href": "/profile/Yevgeniy-Kizhner"
                },
                {
                    "user_id": "Lord Grim",
                    "user_href": "/profile/Lord-Grim-47"
                },
                {
                    "user_id": "Chhaya Jadhav",
                    "user_href": "/profile/Chhaya-Jadhav-6"
                },
                {
                    "user_id": "Harikrishnan Reghu",
                    "user_href": "/profile/Harikrishnan-Reghu"
                },
                {
                    "user_id": "Abhinav Kumar",
                    "user_href": "/profile/अभिनव-कुमार-Abhinav-Kumar-1"
                },
                {
                    "user_id": "Mugdha Talole",
                    "user_href": "/profile/Mugdha-Talole"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Leroy",
                "href": "/profile/Justin-Leroy"
            },
            "answer_text": "The ideas of the Scientific Revolution and the Enlightenment gave us most of the tools for apprehending reality.  It's tempting to try and think of \"science\" and \"philosophy\" as two distinct sources of knowledge, but that's a very presentist view.  In the 16th and 17th centuries, science and Enlightenment philosophy were both secular challenges to ecclesiastical authority and religiously-informed ways of understanding the world. Three major ideas that come from this period in philosophy are empiricism, rationalism, and materialism.  Empiricism is the idea that sense experience can be used to gain knowledge, and it's where we get the idea that you can do experiments, reliably get the same results if performed again under the same circumstances, and make knowledge claims based on those results.  Rationalism is the idea that we don't need to actually experience something to gain knowledge about it--we can use human reason to figure it out, based on what we know about other things.  For example, I don't need to stab arm to know it would bleed and hurt.  Even though I've never experienced that, I can deduce the results from other experiences.  Finally, materialism is the idea that there is no distinction between physical and spiritual matter, and thus rejects the idea that things like divine will or the soul have any influence in worldly matters.  Most of the time Marx is associated with materialism, but actually the philosopher Spinoza, writing two centuries earlier, was the first to make such claims. ",
            "date": "Answered January 16, 2011",
            "views": "66",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhinav Kumar",
                    "user_href": "/profile/अभिनव-कुमार-Abhinav-Kumar-1"
                },
                {
                    "user_id": "Kevin Fernandez",
                    "user_href": "/profile/Kevin-Fernandez-32"
                },
                {
                    "user_id": "Julie Rose de Vera",
                    "user_href": "/profile/Julie-Rose-de-Vera"
                },
                {
                    "user_id": "Alberto Montellano",
                    "user_href": "/profile/Alberto-Montellano"
                },
                {
                    "user_id": "Jane Huang",
                    "user_href": "/profile/Jane-Huang"
                },
                {
                    "user_id": "Greg Price",
                    "user_href": "/profile/Greg-Price"
                }
            ]
        }
    ]
}