{
    "title": "What are the advantages and disadvantages of restorative justice in post conflict societies? - Quora",
    "tags": [
        "Restorative Justice",
        "Justice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Junaidi Gunawan",
                "href": "/profile/Junaidi-Gunawan"
            },
            "answer_text": "Hi, I like to share my thinking in this topic. If the question here asked about current Restorative Justice (RJ) then what Marcus Troyka; Answered Feb 17, is quite correct. But from my study in Law school which I have published several writing on RJ alternatives that has the same idea of old / ancient of RJ that if it is renewed with Economic Analysis of Law (EAL) can be a powerful theory to create a just, deterrent, give certainty, and yet humane, merciful, productive. The modern RJ and current law science as a whole have a very huge weakness which is the lack of consistency in valuing the weight of penal punishment or sentencing. According to my research finding which was published in a book titled: Konsep Pemidanaan Berbasis Nilai Kerugian Ekonomi or in English: The Concept of Economic Loss Value-based Sentencing, the current criminal justice system in Indonesia, and even in Dutch and America (and possibly a lot more but need research) does not represent in its Criminal Justice (CJ) law that ensure crime does not pay or does not benefiting to the perpetrator. Hence, the problem of applying modern RJ is limited to the condition of creating an outside process of the current CJ or is called Alternate Dispute Resolution. But how you ensure justice in RJ if it is only an alternative and the major CJ operates with the possibility of lesser the weight of sentence than the outcome of RJ? That is why I also propose an alternative of the sentencing above with different point of view called: Restorative Justice Based Sentencing.docx in my academia account. I am planning to pursue this idea in my PhD course. Restorative Justice here is the idea modernizing Aristotle’s Nicomachean Ethics - Wikipedia with the modernization of John Rawls’ Theory of Justice and EAL: it is about finding the balance to restore the condition caused by a criminal act, which should be about ensuring crime does not pay (ratio legis of sentencing is meeting crime does not pay). More detail You can read from my works above. I do hope the question above about “in post conflict” is about after the Criminal Justice proceeding and finished doing the sentence. If it is then the some of the Disadvantages are: the need to restudy the weight of sentencing based on the average of economic losses the victims’ of similar case which should be calculated based on how much money economically the victims use to repair the damage;it only cover the minimum of justice which will be the average of economic loss to most victims in similar case. In order to get more the victims or their family must fight more;and some of the Advantages are: It is the only probable solution of treating the perpetrators to make them a better person by treating them in a strict, just, ensuring crime does not pay, but provide a humane way to exit the suffering or burden of penal sentencing. This way, the perpetrator is treated justly yet encourage oneself to be productive, to be able to pay the deed caused by the criminal act;As it is not using defamation or suffering the way of fixing human mental sickness but through a kind, compassionate, and loving act so in order to do that, there must be a sentencing system that is just, definite, and fair sentencing that put the weight of criminal responsibility that must meet “crime does not pay criteria” but not put the priority of defamation, suffering, hurting, or jailing in the first priority;It is also a way of developing a CJ System that put the victim back into the equation (victim oriented criminal justice system) which is better than current CJ, which will guarantee the victim will be well compensated through a system that encourage restitution from the perpetrator to the victim or through sentencing conversion which will be used by the state as the source of money to pay the victim if it is not payed partly or completely by the perpetrator in CJ proceeding;Sorry about my English, I’m writing it in translation from Indonesian. Hope it helps. ",
            "date": "Answered November 10, 2018",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marcus Troyka",
                "href": "/profile/Marcus-Troyka"
            },
            "answer_text": "Advantages: It would be perfect in every way. Disadvantages: It’s impossible and cannot exist. First of all there is no such thing as a ‘post conflict society’. Even if there were then such a society would have no need for justice. You cannot have justice without a conflict to produce injustice. Finally, restorative justice is equally impossible. If I wreck your car by crashing into it I cannot simply uncrash to restore your car to its original condition. If I murder someone I cannot simply un-murder them to bring them back to life. That is why all real justice is either punitive or restitutive. You can deter, punish, and rehabilitate a criminal, and you can extract restitutive payment from them, but you cannot reverse time to undo a crime. ",
            "date": "Answered February 16, 2018",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Anonymous7278"
                },
                {
                    "user_id": "Jude McLachlan",
                    "user_href": "/profile/Jude-McLachlan"
                },
                {
                    "user_id": "Michael Ejercito",
                    "user_href": "/profile/Michael-Ejercito"
                }
            ]
        }
    ]
}