{
    "title": "What are Descartes’ two arguments for the existence of God? - Quora",
    "tags": [
        "René Descartes",
        "Existence",
        "Theology",
        "God",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "John E Raymond",
                "href": "/profile/John-E-Raymond"
            },
            "answer_text": "Here’s a link to a good source for this: Principles of Philosophy. “Descartes gives at least two arguments for God's existence. The first one, found in I.14, is a version of the ontological argument for God's existence. Descartes' ontological argument goes as follows: (1) Our idea of God is of a perfect being, (2) it is more perfect to exist than not to exist, (3) therefore, God must exist.” Mind you that his ontological argument commits a logical fallacy in that his argument uses if A and B then C but there’s no evidence that A or B are in fact true…and for the A and B then C argument, both A and B must be true. “The second argument that Descartes gives for this conclusion is far more complex. This argument rests on the distinction between two sorts of reality. Formal reality is the reality that anything has in virtue of existing. It is just regular, garden-variety reality. Formal reality comes in three grades: infinite, finite, and mode. God is the only existing thing with infinite formal reality. Substances all have finite formal reality. Finally, modes have modal formal reality. An idea, insofar as it is considered as an occurent piece of thought, has modal formal reality (since any particular thought, as we will see later, is just a mode of mind).” “Ideas, however, also have another kind of reality, unique to them. When considered in their relation to the objects they represent, ideas can be said to have objective reality. There are three grades of objective reality, precisely mirroring the three grades of formal reality. The amount of objective reality contained in an idea is determined solely on the basis of the amount of formal reality contained in the object represented by the idea.” “Descartes begins the argument by making the controversial claim that we all have an idea of God as an infinite being. (He believes that we cannot fail to have this idea because he thinks it is innate.) Because our idea of God is of an infinite being, it must have infinite objective reality. Next, Descartes appeals to an innate logical principle: something cannot come from nothing. Reasoning from this principle he arrives at two other causal principles: (1) There must be as much reality in a cause as in an effect, and so, (2) there must be as much formal reality in a cause of an idea as there is objective reality in an idea. Since we have an idea with infinite objective reality (namely, the idea of God), Descartes is able to conclude that there is a being with infinite formal reality who caused this idea. In other words, God exists.”” First off, the second argument is quite complicated ultimately, but regardless, his conclusion is that God is the only thing that exists with infinite formal reality. Now, in his defense, science was nowhere near where it is now…but concluding that the universe itself isn’t infinite, and therefore the universe itself may well be a thing that exists with infinite formal reality. We just can’t prove it…especially given theories on multiverses and so forth. Secondly, regarding his second argument, if there is nothing else that would be part of an infinite formal reality, and there is no evidence to support it, then there is also no reason to believe there is an infinite formal reality. Thirdly, his premise that we all have an idea of God as an infinite being is flawed, because we all don’t. Lots of people don’t think of God as even existing…never mind as infinite. Fourth, he argues that something cannot come from nothing as an innate logical principle. However, that does not necessarily square with science. Great scientific minds of this era have concluded that just may be the case. Meanwhile, if god exists, then if one concludes that something cannot come from nothing, one should conclude that god, which they conclude is a thing, must have come from something as well…and you get in a circular argument. So his ultimate conclusion is because we think it’s so, it must be so. (My interpretation of his conclusion. To me…I feel that his version of objective reality more closely resembles subjective reality and his version of formal reality more closely resembles objective reality and now we’re talking semantics of texts translated from Latin…and just like translations of other works, stuff is lost in the translation. Then there’s the change in meanings of words over time such that without serious education in historical linguistics, much is lost from old texts. The bible suffers from this greatly. ",
            "date": "Answered October 9, 2020",
            "views": "35",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dirk Theurer",
                    "user_href": "/profile/Dirk-Theurer"
                },
                {
                    "user_id": "Jim Grossmann",
                    "user_href": "/profile/Jim-Grossmann"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Ruis",
                "href": "/profile/Steve-Ruis"
            },
            "answer_text": "These arguments are more than a bit lame. Descartes' ontological argument goes as follows: (1) Our idea of God is of a perfect being, (2) it is more perfect to exist than not to exist, (3) therefore, God must exist. This “proof” basically imagines his god into existence. If you flip it around if his god din’t exist, you wouldn’t be able to imagine it. Since I am able to imagine all sorts of things that don’t exist (e.g green hot dogs, leprechauns, unicorns, etc.), what is this “limitation” of my imagination based upon? His second argument is similar and can be summarized as “Since the idea of God contains the level of (objective) reality appropriate to an infinite substance it is legitimate to ask where an idea with this level of reality came from. After considering various options Descartes concludes that it must come from a substance that has at least the same level of (formal) reality. Therefore, an infinite substance, i.e. God, must exist.” Again, this is linking the idea of god being an infinite being to its existence, but of course, there is no evidence for the existence of an infinite being, this si just something we imagined, so this suffers the same flaw as the first. Descartes also made other arguments, such as: I couldn't exist as the kind of thing that has this idea of God if God didn't exist, for I didn't create myself, I haven't always existed, and, although there may be a series of causes that led to my existence, the ultimate cause must be such that it could give me the idea of God and this, for the reasons already given, will be God.This idea of God didn't come to me via the senses, nor did I invent this idea for I am plainly unable either to take away anything from it or to add anything to it. The only remaining alternative is that it is innate in me.Again, these are “proofs” based upon our ideas of god and since Descartes had an idea of god but couldn’t have had an idea of himself before he was born, then god must exist. Of course this is not the only conclusion one can come to as there is nothing in these proofs that identifies his god. If a powerful alien race came to Earth and created the human species and left us here, we couldn’t know that, so “god” could be aliens … or any other magical being that one believes in (with any sufficiently advanced technology being indistinguishable from magic). All of these devolve into “I can imagine God, so it must exist” which is about as weak an argument as anyone could make. Remember this is the guy who came up with proof of his own existence as “I think, therefore I am.” But how one can prove to another that they actually think is problematic at best. I am not a Descartes expert, merely a philosophy buff (with some formal education but mostly self-education), so you might get better answers from someone more knowledgeable. ",
            "date": "Answered October 9, 2020",
            "views": "38",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dirk Theurer",
                    "user_href": "/profile/Dirk-Theurer"
                },
                {
                    "user_id": "Steve Marck",
                    "user_href": "/profile/Steve-Marck"
                }
            ]
        }
    ]
}