{
    "title": "What can you say about the idea that we are simulations in God's computer? - Quora",
    "tags": [
        "Simulations",
        "Simulation Theory",
        "Computer Simulation",
        "Simulation",
        "The Universe",
        "Theology",
        "God",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Trafton",
                "href": "/profile/Matt-Trafton-1"
            },
            "answer_text": "First discard the notion of a god. Unless you want to consider the A.I. running the simulation god. Ok. I have written this myriad times in various ways in you tube comments under simulation theory videos yet here it goes… 1) Notable cientists, such as Neil De Grasse Tyson and Elon Musk, have stated it is at least 50/50 that we live in a simulation. Just one point 2) Look at our prevalence towards simple simulations. Verbal stories, written stories, plays, radio stories, TV & movie stories, computer games and now VR. All simulations to one degree or another. First we used our imaginations and now you can participate in a simulation in a simple way. BtW Eventually one will not be able to distinguish between reality and a VR sim. Already research is being done to link the mind with computer hardware & software. Quality video and VR simulations are olik to distinguish already. Imagine entertainment 100–300+ years in the future 3) Reincarnation. If you watch videos of legitimate interviews of young ,5+ ,children regarding their past lives you will be convinced, unless one is a diehard religious wacko, that reincarnation is real. People are rebooted/reincarnated. My dog & I were in bad car crash but, that is a whole other email and I doubt you would believe me even though there are hospital records and photos of my car to verify my claim. 4) Immortality. The bible talks of the immortal soul. People want to believe that we have one because no individual, including myself somewhat, wants to believe one is birthed–lives(oft suffering a lot)–dies and that is it. We have big egos. What if? If we are immortal think how boring it would be after several hundred years. Having done and seen everything. It could drive one mad. (I recommend the film He Never Died)The best solution for enduring immortality would be to enter a simulation in which you believe you are mortal so you experience the newness of life over & over again from many different vantage points. Perhaps to ultimately gain wisdom or some form of enlightenment. 5) It would explain the Mandela effect. Many people, including myself with some events from history, remember things differently. Some sensationalize the Mandella Effect to profit from it but, there are some valid discrepancies. I will give you one that I find quite unusual. There supposedly was an event called the Black Tom explosion on an island near NYC. Circa WWI (Look on you tube or Google it for specifics.) Neither I, nor my Stepdad, who grew up in New York, recall learning of this major historcial event. Many other learned folk with good memories do not recall it either. This could be the closest thing to evidence that we do indeed exist in a simulation. There are numerous Mandella Effects. I have other cogent theories but, I am considering writing a book on the topic so I will keep them to myself. It is not important to me that you believe me. You were in interested so… Simulation theory has as much proof of being real as the plethora of religions that people still use as a crutch or to excuse not critically thinking. Considering the average I.Q. of the world.populace it is not surprising that billions still believe in an invisible entity. Oh, there are some unexplainable observations in physics that may be proof but, I am not a scientist and can not speak on there validity. Enjoy your life/simulation and remember that this life, and past lives, influence your future lives. Karma perhaps. I am neither a Buddhist trying to validate his spiritual beliefs. Oh, split personalities and brain injuries that leave people with knowledge they never learned in their current life could also be signs of being rebooted over and over. And, don't get me started on dreams. Could be a scrambled version of all one's past simulations. Oh. And, stereotypes & stupid people could be A.I. non-people that don't exist except as societal filler within our simulation. Enjoy your holidaze.🎃🦃🎅🎉 Er Tillgivne, Matt Trafton ",
            "date": "Answered October 23, 2020",
            "views": "11",
            "upvotes": " Answer requested by Amy Potter"
        },
        {
            "author_info": {
                "name": "Timothy Paul Haines",
                "href": "/profile/Timothy-Paul-Haines"
            },
            "answer_text": "I usually say this is not a simulation, but it is less real. For instance, if we exist at smaller increments of reality, or more basic essences, then we may be more profound than just being a construct with limitations like we clearly are. If Consciousness could exist while looking at all the supposed parts of what secular science says Consciousness is, then why are we still looking beyond those things? For example, if we are just neurons, then why can we look into neurons and still keep exploring? We “see” the compounds, the molecules, the atoms, the subatomic particles, the quarks and we still keep looking. So how are we just neuronic activity? If we find ourselves, then there's a possibility that we'd stop looking. But right now, due to the cyclical stagnation of intellectual circles, we are just looking for physical explanations. Yet, the observations have to be the activity of the Observer, us, as examples of Consciousness. To question Consciousness is to basically doubt our observations. What is this Mind/Soul which can grow past its physical receptacle? Who are we to add technology to our clearly deficient physical bodies? Our Mind adds enough knowledge and technology to make us the winners of the evolutionary race. By far. We still don't have the real ‘scoop' on what our thought processes are. Are they even physical like we are lead to believe? Are we just neuronic activity, or is what we are something that might make a “artificial neuron” for Independent Artificial Intelligence that we could make within the next 2 centuries? We repurpose parts of the universe to make what has never existed before. We can use the universe to make what's in our Mind's eye. We chose to make sugary drinks and thermonuclear weapons. We desired to make what was unnecessary. Our inventions don't always make us healthier, or wiser. Then maybe we will get to the point where we will grow so that our maturation will prove that we are manipulators of something that we are greater than. Our observations are always greater than what we observed. We are greater than what we manipulate. We are on the outside looking in at this reality. Every indication is that we will become greater still. We will cure disease, change the mechanism of the economy, solve the problems of hunger and thirst and possibly reintroduce animals after we agree the population control. This will happen. If not anytime soon, then certainly within the next 500 years. We have been allowed to grow largely by ourselves. We ought to be able to see that our progress is much greater than incubator earth evolution. It might even be greater than our current dimensional state. We might even grow until our Mind/Soul creates a way to exist at the vastly more profound states of the electrical universe in which we are meant to know. When will we stop progressing? When we die, or when we find the doorway to where reality truly starts. We are still in Plato's cave. ",
            "date": "Answered October 18, 2020",
            "views": "99",
            "upvotes": " Answer requested by Amy Potter"
        }
    ]
}