{
    "title": "What are thoughts about the 'Free Will' debate happening between Sam Harris and Dan Dennett? - Quora",
    "tags": [
        "Sam Harris (author)",
        "Religion and Spirituality",
        "Free Will",
        "Debate",
        "Philosophy of Religion",
        "Neuroscience",
        "Important Life Lessons",
        "Religion",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Gerow",
                "href": "/profile/Adam-Gerow"
            },
            "answer_text": "Consider a 90% free-throw shooter missing a free throw. Could she have done otherwise?  Sense A: yes, the other nine times out of ten prove she could have done otherwise. Sense B: no, both sides agree, if you “rewind the tape” to that exact state of the universe, you always get an identical replay because cause and effect determined every outcome.Now, neither Dennett nor Harris disputes the reality of Sense A or Sense B. The first disagreement is about whether or not Sense B negates free will. Dennett is a compatibilist because he finds the potential reality of Sense B compatible with free will.  The debate then centers on two follow-up questions:  Question A: What is the average person’s sense of free will, and what is the consequence that understanding?Question B: What effect will a particular definition of free will have on society? Reactions: I find it very fitting that what appears to be an argument about metaphysics is mostly about psychology and sociology, the kind of thing that inspires people to lament philosophy as a word game (often with a misquote of Wittgenstein). Dennett, my emphasis:  [Compatibilists argue] that once you understand what free will really is (and must be, to sustain our sense of moral responsibility), you will see that free will can live comfortably with determinism — if determinism is what science eventually settles on. Once I understand what free will is? Really? You’re gonna ’splain it to me? Because you know or because you worry about “our sense of moral responsibility”? And if Harris disagrees, will you “prove” him wrong? How? By what measure? A deeply disappointing amount of anglophone philosophy pivots on generating hypotheticals that illuminate cracks in our collective, intuition-driven dictionary. I suppose we haven’t sufficient evidence for philosophers to acknowledge that meaning always bends to improvisation, and that we can subject almost any word to a scenario that brings its exact definition into question. While the possible moral repercussions of the way we define “free will” give a little more weight to this debate than say, the local epitome, “is water H2O in every possible world?”, I still can’t summon much enthusiasm for it, in part because I doubt the utility of Harris and Dennett answering Question A & B, in part because I doubt their qualifications to do so. Also, while I think Harris overstates the case and goes down avenues I find fruitless, Dennet seems to engage in willful misrepresentation. On one hand Dennett acknowledges that determinism goes in hand with cognitive illusion, (my emphasis):  Everyday folk mean something demonstrably preposterous [by “free will”], but Harris sees the effort by compatibilists to make the folks’ hopeless concept of free will presentable as somehow disingenuous, unmotivated spin-doctoring, not the project of sympathetic reconstruction the compatibilists take themselves to be engaged in. And later:      [Harris argues that] the dualism that is uncritically endorsed by many, maybe most, people is incoherent, and he is right — I’ve argued the same for decades. But then how can he object that I want to replace the folk conception of free will based on that nonsense with a better one? Yet, despite acknowledging his redefinition project, he switches to telling us “what free will really is” and what we mean by it, (my emphasis):  “could have done otherwise” is perfectly compatible with determinism, because it never means, in real life, what philosophers have imagined it means: replay exactly the same “tape” and get a different result.  BOLLOCKS! That’s exactly what it means in real life Dan!  At least some of the time. Of course, not always. And this is why the debate is ultimately useless chatter about what “they” (whomever that is) “usually mean” (however that’s defined) by “free will”, and useless conjecture about what will happen if the wrong philosophers write the definition, as if we have such knowledge. The whole thing could be summarized and put to bed, were either Dennett or Harris willing to relinquish the right to “decide how to use the term free will.” I prefer Harris’ notion, but more than that I’d prefer to resolve an annoying debate  so emblematic of mainstream distaste for anglophone philosophy, even if it means I have to use another term for “free will”. After reading this, I wished Nietzsche were here. To validate my frustrations, I got out the Ouija board and rang him. He was kind enough to appear. I’m not sure I agree, but I was glad to here from F-Niet:  How tremendous, this celebration of stupidity! Philosophers, like toddlers in a ballet class, content to run around in circles and holler through somersaults and eventually gnaw with satisfaction on their own fingers. A century and more since I hammered the last nail in the illusion of free will — and there can be no mistake, free will is dead — but rather than willing the strength to go forward, we see what precocious and petulant children philosophers are, as they resurrect the rotten corpse of free will, pretending to inquire into truth while chasing a fantasy, judged in some useless court of public opinion, as though new definitions and terms could breathe life into the rigid husk of Kant’s folly. Make no mistake, it is pretending, for the real problem — if indeed a fact can be called a “problem” — is that the death of free will makes men nervous and uncomfortable. How marvelously impotent! To hide one’s eyes from the sign and then rage against the signpost! ",
            "date": "Answered September 24, 2014",
            "views": "14",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Doug Pasnak",
                    "user_href": "/profile/Doug-Pasnak"
                },
                {
                    "user_id": "Roberto Vilar",
                    "user_href": "/profile/Roberto-Vilar"
                },
                {
                    "user_id": "Indigo Blue",
                    "user_href": "/profile/Indigo-Blue-5"
                },
                {
                    "user_id": "Jonas Muscat",
                    "user_href": "/profile/Jonas-Muscat"
                },
                {
                    "user_id": "Claus Appel",
                    "user_href": "/profile/Claus-Appel"
                },
                {
                    "user_id": "Dinesh Dharme",
                    "user_href": "/profile/Dinesh-Dharme"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Ketsdever",
                "href": "/profile/Nathan-Ketsdever"
            },
            "answer_text": "The idea that this debate is without its assumptions.  Its like two Tea Partiers debating about the welfare state--the results are nearly 100% predictable in terms of the conclusions. Compatibalism makes more sense.  I'm probably a bit more on the soft determinism side rather than compatibalism or at least the compatibalism of Dennett. I've written about my perspective on determinism vs. free will on these two threads: Nathan Ketsdever's answer to Does free will exist?Nathan Ketsdever's answer to What does the scientific community think of Sam Harris' view that we do not have free will when it comes to our thoughts?The attempt to use science and/or neuroscience to answer this question is rather limited. Science isn't meant to find agency.  Its not meant to find choice.  Its like using a hammer, when you should use a telescope or vice versa.  Its a category mistake to believe otherwise.Science only answers questions at one level.  It can't answer the question from a subjective point of view.* Crosspost from the question on compatibalism vs. determinism. ",
            "date": "Answered November 26, 2014",
            "views": "415",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Susan Hunter",
                    "user_href": "/profile/Susan-Hunter-91"
                },
                {
                    "user_id": "Roberto Vilar",
                    "user_href": "/profile/Roberto-Vilar"
                }
            ]
        }
    ]
}