{
    "title": "What are the best arguments for and against utilitarianism? - Quora",
    "tags": [
        "Utilitarianism",
        "Ethics (moral philosophy)",
        "Ethics and Morality",
        "Arguments and Argumentation",
        "Morals and Morality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Dumas",
                "href": "/profile/Christopher-Dumas"
            },
            "answer_text": "I’ve already answered the “against” aspect of this question in another answer[1] so in this one I’ll focus on the “for” aspect—after all, if I can’t steel-man the arguments of my philosophical opponents, what kind of philosopher am I? There are two main arguments for utilitarianism, which I’ll present here with short explanations of why they’re unconvincing: Equality of Consideration Nature has placed mankind under the governance of two sovereign masters, pain and pleasure. It is for them alone to point out what we ought to do, as well as to determine what we shall do. On the one hand the standard of right and wrong, on the other the chain of causes and effects, are fastened to their throne. They govern us in all we do, in all we say, in all we think: every effort we can make to throw off our subjection, will serve but to demonstrate and confirm it. In words a man may pretend to abjure their empire: but in reality he will remain subject to it all the while. The principle of utility recognizes this subjection, and assumes it for the foundation of that system, the object of which is to rear the fabric of felicity by the hands of reason and of law. Systems which attempt to question it, deal in sounds instead of sense, in caprice instead of reason, in darkness instead of light. —-Bentham, Of the Principle Of Utility This is Bentham's argument, as far as I can tell: if we each are psychological egoists (Epicurians) who desire our own pleasure (or lack of pain) most of all, then we should also consider the pleasure and pain of others. \"We all consider our own happiness, that much is obvious,\" Bentham asks, \"but through what right do we claim to deserve to be the only person for whom we consider happiness? Since all humans are equal, should not the concern for our own happiness be more fairly converted into concern for all happiness?\" This seems to draw on a form of the Kantian Universalizability Principle, which—in all fairness—has become a staple of ethical theory since he posited it; the difference is it replaces “what is permissible” with “consideration”: the principle originally said that “what is permissible for you should certainly be permissible to others, for by what right do you get to be the exception?” [Sidebar: real quote: “Act only according to that maxim by which you can at the same time will that it should become a universal law.”[2] ] The problem is that the fundamental moral equality between humans that allows the Kantian UP to apply to maxims does not work when applied to a specific internal considerations. The right by which you consider yourself over everyone else (though not necessarily to their detriment) is that you are yourself primarily—they have no hold on you and should consider themselves, and you have no hold on them either. Thus, if I am concerned about my own happiness, the universalized principle should be that I should allow others to be concerned with their own respective happiness. This does not lead to utilitarianism, but instead to a sort of \"every man for himself, just no killing\" situation, where as long as someone is alive and worrying about or pursuing their happiness, it's fine. It almost approaches Stirnerite levels of nihilism. Desirability of Utility J.S. Mill, in chapter four of his book, Utilitarianism, says: The only proof capable of being given that an object is visible, is that people actually see it. The only proof that a sound is audible, is that people hear it... In like manner, I apprehend, the sole evidence it is possible to produce that anything is desirable, is that people do actually desire it… No reason can be given why the general happiness is desirable, except that each person, so far as he believes it to be attainable, desires his own happiness… we have not only all the proof which the case admits of, but all which it is possible to require, that happiness is a good: that each person's happiness is a good to that person, and the general happiness, therefore, a good to the aggregate of all persons. [3] I can’t argue it any better than this, but I can provide a summary: essentially, like the first argument, it appeals to an obvious Truth, and then extends it; all people clearly do desire happiness—although this is debatable: since they often take hits in their short- and long- term happiness for various reasons, people seem to desire virtue or achievement as well—so what other reason should we need to think that happiness is good and desirable? Now, the jump from is to ought is a little rough here—that we ought to desire happiness—but what’s worse is the jump from each human desiring happiness for himself to each human desiring happiness for the collective as a whole such that they would sacrifice their particular happiness. How does this come about? It is entirely unclear. It’s a Good Heuristic One final reason for choosing utilitarianism is that it seems to be a better heuristic then other moral systems for producing intuitively moral solutions. Essentially, it takes our own human moral intuitions as the Word of God and tries to build a system around them. The question here is, why is intuition so important? And if you’re simply trying to piggyback on it, why not just listen to it directly, instead of adding this entire unworkable theoretical framework? Furthermore, utilitarianism is incredibly easy to “upset” and cause to produce unintuitive solutions. If you really wanted to systematize human moral intuitions, patient-centric deontology is far more accurate and predictive. Footnotes[1] Christopher Dumas's answer to What are some criticisms towards ethical utilitarianism?[2] Kantian ethics - Wikipedia[3] Utilitarianism - Wikipedia",
            "date": "Updated March 30, 2020",
            "views": "885",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lawrence Dent",
                "href": "/profile/Lawrence-Dent-3"
            },
            "answer_text": "Firstly, there are different types of Utilitarianism. These arguments apply to Jeremy Bentham’s Utilitarianism which is sometimes also referred to as Act Utilitarianism Strengths Utilitarianism represents a natural common sense approach to making ethical decisions i.e. we already naturally will make decisions that benefit our personal happiness. It is flexible and practical as it is based on the consequences of actions rather than the actions themselves i.e. it would make allowances for the person stealing food from a large supermarket chain to feed their starving family or the person killing a murderer in self defence of their own family. It requires no special wisdom and is therefore not elitist i.e. is accessible to people of all backgrounds and levels of education. If it is accepted that happiness is the “only good” then it is a virtuous moral system which will lead to virtuous decisions. Weaknesses It relies on being able to accurately predict the future (the consequences of an action) which is impossible to do consistently. Many argue that it is hedonistic (pleasure seeking) as it based on maximising an individuals personal pleasure and could therefore be viewed as selfish. The most endemic criticism is that it could be used to justify evil actions such as slavery or the torture and rape of a prisoner by a group of sadistic prison guards i.e. minority views will always be overlooked, sometimes with horrific consequences ",
            "date": "Answered June 27, 2018",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarah Al Zahrani",
                    "user_href": "/profile/Sarah-Al-Zahrani-2"
                },
                {
                    "user_id": "Scott D. Applegate",
                    "user_href": "/profile/Scott-D-Applegate"
                },
                {
                    "user_id": "Duncan Gillespie",
                    "user_href": "/profile/Duncan-Gillespie-9"
                }
            ]
        }
    ]
}