{
    "title": "What are some useful books that can help me increase my knowledge and develop my thinking? - Quora",
    "tags": [
        "Knowledge",
        "Book Recommendations",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rand Lane",
                "href": "/profile/Rand-Lane"
            },
            "answer_text": "There’s no one best book, to my knowledge, which is why i recommend reading Adler’s “How to Read a Book.” It’s actually somewhat boring, but wisely he recommends reading any book of great value three times. Otherwise all we’ll do is experience what Oprah calls “Aha moments” and keep on reading. IF we want to incorporate new information, especially new understanding, we need to review it. So i highlight passages and take notes inside the covers and reread them. In my case i also transcribe many passages that i save under various categories (currently i have over 150 categories). The one book i most often recommend at present to persons in pursuit of Truth is “Waking Up …” by Sam Harris. rand ",
            "date": "Answered July 28, 2019",
            "views": "37",
            "upvotes": " Answer requested by Jordan Hernandez",
            "upvoters": [
                {
                    "user_id": "Moncef Jdyaa",
                    "user_href": "/profile/Moncef-Jdyaa-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adrian Lee Magill",
                "href": "/profile/Adrian-Lee-Magill"
            },
            "answer_text": "I think you need to develop your question further, as most books can increase knowledge and develop thinking. What areas of knowledge are you wanting to develop? To what end do you want to develop your thinking patterns? Please be more specific. Adrian Lee Magill ",
            "date": "Answered June 16, 2017",
            "views": "72",
            "upvotes": " View 1 Upvoter "
        }
    ]
}