{
    "title": "What are the differences between spirituality, theology and philosophy? - Quora",
    "tags": [
        "Philosophy of Religion",
        "Theology",
        "Spirituality",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Artem Boytsov",
                "href": "/profile/Artem-Boytsov"
            },
            "answer_text": "Philosophy is an attempt to explain Existence from the perspective of the ego. Every ego has some sort of philosophy, and every philosophy is contradictory to some extent, hence all philosophies have internal inconsistencies. It is misleading, but taken to the extreme, any philosophy devours itself, so the only problem is that people just don’t make the effort to take their philosophies far enough. Stoicism, utilitarianism, relativism are philosophies. Religion is an attempt to describe Existence from the perspective of The Absolute, God. Even though some things it says are quite correct, it is not possible to grasp or comprehend them from the perspective of the ego, so it requires belief. Beliefs are not subject to examination, so religions are more dangerous than philosophies. One could say religion blinds you to truth by making you pretend you know it already. Buddhism, Hinduism, Christianity are religions. Spirituality is a vehicle (a toolset) to reach the point of truth when these two perspectives merge into one. As such, this point is beyond both philosophy and religion, it annihilates them both. Both are understood and both are abandoned. You don’t have to be neither philosophical, nor religious, nor spiritual to reach that point, but even then it will give you a complete understanding of both. Once this point is reached, spirituality is abandoned also. Meditation, self-inquiry are examples of spiritual methods. The most overlooked part of any religion is that it combines philosophy (an explanation) and spirituality (for example, meditation in Buddhism). Since the egoic perspective is fundamentally philosophical, most religious people cling to the explanation and the moral consequences of it (which you can also find in any philosophy), and don’t really pay much attention to the spiritual tools it offers. Some philosophies also offer spiritual tools (for example, stoicism). For one to realize the truth of one’s nature, one has to abandon all explanatory content altogether and focus exclusively on the spiritual methods and tools, but it’s easier said than done, because it gets very uncomfortable. Both philosophy and religion offer a comfortable blanket of lies, and the truth lies beyond it. ",
            "date": "Updated July 26, 2019",
            "views": "11",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jopay Ala",
                    "user_href": "/profile/Jopay-Ala"
                },
                {
                    "user_id": "Niko Mitropoulos",
                    "user_href": "/profile/Niko-Mitropoulos-1"
                },
                {
                    "user_id": "Keyla Zarte",
                    "user_href": "/profile/Keyla-Zarte"
                },
                {
                    "user_id": "Vinayagamoorthy Kuppusamy",
                    "user_href": "/profile/Vinayagamoorthy-Kuppusamy"
                },
                {
                    "user_id": "Kham Hau",
                    "user_href": "/profile/Kham-Hau"
                },
                {
                    "user_id": "Michal Ruzicka",
                    "user_href": "/profile/Michal-Ruzicka-6"
                },
                {
                    "user_id": "David Stein",
                    "user_href": "/profile/David-Stein-101"
                },
                {
                    "user_id": "Jyotsna Kaushik",
                    "user_href": "/profile/Jyotsna-Kaushik-5"
                },
                {
                    "user_id": "Conrado Caliuag",
                    "user_href": "/profile/Conrado-Caliuag"
                },
                {
                    "user_id": "Charlotte Jones",
                    "user_href": "/profile/Charlotte-Jones-459"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Emslie",
                "href": "/profile/John-Emslie-4"
            },
            "answer_text": "Good question. Made me think. I would answers this in terms of their criteria for statements of truth. Statements of spirituality are vague. They may express anything that concerns another dimension of reality or experience. They are subjective to the extent that any statement can be true or false as they relate to the personal; subjective to the extent that claims of truth are emotional, perhaps contradictory (embracing opposites) and without correspondence to anything outside of them. Looking at your question this way, I would add science, and put it at the other end of spirituality. A statement is true in science (mathematical or otherwise) to the extent that is a description of something objective or observable. (True statement of science science are like ‘verbal stand ins’ for the empirical.) In terms of the personal or subjective, a purely scientific statement will describe the subjective only in terms of what objectively corresponds to it. (For example, nothing objectively corresponds the experience of God (nothing we can agree upon); science has nothing to say) Philosophy aims to create a full model of reality. It is based in rationality and empiricism (depending on the philosophy). Statement are considered true if they can be built out of the philosophical model. The subjective is considered in its relationship to the objective. From its foundations, theology is akin to philosophy by aiming to best describe an ultimate model of reality. But theology adds one statement that it assumes from the start to be true: God exists. That God exist is an assumption of ‘faith’ and upon that all other theological statements are built. You could answer this in even more simple terms if you asked about their similarities. Similarities: spirituality, philosophy and theology all seek meaning. This is not true of science. ",
            "date": "Answered June 8, 2018",
            "views": "4",
            "upvotes": "0"
        }
    ]
}