{
    "title": "What are effective ways to communicate with someone who is deep into a confirmation bias? Is it even worth trying? - Quora",
    "tags": [
        "Confirmation Bias",
        "Communication"
    ],
    "response": [
        {
            "author_info": {
                "name": "Blake Bennett",
                "href": "/profile/Blake-Bennett-12"
            },
            "answer_text": "There's no way to tell you whether it's worth it to communicate to someone. If it's a random acquaintance on the subway who's convinced Obama is part of a secret society taking over America you should probably walk away. If it's your spouse who's convinced helicopter parenting is the only safe option then you better find a way to get through or your kid may be traumatized for life and you marriage disintegrate. But how to approach it… that's tough. Confirmation bias caries its own defense mechanism that is tough to unseat. Every fact you point out is reinterpreted to fit a worldview. Fundamentally confirmation bias starts with beliefs with the appearance of rationality tacked on. Most people address the (ir)rational explanation because it's so obviously faulty, but that's pretty universally useless. It's like playing whackamole - as soon as you kill one fantastical misrepresentation with facts and sources they find another far fetched interpretation without a hint of reflection. You will soon learn that is far less work to manufacture a myth than to disprove one. What it comes down to is this: the supporting evidence is all smoke and mirrors. Don’t shoot at smoke and mirrors. There are two good ways that I can think of to go after someone suffering confirmation. One way is to attack the belief at the core. Ignore the ‘rational’ arguments and keep digging until you hit the core value that drives the judgement and the assumptions that make it stick. Using the spouse as an example again, maybe they fear judgment from other parents and think they have to live up to a false standard. Or something happened when they were young. Or they feel like a failure and want to live vicariously. If you get to this issue, then all the crap about how the kid tried to run in the street or wants to buy alcohol or has bad taste in women melts away. Once you understand why, you can begin discussing the alternatives - how your kid has to become his own person someday and it's better he do it at home. Those arguments fall on deaf ears when the fear is rationalized as protecting from danger, but are much more clearly heard in light of the real concern. The other way is to help the person become more rational as a whole. Explain what confirmation bias really is and give examples that they would agree with. Explain the concept of falsifiability - that the possibility of disproving something is critical to knowing it is true. This is quite different from the first approach because instead of attacking the illogical ‘facts’ it goes after the illogical thinking. This approach might be more appropriate for helicopter parent if they are genuinely scared for their child's safety from highly reported stories of kidnappings and other scary situations. Until they understand rational thinking, the stastics showing how rare these events really are will have little impact. Note that in this example we still need to attack the belief if it is the important variable, but if the problem is a more general tendency to cement false conclusions by someone close to you that may not be necessary except as examples to challenge them with. All this comes with a huge grain of salt - I've never consciously applied either of these ideas in pure form and am often guilty of attacking the smoke and mirrors. But taking a step back these two approaches seem most likely to work based on what I know about confirmation bias, and looking back I've effectively used concepts from both sets in arguments. But my favorite approach is to walk away. I've long ago accepted that people love to be wrong, and redirected my energy to being right and discussing with people who can be convinced. ",
            "date": "Answered October 24, 2016",
            "views": "309",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeff Kelley",
                    "user_href": "/profile/Jeff-Kelley-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott von Laven",
                "href": "/profile/Scott-von-Laven"
            },
            "answer_text": "I like Blake’s answer. Mine tries more to address the psychology of the situation. Ask lots of questions. You need to understand what they actually believe and why. If you feel you really need to introduce an important concept/fact, try to do so in the form of a question, and just acknowledge their answer; don't jump all over them. They should do almost all of the talking. You want them to feel comfortable talking to someone who may not agree with them. That's as far as you can expect to get in a first conversation. Example 1 You: Is free college and health care for everyone economically feasible? Them: Of course, we'll tax the rich. [… a lot more of whatever is on their mind …] You: I understand your position. Let's save the math for another day. Example 2 You: Do people tend to follow the religion of their parents? Them: Yes, but plenty of people who were raised as Muslims become Christian and vice versa. [… a whole lot more of whatever is on their mind …] You: I think you are right. In fact, my religious beliefs changed several years ago. Establish common ground. Bond a little. You might learn something. Remember you have biases also. If you don't think you do, you may have trouble pursuing this exercise with sincerity. ",
            "date": "Answered October 25, 2016",
            "views": "119",
            "upvotes": " Answer requested by Jeff Kelley"
        }
    ]
}