{
    "title": "What are some relationships between epistemology and phenomenology - Quora",
    "tags": [
        "Phenomenology (philosophy)",
        "Epistemology",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kent Palmer",
                "href": "/profile/Kent-Palmer"
            },
            "answer_text": "Epistemology is the study of Knowledge.Metaphysics is the study of what there is to know. There are four disciplines that I think are crucial in Philosophy these days: Phenomenology -- Phenomena within Consciousness as it appearsHermeneutics -- Meaning and Interpretation of things appearingDialectics -- How thought works it self out in timeOntology -- The ISness of IS, What is IS? Heidegger talks about Phenomenology, Hermeneutics, and Ontology in Being and Time but does not really deal with dialectics. Gadamer in Truth and Method expands on Heidegger's bringing into play Hermeneutics. If we are going to look at the meaning of Being, then we are engaging in Hermeneutics. Heidegger wants to look at the phenomena not as Husserl does directly following Kant by assuming the subject/object dichotomy, but prior to the split between Subject/Object when all there is that is projecting Being is Dasein, being there, being-in-the-world. Heidegger gets the idea of using the World as horizon from the late Husserl in works that were never published. Phenomenology becomes the relation to the phenomena within the world by the unique type of Being that projects its own world, i.e. Dasein which it finds itself within. This is the essence of the Kantian Synthetic a priori focused in on and without all the dualisms that cloud the issue that we see in Kant and Husserl. But for Heidegger the real question is not about Being qua Being, but about the Meaning of Being, hence Hermeneutics becomes important. It is one thing to as what IS is, but another deeper question to ask what it means to have an IS, which is a uniquely Indo-European question because it is unique in having IS as an idea in the language. But as soon as we are making distinctions then dialectics comes into play, because there is movement of thought with respect to the making of distinctions. And if Heidegger is right the highest distinction we can make is between modes of Being which Heidegger makes between present-at-hand (Pure Being) and ready-to-hand (Process Being). But as soon as this distinction, which is the highest because it is a distinction in Being is made, then we realize that there must be a difference that makes a difference between Pure and Process Being, so what is that? Later Heidegger calls this Being crossed out. Derrida calls it Differance (differing and deferring), and now we have three kinds of Being when we only set out to have two, to resolve the relation between our goals and means, thinking and doing, etc. within the world. Merleau-Ponty then writes Phenomenology of Perception to show that present-at-hand is really pointing and ready-to-hand is really grasping psychologically, and then he mentions toward the end the possibility of the expansion of Being in the world, say as we learn to use a musical instrument until it becomes part of our being-in-the-world, like the case with a blindman and his stick. Suddenly we have a concrete idea of what the third kind of Being might be, and later we find that Plato recognizes it in the Timaeus. Probably the most interesting book in Continental Philosophy is the unfinished one that Merleau-Ponty was working on before he was killed in a car accident. It is the Visible and the Invisible where he defines a kind of Being beyond Hyper Being of Differance which he called Wild being, i.e. the contraction of being-in-the-world which is the complement of Hyper Being. Delueze goes on to explore that and to try to build a philosophy based on it. Now we have four kinds of being and for years I thought that was the limit that was possible until I discovered how Ultra Being could exist, and it turns out that Badiou and Zizek are attempting to build philosophies on the basis of that singularity, which Badiou calls the ultra-one, i.e. the one which first arises from multiplicity, pure heterogeneity to make plurality possible in Being and Event. So we have meta-levels of being produced as the dialectic of the distinctions between the kinds of Being plays itself out in Continental Philosophy in the last century after the second war, and it is still playing out. Ontology once we assume as Heidegger did that there is Ontological difference between Being and beings becomes complex following out the higher logical types of Russell.  But here is the strange thing. In our tradition Ontology studies Being which is supposed to perdure, i.e. to last. But in actuality Being is an illusion and it only exists as an anomaly in Indo-European languages, and it is actually Knowledge that perdures. So this whole movement of thought thinking Being is what Zizek calls an ideology, it is an illusion. What is significant is Knowledge and Foucault realizes that and translates the ideas of Being and Time into a way to think about the relation of Knowledge and Power. The place where he discusses this is The Order of Things, which is required reading for those who want to understand the evolution of Knowledge though the various epsitemes of the Western worldview. Foucault goes back and uses the genealogical method of Nietzsche as a way of unearthing the meaning of things like the Clinic, the Madhouse, Sexuality, etc. within our worldview. The idea is that we know though institutions and those institutions create power relations that control us as individuals within society. Cornelius Castoriadis calls this The Imaginary Institution of Society. Suddenly the tables are turning and we are realizing that Epistemology is deeper than Ontology. Ontology pretends to talk about universals, but the concept by which it talks about the universal is itself singular and not universal so there is a fundamental contradiction in Ontology that is unresolved, while Epistemology has no such problem, Knowledge is universal in itself and it perdures, as Being is supposed to but doesn't. Try unknowing something you know! And how do we know, though representations that aim at concepts. I came up with this formulation the other day: Knowledge is a representation formulated as a judgment that bears repeating in an appropriate situation that continues to yield meaning, significance and relevance. Wisdom is knowing when the appropriate situation for repeating the representation is, and when it is not appropriate because would not generate meaning. Phenomenology is what we experience in consciousness as we pursue data, information, knowledge, wisdom, insight, and realization. What we experience is that knowledge is not graspable, yet it comes when we need it, although we do not know what it is. We seek to acquire it but it eludes us, yet it is there as the foundation for our lives because it is the only thing that perdures in experience. We know knowledge though the emergent scopes within our tradition such as given, fact, theory, paradigm, epsiteme, ontos, existence, absolute. There can be emergent change at all these scopes of concern. Knowledge is socially constructed and is solid yet constantly changing as we learn more. And Bateson captured it well in his meta-levels of learning. Knowledge is what we learn at the various meta-levels of learning which gives our tradition its meta-stability in the face of emergent change in relation to the nihilistic background that our tradition generates. There are hundreds of thousands of papers that are produced every year, perhaps millions. But how many of those have knowledge related to the cutting edge of our tradition, so they are really relevant, significant and meaningful. We can cull though the whole lot and perhaps just find a few papers that give us real knowledge, by actually going beyond what we knew before. Most of the material that is good is rehash of what is already known, learning it again, by others. The rest is just what you have to do to make sure you keep your academic job and really has nothing to do with pushing the tradition along to the next level of the comprehension of our place in the world, or the nature of the world itself. We have myriad experts but to find someone with a comprehensive knowledge  is rare. Finding someone who is pressing on to understand things more deeply and thus gain a more profound knowledge of themselves and the nature of the world is even rarer. Knowing things about the world is Pure Knowledge. Apollo suggested Know Thyself as a maxim.  Hegel would amend that to say Know thyself though the Other. Knowing Knowledge (Process Knowledge) which is dwelling in the only thing that perdures and what our culture is based upon is extremely difficult. But knowing Knowledge knowing  itself and other (Hyper Knowledge) is what Hegel called Spirit. It is what guides reason out of the valley of death by nihilism. Yet knowing knowledge knowing the known (Wild Knowledge) is purely reflexive knowledge of self/other knowing themselves though each other. Beyond that is only the singularity of Ultra Knowledge. Like Being there are meta-levels of Knowledge, but they have yet to be explored in our tradition. There is a mountain to climb, don't wait, climb it beyond yourself into your self in order to truly follow Apollo's advice. Nietzsche tried to scale that mountain as Zarathustra. Those who scale it become \"knowers\" in the true sense of the word in all its possible depth. They are few indeed. ",
            "date": "Updated February 17, 2014",
            "views": "37",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bryer Sophia-Gardener",
                    "user_href": "/profile/Bryer-Sophia-Gardener"
                },
                {
                    "user_id": "Carla Cram",
                    "user_href": "/profile/Carla-Cram"
                },
                {
                    "user_id": "Fernando Barbosa Barros",
                    "user_href": "/profile/Fernando-Barbosa-Barros"
                },
                {
                    "user_id": "Marita Batna",
                    "user_href": "/profile/Marita-Batna"
                },
                {
                    "user_id": "Richard Rogers",
                    "user_href": "/profile/Richard-Rogers-41"
                },
                {
                    "user_id": "Anthony Nirmalraj",
                    "user_href": "/profile/Anthony-Nirmalraj"
                },
                {
                    "user_id": "Ronin Liu",
                    "user_href": "/profile/Ronin-Liu"
                },
                {
                    "user_id": "Manos Kontizas",
                    "user_href": "/profile/Manos-Kontizas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vikrant Kapoor",
                "href": "/profile/Vikrant-Kapoor"
            },
            "answer_text": "Epistemology is the study of a defined set of knowledge or justified beliefs that one has. Phenomenology is the study of conscious experiences. They are similar in saying that a set of epistemology and phenomenology is unique to each individual and cannot be general for all.  ",
            "date": "Answered September 14, 2012",
            "views": "961",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Rogers",
                    "user_href": "/profile/Richard-Rogers-41"
                },
                {
                    "user_id": "Zhansaya Badagulova",
                    "user_href": "/profile/Zhansaya-Badagulova"
                }
            ]
        }
    ]
}