{
    "title": "What are the easy and hard problems of consciousness? - Quora",
    "tags": [
        "Hard Problem of Consciousness",
        "Consciousness",
        "Problem Solving"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jimm Wetherbee",
                "href": "/profile/Jimm-Wetherbee"
            },
            "answer_text": "For a good summary of the easy problems, see: The Hard and Easy Problems in the Mind-Brain Question | Evolution News. The hard problem (which I like to think of as Kripke’s Zombies) goes something like this: Imagine a state of affairs where people act exactly as they do here, have the same brain events that we do, and in every way are indistinguishable from us, save that none of them are conscious—they have no ‘interior life as it were. They see perfectly well, but have no images; they can decipher sound but hear nothing, affirm things to be true or false but believe nothing. Is this really a hard problem? Perhaps not, but does seem to show that physical events (whether that of a body or just of a given organ) or behaviors are different descriptions from mental events and that latter cannot simply be describe by the latter. ",
            "date": "Answered April 29, 2020",
            "views": "54",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stedman Gilday",
                "href": "/profile/Stedman-Gilday"
            },
            "answer_text": "POSITIVE SIDE OF YOUR [EASY] Consciousness Love family Happy Giving Sharing Learning All that there is and can be Good “YOU,” As your POSITIVE Consciousness of All that you are, As one side of Life's living coin, <<<<<<<<<<>>>>>>>>>>>>>> Then we have Dam Life's Choices The other side of life's living coin, and your [Hard] Negative Consciousness Which we must make decisions with very little info Yet we must deal with , As Bad “YOU” You KNOW what it is , Or do you fit in category , See no evil Hear no evil I NEVER DO EVIL, If you embrah both sides of you consciousness, then you are WHOLE , A Balance Consciousness THAT BECOMES real “ YOU,” Fail and you can see it in the other lifes, around you, or even you own, ",
            "date": "Answered April 30, 2020",
            "views": "37",
            "upvotes": "0"
        }
    ]
}