{
    "title": "What are some secret things that women will never tell men? - Quora",
    "tags": [
        "Interpersonal Interaction Advice",
        "Interpersonal Interaction with Romantic Partners",
        "Relationships and Dating of Young People",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Winny George",
                "href": "/profile/Winny-George"
            },
            "answer_text": "I can tell few things which women never tend to share with men, here especially to boyfriend/husband like: Women have sex cravings but they seldom tell it out openly and expect men to normally make the first move. Women also initiate some times but not always. The other side is expected to do the initiation part more. At least this is what I know of, might differ from person to person.Every time another woman crosses your man or is present somewhere in the vicinity, there is a spark of jealousy. It is something that comes very naturally to us. I mean it's not like we have something against these women but their presence just doesn't feel so comfortable for us.Your man is your man and trust me, it is also sometimes not easy to bear the guy-friends of your man around you during 'your time' ,it is always uncomfortable. It's like a mixed emotion of jealousy plus selfishness and everything altogether. It's even worse when these so called friends are unmarried ( because that's the reason they are disturbing you…oops I mean invading your time!! :P ) No offense to bachelors but it's not easy all the time.Women tend to do a lot of experiments while cooking. The idea is to get good food in the end. They hide the fact that they put a lot of ingredients into it or maybe nothing much at all which also means not sharing the recipe and the hidden secret to getting good food. :D ok not always but sometimes for sure.Women might be watching TV or doing something in the laptop but their ears are wide open and they are actually listening to what you are talking on phone in the next room or can hear you trying to steal and eat something from the kitchen. It's not like they are into what they are doing but you know the multitasking comes into play here..Hahahahaha! So men, beware!Other than these points, there might hundred other things they hide or not say and as a matter of fact, I won't share it here since it is supposed to be hidden. Lol! :D ",
            "date": "Answered May 24, 2020",
            "views": "333",
            "upvotes": " View 100 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Milton Carlile",
                    "user_href": "/profile/Milton-Carlile"
                },
                {
                    "user_id": "Sar Montana",
                    "user_href": "/profile/Sar-Montana"
                },
                {
                    "user_id": "Greg Harris",
                    "user_href": "/profile/Greg-Harris-169"
                },
                {
                    "user_id": "Mahesh Kumar",
                    "user_href": "/profile/Mahesh-Kumar-1917"
                },
                {
                    "user_id": "Marilyn Domilski",
                    "user_href": "/profile/Marilyn-Domilski"
                },
                {
                    "user_id": "Zachary Heimann",
                    "user_href": "/profile/Zachary-Heimann"
                },
                {
                    "user_id": "Amethyst Queen",
                    "user_href": "/profile/Amethyst-Queen-6"
                },
                {
                    "user_id": "Polo TTG",
                    "user_href": "/profile/Polo-TTG"
                },
                {
                    "user_id": "Gabrielle Okorodudu",
                    "user_href": "/profile/Gabrielle-Okorodudu-2"
                },
                {
                    "user_id": "Spencer Scott",
                    "user_href": "/profile/Spencer-Scott-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vidushi Gupta",
                "href": "/profile/Vidushi-Gupta-45"
            },
            "answer_text": "Why would we let our secrets out ? :P Okay here are few - Unlike your bro code, and how even unknown guys are your bros, girls are different. Although we will gladly help a stranger girl, only our best friends are our sisters.Even we discuss about boys and sex and other things, just like men do, but in a more civilized manner. And then we act like we don't in front of guys.That we will give a sanitary pad even to a stranger girl on road if she asks for one. No girl will say no. Trust me in this.We check out each other's clothes to check they're not spoiled.We cover for each other in front of our parents all the time.Women discuss. ALL OF US ARE GUILTY. So please don't be mad at us if we told our best friend about a fight we had with our guy. Also, we know our boundaries too and know where we have to stop sharing details.Okay this is a hypocrisy by almost all women. Not matter how independent she is, she loves and always want to be pampered by that ONE MAN.We're very territorial when it comes to our guy.Although not most women say it, but even though no matter how much we love our guy, our father would always be the most important man for us. Our guy would be the second. If she's ready to leave her parents happily and willingly for you, trust me she loves you much more than you think. It's always not about the tradition.That we feel lucky when amazing men in our life shows us they care for us, eg brothers, friends, even complete strangers.If we're trying to take care of you, we're not trying to be your mother. We just love you so much that we're afraid that something bad will happen to you.His clothes and his hugs make us feel safe and happy and peaceful and complete all at the same time.That we crave for that one guy as much as he craves. It's not like girls don't care.The attention women get is both amazing and terrifying. Probably at least one guy is trying to hit on your girl, but she will not let you know, because she knows that it doesn't matter.Women stalk. If she has a crush on you, she'll stalk you like crazy on social media. If she's in love with you, she'll stalk even your friends and family. No, she's not mad. Unless she's bothering you in anyway. Sometimes she does it for fun.We really romanticize fictional characters.Sometimes it's your roughness that steal our heart. Sometimes the way you play with puppies or kids or bring flowers take our heart away.That girls get friendzoned too. Girls just don't make a big issue about it because we feel ashamed of admitting that a guy turned us down.Good girls are really not that good :PThat sometimes she fakes anger and hurt so that she could get attention and pampering.Like men uses verbal and physical action in fights with other men, women just ignore the women they don't like. So if a woman in your life ignores another woman, chances are she doesn't like her.Women doesn't dress up to impress men. Majority of it is to impress their own selves and other women too. Women like to flaunt their clothes, shoes, jewellery, men, and accessories.Probably not as much as men, but women too are competitive like hell.Women are not complex. Sometimes they act complex so as to maintain the aura of mystery interest and confusion.Nothing makes our heart break more than to see the men we love cry, i.e. our father, our man, our brother, our son. She may try to pacify you but internally she is crying and blazing with anger and thinking about destroying the things or people that brought you pain.Well these are the only points I can think of as of now :D ",
            "date": "Answered April 7, 2017",
            "views": "637",
            "upvotes": " View 370 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dipanshu Kumar",
                    "user_href": "/profile/Dipanshu-Kumar-222"
                },
                {
                    "user_id": "Chayan Das",
                    "user_href": "/profile/Chayan-Das-89"
                },
                {
                    "user_id": "Abhijit Nayyar",
                    "user_href": "/profile/Abhijit-Nayyar"
                },
                {
                    "user_id": "Amit Shukla",
                    "user_href": "/profile/Amit-Shukla-1285"
                },
                {
                    "user_id": "Teju",
                    "user_href": "/profile/Teju-70"
                },
                {
                    "user_id": "Greg Harris",
                    "user_href": "/profile/Greg-Harris-169"
                },
                {
                    "user_id": "G J Rahul",
                    "user_href": "/profile/G-J-Rahul"
                },
                {
                    "user_id": "Devam Meena",
                    "user_href": "/profile/Devam-Meena-1"
                },
                {
                    "user_id": "Vishwajeet Babbar",
                    "user_href": "/profile/Vishwajeet-Babbar"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Hearthoseok-B"
                }
            ]
        }
    ]
}