{
    "title": "What are the similarities between ethics and morals? - Quora",
    "tags": [
        "Ethics and Morality",
        "Ethics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joop Remme PhD",
                "href": "/profile/Joop-Remme-PhD"
            },
            "answer_text": "The two are often confused. The differency is simply that moralsis more practical than ethics. Ethics is typically the study of desirable behaviour and morality is the practical guidance of such behaviours. Ethics is the home of values and principles, which have to be translated in norms and rules to lead to behaviours. You can also look at the issue from the side of motivation. Values are motivating, but they need to be instrumentalized to make sense. That is done by translating them into norms, which are then applied (or not). When that application of norms is successful, the underlying value is confirmed as desirable and useful. You could say that morality is what keeps the ethics and its values alive. When translating a value into norms and thus certain behaviours is not successful, the value looses much of its strength. In short, what ethics and morals have in common is that they are placed in the same learning loop. Ethics is like a verb: it has a past tense (what have I done?), a present tense (what am I to do now?) and a future tense (what am I to aspire to?). The questions in all three tenses can only be answered when the ethics at hand is translated into morality, producing observable behaviours. ",
            "date": "Answered October 22, 2018",
            "views": "53",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Bangay",
                    "user_href": "/profile/John-Bangay"
                },
                {
                    "user_id": "Charmie Concepcion VERULA",
                    "user_href": "/profile/Charmie-Concepcion-VERULA"
                },
                {
                    "user_id": "Hanna Tsige",
                    "user_href": "/profile/Hanna-Tsige"
                },
                {
                    "user_id": "Mpapi Morare",
                    "user_href": "/profile/Mpapi-Morare"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Miller",
                "href": "/profile/David-Miller-707"
            },
            "answer_text": "What are the similarities between moral values and ethics? There are more similarities than differences. Moral values are the standards we all expect when dealing with one another. They have to do with interpersonal behaviour, and in particular with how we treat one another. Morality deals with mutual consent, bodily or psychological harm, assault, murder, deprivation of liberty, deprivation of proprietary rights (theft, extortion and the like). Those moral values are considered to be universal and can be codified as the ‘rights of man’. Added to those moral values, we have societies, particularly religious sects, that impose additional strictures on the behaviour of their members. Those ‘moral values’ fall outside the commonly accepted definition of morality. For example, some religions place ‘moral’ strictures on how and with whom we may have sexual relations that are well beyond the universal moral values of mutual consent and harmlessness. Ethics are another set of internal behavioural restrictions placed on particular societies, professions and companies in order to preserve the decorum within those societies. My medical profession once dictated that it was unethical for doctors to advertise, for instance. Not immoral, but unethical. ",
            "date": "Answered January 16, 2020",
            "views": "38",
            "upvotes": "0"
        }
    ]
}