{
    "title": "What are some counterintuitive political facts? - Quora",
    "tags": [
        "Counterintuitive",
        "Mind-Blowing Facts",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Baker",
                "href": "/profile/Daniel-Baker-37"
            },
            "answer_text": "One counterintuitive political fact is that even in a functioning democracy, a minority is often more powerful than a majority.  This is because of the phenomenon of concentrated benefits and diffuse costs. Suppose a policy will cost $300 million to implement and lead to only $50 million worth of benefits.  That would be a stupid policy, right?  But then suppose the costs will be paid by all 300 million people in America, and the benefits will accrue to only 50,000 people.  Then each ordinary American has no incentive to spend more than $1 worth of effort to oppose the policy, because that is all that the policy costs them.  But the 50,000 people who will benefit each have an incentive to spend up to $1,000 worth of effort in fighting for the policy, writing letters to Congressmen, paying for ads in favor of the policy, organizing and attending public rallies, contributing to the campaign committees of Congressmen who favor the policy, etc.  Even a perfectly honest politician, looking at his mailbox and the daily news media, thinks he sees widespread support for the policy and little if any opposition.  Hey, vote for it! ",
            "date": "Answered May 11, 2015",
            "views": "413",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Hamaoui",
                    "user_href": "/profile/David-Hamaoui"
                },
                {
                    "user_id": "Dale Deffenbaugh",
                    "user_href": "/profile/Dale-Deffenbaugh"
                },
                {
                    "user_id": "Matthew Gordon",
                    "user_href": "/profile/Matthew-Gordon-7"
                },
                {
                    "user_id": "Pontus Rudholm",
                    "user_href": "/profile/Pontus-Rudholm"
                },
                {
                    "user_id": "SirMaxSteel .",
                    "user_href": "/profile/SirMaxSteel"
                },
                {
                    "user_id": "Flying Cannonn",
                    "user_href": "/profile/Flying-Cannonn"
                },
                {
                    "user_id": "Bennett W. Nelson",
                    "user_href": "/profile/Bennett-W-Nelson"
                },
                {
                    "user_id": "Jim Winer",
                    "user_href": "/profile/Jim-Winer"
                },
                {
                    "user_id": "Walt Karas",
                    "user_href": "/profile/Walt-Karas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Habib Fanny",
                "href": "/profile/Habib-Fanny"
            },
            "answer_text": "That democracy does not necessarily translate into the enactment of policies supported by the majority. That whether a policy becomes law has more to do with how much support it garners from economic elites than it does with the will of the majority.   If I'd asked you to guess what those curves looked like without seeing any data, you might have been able to guess that economic elites held more sway in policy and law making than average citizens did. What I find surprising here are two things: 1. A policy supported by 100% of average citizens is only marginally more likely to be implemented to one supported by 0%. 2. Looking at the shape of the graph on the economic elite side, you see that not only do policies they support have a higher likelihood of being enacted, but policies they oppose are also less likely to be enacted. Not only do they get the enactment of their favored policies, but they can also prevent other citizens from getting what they want. That's truly remarkable in a democracy. ",
            "date": "Answered May 13, 2015",
            "views": "290",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Davi Silva",
                    "user_href": "/profile/Davi-Silva"
                },
                {
                    "user_id": "Bryce Vining",
                    "user_href": "/profile/Bryce-Vining"
                },
                {
                    "user_id": "Elliot Jackson",
                    "user_href": "/profile/Elliot-Jackson-7"
                },
                {
                    "user_id": "Jainil Shah",
                    "user_href": "/profile/Jainil-Shah-28"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Ed Caruthers",
                    "user_href": "/profile/Ed-Caruthers"
                }
            ]
        }
    ]
}