{
    "title": "What are the differences between Modernism and Postmodernism? - Quora",
    "tags": [
        "Postmodern Art",
        "Modernism",
        "Postmodernism",
        "Literary Analysis and Criticism",
        "Art",
        "The Arts",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jan Kaleta",
                "href": "/profile/Jan-Kaleta-1"
            },
            "answer_text": "Modernism: We know the answers to everything. We’ve got science, liberal democracy, partial capitalism, moderate Christianity, atheism, etc. We can create wealth, free women and slaves, cure disease, explore the universe. We’ve got things figured out. We will evolve to a magnificent stellar civilization and live happily in utopian societes. Obi-Wan Kenobi: That’s no moon! Next step: Giving voting rights to poor masses who vote to steal people’s money away, going into debt, printing money, waging wars all over the world, starting more wars to keep the military industrial complex happy, and did I mention printing money to pay for the welfare / warfare state? Postmodernism: Everything is extremely messed up, yet still better than before. There is no truth, all answers are equal, you can be whatever you think you can be. The great narratives are false. There is no waiting for the Doomsday, when the wicked will be judged. There is no eternal progress of humanity. We don’t need salvation.Admiral Ackbar: It’s a trap!!! Next step: Everyone’s an evil racist, especially the white male capitalist intelligent cisgendered men. Everyone’s who’s NOT white or Asian or able-bodied and mentally healthy is a good oppressed victim and must be artificially privileged by the state power. We are all the same, no difference between men and women, the race doesn’t matter, so we need diversity and gender quotas everywhere, especially hundred-headed Diversity HR departments. Not enough women in STEM fields, so we need more feminist interpretive dance graduates. The art is terrible. It is more a political provocation than art.Yeah, and we want our iPhones to still work perfectly, even if we don’t know how. I can only conclude that talk is the talk, but people compromise their principles all the time. Nobody has any principles. People don’t even know what principles are. People calling themselves Christian are nothing like Jesus, people calling themselves postmodernists are pretty damn certain about who’ a Nazi. If postmodernism was about freedom from oppressive certainty and violent authority, it already ended. Eternalism? : Jordan Peterson and other figures begin to speak how we cannot live without great narratives. We need principles, we are logical creatures, without philosophy, we sink towards animalism. We are meant to think and speak freely, we are meant to judge and to form various hierarchies other than just the hierarchy of brute power. Everyone does it, even lobsters. ",
            "date": "Answered June 5, 2018",
            "views": "5",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alex Lee",
                    "user_href": "/profile/Alex-Lee-377"
                },
                {
                    "user_id": "Aman Ale",
                    "user_href": "/profile/Aman-Ale-2"
                },
                {
                    "user_id": "Rajdeep Vijayaraj",
                    "user_href": "/profile/Rajdeep-Vijayaraj"
                },
                {
                    "user_id": "Shuan Baba",
                    "user_href": "/profile/Shuan-Baba"
                },
                {
                    "user_id": "AliMert Metin",
                    "user_href": "/profile/AliMert-Metin"
                },
                {
                    "user_id": "Justin Valles",
                    "user_href": "/profile/Justin-Valles"
                },
                {
                    "user_id": "Pulakesi Bagalakote",
                    "user_href": "/profile/Pulakesi-Bagalakote"
                },
                {
                    "user_id": "Laura R. Victoria",
                    "user_href": "/profile/Laura-R-Victoria"
                },
                {
                    "user_id": "Sundari Citra Afifah",
                    "user_href": "/profile/Sundari-Citra-Afifah"
                },
                {
                    "user_id": "Mariam Al Bouanani",
                    "user_href": "/profile/Mariam-Al-Bouanani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Engel",
                "href": "/profile/Joshua-Engel"
            },
            "answer_text": "They're both very vaguely-defined terms, so it's impossible to precisely clarify where one ends and the other begins. Basically, though: modernism is what happened to art and philosophy in the early 20th century.  It was a reaction to technology and science, against the cultural norms that had come before.  It's most clear in art, which introduced non-realistic forms of painting like impressionism.  The camera was doing the job of capturing an image, so painters began to experiment with ways that they could capture subjective senses and express emotion.  That same sensibility translated into other fields: poetry, art, psychology, music, and so on, freed from the structures that had become rigid in the 19th century. That's pretty vaguely defined, and post-modernism is even less well defined.  It's simply \"what came after modernism\".  It can be thought of as modernism taken to its logical conclusion, from an Old Master's \"this is what there is to see\" to Picasso's modernist \"this is the way I see it\" to Jackson Pollock's postmodern \"here's a blotch, see whatever the hell you want to see, now get me another drink or go the hell away\".  It's the reaction of people reacting to modernism, once it had been around for a few decades to become something to be reacted to. I associate \"postmodernism\" most closely with its philosophical expressions, trying to puzzle out the nature of \"meaning\" and discovering that in many ways meaning is more arbitrary than had previously been thought.  A painting or book or literally anything can be thought of as meaning different things to different people, possibly without limit.  This had a nihilistic effect on culture and art, and that nihilism is what people most commonly associate with \"postmodernism\" today.   That's too bad, because the point of both modernism and postmodernism had been to reconsider what we had thought of as hard-and-fast rules.  Taking it to nihilism is an abdication of thinking, rather than thought itself.  There is good work done in both modernism and postmodernism, and how you group them is (fittingly) arbitrary. ",
            "date": "Answered July 15, 2011",
            "views": "391",
            "upvotes": " View 72 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Chester",
                    "user_href": "/profile/John-Chester-30"
                },
                {
                    "user_id": "Feodora Humaira",
                    "user_href": "/profile/Feodora-Humaira"
                },
                {
                    "user_id": "Henry Brice",
                    "user_href": "/profile/Henry-Brice"
                },
                {
                    "user_id": "Jacob Ningen",
                    "user_href": "/profile/Jacob-Ningen"
                },
                {
                    "user_id": "Rajdeep Vijayaraj",
                    "user_href": "/profile/Rajdeep-Vijayaraj"
                },
                {
                    "user_id": "Jean Accoh",
                    "user_href": "/profile/Jean-Accoh"
                },
                {
                    "user_id": "Eliana Yu",
                    "user_href": "/profile/Eliana-Yu"
                },
                {
                    "user_id": "Tejas Pandhare",
                    "user_href": "/profile/Tejas-Pandhare"
                },
                {
                    "user_id": "Marti LaChance",
                    "user_href": "/profile/Marti-LaChance"
                },
                {
                    "user_id": "Jonathan Myong",
                    "user_href": "/profile/Jonathan-Myong"
                }
            ]
        }
    ]
}