{
    "title": "What comes in your mind when you hear the word power? - Quora",
    "tags": [
        "Word Associations",
        "The Mind"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pavan Raina",
                "href": "/profile/Pavan-Raina-2"
            },
            "answer_text": "What comes in mind? Intoxication feeling making people mad to run after and ruin their life. There is nothing known matter or trait which is felt or desired externally and not existing within our body and mind system. The greed of power can be achieved and spoil the sleep whereas the journey could not be the end. Thus external power may be able to give what all one can think and desire leaving the ability of available resource beyond it. Those who command power (not demand) but never use as their weapon live in joy as unending peace. If saints have experienced who have been coming at different times and different places for establishing the value of humanity do teach us about it. They call it bliss. Such people do have super natural power within but that does not attract because that could kill the bliss. On earthly plane similarly the one who is enjoying the pleasure in servicing the humanity enjoy bliss, they are powerful too with variance that can sustain life long. On this ground “what comes me in my mind” is liking wasting energy in not going a step higher where lies the goal much bigger but needs the expansion of mind. ",
            "date": "Answered January 17, 2019",
            "views": "35",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matua Mallik",
                    "user_href": "/profile/Matua-Mallik"
                },
                {
                    "user_id": "Sean Yarbrough",
                    "user_href": "/profile/Sean-Yarbrough-1"
                },
                {
                    "user_id": "Prateek Raj",
                    "user_href": "/profile/Prateek-Raj-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Werner",
                "href": "/profile/Mark-Werner-4"
            },
            "answer_text": "Well….Since we’re on Quora and since I answer a lot of questions about exercise physiology, the first thing that pops into my mind is the definition in that regard…. The ability to translate strength into movement. The ability to jump high, hit a home run…. Something like that. But there are so many other definitions…. Political power, the power derived from energy production, military power…. On and on. ",
            "date": "Answered August 25, 2016",
            "views": "17",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Xarkenzia Vae",
                    "user_href": "/profile/Xarkenzia-Vae-1"
                },
                {
                    "user_id": "Ethan Rey",
                    "user_href": "/profile/Ethan-Rey"
                },
                {
                    "user_id": "Pattie Huggins Deitrick",
                    "user_href": "/profile/Pattie-Huggins-Deitrick"
                }
            ]
        }
    ]
}