{
    "title": "What are the contributions of Greek philosophers to education today? - Quora",
    "tags": [
        "Greek Philosophers",
        "Philosophers",
        "Ancient Greece",
        "Greece",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruno Marchal",
                "href": "/profile/Bruno-Marchal"
            },
            "answer_text": "Mathematics, physics, musical theory, astronomy, philosophy and theology. (Look at the greek roots of most terms in science, they are almost all greek). The contribution of the greeks is enormous, but we have regressed a lot, especially in Theology which has not yet come back to science where it was born (for historical reasons). By many token, I would say that the greek are still in advance compared to us, despite we have made extraordinary technical improvement of Aristotle physics (which was already a regression from Plato, and some early greek inquirer (Eratosthene was already aware that Earth was round and he evaluated correctly its diameter). But above all, it is in theology that the greek was the most advanced, and (thanks god!) they did influence the major religion of today, but alas, those remains in the sphere of the argument per authority. I guess, and hope, this will change by the discovery of the Universal (Turing) Machine, which already (arguably) has a rich ad testable theology, but that is another matter … Are the greek the originator of all this? It started with Pythagorus, who was a great traveller, and they are evidences that the greeks were influenced by Asia. The Babylonians were also very advanced, since long, in science and technology. Hard to say. Now, we have been influenced, in Occident mostly by Aristotle, which I think did not understood Plato, and I think that the modern current fundamental science will bring us back to Plato, Pythagorus and immaterialism (the physical reality would only be the emerging visible part of a much simple and deep arithmetical reality. ",
            "date": "Answered February 13, 2018",
            "views": "28",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Babatunde Adeleke Moses",
                    "user_href": "/profile/Babatunde-Adeleke-Moses"
                },
                {
                    "user_id": "David Joyce",
                    "user_href": "/profile/David-Joyce-11"
                },
                {
                    "user_id": "Peter Semitekolos",
                    "user_href": "/profile/Peter-Semitekolos-2"
                },
                {
                    "user_id": "David Nyman",
                    "user_href": "/profile/David-Nyman-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Johnny Poulos",
                "href": "/profile/Johnny-Poulos"
            },
            "answer_text": "Darwin acknowledged Aristotle’s studies on the road to unfolding Evolution his works are still being studied, then we have Plato the founder of the Academy in Athens the first institution of higher learning in the world his writings too are studied at universities all over the world; the ancient Greeks knew the world was a globe, there is a clay pot with the painting of an automobile with the word automobile written on it and take a look at the ANTIKYTHERA MECHANISM on youtube a clockwork mechanism of extreme, and I mean extreme complexity; then they could calculate the circumference and radius of the Earth; as they built the partheon they had knowledge of perspective so as to slightly curve the steps and columns so that from a distance they would appear straight. We have knowledge of the philosophers who came before Socrates; there is a woman philosopher named Hypatia from the great library of Alexandria who was receiving mail simply addressed To the Philosopher an extraordinary woman; I Could go on to the Playwrights whose plays are still performed to this day or made into movies. These men and women were philosophers, mathematician, scientists etc all at the same time. Does everything have a purpose? Aristotle says yes Sartre and Camus the 20th Century philosoohers answer NO. Then there is archimedes and his Eureka moment and if you delve into Greek history, philosophy, Science, Mythology, Theatre etc you too will have lots of Eureka moments. ",
            "date": "Answered July 25, 2018",
            "views": "672",
            "upvotes": "0"
        }
    ]
}