{
    "title": "What are the differences between libertarianism and utilitarianism? - Quora",
    "tags": [
        "Utilitarianism",
        "Libertarianism (politics)",
        "Political Philosophy",
        "Ethics",
        "Philosophy",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aaron Brown",
                "href": "/profile/Aaron-Brown-165"
            },
            "answer_text": "I would say the main difference is libertarianism is a philosophy of means, while utilitarianism is a philosophy of ends. Libertarians forbid initiating violence against an innocent. Anything else you do is your own business. Your goals are your own choice. Utilitarians want to maximize the greatest good of the greatest number, but there’s nothing in the philosophy about how to do that, or whether any means are unacceptable for achieving it. It’s not clear how it applies to individual choices—is everyone supposed to work toward their own ideas of the greatest good? Or should individuals organize in groups to impose group-consensus ideas of the greatest good on everyone else? Or something else? You could be both. You could be a libertarian who chooses to work for your idea of the greatest good. You could be a utilitarian who believes leaving people alone leads to the greatest good. ",
            "date": "Updated October 14, 2020",
            "views": "13",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Murphy Barrett",
                    "user_href": "/profile/Murphy-Barrett"
                },
                {
                    "user_id": "Sam Derry",
                    "user_href": "/profile/Sam-Derry"
                },
                {
                    "user_id": "Alonso Muñoz",
                    "user_href": "/profile/Alonso-Muñoz"
                },
                {
                    "user_id": "Jacob Roach",
                    "user_href": "/profile/Jacob-Roach-5"
                },
                {
                    "user_id": "Louis Lamia",
                    "user_href": "/profile/Louis-Lamia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan Davidson",
                "href": "/profile/Ryan-Davidson-3"
            },
            "answer_text": "The crux of utilitarianism is in defining utility. But the big difference is that libertarianism revolves around the reduction of coercion, violence and fraud. Utilitarianism favors ‘the greatest good for the greatest number’ (which can be a hard thing to definitively know.) While both were forms of liberalism about 100 years ago, Utilitarianism is more amenable to collectivism and coercion in service of some greater good. ",
            "date": "Answered July 4, 2019",
            "views": "850",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Curt Howland",
                    "user_href": "/profile/Curt-Howland"
                }
            ]
        }
    ]
}