{
    "title": "What are people noticing about the consciousness shift? - Quora",
    "tags": [
        "Consciousness",
        "Neuroscience",
        "Understanding Human Behavior",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "\"Phd\" Siva",
                "href": "/profile/Phd-Siva"
            },
            "answer_text": "I think, you mean observing in “noticing”… “From an individual’s perspective, who is performing the introspective analysis, the entire spectrum of reactions can be broadly classified into either avoidable (See Figure 11) or unavoidable (See Figure 12) situations. The initial reactions, in both categories, start out between the opposite poles of attraction (love or like) and repulsion (hate or dislike) or in between (provocative, a mix of love & hate), or neither (mindless, habitual)…” More at Section 6: Quickening Evolution (TCE 25 - 29)    From my book “Understanding Creation’s Design: Theory of Consciousness Evolution”… More at my blog: www.mccrf.org (Mind Corruption Cure Research Fellowship) or Check out at Amazon.com ",
            "date": "Answered July 27, 2017",
            "views": "263",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Monie Burns",
                    "user_href": "/profile/Monie-Burns"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marc Lambert",
                "href": "/profile/Marc-Lambert-9"
            },
            "answer_text": "The increase in popularity of right wing politics and thinking would suggest a consciousness shift to more right brain use, as anxiety increases globally due to the stress of inequality and terrorism there appears to be generally more right brain use. The consciousness and energy regulator should be balanced with the whole body and focused on logical/positive brain areas this leads to equality and a more liberal but never extreme life and is reflected in politics, there are pockets of people shifting to more left brain use but we are losing the battle at the moment. Science is giving us the knowledge and tools to reduce right brain use with practices like EGMi but higher anxiety levels make practice harder, humans must overcome their evolutional brain fault and self evolve into left brain thinkers I eagerly await this shift be part of the solution not part of the problem. ",
            "date": "Answered July 28, 2017",
            "views": "49",
            "upvotes": " Answer requested by Monie Burns"
        }
    ]
}