{
    "title": "What are some criticisms of positivism? - Quora",
    "tags": [
        "Positivism (philosophy of science)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Benjamin Cain",
                "href": "/profile/Benjamin-Cain"
            },
            "answer_text": "Positivism isn’t really a live option anymore in philosophy. I don’t know of anyone who would call himself a positivist. What lives on is the attitude or the prejudice of scientism. Positivism was the idea that we can separate real knowledge from fake knowledge with a handy criterion of meaningfulness or with a theory of historical progress according to which we leave behind religion and metaphysics to give epistemic credit only to empirically well-tested statements. Positive statements, as opposed to those which are meaningless and which therefore amount to nothing, are those that can be tested or verified; in short, they were the kinds of statements made best by scientists. It turned out that this account of semantic positivity is incoherent, since the criterion of meaningfullness isn’t itself just an empirical, scientific statement, so evidently there are meaningful, nonscientific statements, as in the case of philosophy, religion, and art. Positivism was a philosophy, after all, not a scientific hypothesis. Perhaps the more interesting question is how the underlying scientism should be criticized, since scientism isn’t a theory so much as an attitude or a prejudice. How do you criticize racism when it can pop up in a million forms? Racism and other such stereotypes are based on the fallibility of all our generalizations. Technically, all generalizations are overgeneralizations, in that they’re models that necessarily simplify to be manageable. This is a pragmatic aspect of human cognition. The question is whether certain generalizations or models are more trouble than they’re worth, whether they bias us to such an extent that instead of being useful in dealing with reality, they isolate us within a self-reinforcing delusion. Racism is often one such bias and scientism is another, since scientism, the prejudice that science is the only source of knowledge or that the sciences are all-around more useful and respectable than the humanities is likely another such counterproductive bias. This attitude is comparable to philistinism, a vulgar reaction against high culture. True, that culture can often be decadent and itself delusory, but there’s likely no way of avoiding high culture altogether. Those who express scientistic or positivistic sentiments are actually engaging in philosophy, since such a bias could hardly be scientifically supported. ",
            "date": "Answered June 4, 2020",
            "views": "251",
            "upvotes": " Answer requested by N Ptiya"
        }
    ]
}