{
    "title": "What are some concise pieces of Zen Buddhist wisdom to bring peace to your soul? - Quora",
    "tags": [
        "Zen Buddhism",
        "Wisdom",
        "Soul (metaphysical entity)",
        "Peace",
        "Buddhism",
        "Spirituality",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Endran Ratnasothy",
                "href": "/profile/Endran-Ratnasothy-1"
            },
            "answer_text": "Here's one that shook me up when I came a cross it, Venerable Master Hui Neng's Poem: One day the Fifth Patriarch told his monks to express their wisdom in a poem. Whoever had true realization of his original nature (Buddha Nature) would be ordained the Sixth Patriarch. The head monk, Shen Hsiu, was the most learned, and wrote the following: The body is the wisdom-tree, The mind is a bright mirror in a stand; Take care to wipe it all the time, And allow no dust to cling. The poem was praised, but The Fifth Patriarch knew that Shen Hsiu had not yet found his original nature, on the other hand, Hui Neng couldn't even write, so someone had to write down his poem, which read: Fundamentally no wisdom-tree exists, Nor the stand of a mirror bright. Since all is empty from the beginning, Where can the dust alight The Fifth Patriarch pretended that he wasn't impressed with this poem either, but in the middle of the night he summoned Hui Neng. The Fifth Patriarch gave him the insignia of his office, the Patriarch's robe and bowl (source). Hui Neng was told to leave for the South and to hide his enlightenment and understanding until the proper time arrives for him to propagate the Dharma.  Source: I WANDERLING ",
            "date": "Answered March 17, 2019",
            "views": "207",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael J. McFadden",
                    "user_href": "/profile/Michael-J-McFadden"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Jen Burns",
                    "user_href": "/profile/Jen-Burns-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Diogo Garcia",
                "href": "/profile/Diogo-Garcia"
            },
            "answer_text": "I have seen several versions of this koan, but the message is what matters: A rich man asked Sengai to write something for the continued prosperity of his family so that it might be treasured from generation to generation. Sengai obtained a large sheet of paper and wrote: \"Father dies, son dies, grandson dies.\" The rich man became angry. \"I asked you to write something for the happiness of my family! Why do you make such a joke as this?\" \"No joke is intended,\" explained Sengai. \"If before you yourself die you son should die, this would grieve you greatly. If your grandson should pass away before your son, both of you would be broken-hearted. If your family, generation after generation, passes away in the order I have named, it will be the natural course of life. I call this real prosperity.\" Source: Zen Koans - AshidaKim.com ",
            "date": "Answered March 23, 2019",
            "views": "35",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Otavio Caixeta",
                    "user_href": "/profile/Otavio-Caixeta"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        }
    ]
}