{
    "title": "What are your thoughts on John Locke? - Quora",
    "tags": [
        "John Locke (philosopher)",
        "Philosophers",
        "Philosophy",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Faille",
                "href": "/profile/Christopher-Faille"
            },
            "answer_text": "Are you interested in Locke as a political philosopher or as an epistemologist? They might as well be two different guys who happen to have the same name — the two vectors of Lockean thought don’t intersect at all. In terms of epistemology, (the philosophical discussion of truth and knowledge), I think we have to see Locke as the man who assimilated Newtonian science into the philosophical discussion. Locke’s empiricism turns on a distinction between primary and secondary qualities, where the primary qualities are treated as objective facts and the secondary qualities as the consequence of human interaction, this possessing a subjective element. He makes THIS distinction in Newtonian fashion, The primary qualities are those that fit into Newtonian equations. The secondary qualities those that do not. Those are my only thoughts on Locke this morning. ",
            "date": "Answered August 11, 2019",
            "views": "256",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ellaine Linejan",
                    "user_href": "/profile/Ellaine-Linejan"
                },
                {
                    "user_id": "Mason Kelsey",
                    "user_href": "/profile/Mason-Kelsey-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Feigenbaum",
                "href": "/profile/James-Feigenbaum-2"
            },
            "answer_text": "John Locke was a very progressive thinker hampered by his absolute faith in the God hypothesis, which prevented him from reaching the insights that Hume and Smith reached. They, of course, pioneered classical economics, but they also laid the groundwork for modern biology. ",
            "date": "Answered July 23, 2020",
            "views": "80",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ellaine Linejan",
                    "user_href": "/profile/Ellaine-Linejan"
                }
            ]
        }
    ]
}