{
    "title": "What are some ways to develop Ne (extraverted intuition)? - Quora",
    "tags": [
        "(Ne) Extraverted Intuition",
        "Myers–Briggs",
        "Jungian Psychological Type",
        "ENTP (personality type)",
        "ENFP",
        "INFP (personality type)",
        "Intuition",
        "INTP (personality type)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Landon Leonard",
                "href": "/profile/Landon-Leonard"
            },
            "answer_text": "Well, first you must understand that intuition is more simply known by most as imagination. Introverted Intuition (NI) and Extroverted Intuition (NE) are the same at their core only polar opposites of each other regarding what they intuitively (naturally/automatically) focus on. In your imagination you can somewhat accurately look into the future and try predict what's most likely to happen, or you can use that same imagination to instead; value EVERY single idea equally instead of valuing just one path above all like NI would. Both have their pros and cons. But the point is they exercise similar mussles just in different directions not at first obvious. They are like twins in a way I suppose. But anyways; using my best understanding, this is my personal opinion: The fastest way to develope NE (everybody has everything, anybody can develop this if they have willpower…some faster then others obviously) is to first learn what an NE dominate (and therefore more developed usually) type seems to unconcously value. These NE types appear to value novelty, and excitement. And unlike the Se's, Ne's value that feeling mostly in concepts, ideas, or beliefs compared to things their senses (Se) pick up. So knowing this you should first above all try your hardest to become optimistic, excited about the future, and believe everything will be ok! Obviously this is hard at first if your not an Ne dominate type. But as an Ne dominate type I assure you; the most successful Ne types value these things at minimum. So that has to be a clue worth at least trying I would think? Inspiration, I guess a single word for what we value comes from our shared Introverted Feeling (Fi) function us Ne dom's. If that wasn't clear please criticize btw I appreciate the help articulating my thoughts. Sharing my ideas more clearly. ",
            "date": "Answered June 25, 2019",
            "views": "24",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Laura Angel",
                    "user_href": "/profile/Laura-Angel-24"
                },
                {
                    "user_id": "Ricky Talang",
                    "user_href": "/profile/Ricky-Talang"
                },
                {
                    "user_id": "Todd Jaarsma",
                    "user_href": "/profile/Todd-Jaarsma"
                },
                {
                    "user_id": "Annisa Mhrn",
                    "user_href": "/profile/Annisa-Mhrn"
                },
                {
                    "user_id": "Andrew Lau",
                    "user_href": "/profile/Andrew-Lau-157"
                },
                {
                    "user_id": "Laura Franke",
                    "user_href": "/profile/Laura-Franke-6"
                },
                {
                    "user_id": "Mikael Fant",
                    "user_href": "/profile/Mikael-Fant"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Sissons",
                "href": "/profile/Ben-Sissons-2"
            },
            "answer_text": "Operating on instinct under pressure really - brainstorming - improvisation etc. I reckon improvisational comedy / theatre is probably a very good way of aggressively developing it - to get started I would read Impro by Keith Johnstone - it’s really good and has loads of exercises. Impro ",
            "date": "Answered June 7, 2018",
            "views": "21",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ammar R. Al-Dousari",
                    "user_href": "/profile/Ammar-R-Al-Dousari"
                },
                {
                    "user_id": "Luciel Jane",
                    "user_href": "/profile/Luciel-Jane"
                },
                {
                    "user_id": "Lucas Bang",
                    "user_href": "/profile/Lucas-Bang-4"
                },
                {
                    "user_id": "Jordan Lea",
                    "user_href": "/profile/Jordan-Lea-4"
                },
                {
                    "user_id": "Texas Johnson",
                    "user_href": "/profile/Texas-Johnson-2"
                },
                {
                    "user_id": "Dana C",
                    "user_href": "/profile/Dana-C-21"
                },
                {
                    "user_id": "Rachel Bartlett",
                    "user_href": "/profile/Rachel-Bartlett-7"
                },
                {
                    "user_id": "Lorn Rupple",
                    "user_href": "/profile/Lorn-Rupple"
                },
                {
                    "user_id": "Ruby Panda",
                    "user_href": "/profile/Ruby-Panda-1"
                }
            ]
        }
    ]
}