{
    "title": "What are the philosophical foundations of spacetime theories? - Quora",
    "tags": [
        "Spacetime",
        "General Relativity",
        "Theory and Theories",
        "Theoretical Physics",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Cooper",
                "href": "/profile/David-Cooper-613"
            },
            "answer_text": "Spacetime was thought up by Minkowski, but it’s just a contrived mathematical abstraction. It’s so contrived that light reduces all the paths it takes through Spacetime to zero length, thereby making all Spacetime locations zero distance apart from all other Spacetime locations, right across the universe and all the way from the most distant past to the most distant future. So, it should not be taken seriously as a model for how the universe actually works. What it did though was produce the right numbers for many things, and it made faster progress with this than the more rational Lorentz Ether Theory which only recently caught up and which is now set to take over and dominate. The biggest problem with Spacetime theories though is that they can’t be simulated without adding a coordinating Newtonian-like time to prevent event-meshing failures, which is why all simulations have to cheat by breaking the rules of the model by including this additional forbidden component, and the real universe has to cheat in the same way. To illustrate this, here are some extracts from a couple of other posts I’ve made on this subject:- For GTR:- “When I simulate GTR without adding a coordinating Newtonian time to it, I get event-meshing failures popping up all over the place, and it’s clear from other people’s simulations that they’ve found that they have to cheat in the same way to avoid the same problem. “Here’s the gravity equivalent of the twins paradox. We have two twins who are age five. We send one straight down to a space station orbiting a black hole, and when we bring him back up, he’s six years old. But his sister is now ten. They were originally separated at Spacetime location S (start) and have been reunited at a Spacetime location F (finish). There is no time in the model other than the “time” dimension, so there is no means for the boy’s clock to have ticked more slowly than the girl’s. In a simulation (and crucially in a real universe too), we must advance them through Spacetime with neither clock ticking slow, but what happens? The boy reaches location F first, four years early. That’s an event-meshing failure: the sister cannot be there yet for him to meet unless we make his clock tick slow, but we can’t make it tick slow without bringing another kind of time in the model to coordinate the unfolding of events for different players, and that extra kind of time is banned in the model. “(There is a GTR model using a block universe with all the future already in place which is imagined to resolve this issue because it’s possible to imagine the boy taking a shorter route from S to F through time to meet up with a future part of his sister in the imaginary physics of such a static block, but such a model cannot account for the generation of that block without running that phase under different laws of physics with the very kind of coordinating time they were supposed to have eliminated the need for. Some the deny that there’s any need to create the block at all, asserting that it can simply be eternal, but that isn’t a viable solution either because it renders all the patterns of causation written through the block as fake: without running the generation phase, none of the apparent effects can ever have been caused by their apparent causes, so we’re then dealing with a model that depends on magic to account for the infinite number of coincidences required for all of that apparent causation to be there.)” And for STR:- “If we’re switching to the STR twins paradox, then let’s do it with two extra rockets which accompany the travelling twin. Rocket C accompanies twin B on the first leg of his trip, while rocket D accompanies him on his the return leg, and neither of those rockets ever accelerates. We can make twin B’s accelerations so short that he is practically accompanied by one or other of those clocks throughout the whole of his trip, his clock ticking along with theirs while they’re moving with him. We now get timings from the whole trip which tell us that timing A > timing B, but also that timing A>C+D, and this latter one is more important because it removes all the confusion that the accelerations add to things. Mathematics tells us that A can only be greater than C+D if clock C or clock D (if not both of them) ticked at a lower rate than clock A. We can’t have either of those clocks tick at a definitively lower rate than clock A though unless they are moving at a higher speed through space than clock A, and that requires an absolute frame. Is there an alternative? Sort of, but again it leads to event-meshing failures: because we aren’t allowed to have an absolute frame to make some clocks tick more slowly than others, they must all tick at the same rate, and that means that twin B will reach the reunion point (which again we can call Spacetime location F) before twin A can get there. Again, we can try to fix that by having an eternal static block universe model in which the future is already in place such that twin B can jump ahead in time to meed up with a future part of twin A, but again this breaks when we try to generate that block in order to make that causation real, at which point we have to have clock B tick at a lower rate on average than clock A, and that requires the Newtonian-like time of an absolute frame to coordinate things. Both STR and GTR are built on this same fundamental fault, both requiring simulations (and the real universe) to cheat by relying on banned features to correct the faults.” ",
            "date": "Answered July 9, 2019",
            "views": "135",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "William Ransom",
                    "user_href": "/profile/William-Ransom-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rodney Brooks",
                "href": "/profile/Rodney-Brooks-3"
            },
            "answer_text": "I can only tell you what my “philosophical” foundation is (and I consider myself a philosopher). I believe that space is the three-dimensional space we intuitively believe in, and that time is the time that we intuitively believe - the rate at which things change. Here is how I describe it in my book “Fields of Color”. (Click here to “Look Inside”.) The most challenging and non-intuitive of all the concepts in the general theory of relativity is the idea that time is part of space… Our brains can take us only so far because it is so nearly impossible to envision a dimension comprising three parts space to one part time, all interwoven like the threads in a plaid fabric. – B. Bryson (B2003, p. 125-126) Of course space-time is four-dimensional in the trivial sense that it takes four numbers to specify when and where an event takes place, but that doesn’t mean that space and time are equivalent. In QFT, as in Einstein’s theory, space and time play separate roles in accord with our natural perceptions. The idea that space-time must be viewed as a four-dimensional entity was introduced by the German mathematician Hermann Minkowski. In a speech at Cologne in 1908, he expressed this view with great eloquence: Henceforth space by itself, and time by itself are doomed to fade away into mere shadows, and only a kind of union of the two will preserve an independent reality… It is only in four dimensions that the relations here taken under consideration reveal their inner being in full simplicity, and that on a three-dimensional space forced upon us a priori they cast only a very complicated projection. — H. Minkowski (E1923, p. 75, 90) Einstein, however, did not subscribe to that view; he called it “su­perfluous erudition”. When adapting Minkowski’s mathematical formalism to describe the gravitational field, Einstein had to add the “imaginary” number i [1] to the time term. This makes the equations more compact and easier to work with, but Einstein was careful to distinguish the formal aspect of the notation from reality (emphases added): The discovery of Minkowski… was of importance for the formal develop­ment of the theory of relativity… The four-dimensional space-time con­tinuum of the theory of relativity, in its most essential formal properties, shows a pronounced relationship to the three-dimensional continuum of Euclidean geometrical space… Under these conditions, the natural laws… assume mathematical forms in which the time coordinate plays exactly the same role as the three space coordinates. — A. Einstein (E1961, p. 63) Einstein is saying that the four-dimensional notation is useful for physi­cists; it is a convenient way of handling the mathematical relationship between space evolution and time evolution that is required by special relativity. One might almost say that physicists couldn't live without it. Nevertheless, space and time are different, and I say shame on those who try to foist and force the four-dimensional concept onto the public as essential to the understanding of relativity theory.  [1] i is defined as the square root of -1. ",
            "date": "Answered July 8, 2019",
            "views": "91",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "William Mansley",
                    "user_href": "/profile/William-Mansley"
                }
            ]
        }
    ]
}