{
    "title": "What are some examples of relativism? - Quora",
    "tags": [
        "Relativism",
        "Ethics and Morality",
        "Best of X",
        "Ethics",
        "Morals and Morality",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Blu Tidwell",
                "href": "/profile/Blu-Tidwell"
            },
            "answer_text": "Relativism is the belief that something might be right for you but wrong for me. Basically it means that each person becomes his or her own god, deciding what is right and good. Some real life examples would be if someone believes stealing is ok if you are hungry, adultery is acceptable as long as you really love the other person, or it’s fine to lie as long as you are helping someone. The problem, of course, is that it changes from person to person and situation to situation. What if you were the one being stolen from? Or the spouse being cheated on? What if the lie someone told helped someone, but caused harm to you? In the end, you can basically substitute the word “selfish” in for relativism, because it is only concerned with ones own thoughts and desires. ",
            "date": "Answered February 11, 2018",
            "views": "18",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deepika Gazta",
                    "user_href": "/profile/Deepika-Gazta"
                },
                {
                    "user_id": "Snow Flakes",
                    "user_href": "/profile/Snow-Flakes-49"
                },
                {
                    "user_id": "Amazing World",
                    "user_href": "/profile/Amazing-World-366"
                },
                {
                    "user_id": "Jade Woods",
                    "user_href": "/profile/Jade-Woods-14"
                },
                {
                    "user_id": "Ronelyn Borres",
                    "user_href": "/profile/Ronelyn-Borres-1"
                },
                {
                    "user_id": "Simran Avachite",
                    "user_href": "/profile/Simran-Avachite"
                },
                {
                    "user_id": "Princess Moreno",
                    "user_href": "/profile/Princess-Moreno-2"
                },
                {
                    "user_id": "Kenya Johnson",
                    "user_href": "/profile/Kenya-Johnson"
                },
                {
                    "user_id": "Rygar Bensen",
                    "user_href": "/profile/Rygar-Bensen"
                },
                {
                    "user_id": "Victor Manuel Velazquez",
                    "user_href": "/profile/Victor-Manuel-Velazquez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gerald Crawford",
                "href": "/profile/Gerald-Crawford-12"
            },
            "answer_text": "relativism - the doctrine that knowledge, truth, and morality exist in relation to culture, society, or historical context, and are not absolute. Moral Relativism Moral relativism is the idea that there is no universal or absolute set of moral principles. It’s a version of morality that advocates “to each her own,” and those who follow it say, “Who am I to judge?” Moral relativism can be understood in several ways. Descriptive moral relativism, also known as cultural relativism, says that moral standards are culturally defined, which is generally true. Indeed, there may be a few values that seem nearly universal, such as honesty and respect, but many differences appear across cultures when people evaluate moral standards around the world. Meta-ethical moral relativism states that there are no objective grounds for preferring the moral values of one culture over another. Societies make their moral choices based on their unique beliefs, customs, and practices. And, in fact, people tend to believe that the “right” moral values are the values that exist in their own culture. Normative moral relativism is the idea that all societies should accept each other’s differing moral values, given that there are no universal moral principles. Most philosophers disagree however. For example, just because bribery is okay in some cultures doesn't mean that other cultures cannot rightfully condemn it. Moral relativism is on the opposite end of the continuum from moral absolutism, which says that there is always one right answer to any ethical question. Indeed, those who adhere to moral relativism would say, “When in Rome, do as the Romans do.” ",
            "date": "Answered April 29, 2018",
            "views": "9",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joe Andros",
                    "user_href": "/profile/Joe-Andros-1"
                },
                {
                    "user_id": "Mariel Mondano",
                    "user_href": "/profile/Mariel-Mondano"
                },
                {
                    "user_id": "Zach M",
                    "user_href": "/profile/Zach-M-2"
                },
                {
                    "user_id": "Dino Fluri",
                    "user_href": "/profile/Dino-Fluri"
                }
            ]
        }
    ]
}