{
    "title": "What are some good careers in criminal justice? - Quora",
    "tags": [
        "Job Opportunities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rosemary E Williams",
                "href": "/profile/Rosemary-E-Williams"
            },
            "answer_text": "If you graduate at the lower part of your class, have done nothing during your years in law school except attend class and take exams, don’t top the bar exam, publish nothing, don’t do moot court, you really have nothing to offer in exchange for a guaranteed job. I had my first book about the law published at the beginning of my second year. The school gave me a plaque, but more to the point, they gave me a scholarship and appointed me associate editor of the law journal (I worked full time so couldn’t be the editor). I topped several of my classes; they gave me a book each time. But I worked in the courthouse and met a lot of lawyers. While I was there, I organized the judges’ unpublished decisions and provided an index to them on the front desk. More to the point, I wrote the first set of local rules that was submitted to a committee of lawyers, who reworked them. I got a sort of “and also” mention. I renumbered the doors on our floor to match the plan of the Pentagon. I made sure we never ran out of paper (which had happened a few times). In between, I sat in on hearings and drafted rulings for the judges to review. My entire job interview was a telephone call to a brilliant woman attorney who I wanted for my teacher after law school. In law school, you learn theory. I wanted to learn practice too. She hired me during the call. I never thought to ask what the salary was. I worked very hard for her doing documentation for large, secured bank loans, and one year out of law school, she let me take my first closing alone. She never said anything much about the quality of my work, but she had the papers for that huge loan bound into two volumes and gave them to me. That said enough. Then she gave me a lot of work, but it was on quality issues and was largely self-directed. No sitting in the library researching memos - this was work directly for clients. After she was appointed to a federal court of appeals, I opened my own firm and never looked back. You get a guaranteed job by working hard and doing something in law school besides just being a passive receptacle for other people’s knowledge. Get a job in a law firm and start learning how to practice law. You’ll see it’s very different than the law learning you get in school. Write something that is published. Join moot court and help the team to a goof finish. But most of all, do something extra and meet a lot of lawyers. But never, ever ask for a guarantee. ",
            "date": "Answered July 12, 2020",
            "views": "108",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Emily Fisher",
                    "user_href": "/profile/Emily-Fisher-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cassie McManigal",
                "href": "/profile/Cassie-McManigal"
            },
            "answer_text": "Well, any job within the criminal justice system is a good place to start. One of my undergrad degrees is CJ. I also have a master’s in CJ. It will depend on if you’re looking to stay with the government or go to the private sector. I currently work as a lead dispatcher or tellecomunicator an I’m a dispatch supervisor. We handle radio traffic, coordination of units for 2 law enforcement agencies, 11 fire departments(4 staffed, 7 volunteer), an animal shelter, and Emergency Management. We are also the only PSAP(Public Service Answering Point- 911 system) for our county. I have been offered a job as an Investigator with our state Departmemt of Children and families and interviewed as a court services officer. Jobs available for CJ majors: Crime scene tech Evidence staff Crime analyst Working as special investigator for the railroads, postal service, DCF , Bureau of Alcohol and Tobacco, a multitude of other government agencies. People say say that CJ degrees are useless and you can only be a cop with it, totally not true. Some options in the private sector: Security Officer/Body Guard Internet security Private Investigator Security consultation business Alarm business(install, maintain) Insurance company investigator The degree is very versatile. Edit** WOW. I typed this on my phone originally and there were some serious typos! ***Additionally, I’ve read some more on this topic, specifically that it kind of matters what kind of Criminal Justice degree you get. Most of them that are obtained at a 4year university are based on a Criminology model where the sociology and psychology of social order/change/disorder are studied. There are other types of CJ degrees including CJ administration which deals more with the HR/Business/Management side of law enforcement and Police Services type degrees where you are taught more basic “how to be a cop” type topics. The police services type degree is sometimes seen as a stepping stone before attending the official police academy and a lot of the topics are the same. ",
            "date": "Answered December 24, 2017",
            "views": "605",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jabari Doyle",
                    "user_href": "/profile/Jabari-Doyle"
                }
            ]
        }
    ]
}