{
    "title": "What are examples of necessary truths? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Joe Andros",
                "href": "/profile/Joe-Andros-1"
            },
            "answer_text": "What are examples of necessary truths? Necessary truths are contingent truths. If this, then that. “Necessary” doesn’t necessarily mean useful, here. Only that the truth follows necessarily from the premise being true. For example, “If a claim is true, its negation cannot be true.” This principle is called “the law of the excluded middle” or something. How it’s used matters more than what it’s called, in every useful case. If the claim “Humans cannot survive without oxygen” is true, then “Humans don’t need oxygen to survive” must be false. It follows necessarily. The “middle” position: humans both don’t and do need oxygen to survive, is excluded. Trivial! Truism, they call it when it’s so obvious, maybe too obvious to mention. Tautology, when it’s true by definition, to the point you’re just restating the definition in different words. The trivially true adds nothing new. But useful to keep the exclusion in mind while reasoning, so you don’t stumble into a bungle and look like a clumsy oaf - gasping for the oxygen you forgot all about! Let’s have some examples, then shall we? You can think of some, I can think of some. Let’s just throw a bunch out there. “Life reproduces itself, therefore there is always male and female.” False! What about asexual budding, bud? What about reproduction by division? Anytime you can contradict the claimed necessary truth by showing examples where different conclusions entirely can follow from the prior truth, do it. This is called whataboutism.Kidding. It’s not called whataboutism - sometimes you’ve got to liven up these dry topics. Or: “Humans are animals, therefore it necessarily follows that humans poop.” Well we do! Again, not particularly useful. Everybody poops, it’s a truism. Also: it doesn’t follow. Because not all animals poop. In “everybody poops,” “everybody” is understood as people.“Gravity is a curvature of spacetime, therefore its effect would necessarily be observable very near very massive objects, such as the sun.” This necessary truth proved the nail in the coffin for Newtonian gravity, and sparked the ascendancy of Einstein’s view (mind you, not really - Newton’s view was right - just not so infinitely precise as it could be). Scientists saw what Einstein’s theory of gravitation implied. Saw what necessary truths flowed from it, and planned to take some observations during a solar eclipse. Bingo!That necessary truth proved useful. So useful that when NASA was gearing up all sweaty to get to the moon, they used Newton’s math not Einstein’s. Well, it was precise to an nth degree, and easier to figure. Easier means fewer mistakes; couldn’t afford any mistakes: Newton’s it was. But in the increased refinement of our view of gravity, and the further explorations it enabled, Einstein’s was still a very useful truth. How about some more trivial examples. I think, therefore I am. The logic here’s a bit biased, me I’d say I think, and I observe I think I am - but that would not be a necessary truth. Plus, sounds hesitant and dumb. The first is formulated as necessary: “therefore.” I am follows necessarily from I think. What if you’re some kind of hypothetical thinking figment, dude? But Descartes didn’t fuss on that. To him, he was like, well clearly I am thinking. Therefore I am. Not bad. If I am anything, then I am. For what it’s worth, it might be better if you didn’t slap an I think on the front of it. Check the effect: “Chicken-Brad is a true friend of mine. It is necessarily true then that Chicken-Brad is not secretly my enemy and therefore no friend at all.” That follows. It’s airtight. Excluded middle! If Chicken-Brad = friend is true, then Chicken-Brad = not friend is false! BUT: “I think Chicken-Brad is a true friend of mine. It is necessarily true then that Chicken-Brad is not secretly my enemy and therefore no friend at all.” Uh. No. Nothing about Chicken-Brad follows necessarily from you think Chicken-Brad. Which gets us to the crux. There isn’t a necessary truth unless it follows as the inevitable consequence of a prior truth. If the prior truth is in doubt, so is the consequence. Capisce? As a further general rule of logic, I don’t know how much trust you want to put in a dude called Chicken-Brad. ",
            "date": "Updated September 15, 2020",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Karl Broberg",
                "href": "/profile/Karl-Broberg"
            },
            "answer_text": "The necessary truths to ascertain any knowledge are the two laws of being: the law of noncontradiction and its corollary, the law of cause and effect or causality. If you deny these truths, you’re just talking nonsense, even when scientist do, they are talking science fiction, not science. This is the foundation of all learning and truth. All truth is God’s truth and meets at the top according to Augustine and Aquinas (two giants who probably have no peers). God is the God of truth and truth sets us free. Jesus came to bare witness of the truth and is the incarnation or personification of it. Truth is knowable and we have erred from it. The Dalai Lama said that truth is the ultimate realtity. ",
            "date": "Answered July 29, 2019",
            "views": "599",
            "upvotes": "0"
        }
    ]
}