{
    "title": "What are some common straw man arguments used by feminists? - Quora",
    "tags": [
        "Strawman Argument",
        "Pros and Cons",
        "Feminism",
        "Arguments and Argumentation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Broudy",
                "href": "/profile/Daniel-Broudy-1"
            },
            "answer_text": "Consider, first, what a straw man is. Take care to label correctly the fallacy you are deconstructing. When power is at stake, power holders sometimes hastily view any criticism as a direct assault on themselves, their position, and/or their influence. Your question hastily presupposes that all feminists put forward a particular kind of fallacy. The first weakness in the question is that it lumps all ‘feminists’ into a single category. One cannot possibly fit all feminists into this category and suggest that such an observation is valid. Your inquiry will receive more meaningful responses if ‘feminists’ were qualified in the question. Example: When small-minded people viewing the complexities of all social interactions and power structures through the lens of feminism put forward fallacious arguments about the world, what are some common examples of their arguments? Note: Your initial question is cast as a simple construction, but it seems to me that it would be better cast as a complex construction. See how the subordinate clause, which recasts ‘feminists’ with a number of qualifiers that you seem to imply, sets up the question itself. The second problem seems to be one of choice: the hasty generalization is likely to be the fallacy you’re looking for. When I hear someone, who claims to be a feminist, say, ‘Men do this or that’, I immediately conclude that I am not hearing a person of reason. Of course, sometimes, when emotions overcome reasoning, we say things that are unqualified and/or oversimplified. Lastly, if you want to assume the high ground in any argument, always attend carefully to the qualifiers necessary to the construction of a nuanced claim, proposal, or prediction. The world is a very complex place, indeed, so take care to formulate your observations in a way that reflect your own deliberations and clarity of thought. ",
            "date": "Answered December 31, 2016",
            "views": "12",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Roy James",
                    "user_href": "/profile/Roy-James-5"
                },
                {
                    "user_id": "Ruposhi Quddus",
                    "user_href": "/profile/Ruposhi-Quddus"
                },
                {
                    "user_id": "Jennifer Redwine",
                    "user_href": "/profile/Jennifer-Redwine"
                },
                {
                    "user_id": "Janey Mac",
                    "user_href": "/profile/Janey-Mac-1"
                },
                {
                    "user_id": "Richard Keys",
                    "user_href": "/profile/Richard-Keys-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jamie Scoverski",
                "href": "/profile/Jamie-Scoverski"
            },
            "answer_text": "Men’s rights activists are reactionaries. Wrong, men’s rights activism is about opposing both the old and new status quo that has been, and still is heavily gynocentric. The MHRM is not a pendulum swing.Discussing male issues in a serious manner is an attempt to derail the discussion about women’s rights. Wrong again. The reason why many men say ‘well what about us’ instead of ‘about us’ is due to the fact when many men do attempt the latter they get chastised anyways. Further exacerbating the ‘what about us’ trend is how many women’s rights advocates push their agenda on the backs of men. Look at some crazy laws feminists have pushed for in several countries and you’d get my point here.If you’re not a feminist this means you don’t care about women. Wrong yet again. It simply means that you’re not going to confine what equality means to you according to a rigid agenda. Furthermore, it also means that boys and men face serious issues that need to be taken more seriously.(Note: I’m leaving out the frequent strawman arguments I get from many feminists during my individual debates with them because they’re too variable.) ",
            "date": "Answered May 12, 2018",
            "views": "958",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Lim",
                    "user_href": "/profile/Jason-Lim-19"
                },
                {
                    "user_id": "Sri Pal",
                    "user_href": "/profile/Sri-Pal-24"
                },
                {
                    "user_id": "Jack Gere",
                    "user_href": "/profile/Jack-Gere"
                },
                {
                    "user_id": "Kevin Roberts",
                    "user_href": "/profile/Kevin-Roberts-88"
                },
                {
                    "user_id": "Brian Wulfric",
                    "user_href": "/profile/Brian-Wulfric-1"
                },
                {
                    "user_id": "Simulacrum",
                    "user_href": "/profile/Simulacrum-2"
                },
                {
                    "user_id": "Aayah Ismail",
                    "user_href": "/profile/Aayah-Ismail-2"
                },
                {
                    "user_id": "Rohit Kavathekar",
                    "user_href": "/profile/Rohit-Kavathekar"
                },
                {
                    "user_id": "David Cameron",
                    "user_href": "/profile/David-Cameron-149"
                },
                {
                    "user_id": "Nick Knight",
                    "user_href": "/profile/Nick-Knight-11"
                }
            ]
        }
    ]
}