{
    "title": "What are the similarities between religion and spirituality? - Quora",
    "tags": [
        "Spirituality of Everyday Life",
        "Spirituality",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harry Singh",
                "href": "/profile/Harry-Singh-245"
            },
            "answer_text": "Religion is based on the outer, objective reality. It is the outward expression of faith. If you belong to a religion, you have a place of worship, a congregation to participate in, hymns and songs to sing, a book to guide you in life, somewhere to introduce new life into the world, and somewhere to take your dead. It gives you an identity; a place in the community and the world. My religion is Manchester United. If fulfils almost all the requirements mentioned above. There is a place of worship; Old Trafford stadium. There are songs to sing including, ‘glory glory Man. United’. There are messiahs including the now retired Sir Alex Ferguson. There is a congregation of worldwide supporters. There is a reason to look forward to life; winning games and trophies. There is somewhere to have your ashes scattered; in and around the stadium. I could go on. Finally, there are even other people of other religions to try to convert; Arsenal, Liverpool, and Chelsea are a few of these. Spirituality is entirely internal and subjective. Subjectivity defined in this sense is, a study of the subject, in other words, yourself. You can live your religion in your head centre but to live your spirituality you have to live in your heart centre. Spirituality is all about your personal relationship with God, nature or the universe. I have spoken to many people who say they know to a greater or lesser extent, and have a personal relationship with, God. They know this for themselves but cannot explain it to anyone else. In fact, it is impossible to explain it to someone else because it is subjective and internal. I can show you gravity by throwing an apple into the air and explaining to you that every time I do this, the apple will fall back to the ground. You might not understand the theory of gravity but you know that an object thrown into the air will fall back to the ground. This is why objective science is so good; experiments can be repeated to prove the action. In spirituality, you cannot conduct experiments to prove your understanding. We have all experienced that fantastic feeling of seeing a beautiful sunset, or the emotions of falling in love, but you cannot even begin to explain the exact feeling to someone else because it is something inside and personal to you. It is the same with trying to explain your spiritual experiences; it cannot be done. Only you can know what you feel. This doesn’t mean that you cannot prove the experience to yourself. You should always be sceptical and try to discover if the feeling is just your imagination or really a meaningful experience that has actually happened to you. Test yourself and try to re-create the feelings. Test and test again until you are sure that for you the feeling is genuine. If you cannot prove it to yourself, you might still want to keep it because it makes you feel good. Spirituality is all about you. ",
            "date": "Answered June 4, 2018",
            "views": "2",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elizabeth Moore",
                    "user_href": "/profile/Elizabeth-Moore-558"
                },
                {
                    "user_id": "Elijah Lees",
                    "user_href": "/profile/Elijah-Lees"
                },
                {
                    "user_id": "Aloak Menon",
                    "user_href": "/profile/Aloak-Menon"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Holt",
                "href": "/profile/David-Holt-126"
            },
            "answer_text": "In common They both involve believing in something non tangible or proven. Differences Religion Religions generally mean that you will be judged by an entity, possibly punished when you die and definately by your peers, friends and other religious people. Others will take your cause and bibles and change them to suit their own purpose. They often use it as an excuse to cut countries to piece with wars and kill random innocent people as a method to persuade others to join their twisted views. Religious people support meny deities and all insist that theirs is the only true one. Spirituality Spirituality, these people believe in a higher purpose. They beleive that everything, person, animal and plant is connected to the universe. They respect that connection without question and admire others who also believe in even the smallest way. There are many ways to connect with spirit including meditation, which is proven to be physically an dmentally beneficial to all who practice it. They do not argue, kill or coerce others to belive in what we do or divide nations or start wars over it. Neither do they do this to those who support other faiths, we respect their choices without quesion. They do often believe in an afterlife and re-incarnation and possibly in connecting with the dead. They do not believe in killing anything deliberately. Are you really happy, I am! Wonder which one I follow? ",
            "date": "Answered June 4, 2018",
            "views": "12",
            "upvotes": "0"
        }
    ]
}