{
    "title": "What are some examples of modernism and postmodernism? - Quora",
    "tags": [
        "Postmodern Art",
        "Modernism",
        "Postmodernism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Quenneville",
                "href": "/profile/Richard-Quenneville"
            },
            "answer_text": "Modernism, Literature is self-contained, Literature is open and intertextual, Rejection of literary conventions, Metafictional, [Narrative that draws attention to its fictional status.] Postmodernism, Mixing of high- and low-brow genres, Parody of literary conventions, Metafictional What's the Difference Between Modernism and Postmodernism in Literature? by Virginia Matteo It is difficult to give a clear definition of modernism and postmodernism. It can be said that both are cultural currents that encompass a range of artistic expressions in painting, sculpture, literature, and architecture over a certain period of time (although not clearly demarcated). Modernism as certain responses to late modernity. Modernity A time period which started in the 17th century with the transition from feudalism to capitalism. It is characterised by a scientific, secular worldview and discourses of progress and rationalisation. Modernism emerged around the time of the second industrial revolution (1870-1920), which was marked by the decline of stable social classes, the beginning of professionalism, and a sense of urban alienation. Postmodernism generally refers to cultural phenomena with certain characteristics that emerged after the Second World War. When exactly postmodernism starts vary according to national contexts and individual critics. Postmodernity The period after modernity. Some critics argue it started after WW2, whereas others situate its beginning in the 1980s or even 1990s. The boundary between modernism and postmodernism in many cases is fuzzy. There was some programmatic disavowal of modernism on the part of postmodern writers, and yet postmodernism continued with and developed some modern ideas and techniques. Whether postmodernism should be seen as a definite break with modernism or its continuation is a matter of ongoing critical debate.” Modernism, Adheres to Western hegemonic values, Focus on the writer, Focus on interiority, Alienation, Unreliable narrator, Rejection of realism, Literature is self-contained, High-brow genres, Rejection of literary conventions, Metafictional, Idiosyncratic language Postmodernism, Contests Western hegemonic values, Focus on the reader, Focus on exteriority, Collective voices, Ironic narrator, Ambivalence towards realism, Literature is open and intertextual, Mixing of high- and low-brow genres, Parody of literary conventions, Metafictional, Simple language.{“ What's the Difference Between Modernism and Postmodernism in Literature? [SEE THIS SITE FOR MORE INFORMATION] EXAMPLES OF MODERNISM IN ART PAINTING ARE THE PAINTINGS OF PAUL CEZANNE. AN EXAMPLES OF POSTMODERNISM IN ARCHITECTURE IS the Portland Building, in Portland, Oregon. An example of postmodern architecture. iN ART WE SEE THE JUXTAPOSITION OF OLD AND NEW, AS A REACTION AGAINST MODERNISM. ",
            "date": "Answered August 30, 2020",
            "views": "174",
            "upvotes": " Answer requested by Mahfuza Rahman",
            "upvoters": [
                {
                    "user_id": "Esther Randall",
                    "user_href": "/profile/Esther-Randall-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas L. Johnson",
                "href": "/profile/Thomas-L-Johnson-1"
            },
            "answer_text": "Virtually every discipline has examples of modernism versus postmodernism. As someone who studied literature, I remember reading James Joyce’s Ulysses and memorizing T.S. Eliot’s The Love Song of J. Alfred Prufrock as examples of high modernism. In the post-modern era, the reflexivity of authors like John Barth, Lost in the Funhouse, or Thomas Pynchon’s Gravity’s Rainbow, or Robert Coover’s The Public Burning or my favorite, Pricksongs and Descants have been widely considered as postmodernist classics. Movies are even easier to characterize as modernist or postmodern. The movies of a Fellini or Ingmar Bergman or Michelangelo Antonioni are clearly modernist in their exploration of modern ideas like existential anxiety or the themes of modern secular existence. When you get to directors like Quentin Tarantino, particularly in a movie like Pulp Fiction, you are dealing with a self-reflexive type of film-making that eschew modernist techniques like linearity or internal consistency. My favorite postmodern film in Run, Lola, Run by German director Thomas Tykwer. It features three different versions of the same story, changed each time by some circumstance that changes the entire story. ",
            "date": "Answered September 4, 2020",
            "views": "168",
            "upvotes": " View 1 Upvoter"
        }
    ]
}