{
    "title": "What are your thoughts on Michel Foucault theories? - Quora",
    "tags": [
        "Michel Foucault (author, philosopher)",
        "Theory and Theories"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jay Pee",
                "href": "/profile/Jay-Pee-10"
            },
            "answer_text": "You asked me to answer this question for you. And I want to. I want to sit down with you and tell you what I think about Foucault. Why he is the most relevant thinker, especially today. I want to show you why he was not a structuralist, not a post modernist and why he should not be grouped with Derrida. I want to show you why Camille Paglia is wrong about him. I want to rant about academics whose understanding of Foucault is beyond stupid. I want to show you the elegance of his discourse, the beauty of his evisceration of Chomsky. I want to go back to the original Foucauldians like Halperin. I want to get apoplectic with frustration at the stupid answer given before me to this question. I want to quote Foucault to you. I don't have the time. But I will say this : I think many people read about Foucault, few read him. I'm watching, somewhat slowly, because it's so profound, that famous debate between Chomsky and Foucault. It's very sad that Foucault is dead and we are left with Chomsky. It's wonderful to see Foucault ask rhetorical questions that, after 40 years make him appear almost psychic. Mostly it's just wonderful to actually watch Foucault think, respond and say what he thinks. Foucault makes such obvious sense. Unlike Derrida who is incomprehensible, Foucault is so relevant it's astonishing.There is, I think, a sort of beauty in Foucault here. And I mean beauty, in it's most subjective sense. His responses are elegant and precise. He never argues. He never justifies. He never interrupts. Yet every single comment is profound today. It's so beautiful. I never saw it as beautiful before. I watched it decades ago. Then, it was clever. Now, now it's beautiful. It's breathtakingly beautiful. It is, I think, his great contribution that he never says what he thinks. He says ' there are 2 possibilities and this one is my favorite.' He is preoccupied, in my view, less with his correctness, and more with why others are so sure. He does not know the answer, but he sees the question. And he questions even the question. And right there, he kills your confidence. For me Foucault is a port in a storm in a world that knows everything, where I reside and daily am sure of nothing other than what I believed yesterday was wrong. \" It sounded like the truth, it seemed a better way, it sounded like the truth, but it's not the truth today.\" I also get his humour… It is because of Foucault that I eat Kentucky Fried Chicken with joy. When people say how can you eat that, it's bad for you, I hear his voice. I hear it clear. It says ' I am unsure how interesting it would be to attempt an interrogation of this idea that is currently known as nutrition.' Touche… ",
            "date": "Answered October 23, 2017",
            "views": "629",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gavin Rudman",
                    "user_href": "/profile/Gavin-Rudman-1"
                },
                {
                    "user_id": "Sandra Brijit Sunny",
                    "user_href": "/profile/Sandra-Brijit-Sunny"
                },
                {
                    "user_id": "Hannes Erkan Yilmaz",
                    "user_href": "/profile/Hannes-Erkan-Yilmaz"
                },
                {
                    "user_id": "Engin Erdoğan",
                    "user_href": "/profile/Engin-Erdoğan-1"
                },
                {
                    "user_id": "Cynthia Mehboob",
                    "user_href": "/profile/Cynthia-Mehboob"
                },
                {
                    "user_id": "Rafael Saltori",
                    "user_href": "/profile/Rafael-Saltori"
                },
                {
                    "user_id": "Christian Benesch",
                    "user_href": "/profile/Christian-Benesch-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Asiner",
                "href": "/profile/Martin-Asiner"
            },
            "answer_text": "Foucault believes that power for the sake of power is the impetus that drives and shapes human interaction. Whatever this human interaction may be--from idle chitchat to academic conferences to romantic relations--if one digs deeply enough, he insists that the real motivation that charges the relation with vitality is nothing less than the need of one party to exercise power over the other. Yet, such a one-dimensional view of the multiplicity of reasons that saturate a relationship that holds that only power is the driving cause is to mask the complexity of human social intercourse with a deceiving patina of simplicity. Perhaps in the millennia before civilization could leaven the need for human beings to relate only on the level of brute nature such a view of power may have been valid. But as humanity diverged from its atavistic origins, people undoubtedly learned of other more socially useful means to interact that did not involve a clubbing on the head. If it were literally true that today power is used in the same domineering sense as in ages past, then the only overriding concern would be who does the bashing and who gets bashed. In the mental universe of Michel Foucault the practitioners of power today have not changed in the slightest from their earliest forebears. For him, such a practitioner today is exemplified by Orwell's 1984, in which O'Brien tells a crushed Winston Smith that power exists only to be used to crush others. Nothing else matters. One major issue that critics have noticed is Foucault's view of what lurks beneath the surface rules and assumptions that suggest the variability that marks human nature may not be so variable after all. In The Order of Things, he suggests through the use of his subtitle \"An Archaeology of the Human Sciences\" that he would be the archaeologist poking under the psychic skin of an episteme's surface to see what lurks within. He had previously postulated that epistemes come and go for reasons that are but vague at best so he was determined to learn whether there was any subliminal mental structure that could be responsible for the end of one episteme and the start of another. This structure would have nothing to do with individual and verifiable facts but everything to do with how the internal elements (of which facts might be just one) interacted with one another. In order to ascertain this hoped-for relation, he made certain assumptions about epistemes. First, he gave the three most recent ones names. The Renaissance Episteme took place near the 16th century. The Enlightenment Episteme was centered on the 17th and 18th centuries. The Modern Episteme began near the 19th century. He deduced two propositions about the appearance and disappearance of an episteme. First, only one episteme could exist in one place at one time and within it lay all the totalities of possible knowledge. Second, when one episteme ended and the next began, the second could have neither connection nor relation to the first. He used the word \"discontinuous\" to emphasize that whatever knowledge marked the first a brand new knowledge suddenly appeared that could be neither classified nor described in the same way as the first. What Foucault saw as his bounden duty as a historian/philosopher was to examine each episteme not for the raw knowledge that was produced by human interaction but rather to identify the multiplicity of relations that existed between and among all the elements contained therein. And this is what he learned after identifying this near infinity of relations. After digging around in the innermost recesses of each episteme with his metaphorical shovel, he discovered a \"sort of great uniform text,\" the existence of which \"proved\" that there really are Eternal Truths that order humanity's existence. Now this \"great uniform text\" was a most un-poststructuralist concept, one that flew in the face of the pronouncements of Foucault's contemporary Jacques Derrida who asserted that there never was, nor is, nor could ever be any such thing as an Eternal Anything. Derrida's own theories on deconstruction essentially fixed by fiat that there was no \"there\" there. It did not take long (actually just three years) for Foucault to change his mind. With the publication of The Archaeology of Knowledge, Foucault suddenly recalled his poststructuralist roots. He could hardly believe that just a few years ago, he supported the very humanist belief that certain things, ideas, and concepts transcended all eras. Now he was properly mortified at his previous totalitarian excesses. Like a politician caught in an obvious untruth, he backpedaled from his great uniform text hypothesis by stating that he never really meant his text hypothesis as it initially sounded. He simply was guilty of an unfortunate choice of words. What he really meant to say was that not all people thought the same things in the same way nor did they accept with equal alacrity a number of fundamental theses. He also by way of expiation dropped the former name of episteme, substituting the newer \"discursive formation.\" No longer would he poke around in the hidden depths of human unconsciousness to seek what was so clearly not there. Whatever explanation of human achievement there was to be found would now be lying right there on the surface. The newly named discursive practices from The Archaeology of Knowledge are to be distinguished from “non-discursive practices.” If the former imply a totality of written and spoken verbal interchanges between human beings, then the latter perform the same functions but only by non-human beings such as heterogeneous and homogeneous long-lived and massive institutions of an ongoing vitality exemplified by political parties, religious organizations, and the military. Non-discursive practices, then, tend to exert a continuous and kinetic energy that is self-sustaining over very long periods of time, perhaps even long enough to remain constant, untouched, and unruffled when one discursive formation ends and another begins. The Catholic Church, for example, is one such institution whose core tenets have not materially altered during the various transitions from one discursive formation to another. Yet, the church seems not to have been bothered by Foucault’s assertion that all such transitions must be marked by new centers of knowledge formation. The discontinuity of knowledge that should have occurred numerous times over the centuries has been inexplicably absent. Part of the problem that readers of Foucault have with his vision of power, knowledge, history, and take on human potential is that he all too often alters his basic views. His supporters understandably and predictably respond by noting that like any Great Thinker, Michel Foucault grew by increments and that his combined vision must necessarily have been assumed to be expected to expand to incorporate new and challenging ideas. To a certain extent, any thinker, great or otherwise should retain the flexibility to modify positions that may now be exposed as untenable. But in the case of Michel Foucault, his expanding vision seems not to flow from ideas that have been so exposed. Rather, they emanate from his personal desire to incorporate trendy political appendages into his own. Consider the years after the university riots in France that began in 1968. France, much of Western Europe, and most of America’s universities became instantly and very nearly totally politically radicalized by a leftist ideology that had been lacking in Foucault’s early philosophy. From these riots came a personal and overriding need by Foucault to abandon the archaeology metaphor that was now entirely inappropriate to seek non-existent Universal Truths and in its place to insert a more politically correct metaphor, a “genealogy,” one that marked a more militant stance. Foucault did not claim his use of this term as his own; he freely admitted that he borrowed it from Nietzsche’s text On the Genealogy of Morals. Nietzsche used it as a club to bash the notion of science as a bastion of objectivity. This concept Foucault enthusiastically embraced, adding to it his own fixation on the all-pervasiveness of power as it becomes subtly entangled throughout every fiber and tendril of the massive web that is human social relations. Genealogy as used by both Nietzsche and Foucault dealt more with perspectives than with what was being perceived and the points of Foucault’s perceived interest lay in what discourse is, who uses it, and why. Regardless of whether Foucault calls a system of thought an episteme or a discursive formation, certain troublesome issues remain unresolved. One issue relates to his sloppy standards of scholarship. His use of references is too often out of date, insufficient, or entirely lacking. This is a problem for both reader and author. It is not simply a problem for a reader who may wish to verify Foucault’s assertions by reference to a citation. A reader may need help in ascertaining the meaning of any of a myriad of obscure terms and will not get it. Foucault creates problems for himself in that he tends to use conflicting words, phrases, and concepts in a manner that smoothes over any such conflicts. The result is widespread confusion rather than clarity. A second issue is his view of history, which he refers to as fiction. This view of history is an inevitable outgrowth of his definition of a discontinuity as a “break” is the progression of history. For some reason, this break occurs; old knowledge is replaced by a “new” knowledge which is mutually exclusive from the old. History then which traditionally had relied on the transmission of verifiable knowledge of the past is now to be seen as lacking in objectivity. The result is a fiction which merely purports to be a truth toward which it futilely gropes. All history is now no more than a subjective interpretation of the past, including Foucault’s own. What is left to validate his own theories is for him to backpedal a bit by claiming that fiction is a function of truth. To claim now that fiction is a mere “function” of truth is to cast doubts on the veracity of that truth. A third issue is that in discussing previous versions of the relative veracity of history, Foucault limits himself to backward looking explanations of previous epistemes; he does not offer a forward looking ontologically-based future one. Hence, those who attempt to fairly evaluate the merits of his claims lack the needed standards to do so. This lack of his own willingness to provide such a model is no nitpicking affair since it is this very lack that, among other things, also precludes identifying who are and what is the subject, which is defined as the person or institution who directs, controls, or coordinates all the interlocking levels of a society that is composed only of those who have power seeking to exercise that power over those who do not. According to Foucault power is ubiquitous, a thing or latent symbol of domination that is simply lying about waiting for the “right” person to pick it up and use it to control another. A reasonable question now arises over who is the “right” person and who the “wrong.” Foucault does not say except that to claim in the power struggle, it is everyone for himself. He does not even justify why those who have power use it. Perhaps he assumes that the collection of power needs no justification. And what of those who lack power? Foucault notes that those who lack power “resist” its use by those who wield it, but he does not explain why they resist. Perhaps again he assumes that the need to resist is self-evident. For Foucault, apparently, power is used in such a manner that there is no need to consider its use in any other area of human endeavor. One who wields its use or suffers from its misuse need not consider social or political interaction as a leavening agent. In a world based solely on the use of power in a manner proscribed by Michel Foucault, the result would be a world not needing democracy, theocracy, monarchy, or tyranny. These types of governments depend on how power is used and why. But these various means by which human beings interact do exist, thus suggesting that the social and political historical theories of Michel Foucault are too simplistic, too vague, and too seriously undefined to have relevance in defining how and why human beings choose to live and work together. ",
            "date": "Answered October 19, 2017",
            "views": "574",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Craig",
                    "user_href": "/profile/Michael-Craig-6"
                },
                {
                    "user_id": "Qus Qidham",
                    "user_href": "/profile/Qus-Qidham"
                },
                {
                    "user_id": "Rafael Saltori",
                    "user_href": "/profile/Rafael-Saltori"
                },
                {
                    "user_id": "Julian Burgess",
                    "user_href": "/profile/Julian-Burgess-3"
                }
            ]
        }
    ]
}