{
    "title": "What are some examples of media bias? - Quora",
    "tags": [
        "Media Bias",
        "Bias",
        "Media",
        "Journalism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Murphy",
                "href": "/profile/Chris-Murphy-104"
            },
            "answer_text": "What are some examples of media bias? Tonight (February 7th, 2020), I was reading an Associated Press article about the latest Democratic presidential debate in New Hampshire. In this one article, I noticed a “tone” in the article that was not only biased for Democrats — but for Joe Biden in particular. This was referenced in the rhetoric of the article as well as the images accompanying it. Yes, images can be biased too. You can select the worst possible images for one candidate versus the best for others. William Randolph Hearst was famous for doing this during the age of truly biased “yellow journalism.” Source: The Latest: Bloomberg isn't at debate, but he's name-dropped Crazy Old Bernie vs. Stoic Joe Biden…  Here we see Bernie Sanders with arms raised up and a weird look on his face — conveying a sort of “grumpy old man” look. Trump (not at the debate) with mouth open wide…  The same article includes images of Trump (who wasn’t in New Hampshire or at the debate) caught mid-sentence with his mouth open. This photo was unnecessary — because it (and the caption about Trump speaking to reporters elsewhere) had nothing to do with the article. Of all of the photos that they could have selected, they selected the one with his mouth open. Biden looking directly into the camera…  In journalism courses, you’re taught that reporters should look into cameras — but never individuals being interviewed. This is because the reporters are speaking TO the audience at home rather than the person being interviewed. Something similar is true with photojournalism. Photos of a person looking at you are often taboo — unless the purpose is to make them seem like they are relating to or speaking directly to you. This is a great example of bias in journalism. Bernie NOT looking into the camera…  Notice that the photo used was not very flattering. Bernie has one eyelid drooping just a bit (probably caught just before or after he blinked). His hair is disheveled too. The image also seems slightly tilted (compared with others from the same angle at the same event) — which seems to indicate he is “hunched.” Pete Buttigieg: “Tall” and concerned for the people around him…  If elected, Pete Buttigieg — who stands about between 5′6″ to 5′8″ — would be the shortest president in modern history. In last year’s Ohio debate, the recently-resigned mayor of South Bend, Indiana stood next to Elizabeth Warren and appeared to be shorter than her (despite the fact that he was wearing oxfords with 1–1.5″ heals). Photos taken at angles like this are meant to convey a “heightened” level of concern and authority. Let’s find another bad photo of President Trump…  Now, at the bottom of the article is a link to another article about President Trump. It includes a photograph of President Trump caught mid-sentence while making a funny face during his remarks at the recent National Prayer Breakfast. Of all of the photos taken at the meeting, the AP decided to run the worst possible image with the headline to the article as well as the thumbnail to it. It has been alleged that the media is very selective again in regard to working with the DNC to help shape the election. Once again, Bernie supporters are alleging that the media is conspiring with the DNC to favor some of the other candidates. When you see images like these, it seems like there might be some credibility to what would otherwise be seen as a tinfoil hat conspiracy. Then again, for this election cycle, we don’t have any leaked emails from John Podesta to provide validity toward that end. ",
            "date": "Answered February 8, 2020",
            "views": "25",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eli James",
                    "user_href": "/profile/Eli-James-66"
                },
                {
                    "user_id": "Umar Kamara",
                    "user_href": "/profile/Umar-Kamara-7"
                },
                {
                    "user_id": "Steve Drawdy",
                    "user_href": "/profile/Steve-Drawdy"
                },
                {
                    "user_id": "Gage Williams",
                    "user_href": "/profile/Gage-Williams-45"
                },
                {
                    "user_id": "Karen Swensen",
                    "user_href": "/profile/Karen-Swensen-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chuck Oaks",
                "href": "/profile/Chuck-Oaks"
            },
            "answer_text": "What are some examples of media bias? I assume you mean the American media? I see bias all the time. Did you WATCH any CNN after the election? Those dudes went ape shit crazy. It seemed like every story was some type of negative hit piece against Trump or a member of his team. They rarely mentioned how or why he won in any way that might have appeared to be a legitimate reason other than suggesting he fooled people. You could actually see the huge disappointment they had on election night. They simply could not hide their bias, and they made no attempt to do so. Constant negativity was directed at the elected President of the United States. But let me ask you this. What if the Republican party had pulled the same stunt that the Democrats did by robbing Bernie Sanders of delegates during the primary? They had a fix on. Now that story just went away didn’t it? If it were the Republicans it would have been a major scandal and they would not have allowed it to drop, even now. But since it was Hillary and her team it just faded away. You hear no mentions of Wasserman-Schulz. No mention of the rigging process. No mention of Donna Brazile giving Hillary the questions ahead of time. Unlike this whole Russia scandal (which has still turned up basically nothing), Brazile admitted it. Does the media hound Hillary? Do they refer to it at all any more? Instead of drubbing us over the head repeatedly about Hillary’s assistant being married to a sexual pervert who exposes himself regularly, there was barely a mention. Not only did they not drill Hillary about her deleted emails, they defended her. Did they express great concern over Hillary’s apparent health issue when she coughed constantly? No…but they mentioned Trump’s weight instead. There is bias. Fox is biased towards the Republicans. CNN, NPR, the New York Times, L.A. times, NBC News, and MSNBC are very biased the other way and they were like that before Fox existed. Many journalists are now freely admitting that they gave Bill Clinton a running free pass on his womanizing and cheating on Hillary, because he was their guy and they wished to prop him up, not tear him apart. Trump certainly gets not such pass, just as Bush did not. We all have different opinions about bias. “Group think” can make us hear stories different than they are meant to be taken. Perhaps the best proof I can give ( if you do not already KNOW the answer to your own question ) is that the former CEO of NPR eventually realized the bias that his station has. I have attached the article. Just the first few paragraphs hit on the point… Former NPR CEO opens up about liberal media bias ",
            "date": "Updated January 16, 2019",
            "views": "86",
            "upvotes": " View 29 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sheila Andres",
                    "user_href": "/profile/Sheila-Andres-3"
                },
                {
                    "user_id": "Umar Kamara",
                    "user_href": "/profile/Umar-Kamara-7"
                },
                {
                    "user_id": "Pete Standley",
                    "user_href": "/profile/Pete-Standley"
                },
                {
                    "user_id": "Justin Walters",
                    "user_href": "/profile/Justin-Walters-41"
                },
                {
                    "user_id": "Barry Scott",
                    "user_href": "/profile/Barry-Scott-98"
                },
                {
                    "user_id": "Dana Gray",
                    "user_href": "/profile/Dana-Gray-30"
                },
                {
                    "user_id": "Mark Gene Duncan",
                    "user_href": "/profile/Mark-Gene-Duncan"
                },
                {
                    "user_id": "Dirk Lindeke",
                    "user_href": "/profile/Dirk-Lindeke"
                },
                {
                    "user_id": "PJ Fitz",
                    "user_href": "/profile/PJ-Fitz-2"
                },
                {
                    "user_id": "Stephen Taylor",
                    "user_href": "/profile/Stephen-Taylor-79"
                }
            ]
        }
    ]
}