{
    "title": "What comes to mind when you hear the word psychology? - Quora",
    "tags": [
        "Word Associations",
        "The Mind"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luci Sain",
                "href": "/profile/Luci-Sain"
            },
            "answer_text": "I would have to say I think of my dad when I hear the word psychology. In college, he majored in psychology and let’s just say he didn’t follow through with it. After four years of schooling, he was done with it and knew it wasn’t the right job for him. He studied into drugs and alcohol and it left him wary of the fact if he could truly help his future clients. With learning such a harsh subject it made him realize how many people who are prone to drugs or alcohol have/are using it to numb themselves and that it’s really tough to change some of their minds. He decided that it would hurt him too much to see so many people which he knew he wouldn’t always be able to help. So, he went into the career of fishing. He isn’t a fisher anymore, but he has told me it was a very rough job. The difference between the two was that he felt tired and fatigued very often when fishing but as a psychiatrist he would’ve felt emotional drained. He made his choice between the two and he was happy with the one he made. He supports me in any ambition I have towards psychology though. He just reminds me to not go into drugs and alcohol which I will gladly do so! ",
            "date": "Answered May 15, 2018",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lynn Al Radi",
                "href": "/profile/Lynn-Al-Radi"
            },
            "answer_text": "As I read or hear the word “psychology”, my mind immediately goes to Pavlov and his dog; in other words,“classical conditioning”. What is classical conditioning? It's when you pair a neutral stimulus with a natural, response-triggering stimulus. Over time, and after several exposures, the neutral stimulus starts triggering, alone, that same response. Pavlov rang a bell before presenting a meal to his dog. Over time, the dog learned to associate the ringing of the bell with the meal; so salivation (the response normally triggered by the sight of the meal) is now triggered merely by the ringing of the bell. It's an interesting type of learning that immediately comes to my mind at the mention of “psychology”.  Source: Google images. ",
            "date": "Answered January 20, 2019",
            "views": "33",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joanna Dela Cruz",
                    "user_href": "/profile/Joanna-Dela-Cruz-22"
                },
                {
                    "user_id": "Shona McDonald",
                    "user_href": "/profile/Shona-McDonald-6"
                }
            ]
        }
    ]
}