{
    "title": "What are examples of absolute moral truths? - Quora",
    "tags": [
        "Truths of Life",
        "Absolute Truth",
        "Ethics of Everyday Life",
        "Ethics and Morality",
        "Truth",
        "Ethics",
        "Morals and Morality",
        "Philosophy",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Puka",
                "href": "/profile/Bill-Puka"
            },
            "answer_text": "This is a very outdated way of thinking. The word “absolute” applies well to almost nothing, including the so-called temperature “absolute zero.” People of old seemed captured by these bedrock categories and strong dichotomies. Certainty was another big one. They applied them to what are ultimately psychological and social phenomena, which makes about as much sense as speaking of absolute chairs, absolute pianos. Very few things fall very far distant along the true-false continuum. Truth (with a capital T) is something more like a mythical ideal, conceivable in principle or theory, but not even in the thinking process. Absolute seems extrapolated from more and less. You add more and more and more and it seems there must be an endpoint at some point above which it can’t go further. But in fact conceiving continua as infinitely progressing has proven more fruitful and realistic. In the commonsense morality game, merely suggest that there may be no absolutes or even truths and people go ballistic—somewhat ballistic, not totally or absolutely ballistic. If it’s not true then it must be false, or at least of no merit. If it’s not absolute or universal then it must be “totally relative,” groundless, a matter of subjective, personal opinion. Nothing in between? Well, that’s not how things seem to work. Morality is not about truths but principles primarily. And that’s only the secondary conceptual part, parasitic on something vastly more important. Morality is about how we treat each other, how we interact, what we do, what choices we make. And where it helps to think about these matters, then commitments, beliefs, values, principles will come into play. An absolute commitment? What is that? We can say it in words, but what could it refer to? Even if on observed an unwavering commitment lived, would it be absolute? Does it get tested enough to even speculate that’s so? If I wanted to get close to something vaguely like a moral absolute, it might be the beauty of a mother holding and marveling over her newborn child, a sibling holding another after the second was thought lost or dead and now is found. People have struggled to picture immoral absolutes like “raped and tortured” and hell. In the Qu’ran there’s a healthy description of Heaven which falls far short of what even a child could conceive as ideal, as ultimately good. It’s something like a men’s spa. It’s child’s play to add to them, extrapolate from them. But when all out of that, one can also simply change frame, come at the idea on a different level, in different terms. What we need in morality is good ideas, appealing, cogent ideas that help guide ever better ways to relate. If someone came up with an absolute moral truth it might very well be useless. (almost useless). Unless it could draw people’s belief and affiliation, truth aint gonna help. And that’s even true of a necessary moral truth. The reason one always here’s about Kant’s categorical imperative in ethics is because so many people aren’t convinced==it’s “Kant’s” view of ultimate moral truth or validity. ",
            "date": "Answered July 29, 2019",
            "views": "298",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Robet Schall",
                    "user_href": "/profile/Robet-Schall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Frauman",
                "href": "/profile/Charles-Frauman"
            },
            "answer_text": "Everyone knows that stealing is the coolest crime there is. The theft of expensive art works takes the cake. Many people place a high moral value on high priced art, as long as it does not offend our political or moral values. Along with Ethics, aesthetics is part of axiology (the study of values and value judgments). And all aesthetic judgments are culturally conditioned. Larceny passes the test if I can prove that coolness is a positive moral judgment. In the same way that something is very attractive, fashionable, and interesting in a way that people admire, the same could be said for large scale heists by handsome men wearing the masks of dead presidents. See, I killed two birds with one stone. The second absolute moral truth is that it's okay to murder a sex worker when you're on a business trip and your wife thinks you're a faithful husband. Sex workers are unhappy with their lives. Their business consists of pleasing fat older men sexually and then returning to their pimps to be smacked around. It is also very hard to break out of that lifestyle. For some, it's a life sentence. Killing a sex worker is therefore merciful. Where I draw the line is at cheating on your wife. Have you no decency? What about remorse? You made vows, man. Does “till death do us part\" mean nothing to you? Thankfully, in the realm of morals, there is a right thing to do. Kill the sex worker and the cuckquean. Problem solved. ",
            "date": "Answered July 27, 2019",
            "views": "143",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robet Schall",
                    "user_href": "/profile/Robet-Schall"
                }
            ]
        }
    ]
}