{
    "title": "What are the major works of John Locke? - Quora",
    "tags": [
        "John Locke (philosopher)",
        "Philosophers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sam Qwato",
                "href": "/profile/Sam-Qwato"
            },
            "answer_text": "Q. What are the major works of John Locke?    Summary answer: (1) Simply, here’re Locke’s key philosophical positions and works. Social contractNatural rights are not dependent on the laws or customs of any particular culture or government, and therefore universal and inalienable (rights that cannot be repealed or restrained by human-enacted laws), the most important of which werelifelibertyproperty.PropertyOne may only appropriate as much as one can use before it spoils (Two Treatises of Government 2.31), 2).One must leave “enough and as good” for others (the sufficiency restriction) (2.27), andone may only appropriate property through one's own labor.We gain Civil rights in return for accepting the obligation to respect and defend the rights of others, giving up some freedoms to do so.Central assertion of social contract approaches is that law and political order are not natural, but are instead human creations.When the government fails to secure their natural rights, or satisfy the best interests of society, citizens can withdraw their obligation to obey, or change the leadership, through elections or other means including, when necessary, violence.Epistemology: Tabula rasa: We’re born without innate ideas. (Note: This has since been disproved by Science.) Knowledge is instead determined only by experience derived from sense perception. This is now known as Empiricism. Above: Tabula rasa, blank slate (2) More on his magnum opus, “Two Treatises of Government”: Sam Qwato's answer to How is John Locke's Two Treatises of Government important?  ",
            "date": "Answered April 20, 2017",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lucas Monteiro",
                    "user_href": "/profile/Lucas-Monteiro-15"
                }
            ]
        }
    ]
}