{
    "title": "What are some paradoxes in life? - Quora",
    "tags": [
        "Paradoxes",
        "Daily Life",
        "Tips and Hacks for Everyday Life",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Guilherme Petrin",
                "href": "/profile/Guilherme-Petrin"
            },
            "answer_text": "1. The more you hate a trait in someone else, the more likely you are avoiding it in yourself. Carl Jung believed that characteristics in others that bother us are reflections of the parts of ourselves that we deny. Freud referred to it as “projection.” Most people call it “being an asshole.” For example, the woman who is insecure about her weight will call everyone else fat. The man who’s insecure about his money will criticize others for theirs. 2. People who can’t trust, can’t be trusted. People who are chronically insecure in their relationships are more likely to sabotage them. Call it the Good Will Hunting syndrome, but one way people protect themselves from getting hurt is by hurting others first. 3. The more you try to impress people, the less impressed they’ll be. Nobody likes a try-hard. 4. The more you fail, the more likely you are to succeed. Insert inspirational famous person quote here. You’ve probably heard many of them. Edison tried over 10,000 prototypes before getting the lightbulb right. Michael Jordan got cut from his high school team. Success comes from improvement and improvement comes from failure. There’s no shortcut around it. 5. The more something scares you, the more you should probably do it. With the exception of genuinely life-threatening or physically harmful activities, our fight-or-flight response kicks in when we’re confronted with past traumas or actualizing the self we dream of being. For instance: speaking to an attractive person, cold-calling someone to get a new job, public speaking, starting a business, saying something controversial, being painfully honest with somebody, etc., etc. These are all things that make you scared, and they make you scared because they are things that should be done. 6. The more afraid you are of death, the less you’ll be able to enjoy life. Or as one of my favorite quotes puts it, “Life shrinks and expands in proportion to one’s courage.” 7. The more you learn, the more you realize how little you know. Every time you gain a greater understanding, it creates even more questions than it answers.  My man Socrates dropping some knowledge bombs about the uncertainty of knowledge. He knew what was up haha. 8. The less you care about others, the less you care about yourself. I know this may go against every perception you’ve ever had of a self-serving asshole, but people treat people the way they treat themselves. It may not be apparent on the outside, but people who are cruel to the people around them are cruel to themselves. 9. The more connected we get, the more isolated we feel. Despite being in more constant communication than ever, research finds an increase in loneliness and depression in the developed world over the past few decades. 10. The more you’re afraid to fail, the more likely you are to fail. See: self-fulfilling prophecy. 11. The harder you push for something, the harder it will feel to achieve. When we expect something to be difficult, we often unconsciously make it more difficult. For instance, for years, I assumed starting a conversation with a stranger was something that was highly abnormal and therefore “difficult.” As a result, I spent a lot of time strategizing and studying ways to relate to people I didn’t know. Little did I realize all I had to do was say “Hi” and then ask a simple question; that would get me 90% of the way there. But because it felt hard, I proceeded to make it hard for myself. 12. The more available something is, the less you will want it. Humans have a strong scarcity bias. We unconsciously assume things that are scarce are valuable and things that are abundant are not. This is not the case. 13. The best way to meet someone else is to not need to be with someone else. The fact remains that the best way to find a sexual relationship — committed or otherwise — is by not needing a sexual relationship to be happy and investing more in yourself. 14. The more honest you are about your faults, the more people will think you’re perfect. The amazing thing about vulnerability is the more comfortable you are about not being that great, the more people will think you are. 15. The more you try to keep someone close, the further away you’ll push them.This is the argument against jealousy in relationships: once actions or feelings become obligations, they lose all meaning. If your girlfriend feels obligated to spend her weekends with you, then the time you spend together has become meaningless. 16. The more you try to argue with someone, the less likely you are to convince them of your perspective. The reason for this is that most arguments are emotional in nature. They come from someone’s values or self-perceptions being violated. Logic is only used to validate those pre-existing beliefs and values. It’s rarely about the objective or logical truth as much as it is repairing people’s worldviews. For any real debate to truly exist, both parties must be making an honest concession to put their egos aside and only deal with the data. This is rare, as anyone who’s spent any time on an internet forum could tell you. 17. The more choices you have, the less satisfied you are with each one. The old “paradox of choice.” Research shows that when we’re presented with more options, we become less satisfied with any particular one we go with. The theory is that when we have so many options, we have greater opportunity costs to selecting each particular one; therefore, we’re less happy with our decision.  Pick one. C’mon, PICK ONE!!! 18. The more convinced someone is that they’re right, the less they probably know.There’s a direct correlation between how open a person is to differing perspectives and how much that person actually knows about any given subject. Or as the philosopher Bertrand Russell once said: “The trouble with the world is that the stupid are cocksure and the intelligent are full of doubt.” 19. The only certainty is that nothing is ever certain. 20. The only constant is change. One of those little banal statements that feels really profound but doesn’t actually mean anything. But it’s still true! ",
            "date": "Answered November 3, 2018",
            "views": "339",
            "upvotes": " View 13.2K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Melissa Stewart",
                    "user_href": "/profile/Melissa-Stewart-213"
                },
                {
                    "user_id": "Jonathan Ashenafi",
                    "user_href": "/profile/Jonathan-Ashenafi"
                },
                {
                    "user_id": "Edita Nadira",
                    "user_href": "/profile/Edita-Nadira"
                },
                {
                    "user_id": "Synnøve Melby",
                    "user_href": "/profile/Synnøve-Melby"
                },
                {
                    "user_id": "Yuvendra Kaushal",
                    "user_href": "/profile/Yuvendra-Kaushal"
                },
                {
                    "user_id": "Amulya Mahadev",
                    "user_href": "/profile/Amulya-Mahadev"
                },
                {
                    "user_id": "Pratik",
                    "user_href": "/profile/Pratik-297"
                },
                {
                    "user_id": "Merve Sakrak",
                    "user_href": "/profile/Merve-Sakrak"
                },
                {
                    "user_id": "Shane Gordon",
                    "user_href": "/profile/Shane-Gordon-66"
                },
                {
                    "user_id": "Prakhar Singh",
                    "user_href": "/profile/Prakhar-Singh-725"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abdul Waheed",
                "href": "/profile/Abdul-Waheed-58"
            },
            "answer_text": "Some of the most important truths in life are contradictory on the surface. They seem like impossibilities, yet experience proves them to be obvious over and over again. It isn’t until you look a bit deeper, beneath the surface contradictions, that the real grains of wisdom emerge. 1. The more you hate a trait in someone else, the more likely you are avoiding it in yourself. 2.People who can’t trust, can’t be trusted. 3. The more you try to impress people, the less impressed they’ll be. 4. The more you fail, the more likely you are to succeed. 5. The more something scares you, the more you should probably do it. 6. The more afraid you are of death, the less you’ll be able to enjoy life. 7. The more you learn, the more you realize how little you know. 8. The less you care about others, the less you care about yourself. 9. The more connected we get, the more isolated we feel. 10. The more you’re afraid to fail, the more likely you are to fail. 11. The harder you push for something, the harder it will feel to achieve. 12. The more available something is, the less you will want it. 13. The best way to meet someone else is to not need to be with someone else. 14. The more honest you are about your faults, the more people will think you’re perfect. 15. The more you try to keep someone close, the further away you’ll push them. 16. The more you try to argue with someone, the less likely you are to convince them of your perspective. 17. The more choices you have, the less satisfied you are with each one. 18. The more convinced someone is that they’re right, the less they probably know. 19. The only certainty is that nothing is ever certain. 20. The only constant is change. We all think we know ourselves well, but psychological studies show otherwise. In fact, most of us are somewhat deluded about ourselves. A,waheed ",
            "date": "Updated September 26, 2017",
            "views": "57",
            "upvotes": " View 65 Upvoters",
            "upvoters": [
                {
                    "user_id": "Terran Pulaski",
                    "user_href": "/profile/Terran-Pulaski"
                },
                {
                    "user_id": "Narayanachar S Murali",
                    "user_href": "/profile/Narayanachar-S-Murali"
                },
                {
                    "user_id": "Joy Peters",
                    "user_href": "/profile/Joy-Peters-10"
                },
                {
                    "user_id": "Rizwan Shehzad",
                    "user_href": "/profile/Rizwan-Shehzad-6"
                },
                {
                    "user_id": "Alex Trình Trần",
                    "user_href": "/profile/Alex-Trình-Trần"
                },
                {
                    "user_id": "Puja Sonowal",
                    "user_href": "/profile/Puja-Sonowal-1"
                },
                {
                    "user_id": "Teresa Beyer",
                    "user_href": "/profile/Teresa-Beyer-4"
                },
                {
                    "user_id": "Mona Tse",
                    "user_href": "/profile/Mona-Tse-1"
                },
                {
                    "user_id": "Carton Walker",
                    "user_href": "/profile/Carton-Walker"
                },
                {
                    "user_id": "Bharat Bang",
                    "user_href": "/profile/Bharat-Bang"
                }
            ]
        }
    ]
}