{
    "title": "What are the principles of the Just War Theory? - Quora",
    "tags": [
        "Just War Theory",
        "Values and Principles",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sam Qwato",
                "href": "/profile/Sam-Qwato"
            },
            "answer_text": "Q. What are the principles of the Just war theory? Summary answer: (1) The theory is focused on the moral justification of war, andmorally acceptable conduct of war.(2) It is defined by the following key criteria. Conditions for war: Identify a set of conditions under which it ismorally defensible to resort to force of arms, andto offer guidelines on the limits within which fighting is to be conducted.Just cause: The most important factor.Defence against aggression.Self-defence against a violation of a country’s political sovereignty and territorial integrity.Helping a third party suffering such aggression.Controversially, pre-emptive military action against a potential aggressor.Right intention:The sole aim of military action is to further the abovementioned ‘just cause’.Motivation should be to right the wrong caused by the aggression that provided ‘just cause’.No disguised ulterior motives, such as territorial expansion.Proper authority:War decision can only be made by the proper authorities,following due process.Execute declaration of war process.Last resort:Every other peaceful, diplomatic, non-military option has been tried or considered.Considered economic or other sanctions.Prospect of success:Commonsensically, a reasonable chance of success.Proportionality:Balance between the desired end, and the likely consequences of getting there.Expected good (righting the wrong that constitutes the ‘just cause’) must be weighed against the anticipated damage (casualties, suffering).Benefit must be worth the cost.jus in bello:Morally acceptable andproper conductonce the fighting starts. ",
            "date": "Updated July 24, 2018",
            "views": "1",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Seth Uttley",
                    "user_href": "/profile/Seth-Uttley"
                },
                {
                    "user_id": "Pete Unwin",
                    "user_href": "/profile/Pete-Unwin-3"
                },
                {
                    "user_id": "Cameron Jackways",
                    "user_href": "/profile/Cameron-Jackways"
                },
                {
                    "user_id": "Joyce H",
                    "user_href": "/profile/Joyce-H-4"
                },
                {
                    "user_id": "Lu Mb",
                    "user_href": "/profile/Lu-Mb-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jesús Pardo",
                "href": "/profile/Jesús-Pardo-2"
            },
            "answer_text": "Unless you win it, you will be sued for the crimes you committed…except if your enemy, due to some lucky circumstance, sees it fit to content himself with winning and imposing or negotiating more or less reasonable terms of surrendering. Sorry for the somehow cinical answer, but if you loose, and the enemy is not happy with that alone, he will find the way to punish you for your crimes, even if they did not really exist. Otherwise, if you win..will you sue yourself? it is conceivable, but fairly unusual :D ",
            "date": "Answered August 18, 2020",
            "views": "17",
            "upvotes": "0"
        }
    ]
}