{
    "title": "What are some good questions that someone can ask to themselves? - Quora",
    "tags": [
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Herd",
                "href": "/profile/Chris-Herd"
            },
            "answer_text": "What am I truly passionate about? Our passions are the things that inspire us to greatness, they are the things that make us get up in the morning with a burning desire to do them. Our passions are the things which define us. They become deeply ingrained within our being and are a part of who we are. They are the first things other people will think of when they think about us. They are what identify us. They are the things that make us happiest. Constantly following your passion allows you to experience personal joy. The purpose of life in my mind is to simply be happy; following your passions is the smoothest route to that level of personal satisfaction. By knowing what our true passion is we can derive purpose for our lives which in turn gives what we are doing value. Purpose and value are inexplicably linked, if what you are doing is your passion it is inherently valuable to you. Uncompromisingly pursuing something is incredibly brave, it is why it must be something you are passionate about. It will allow you to become ignorant of the questioning, criticism or dissenting voices as you spend your time doing it. Not enough people are brave enough to inexorably chase their passions. Purpose gives us direction. It ensures a single minded focus on achieving a top-level goal which enables you to concentrate all your energy on achieving it. In a world where the seductive allure of smart phone screens distracts us to the point of paralysis our passions are the light which sets us free. Your passions aren’t just the thing you like they must be far more than that. They are the things that we invest our time in now in hope of profiting in the future. They are the destinations that we become desperate to reach and would overcome any obstacle to get there. Our passions are the things which merely embolden us in the face of failure; there’s nothing more important or essential and failure is only a momentary bump in the road which allowed us to recalibrate before continuing forward. Following your passion endows you with the opportunity to achieve unprecedented success. Success = Talent x Effort². Effort is twice important to success as talent therefore we will achieve the best results in the things we are most passionate about because we will never give up. Below is an anecdote which for me illustrates the difference between those who are passionate and those who are just doing something for the sake of it. A ceramics teacher announced he was dividing his class into two groups. All those on the left side of the studio would be graded solely on the quantity of work they produced, all those on the right graded solely on its quality. His procedure was simple: on the final day of class he would weigh the work of the “quantity” group: 50 pounds of pots rated an A, 40 pounds a B, and so on. Those being graded on “quality”, however, needed to produce only one pot — albeit a perfect one — to get an A. Well, come grading time and a curious fact emerged: the works of highest quality were all produced by the group being graded for quantity! It seems that while the “quantity” group was busily churning out piles of work — and learning from their mistakes — the “quality” group had sat theorizing about perfection, and in the end had little more to show for their efforts than grandiose theories and a pile of dead clay. The lesson: in life quantity always trumps quality. Your passions are what enable you to relentlessly do something. That results in you producing or doing something far more than anyone else which gives you more opportunity to achieve significant success. Picasso was so great because he was prolific. But it’s important to understand that though he was a genius only a proportion of his work was viewed as such. Let’s assume only 10% of his work was ‘great’. If that strike rate hold true for the rest of humanity the only difference is output. If I produce 1,000 drawings and you only produce 10, I would therefore produce 100 ‘great drawings’ while you only have one. Pursuing our passions give us the opportunity to achieve unprecedented greatness and unmatched personal happiness which ensures we are content with the lives we lead. Passion is the lifeblood of humanity and is what has let us excel. Passionate people pursuing the things the care about most has resulted in the evolution of our civilisation. If you pursue your passions you will ensure your own happiness. What is more important than that? ",
            "date": "Answered August 31, 2016",
            "views": "619",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Martese Holloman",
                    "user_href": "/profile/Martese-Holloman"
                },
                {
                    "user_id": "Dhawal Panchal",
                    "user_href": "/profile/Dhawal-Panchal-1"
                },
                {
                    "user_id": "Sindhu A",
                    "user_href": "/profile/Sindhu-A"
                },
                {
                    "user_id": "Graeme Herd",
                    "user_href": "/profile/Graeme-Herd-2"
                },
                {
                    "user_id": "Ash Herd",
                    "user_href": "/profile/Ash-Herd"
                },
                {
                    "user_id": "Graeme Herd",
                    "user_href": "/profile/Graeme-Herd"
                },
                {
                    "user_id": "David Smith",
                    "user_href": "/profile/David-Smith-1331"
                },
                {
                    "user_id": "Buena Patria",
                    "user_href": "/profile/Buena-Patria-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bronner B. Gustafson",
                "href": "/profile/Bronner-B-Gustafson"
            },
            "answer_text": "Ask: Will you, self/l, please get out of my way? Why? Because if I have not fully experienced what this life is yet, I want to. I may not even know what that means but I know there IS something more. More than what I see. More than what I smell. More than what I think I know. I cannot even tell you right now as i ask this of you self, how or why I know there is more. I feel it. I feel it. Self. I feeel it….Self. Wait a tick. If I feel and I can talk to my self??? Hmmmm… I feels and self is in the way???… There is more to life I can feel but self is in the way??? A question worth pondering. A question worth answering. A question that brings out to the very center of your awareness the fullness of who you are. If only for a moment as you dance with this question in the motion of your mind. Roll it around. Don’t just answer and dismiss as though you know it all. Clearly YOU do not I I feels and Self is in the way. which one of these are you is the answer to the question. When the realization hits you, or the emotions and the mind connect, this is the beginning of the spiritual path to ultimate liberation. This is when deeper dimensions of who you ate open up and the life experience you have been having gets blown away. Imagine walking down the street today in the most incredible feeling of bliss you have experienced in any one moment. How would it feel to walk the streets every day or sit by yourself and this is the way you always feel? Where would you go and what would you take on? If you were always in a deep and 100% function state of love with everything around you. What would be out of your reach? How would the world around you treat you? Remember how you felt at that moment and how you had to come down from there. You had to come down from the natural state of life into a lower vibrational world. Even though you wanted to be there and stay, someone that is not an outside force decided to come down. Either self or I came down within you. And I feels while self is in the way. Its obvious and so simple. All that is in the way of your ultimate happiness all the time is you. As the self. Figuring things out and thinking, thinking, thinking. Not believing and thinking then believing and then thinking. The self that needs attention or it will die. The self that gets attention and then hides from it or blows it up so much it becomes loud and obnoxious. The self that fears others opinions and comments about self. The self that try to feel for I that everyone dislikes me and self uses feelings to become self conscious. Then self is in the drivers seat. Driving every thought and emotion about life, the existence, happiness, loneliness, right and wrong all the way to salvation. Self builds a fortress of beliefs systems around it to stay in control. All the while the real power of the I stays silent in the stillness of grace and says. “No worries. Do what you need to do self. I AM absolute. I AM always here. I AM life that allows self to play the joker.” This is the spiritual path. The taking back of ones power as the I AM. The I/eye that sees everything and is everything. If there were not I/eyes, mere words, the universe would be dark. Underneath it all, way way down, but woven all the way through, you are the entirety of the universe itself. The intelligence of life that animates the body and brings life to all things and allows the self to play a marvelous game of hide and seek. Pretending to be of importance and trying to be super. When all the while I AM already totality which is extremely super! It is my wish that all who seek find the answer to this question within them and live the fullness of the piece of complete life you are. The experience is absolutely heaven. Live As Love Love As Life. Unconditionally. ",
            "date": "Answered August 3, 2020",
            "views": "136",
            "upvotes": "0"
        }
    ]
}