{
    "title": "What are examples of confirmation bias in education? - Quora",
    "tags": [
        "Confirmation Bias",
        "Cognitive Bias"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dallas McKay",
                "href": "/profile/Dallas-McKay"
            },
            "answer_text": "A lot of stuff in history is open to interpretation. A great example is why did we fight the American Civil War. The answer, unequivocally is slavery. There were other contributing factors, but you can objectively state that slavery was primary cause, and fed the other factors. States rights is a big one, and you can say honestly. But it was the state's right to own slave that was in question. There is a good deal of revisionist history regarding the cause and effect of the Civil War, and educators will cherry pick to fit thier personal opinions. Ironically, psychology is another area. Any time you have schools of thought, you're bound to focus on the one you are a adherent to. This holds for all Social sciences. If there are competing theories with no concrete right answer, your bias will likely show up. Even an effort to not be biased can lead to reverse conformation bias. (*I just made that term up, I'm sure there is a real term for it, but it's probably Latin.) You're trying so hard to not let your opinion reflect in your teaching, you go the other way.",
            "date": "Answered March 11, 2016",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Mandlbaur",
                "href": "/profile/John-Mandlbaur"
            },
            "answer_text": "The fact that angular momentum is not conserved and this is proven by any of the demonstrations used because they all “spin faster”, but none of them “spin faster” enough. I have been pointing this out for nearly five years. Educationalists are ignoring any evidence I present and refuse to apply the scientific method and measure any of the examples and incessantly attack my character. They are all victims of confirmation bias. ",
            "date": "Answered July 8, 2020",
            "views": "103",
            "upvotes": "0"
        }
    ]
}