{
    "title": "What are some paradox theories? - Quora",
    "tags": [
        "Paradoxes",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pratik Kalawala",
                "href": "/profile/Pratik-Kalawala"
            },
            "answer_text": "Paradoxes are not theories. They are intellectually challenging, logically confusing and often comprised of inherently contrasting observations or situations put together in an “apparent” cohesive story... There can be theories to solve paradoxes. Some paradoxes are innately designed with fallacies which can’t be exposed unless you solve them. They are called FALSIDICAL Paradoxes. These often look like they are “designed correctly” until you realize the flaws in the design that make them the paradoxes. Some paradoxes are simply problems that can be solved, but are too difficult to begin with. They are “true” or “valid” situations that lead to an actual “true” or “valid” result. They are called VERIDICAL Paradoxes. And the other remaining category is emotive drive. They are inherently “insolvable” because of the stark incompatible premises. They are almost like “FOREVER PARADOXES”. They are usually not solved unless, there are theories made to extend the meaning of their premises or make further amends to their interpretations. Here’s a nice video if you are further interested.  ",
            "date": "Answered July 26, 2019",
            "views": "80",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sajjan Chauhan",
                    "user_href": "/profile/Sajjan-Chauhan-1"
                },
                {
                    "user_id": "Ankit Yadav",
                    "user_href": "/profile/Ankit-Yadav-145"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malcolm Sargeant",
                "href": "/profile/Malcolm-Sargeant"
            },
            "answer_text": "Most paradoxes are created by introducing  infinity (visibly or invisibly) at some point in the an argument or theory. Introducing infinity is usually the best way to turn a simple problem into a paradox.List of paradoxes ",
            "date": "Answered October 12, 2013",
            "views": "709",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pooja Bhagawat",
                    "user_href": "/profile/Pooja-Bhagawat"
                },
                {
                    "user_id": "Mills Baker",
                    "user_href": "/profile/Mills-Baker"
                },
                {
                    "user_id": "Daniel Essien",
                    "user_href": "/profile/Daniel-Essien"
                }
            ]
        }
    ]
}