{
    "title": "What are some examples of solved paradoxes? - Quora",
    "tags": [
        "Paradoxes",
        "Problem Solving"
    ],
    "response": [
        {
            "author_info": {
                "name": "Teng Wang",
                "href": "/profile/Teng-Wang-2"
            },
            "answer_text": "I have solved the Omnipotence Paradox. Can God Create a Stone that He Cannot Lift? This question is more than 800 years old. In asking this question, the questioner had already assumed the existence of gravity because of the word “lift” in the question. What is “lift”? My definition for “lift” is: Moving an object to the opposite direction of gravity. By definition, God created everything. Hence, God created gravity. Since God can create gravity, he can certainly make it disappear. So God can “lift” any stone. Put another way, this question could become: if God were to have an arm wrestling match between his left arm （gravity）and right arm (to “lift” the stone), which one would win? Both arms belong to God. This is not a contest; there is no winning or losing. Therefore this is a stupid question. If God is omnipotent, God must be everything, everything must be God. Since “outside everything” is an oxymoron, therefore “outside God” is an oxymoron: if there is God, then there will be no “outside”; if there is an “outside”, then there will be no God. There is no gravity “outside” God. God doesn’t live in a gravitational field. For an omnipotent God, there is no such concept as “lift”. “Lift” only exists in human experience. Gravity, like everything else, exists inside God. For an omnipotent God, there is no such concept as “stand” either, because there is no ground “outside” God. By the same token，for an omnipotent God, there are no such concepts as “breathe”，“eat”，“drink”，“excrete”, “wear clothes”, “walk”，“sit”, “lie down”. God doesn't have a body. All bodies have skin, skin is the boundary of the body. God doesn't have boundary. Therefore, God doesn't have a face，nor shape. An ant looks at you while you are talking, it could see your lips and tongue moving. The ant asks you: “How do you lift your lips and tongue?” You reply: “It’s a stupid question.” A man sees that the Moon is moving, he asks God: “How do you lift the Moon?” God says: “It’s a stupid question.” The editor at Wikipedia doesn’t agree with me. Talk:Omnipotence paradox ",
            "date": "Answered June 23, 2016",
            "views": "15",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sailesh Krishnakumar",
                    "user_href": "/profile/Sailesh-Krishnakumar-1"
                },
                {
                    "user_id": "Hydra Sagaria",
                    "user_href": "/profile/Hydra-Sagaria"
                },
                {
                    "user_id": "Adriana Pagers",
                    "user_href": "/profile/Adriana-Pagers"
                },
                {
                    "user_id": "Mohd Suhail",
                    "user_href": "/profile/Mohd-Suhail-26"
                },
                {
                    "user_id": "Aditya Anaspure",
                    "user_href": "/profile/Aditya-Anaspure"
                },
                {
                    "user_id": "Vishisht Mishra",
                    "user_href": "/profile/Vishisht-Mishra-1"
                },
                {
                    "user_id": "Darryl Lankford",
                    "user_href": "/profile/Darryl-Lankford"
                },
                {
                    "user_id": "Yustikasari Diana Putri",
                    "user_href": "/profile/Yustikasari-Diana-Putri"
                },
                {
                    "user_id": "Ethan Howard",
                    "user_href": "/profile/Ethan-Howard-11"
                },
                {
                    "user_id": "Chuck Matthews",
                    "user_href": "/profile/Chuck-Matthews"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yonathan Kurniawan",
                "href": "/profile/Yonathan-Kurniawan"
            },
            "answer_text": "I have solved the irresistible force immovable object paradox. The irresistible force simply passes through the immovable object. A lot of people were perplexed by this paradox because they were using the wrong kind of logic. Their logic states a person cannot both be sick and healthy at the same time, a team cannot both win and lose at the same time, and so on etc. Therefore according to this logic the irresistible force has to move the immovable object because it cannot both be irresistible and not move an object. However if we accept that the law of the excluded middle in logic is wrong then we can see how the force can simply pass through the object. This is the logic that applies to the quantum realm, where an object can be both a wave and particle at the same time. I have also solved time travel paradoxes. In a time travel paradox such as the grandfather paradox what happens is that the relationship between what exists and what happens ceases to hold. Therefore an object can exist yet have no influence upon reality and an influence upon reality which can clearly be seen, heard, even remembered doesn't necessarily have to correspond to something that exists. If you go back in time and kill your grandfather then what happens is that you will no longer be able to influence reality. No one will be able to see, hear, or even remember you, even though you are a real object. The opposite occurs in a bootstrap paradox. The object which has no origin is not a real object, yet it can be seen, heard, and even remembered. ",
            "date": "Updated June 6, 2017",
            "views": "652",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Darryl Lankford",
                    "user_href": "/profile/Darryl-Lankford"
                },
                {
                    "user_id": "Christa Harrison",
                    "user_href": "/profile/Christa-Harrison"
                },
                {
                    "user_id": "William Finch",
                    "user_href": "/profile/William-Finch-3"
                }
            ]
        }
    ]
}