{
    "title": "What are the top 3-5 ways in your opinion that Karl Marx was a bad guy? - Quora",
    "tags": [
        "Karl Marx (philosopher, author, economist)",
        "Marxism",
        "Political Philosophy",
        "Philosophers",
        "Capitalism",
        "Socialism",
        "Communism",
        "World History",
        "Philosophy",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charles J. Hunsinger",
                "href": "/profile/Charles-J-Hunsinger"
            },
            "answer_text": "Marx was a leach, in that, he took money from Frederick Engels to support himself , his wife and five children with one of them dying of malnutrition. That is two. The second point here is also associated with the fact that he forced his wife and children to live in absolute squalor. Be it also noted that Engels took money from his capitalist father to support himself and Marx. Three. Marx saw himself as a modern day Jesus Christ who would save humanity from the sins of being human: a messianic complex. The sins here would be individualism, individual ambition and talent. Sins that must always be guarded against with swift and sure punishment for the sinner. Plagiarist. Four. Marx plagiarized the Christian bible by converting the word and promises of Christianity into secular terms. 224: SIMILARITIES BETWEEN CHRISTIANITY AND SOCIALISM In all Marx was a fraud, a lazy abusive fraud who attempted to exploit the weaknesses of the human condition to further his own messianic tendencies. ",
            "date": "Answered September 24, 2020",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dmitry Isakov",
                "href": "/profile/Dmitry-Isakov-5"
            },
            "answer_text": "He was a war mongering propaganda shill who was offering his services to a highest bidder. Just read his articles in a wake and during Eastern War, which is now commonly called Crimean War. His “Das Kapital” was one of the most deceptive books ever written, assuming how many people were deceived by it. ",
            "date": "Answered September 23, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shiva Laxmi",
                    "user_href": "/profile/Shiva-Laxmi-12"
                }
            ]
        }
    ]
}