{
    "title": "What are some key ideas from ancient Indian philosophy? - Quora",
    "tags": [
        "Indian Philosophy",
        "Ancient India",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Parashuram Chitale",
                "href": "/profile/Parashuram-Chitale"
            },
            "answer_text": "1] Soul is fundamental force of universe. 2] There are infinite number of souls - either trapped or free in this universe 3] Power of soul varies. Physic of Supreme souls is different than physic of ordinary souls on this earth 4] Just like magnet has flux around it - soul also has flux around it. Supreme soul has supreme flux while other souls do not have that much. This flux is called mind in human being. 5] Soul + Flux decides the power of soul 6] The weapons used were flux base and mind controlled when physic of supreme souls were active on this earth. Flux base weapons are superior to any weapons our current science has developed. 7] Human being can achieve supernatural power by awakening kundalini….Serpentine power ",
            "date": "Answered October 8, 2020",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ranjiv Kurup",
                "href": "/profile/Ranjiv-Kurup"
            },
            "answer_text": "Ancient Indian philosophies (known as darshana, literally “vision”, and there are many of them, you have to find something that suits your orientation), are about shaping character so you can lead a life of happiness and fulfillment in the service of your community. That’s the gist. While modern science many have many methods to shape behaviour (used extensively by companies worldwide), it offers nothing that shapes character or what is known as “below the line human attributes” in the HRD “Iceberg Model”.  So while modern science focuses on the 10%, Indian philosophy focuses on techniques and practices that develop the underlying 90%. And it is entirely spiritual knowledge. ",
            "date": "Answered October 8, 2020",
            "views": "40",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Siva Charan",
                    "user_href": "/profile/Siva-Charan-97"
                },
                {
                    "user_id": "Mudit Sharma",
                    "user_href": "/profile/Mudit-Sharma-101"
                }
            ]
        }
    ]
}