{
    "title": "What are the differences between Baha’i and Christian religion? - Quora",
    "tags": [
        "Bahá'í Faith",
        "Christians",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arthur Gregory",
                "href": "/profile/Arthur-Gregory-9"
            },
            "answer_text": "I think Christian churches usually have clergy or someone designated as a preacher and often there’s a hierarchy with Bishops, archbishops, cardinals, etc. Baha’i communities have Local Spiritual Assemblies that are elected annually and National Spiritual Assemblies elected annually as well. The Universal House of Justice is also elected every five years. So there is no paid clergy as such in the Baha’i Faith. ………………………………………. Another difference is that many churches are liturgical, that is they have rites and liturgies such as the Eucharist or Holy Communion and an Altar at the front of the church. The Priest conducts the rite before the altar. Baha’is have no altars and no priests that conduct liturgical rites. We do read or recite revealed scripture from our Writings in devotional meetings and Feasts that are held every nineteen days. ……………………………………………. Most Christians use the Gregorian calendar and hold services on Sundays and sometimes other Holy Days that are on the church calendar. Baha’is use a calendar known as the “Badi Calendar” Bahá'í calendar - Wikipedia and gather at a Feast every nineteen days. Each Feast is named after an attribute of God. ……………………………………………. Many Christian churches have a rite of confession where people ask for forgiveness of sins through a priest. While Baha’is recite prayers for forgiveness or can personally pray to be forgiven we do not “confess” our sins to a priest. …………………………………………… Many churches call for tithing or contributing a tenth of your income to the church. Baha’is are encouraged to make contributions to Baha’i funds. There’s also what is called Huququllah which is 19 percent of profits after your expenses. ……………………………………………………… Many Christian churches have a form of the cross in their architecture and inside are oriented toward an altar; Baha’i Houses of Worship have nine sides and entrances from every direction and are usually circular in their seating. The number nine is significant as it is also the Abjad numerical value of “Baha”. Above the auditorium in the apex of the ceiling is usually a calligraphic rendering of the Greatest Name. See: Sacred symbol placed at apex of Chile temple | Bahá’í World News Service (BWNS) ………………………………………………. The main Holy Book for Christians is the Holy Bible used in public and private devotions. Many churches also invite readings from other scriptures in Inter-Faith services. Baha’is recognize the Writings of Baha’u’llah, the Bab as authentic repositories of the Word of God and the Writings of Abdul-Baha as authoritative interpretation. Baha'i Reference Library Baha’is are free to read from the Bible and the Qur’an as sacred scriptures: “985. During the devotional part of the Nineteen Day Feast any part of the writings of the Báb, Bahá'u'lláh and the Master can be read, also from the Bible and Qur'án, as these are all sacred scriptures. This part of the meeting need not be confined to prayers, though prayers can and should be read during it.” (18 October 1948) (Compilations, The Compilation of Compilations vol. I, p. 448) ",
            "date": "Updated November 7, 2017",
            "views": "13",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Harris",
                    "user_href": "/profile/Robert-Harris-506"
                },
                {
                    "user_id": "Terry Cipolloni",
                    "user_href": "/profile/Terry-Cipolloni-1"
                },
                {
                    "user_id": "Kal Basin",
                    "user_href": "/profile/Kal-Basin"
                },
                {
                    "user_id": "Marc Forward",
                    "user_href": "/profile/Marc-Forward"
                },
                {
                    "user_id": "Scott Hakala",
                    "user_href": "/profile/Scott-Hakala"
                },
                {
                    "user_id": "Salman Iqbal",
                    "user_href": "/profile/Salman-Iqbal-10"
                },
                {
                    "user_id": "Christopher Strolia-Davis",
                    "user_href": "/profile/Christopher-Strolia-Davis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susan Bantelar",
                "href": "/profile/Susan-Bantelar"
            },
            "answer_text": "In christian faith what you see is what you get but in Baha'i religion things are completely different then what they outwardly stand for. Here are some points that explain what Baha'i religion is : 1) The Bahá'í Faith exists solely to perpetuate itself, 99% of its focus and activities are toward this one goal, growth in membership. Throughout their history they have been preparing their members for the \"entry by troops\" of new converts, which has yet to materialize. They do a minimal amount of humanitarian or charity work. 2) Bahá'ís use terminology in ways that was not intended. Bahá'ís don't have censorship, they have \"review.\" They don't proselytize, they \"teach.\" They don't have missionaries, they have \"pioneers.\" They don't have prophets, they are called \"manifestations.\" And so forth. 3) Bahá'ís have a \"lo is us\" sense of historical persecution. If you look at their history, though, most would call it just fruits. During the founding of the religion, the forebear Babi sect led a violent revolution in Iran, and some of their members later attempted to assassinate the Shah. Their leadership were exiled to the Ottoman Empire where schismatic violence within the group later led to house arrest. Of course, this is all billed as being persecuted. 4) Bahá'ís lament how others view them in a conspiratorial light, when in fact, again, this is based on historical reality. In Iran the Babis had the protection of the Russian ambassador (Russia being an imperial power that had seized wide swaths of territory from Iran and at one point the Russian ambassador had to approve Iranian cabinet ministers). In the Ottoman Empire, Bahá'ís conspired with the Young Turks, who deposed Sultan Abdul Hamid II in a coup. Later, they would assist the British, and their leader 'Abdu'l-Bahá earned knighthood, being designated KBE. With their headquarters in Haifa, Bahá'ís have cooperated with the state of Israel, to the extent that some of the Bahá'í World Center buildings are built on land expropriated from absentee Palestinian land owners. 5) Bahá'ís inflate their membership numbers. Comparing census data of various nations to self-reported data confirms this. The outside data Bahá'ís often cite, like from the Association of Religion Data Archives, only uses self-reported data, creating a circle. 6) Bahá'ís initially hide from members some of the more unsavory realities of their religion. Men and women are equal, but women are barred from serving in the highest organ of the religion, the Universal House of Justice. The hierarchy is billed as being democratic, but only in the sense of council democracy as it still exists in Cuba where individuals elect local committees, who then elect national committees, who then elect the Universal House of Justice. There is a parallel appointed hierarchy. With no politicking or partisanship allowed, elected members in the higher ranks serve for life until they die or retire, and are subsequently replaced by nomenklatura. 7) Bahá'ís hide from members some of the more unsavory realities of their history. After Bahá'u'lláh their leader was 'Abdu'l-Bahá and then Shoghi Effendi. By the time Shoghi Effendi died, all the living descendants of Bahá'u'lláh had been excommunicated from the religion for various offenses, including \"marrying a low born Christian girl.\" Shoghi Effendi was also designated the \"Guardian,\" by 'Abdu'l-Bahá. The Guardian was supposed to designate subsequent Guardians, but did not do so, although the entire Bahá'í administrative structure depended on it. 8) Ignoring failed prophecies, like `Abdu'l-Bahá declaring the peace of the world to come by the year 2000. Those of us around in the 1980's and 1990's remember the crescendo, and the anticlimactic ignoring of reality and denial of the build up. 9) Bahá'ís claim earlier religions are valid, but in reality they only do this in an Islamic sense (i.e., the earlier revelation was perverted over time). For example, they deny the parts of Bible written by Paul. Or when Muhammad says he is the last prophet, Bahá'ís say that was true only for the Adamic Cycle, but now we are in the Bahá'í Cycle. Source : http://bahaitexts.blogspot.com Bahá'í Faith employs a great bait-and-switch technique to attract new members, akin to marketing time share realty. On the other hand, people who join the Bahá'í Faith or remain members do so voluntarily. As such, they voluntarily belong to an organization that delineates certain stipulations for membership, including refraining from criticism of the Administrative Order's decisions. I would say this is analogous to a Catholic convert's accepting of a celibate, male-only clergy or a Muslim convert's accepting of gender-segregated worship. The analogy is severely faulty, however, since a convert to Catholicisim or Islam knows these basic facts, whereas fundamental aspects of Bahá'í teachings and practice, let alone history, are outright hidden from seekers and, indeed, members. ",
            "date": "Updated November 22, 2017",
            "views": "24",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samantha Fernandes",
                    "user_href": "/profile/Samantha-Fernandes-35"
                },
                {
                    "user_id": "John Grey",
                    "user_href": "/profile/John-Grey-100"
                },
                {
                    "user_id": "Lory Darnell-Gustafson",
                    "user_href": "/profile/Lory-Darnell-Gustafson"
                },
                {
                    "user_id": "Maymoon Jawaheri",
                    "user_href": "/profile/Maymoon-Jawaheri"
                },
                {
                    "user_id": "Stanford Dsouza",
                    "user_href": "/profile/Stanford-Dsouza-1"
                },
                {
                    "user_id": "Melanie Gowing",
                    "user_href": "/profile/Melanie-Gowing"
                },
                {
                    "user_id": "Prithvi Singh",
                    "user_href": "/profile/Prithvi-Singh-125"
                },
                {
                    "user_id": "Jack Promin",
                    "user_href": "/profile/Jack-Promin"
                },
                {
                    "user_id": "Baman Zariwala",
                    "user_href": "/profile/Baman-Zariwala"
                },
                {
                    "user_id": "Brendan Esposito",
                    "user_href": "/profile/Brendan-Esposito"
                }
            ]
        }
    ]
}