{
    "title": "What always sounds like a good idea but never actually is? - Quora",
    "tags": [
        "Sounds",
        "Understanding Emotions",
        "Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arjan Singh",
                "href": "/profile/Arjan-Singh-34"
            },
            "answer_text": "Wide shoulders. This is going to be the most conceited thing I write but trust me, it’s a pain at times. Clothes fit weird: I have wide shoulders and a small waist. So when I find something that fits my waist, it’s really tight around my shoulders. Then I go up a size to fit my shoulders but it’s huge around my waist and now I look fat :):):)It attracts aggression: At 5′11, I’m not exactly the tallest person - I’m not towering over anyone to make them feel small. But wide shoulders just seems to trigger aggression in other guys though. They look at you funny and if you bump into them on accident, they’re more likely to want to get physically aggressive with you.It’s impractical: Crowded train? Narrow stairway with people walking in both directions? Really narrow airplane seats? Yeah. You’re the one that needs to accommodate others, so you end up hunching yourself together to move through places. But sometimes you just cant. I was on a train leaving London and for two hours, I was sat next to a man that I forced upon to the window of the train… I felt bad. Then British micro aggression kicks in with frequent huffing and puffing.I get more compliments from guys: I heard girls like wide shoulders… But you could never tell because the only people who talk to me about it are guys.In theory, wide shoulders sounds really cool. But practically speaking, they attract guys, aggression and make you look fat in certain clothes. ",
            "date": "Updated December 16, 2018",
            "views": "15",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sam Glass",
                    "user_href": "/profile/Sam-Glass-15"
                },
                {
                    "user_id": "Christina Godinho",
                    "user_href": "/profile/Christina-Godinho-1"
                },
                {
                    "user_id": "Harshita Mahajan",
                    "user_href": "/profile/Harshita-Mahajan-1"
                },
                {
                    "user_id": "Blake Harris",
                    "user_href": "/profile/Blake-Harris-22"
                },
                {
                    "user_id": "Rhiti Awasthi",
                    "user_href": "/profile/Rhiti-Awasthi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Kim",
                "href": "/profile/Daniel-Kim-1810"
            },
            "answer_text": "I think the best answer for this, especially in terms of effect, would be communism. Communism, in theory, would be great; everyone would work for what they need and would receive based on how well they contribute to society. Sounds great, right? The problem with communism, however, is that no one is willing to hold to communism and act their very best, basically due to diffusion of responsibility and innate greediness. Diffusion of responsibility in this case would just be everyone thinking, “Ah, someone else will get to it.” For a while, this may even be the case, with upstanding citizens carrying society on their backs. Eventually, though, this situation would fail; either the upstanding citizens would see the injustice and rebel, or the beneficiary citizens would heap more and more work onto the upstanding citizens and society would come crashing down.Innate greed basically means everyone wants to hold onto their belongings and gather more belongings. Especially with the eradication of money in a communist society, everyone would take more than their due, either because everyone wants that slight physical advantage in supplies over their neighbors or because everyone wants the bragging right that they have more than those around them.",
            "date": "Updated October 11, 2020",
            "views": "315",
            "upvotes": "0"
        }
    ]
}