{
    "title": "What could be an argument against Einstein’s definition of insanity? - Quora",
    "tags": [
        "Insanity (fitness regime)",
        "Schizophrenia",
        "Albert Einstein (physicist)",
        "Arguments and Argumentation",
        "Philosophy",
        "Mental Illness",
        "Psychology",
        "Mental Health",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patty Mace",
                "href": "/profile/Patty-Mace"
            },
            "answer_text": "A2A. Thanks. You should share Einstein’s definition of insanity with all of us who may not know it. I think I remember it as “Doing the same thing over and over again, expecting a different result.” 12. \"Insanity is doing the same thing over and over again and expecting different results.\" — not Albert Einstein Different versions of this quote appear everywhere (doing the same thing twice, expecting the same result, etc.), and we owe none of them to Einstein. After Michael Becker, an editor at the Bozeman Daily Chronicle (a local paper in Montana), let the wrong version slide into an editorial, he did some research on his personal blog. Becker traced the original back to Rita Mae Brown, the mystery novelist. In her 1983 book \"Sudden Death,\" she attributes the quote to a fictional \"Jane Fulton,\" writing, \"Unfortunately, Susan didn’t remember what Jane Fulton once said. 'Insanity is doing the same thing over and over again, but expecting different results.'\" Now, go throw away half your coffee mugs and inspirational posters. This is what I found when I looked it up online. Business Insider did an article on Famous Quotes attributed to people who didn’t say them. They sighted 12 examples. This Einstein Quote was the twelfth. Who knows if Michael Becker even got this right? It is an interesting article though. I was pretty sure I knew what you meant, because I collect quotes. I also learned this in Group Therapy on one of my many hospitalizations. I remember reading sometime later that it was attributed to Einstein even though he isn’t the person who said it. It was pretty impressive when I heard it in the hospital. I took it to heart, no matter who said it. Here is a true quote from Mr. Einstein: “ No problem can be solved from the same level of consciousness that created it. We must learn to see the World anew.” One of my all time favorite Quotes: “Blessed are the flexible, for they shall not be bent out of shape.” A quote by Betsy Shirley, the Foster Mother of 23 boys. Thank you for the question; I love Quotes. ",
            "date": "Answered March 31, 2020",
            "views": "130",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Elena Ursa",
                    "user_href": "/profile/Elena-Ursa"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barry Goldberg",
                "href": "/profile/Barry-Goldberg-1"
            },
            "answer_text": "Q: What could be an argument against Einstein’s definition of insanity? Well, one argument that springs immediately to mind is the fact that there is absolutely no indication that Einstein actually defined insanity as “doing the same thing over and over again and expecting different results.” A favorite of politicians (and pretty much everybody else), this quote has been wrongly attributed to Benjamin Franklin as well as—but there’s no evidence either of them said it. “The Ultimate Quotable Einstein,” an authoritative complication of his most memorable utterances, identified the quote as a misattribution, and mentioned its use in the 1983 novel “Sudden Death” by Rita Mae Brown. On his website, Quote Investigator, O’Toole traced, the link between insanity and repetition back to at least the 19th century, but noted its use in a Narcotics Anonymous pamphlet as well as novels (including Brown’s), TV shows and various other sources. — https://www.history.com/news/here-are-6-things-albert-einstein-never-said ",
            "date": "Answered March 31, 2020",
            "views": "381",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Patricia Rahikainen",
                    "user_href": "/profile/Patricia-Rahikainen"
                },
                {
                    "user_id": "Elena Ursa",
                    "user_href": "/profile/Elena-Ursa"
                },
                {
                    "user_id": "Deniz Erdagi",
                    "user_href": "/profile/Deniz-Erdagi"
                },
                {
                    "user_id": "Leo McDevitt",
                    "user_href": "/profile/Leo-McDevitt"
                },
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                },
                {
                    "user_id": "Stuart Vealey",
                    "user_href": "/profile/Stuart-Vealey"
                },
                {
                    "user_id": "Virginia Grant",
                    "user_href": "/profile/Virginia-Grant"
                },
                {
                    "user_id": "Mark McCoy",
                    "user_href": "/profile/Mark-McCoy-57"
                },
                {
                    "user_id": "Michael McClennen",
                    "user_href": "/profile/Michael-McClennen"
                },
                {
                    "user_id": "Jonathan Kinrade",
                    "user_href": "/profile/Jonathan-Kinrade"
                }
            ]
        }
    ]
}