{
    "title": "What are we in this universe? - Quora",
    "tags": [
        "Meaning of Life",
        "The Universe",
        "Cosmology",
        "Astrophysics",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Babaji Yogiraj",
                "href": "/profile/Babaji-Yogiraj"
            },
            "answer_text": "“What are we in this universe?” Whatever we can identify with, from an abstract concept such as the infinitely expanded ‘immaterial absoluteness’ which is the formless source of all knowledge, time and space, all the way down to the idea of an elementary particle, an atom, thus seeing ourselves as an infinitely limited, small and insignificant singular cell lost somewhere in the humongous universal body. We are THAT which is infinite, real and never divided, but only if we let it happen by surrendering our ego-sense, the boundary which keeps us in the skin feeling and unbearably limited by collective consciousness, our Human Artificial Intellect.  Hari ॐ  @~The Genuine Original Dreamer~@ ",
            "date": "Updated February 28, 2020",
            "views": "233",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sohail Khan",
                    "user_href": "/profile/Sohail-Khan-478"
                },
                {
                    "user_id": "Seshagiri Rao",
                    "user_href": "/profile/Seshagiri-Rao-2"
                },
                {
                    "user_id": "Barbara Hemming",
                    "user_href": "/profile/Barbara-Hemming-1"
                },
                {
                    "user_id": "Sumit Bishnoi",
                    "user_href": "/profile/Sumit-Bishnoi-41"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suresh Taksande",
                "href": "/profile/Suresh-Taksande"
            },
            "answer_text": "Human being are the best creation of universe . It is through human being universe gets aware of itself. It is through us God thinks, create s, sings , dances It is human who appreciate the beauty of existence and gives some meaning to existence. Without human beings to observe I would say existence doesn't exist. #cosmology ",
            "date": "Answered February 22, 2020",
            "views": "22",
            "upvotes": " Answer requested by Sumit Bishnoi"
        }
    ]
}