{
    "title": "What advantages does economics have over the other social sciences that study human behavior? What does it have in common with the other social sciences? - Quora",
    "tags": [
        "Behavioral Economics",
        "Social Sciences",
        "Behavior",
        "Economics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mohammad Gani",
                "href": "/profile/Mohammad-Gani"
            },
            "answer_text": "My answer may seem too radical to some readers. It challenges prevailing ideas. 1/ The study of human behavior may fall into a set of sciences, and another set of arts. The biological behavior of the human is studied by physiology, biochemistry, medicine, and physical anthropology, with primatology, genetics and biology as general backgrounds. The cultural behavior is studied by cultural anthropology. The mind of the human is studied by psychology. The social behavior is studied by sociology. The criminal behavior is studied by criminology. Than literature has various fiction-based art disciplines dealing with human existence and behavior. 2/ Does economics belong to the list of sciences that study human behavior? The prevailing view is that it does. This view is seriously contradicted by philosophy of knowledge (epistemology) and by methodology. These are abstract high-level ideas that may not be grasped by some people, unfortunately. 3/ Economics is in effect, de facto, a study of the behavior of traded objects. Its goal is to understand why the kinds and quantities (and prices as ratio of quantities) of traded objects are what they are. The fact that the human beings are associated with the production, exchange, and consumption of the traded goods does not make it a study of human behavior. The fact that people really produce and consume electricity does not make electrical science a behavioral science. 4/ There is a serious gap in understanding the subject of economics. Nobody wants to know why humans want to consume what they consume, just as they do not care why animals eat the foods the indeed eat. The goal is to find out how much is produced, traded and consumed, and at what prices, and for wat payments. We are trying to explain why the prices of houses are rising or price of oil is fluctuating. We are not trying to understand human behavior behind the rising housing prices: we are trying to understand the price behavior of houses or oil. 5/ Many heads will explode when I say that the state of mind of the individual has nothing to do with the state of the economy. This view is completely the opposite of the orthodoxy. My reasoning is this. The same traded good x exchanged against y as its payment must necessarily have precisely opposite minds of the two people trading it. The buyer of x must surely prefer x to y, while the seller of x must necessarily prefer y to x for the exchange between x and y to happen at all. Now tell me, whose state of mind determines the preference? The answer, no ones’ state of mind has relevance. The value of x is by definition equal to the value of y if y pays for x. Thus though x and y must be of equal value, the seller of x still must prefer y to x while the buyer of x must prefer x to y. Surely, human minds have nothing to do with the valuation of x or y, or the price of x, (which is by definition the ratio (y/x). 6/The humans are bound by social rules that supersede the individual. Whether you like it or not, if you buy x, you must pay for x, and the name of the payment is y, as chosen jointly by both the seller and the buyer of x. This agreement is governed by inviolable social rules. What happens in the market happens according to those social rules, regardless of the state of mind of the individuals. Since nobody knows about those rules, it must seem like a revolution to find them. 7/ The three rules of exchange are here: First, the freedom of enterprise rule says that an individual is free to buy something rather than be compelled to produce it; and he is free to sell something rather than be compelled to consume it. This social rule violates natural law of subsistence which compels all animals to produce what they consume (and never buy), and to consume (and never sell) what they produce. 8/ The second rule is that of equivalence between the traded goods. If x is a traded good, than whatever value it is agreed to have by the buyer and seller is exactly the value the payment against x must have. If x is a shirt, and the buyer and seller agree that its value is 10 dollars, then the buyer must pay exactly ten dollars, neither more nor less. 9/ The third rule is reciprocity between the agents. If John sells x to Ken, then John and nobody but John can ask for the payment y from Ken. And Ken must pay, and nobody else must pay for x to John and to John only. The buyer of x must be the seller of the payment to x, called y. just as the seller of x must be the buyer of whatever is its payment. 10/ It will of course not be directly seen how these three rules are both necessary and sufficient to explain ALL economic issues, all of them really. 11/ Please read the whole book to find out. https://mpra.ub.uni-muenchen.de/67542/3/MPRA_paper_67542.pdf A short cut is found in (PDF) Money in Market Clearing ",
            "date": "Answered September 30, 2020",
            "views": "47",
            "upvotes": " Answer requested by Charlene Mae Ortega",
            "upvoters": [
                {
                    "user_id": "Olivia Heslinga",
                    "user_href": "/profile/Olivia-Heslinga-2-1"
                },
                {
                    "user_id": "Robert Sundahl",
                    "user_href": "/profile/Robert-Sundahl"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Godek",
                "href": "/profile/Stephen-Godek"
            },
            "answer_text": "The biggest advantage for economists is that much of what they would like to understand and explain is available in quantitative data over relatively long periods of time. Observing and measuring economic decisions and activities has critical practical utility and has thus spurred the construction of vast datasets that can be used to examine the validity of hypotheses about economic behaviors. This has allowed the construction and testing of highly sophisticated models of economic behavior that far outstrip models used in the the other social sciences. Despite this advantage, however, the models, as sophisticated and precise as they are, are still just models, not real theories. Dealing with human behavior in theoretical terms is extremely difficult for any of the social sciences and most of the “theories” upon which we base research to advance our knowledge do not get beyond being partial models with relatively limited application. These models, including highly successful models of the operations of markets, all essentially begin with assumptions that may seem relatively reasonable and realistic but the complexity of human behavior tends to limit even the most advanced modeling of economic science. ",
            "date": "Answered September 30, 2020",
            "views": "43",
            "upvotes": " View 2 Upvoters "
        }
    ]
}