{
    "title": "What are some of the inconvenient truths about race and intelligence? - Quora",
    "tags": [
        "Truth",
        "Racism",
        "Intelligence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Panu Höglund",
                "href": "/profile/Panu-Höglund"
            },
            "answer_text": "The most inconvenient truth seems to be the truth that blacks are precisely as intelligent as whites, when provided with the same possibilities. People like the original poster always get neurotic about this inconvenient truth and spend their entire life trying to deny it. ",
            "date": "Answered May 5, 2020",
            "views": "159",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sheldon Hollis",
                    "user_href": "/profile/Sheldon-Hollis"
                },
                {
                    "user_id": "John Skogman",
                    "user_href": "/profile/John-Skogman"
                },
                {
                    "user_id": "Robert Felker",
                    "user_href": "/profile/Robert-Felker-5"
                },
                {
                    "user_id": "Ian Bijeaux",
                    "user_href": "/profile/Ian-Bijeaux-2"
                },
                {
                    "user_id": "Khe-Thai Yu",
                    "user_href": "/profile/Khe-Thai-Yu"
                },
                {
                    "user_id": "Eliot Layton",
                    "user_href": "/profile/Eliot-Layton"
                },
                {
                    "user_id": "Eric Shrewsberry",
                    "user_href": "/profile/Eric-Shrewsberry-4"
                },
                {
                    "user_id": "Michael Baumgartner",
                    "user_href": "/profile/Michael-Baumgartner-8"
                },
                {
                    "user_id": "Nicholas Clay",
                    "user_href": "/profile/Nicholas-Clay-6"
                },
                {
                    "user_id": "Zander Tsadwa",
                    "user_href": "/profile/Zander-Tsadwa"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gayle Arrington",
                "href": "/profile/Gayle-Arrington-1"
            },
            "answer_text": "I'll get penalized or whatever but that happens even when you dont say anything “offensive”. White people have a sharp, predatory sense that's more accute than most. When mankind was moving out of Africa people had to learn to hunt in the snowy cold environment where food could be hard to come across. So when a rabbit happened to run by you had to be on top of your game or there may not be another shot at real food till God knows when. So the ancestors of modern white people developed pointier noses to help with sense of smell and sharp senses for prey. Look throughout history and tell me white people haven't shown predatory nature. Its why the British controlled most of the world- example. So go ahead and turn the caps button on and “You racist son of a bitch! That aint right your just racist! Racist!”. You know you want to. ",
            "date": "Answered May 5, 2020",
            "views": "188",
            "upvotes": "0"
        }
    ]
}