{
    "title": "What caused you to leave the The Baha'i Faith? - Quora",
    "tags": [
        "Baha'i Censorship",
        "Bahá'í Faith",
        "Faith and Religion",
        "Religious Conversion",
        "Faith",
        "Belief and Beliefs",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lisa Armstrong",
                "href": "/profile/Lisa-Armstrong-18"
            },
            "answer_text": "I hope this doesn’t get to be too long, but I was a Bahai for more than 40 years before I withdrew from the Baha’i faith in March 2019. I was a seeker of religion from the time I was 12 years old when upon taking communion for the first time at a Methodist church. While I was kneeling I gazed at a stained-glass figure of Christ. As I took the wafer and juice, I heard a voice that said “I am not in the Church.“ Although after this incident I didn’t search actively for an alternative to Christianity, I was aware that there were many issues within what I had witnessed within that small Southern church. I began to I visit different services and even wanted to attend a Jewish synagogue! Later, as a teenager within a household that had long been headed toward divorce, I retreated to the local library and read books on religion, witchcraft, astrology and metaphysical subjects. Then in the summer of 1973, I heard the soaringly beautiful music of Seals and Crofts. After buying a couple of albums, I discovered that their music included lyrics and concepts taken from the Baha’i writings. I rushed back to the library to search for Baha’i. It wasn’t long before I found some old copies of Baha’i books including This Earth One Country by JB Esslemont, and another one titled the Baha’i World Faith, both of which helped to satisfy an 18-year-old’s curiosity about the basis of Baha’i teachings. Within a few months of my investigation, I called the local Baha’i Center and attended my first meeting. I was very nervous because I thought perhaps it was a cult, and that I might see people smoking water pipes or other strange things. However, everything I heard and experienced that first time seemed to fit my every need at that time in my young life. Two weeks later, I signed a declaration card on August 26, 1973. Since my parents were in the middle of a divorce, they simply didn’t have time or the emotional energy to try to talk to me about my decision, and I began hanging out almost exclusively with other young Baha’is, teaching the Baha’i faith, and spending almost my every waking moment either reading, studying, praying or listening to the music of Seals and Crofts. Not long after, I began to date a talented Baha’i musician who was also the nephew of the producer of Seals and Crofts. We married two years later, almost immediately had a child, and moved to another town. In the ensuing years, although the local community where I started my life as a Baha’i had been a warm cocoon to help me heal after my parents divorce, subsequent years with Baha’is and the larger Baha’i community became more and more disillusioning, My disappointment was especially strong when in 1982, the National Spiritual Assembly of the Baha’is of the United States disbanded the local assembly where I had declared. I felt strongly that the individuals within that Assembly had been unjustly wronged and their families practically destroyed. This began a couple of decades of trying to right the wrongs that I had seen done to that previous community, as well as for me to become the “best Baha’i” I could be, serving on local assemblies, coordinating teaching efforts, co-sponsoring a performing arts youth workshop, and other activities. Yet in my heart I knew that something was rotten at the core of the Baha’i faith. I saw it becoming more and more political, more emphasis being placed on wealth and power, as well as a vast difference in the approach of the national administration in the years leading up to 2000, as compared to the 1970s. I begin to withdraw from active life more and more and finally in 2011 was accosted by a couple of individuals who suddenly visited my home from the community where I had declared. I was in total shock at the revelation from these people from that Assembly. They had never asked to meet with me in over 20 years time, and yet declared that there had been “problems” with me for years - that individual Baha’is and even other institutions had asked that Assembly to place sanctions on my behaviors. There were so many parts of this final blow to my belief that were wrong on so many levels, but the biggest flaw was the fact that a Baha’i governing body had decided to hold onto my many so-called wrongs for decades before ever contacting me either in writing, by a phone call or in person. There was no ability to discuss, to present the facts or even to know who my accusers were- just to be read a laundry list of restrictions to my personal and religious life! After that fateful weekend, it took almost a decade for me to decide to officially withdraw my belief in the Baha’i faith, but I finally did, and I now feel so much better! I am now a student of metaphysical teachings and pagan beliefs, and host a monthly women’s Moon Circle. I feel much more my true self, and do not miss any of the restrictions, the judgments and imperious behaviors of many within the Bahai Faith and _ especially_its tragically flawed so-called administration. I’m very thankful for the opportunity to be able to share a portion of my experience on this forum. Thank you!! ",
            "date": "Updated October 15, 2019",
            "views": "49",
            "upvotes": " View 26 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Suzie Payblyth",
                    "user_href": "/profile/Suzie-Payblyth"
                },
                {
                    "user_id": "Nell’s E ata",
                    "user_href": "/profile/Nell-s-E-ata"
                },
                {
                    "user_id": "Samantha Fernandes",
                    "user_href": "/profile/Samantha-Fernandes-35"
                },
                {
                    "user_id": "Bill Kemke",
                    "user_href": "/profile/Bill-Kemke"
                },
                {
                    "user_id": "Don Delaney",
                    "user_href": "/profile/Don-Delaney-14"
                },
                {
                    "user_id": "Axel Felix",
                    "user_href": "/profile/Axel-Felix-3"
                },
                {
                    "user_id": "Lizzy Smith",
                    "user_href": "/profile/Lizzy-Smith-44"
                },
                {
                    "user_id": "James Hyatt",
                    "user_href": "/profile/James-Hyatt-16"
                },
                {
                    "user_id": "Isabella Rios",
                    "user_href": "/profile/Isabella-Rios-3"
                },
                {
                    "user_id": "Starla Gresham",
                    "user_href": "/profile/Starla-Gresham"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susan Bantelar",
                "href": "/profile/Susan-Bantelar"
            },
            "answer_text": "Baha'i faith is the second name of the word 'Hypocrisy'. What they teach is absolutely something that their central figures never followed. It is a cult. Some Baha'is who left this cult had to undergo deprogramming therapy. Baha’u’llah was an opportunist Sufi Muslim who hijacked the Babi religion to create his own religion. Following are some points, that were discovered about him: 1. He doesn’t compare well with Jesus a. He claimed to be a supreme manifestation of God but his life shows none of the qualities that made Jesus who He was: no miracles, no healings, no love, no gentle compassion, no life sacrifice. b. Biblical prophecies cited are either vague or inaccurately interpreted. 2. His family was a mess! a. He was a polygamist with four wives (don’t forget Jamaliyya, the one he married in his old age) b. He had at least six children die in early childhood (WWJD? Heal them?) c. He abandoned his family in Baghdad and his son died because of no medical care (ie: neglect) d. His sons couldn’t get along well enough to fulfill his covenant e. His descendants were thrown out of the main sect of the religion (excessive family disunity) 3. His writings are questionable a. There are many talented speakers and writers who could produce similar books (Joseph Smith, for example, with his “Book of Mormon” – or Mary Baker Eddy with her “Science and Health with Key to the Scriptures” and many other writings; the idea that only Baha’u’llah could do this is just ludicrous) b. He focused on his own problems calling himself “wounded one” over 170 times c. No gospel of salvation similar to what’s found in the Bible d. Laws – the legalism of the Baha’i Faith is outstanding. Christ came to set us free from legalism so why should we go back to it? The Bible says: “Stand fast therefore in the liberty by which Christ has made us free, and do not be entangled again with a yoke of bondage. . . . you who attempt to be justified by law; you have fallen from grace.” Galatians 5:1,4 … Excessive legalism is a sign of a false religion. Cults are controlling. e. Hypocrisy – write one thing and do another; not a good sign f. World government is a bad idea g. Works more important than grace h. Prayerbooks interfere with directly talking to God (ie: prayer) i. Inequality of men and women despite saying otherwise j. He said God was unknowable and denied any relationship to God (first section of Gleanings) k. Some laws are irrational and some cause extreme emotional pain to those trying to follow them l. Threatening people who leave the religion (see the last page of the Kitab-i-Iqan) 4. The cultish religion a. Hypocrisy & members in denial about that b. Marketing strategies c. Exclusion methods are cultish d. Difficulty with withdrawal e. Overemphasis on administration f. Deceptive numbers … membership statistics g. Spy tactics h. Requests for money i. Attempts to make other religions fit the Baha’i paradigm j. Information control (publishing) k. Information control (re: covenant breaking) l. Excessive paranoia about “protection of the Faith” m. Treating members like they’re not able to make up their own minds n. Little teaching about spiritual concepts (Baha’i life is mostly admin work) o. Possibly fixed elections since admin people stay the same year after year p. Tracking people by number q. Keeping files on members r. The Archives building is a replica of the Parthenon, a temple to a mythological goddess s. No tolerance for dissenting opinions t. Tearing families apart in the name of the Almighty Protection obsession u. Shaming people who make mistakes v. Proselytizing while claiming they don’t proselytize 5. Personal This section is about how the religion affected me. a. No love b. Judgement and accusations c. Caused feelings of inadequacy d. Caused depression e. Exclusion f. Guilt trips g. Failed promises h. Isolation i. Loneliness j. Cognitive dissonance k. I ask myself: “Would a religion that treats me this way be from God?” That’s it for now, from my point of view. You’re welcome to leave a comment here with other issues in case I didn’t touch on what you believe about him. ",
            "date": "Updated September 8, 2019",
            "views": "63",
            "upvotes": " View 54 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Spencer Devine",
                    "user_href": "/profile/Spencer-Devine-4"
                },
                {
                    "user_id": "Avro Shuvro",
                    "user_href": "/profile/Avro-Shuvro"
                },
                {
                    "user_id": "Izzy The Bats",
                    "user_href": "/profile/Izzy-The-Bats"
                },
                {
                    "user_id": "Lizzy Smith",
                    "user_href": "/profile/Lizzy-Smith-44"
                },
                {
                    "user_id": "David Alexander",
                    "user_href": "/profile/David-Alexander-524"
                },
                {
                    "user_id": "Asma Bilal",
                    "user_href": "/profile/Asma-Bilal-30"
                },
                {
                    "user_id": "Paul Haokip",
                    "user_href": "/profile/Paul-Haokip"
                },
                {
                    "user_id": "Anouer Dkhil",
                    "user_href": "/profile/Anouer-Dkhil"
                },
                {
                    "user_id": "Novail Khan",
                    "user_href": "/profile/Novail-Khan"
                },
                {
                    "user_id": "Olga Campbell",
                    "user_href": "/profile/Olga-Campbell-10"
                }
            ]
        }
    ]
}