{
    "title": "What are the mysteries of India that science cannot explain? - Quora",
    "tags": [
        "Ancient Mysteries",
        "Unsolved Mysteries",
        "Unexplained Phenomena",
        "Mysteries",
        "History of India",
        "Historical India",
        "Science",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Umar Sheriff Habibullah",
                "href": "/profile/Umar-Sheriff-Habibullah"
            },
            "answer_text": "There are lots of mysteries India has that science cannot explain. we shall see few of them Dear Quora readers this is little longer post as it has in depth information . I have shared my knowledge and reference from the other websites. each one of them is unique and these are proud monuments of India. welcome to the mysteries of India. I have given 4 best mysteries they are: 1. The Konark Sun Temple, odissa 2. Brihadeeswara Temple, Tanjore, Tamilnadu, 3.Kailasa Temple Engineering Marvel Of India’s Master Builders 4. Temples of Mahabalipuram – Chennai , Tamilnadu Hope you will read till the end to enjoy!!!!!!!!!!!! welcome and share your comment. 1. The Konark Sun Temple, odissa The construct is also hiding much numerical mysticism connected to time. The sun defines time by its passage across the sky. The carriage has 24 wheels for the lunar phases according to Indian tradition. And the wheels as such are miracles. They have 8 spokes, symbolizing the 8 periods of a day as was traditional in old India.  The temple is a UNESCO World Heritage Site and has also featured on various list of Seven Wonders of India. The temple is 35 km from Puri and 65 km from Bhubaneswar. It took 16 years to built the sun temple and it was made of black granite and black pagoda. The temple has earned the pride of being one of the World Heritage Sites in the world. This is due to the unique architectural style of the temple, which is completely made out of stone and comprises fine stone carvings. The entire structure, resembling a colossal chariot with 12 pairs of wheels, lavishly sculpted with symbolic motifs and pulled by seven horses, was so designed to let the first rays of the sun fall on the main entrance, say experts. The main attraction of the temple is its twelve pairs of wheels located at the base of the temple. These wheels are not ordinary wheels but tell time as well – the spokes of the wheels create a sundial. SourceHindufaqs One can calculate the precise time of the day by just looking at the shadow cast by these spokes. The Science behind the Construction.  A heavy magnet was placed at the temple top and every two stones of the temple is sandwiched by iron plates. The idol was said to have been floating in air due to the arrangement of magnets. Sourcepinimg The unique arrangement of the main magnet along with the other magnets caused the main idol of the temple to float in air.  Stories Which Remain As Legends With No Answers The temple had iron beams between the stones and a central magnet which held the beams in place. Later the loadstone was removed during the Portuguese period since it was disturbing the compasses and ships running aground. The other stones/beams held in alignment by magnetic force till now, crashed regularly to bring the destruction.   Statue of sun god at Konarak sun temple,Konarak,Orissa,India World Heritage The main pratima (idol) was believed to be floating in the air because of the unique arrangements of the main magnets and other series of magnets. When the balance was disturbed, it was shattered in the absence of binding forces. The placement of the temple had been aligned in a way that the first rays of the sun falling on the coast would pass through the Nata Mandir and would reflect from the diamond placed at the centre of this idol in the main sanctum. This phenomenon would last for a couple of minutes in the early morning.  An 1838 painting by Fergusson Local legends say that the huge 12 chariot wheels have been designed as sun dials to find time accurate to 1.5 minutes. To calculate this, one must place a long stick at an axis parallel to ground and note where the shadow falls. The distance between two wider spokes is of three hours (180 minutes). This is subdivided by the thinner spoke into 90 minutes. This is subdivided by 30 beads in the rim into three minutes. Depending on where the shadow falls in the bead, it can be refined to 1.5 minutes. Also, for each month, a particular wheel needs to be selected. Even the modern day sun dials have sidereal corrections to cover lateral movement of sun over seasons and its efficacy still remains a myth. Iron Beams  There was an advanced smelting foundry for casting iron beams, which interspersed stone beams and boulders to bear load  Madala Panji – the chronicle of Puri Jagannath Temple started by Anandavarma Chodagangadev (1078-1150), and also talks about some of the events of the Sun Temple. Researchers have painstakingly collated this palm script manual with 23 leaves written in Karani script in Old Oriya. This details the temple plan, full view diagrams and cross sections. These are the only visual clues to the original state of the temple as it stood in the 16th century. courtesy :- The Many Mysteries Of The Konark Sun Temple, by Sivasankar Babu - Jul 14, 2018, 2:41 pm   KONARK WHEEL Sun Temple of Konark is renowned throughout the world for its stone sculptures. The temple was designed in the shape of a huge chariot drawn by 7 mighty spirited horses on 12 pairs (total 24 wheels) of gorgeously decorated wheels at its base. The size of the wheel is of 9 feet 9 inches in diameter and each one of them having 8 wider spokes and 8 thinner spokes.Out of these 24 wheels 6 are in either side of the main temple, 4 wheels are on each side of the Mukhasala and 2 wheels on each side of steps at eastern front. The huge wheels of the Konark Temple are one of the major attractions for visitors. Various theories have been advocated regarding the significance of Konark wheel. According to some, the 7 horses represent the days of the week and the 12 pairs of wheels represent the 12 months of the year and the 24 wheels signifies 24 hours of a day and the 8 major spokes signifies prahars (three hour period) of a day. According to others, the wheels of the chariot have been interpreted as the 'Wheel of Life'. They portray the cycle of creation, preservation and achievement of realisation. These 12 pairs of wheels may also possibly represent the 12 zodiac signs. Some also believe that the Wheel of Konark is the same as the Dharmachakra of the Buddhists - The Wheel of Karma, The Wheel of the Law. out of these 24 wheels, 2 wheels will show you the time accurately from sun rise to sun set. In the wheel and you put your finger at centre of the axel and along with other tourists was surprised that the finger's shadow showed the precise time of the day. It's difficult to explain the technique in writing so I created following images based on his explanation.  The Konark wheel has 8 wider spokes and 8 thinner spokes. The distance between two wider spokes is of 3 hours (180 minutes). The thinner spoke between two wider spokes is of 1.5 hours (90 minutes). There are 30 beads between one wider spoke to the next thinner spoke and each bead represents 3 minutes. The Sun dial shows time in anti-clockwise and the top centre wider spoke represents 12 o' clock midnight. courtesy :- Konark Wheel, Konark Temple Wheel, Wheel of Konark, Konark Sun Dial _______________________________________ some of the other pictures 2. Brihadeeswara Temple, Tanjore, Tamilnadu,  Thanjavur Brihadeeswara temple is one of the most ancient temple, situated in the city of Thanjavur in Tamil Nadu, India. Thanjavur named after the legendry asura \"Tanjan\", is one of the ancient temples in India. In ancient days, Thanjavur known as “The rice bowl of Tamil Nadu,” was an important city to the ancient Cholas. It was remade by the Cholas from a collection of villages into a major temple center 1000 years ago, with the construction of the Brihadisvara Temple in the center of the city, and the city then built up around it.  How did Cholas lift 80 tons of Granite to a 216-foot tower (Gopuram) at the Tanjore Brihadeeswarar Temple?  The vimanam(temple tower) is 216 ft high. How did the cholas lift 80 tons during those days when the modern equipment a were not available? Did they use cranes or some other method to lift the kumbham? Shadow Disappears at noon: The most intersting part of this temple is the shadow of the temple, which surprisingly never falls on the ground at noon  . The Brihadeshwar Temple is one of the tallest temples in the world and is so designed that the viman does not cast a shadow at noon during any part of the year.  Musical pillars: At the entrance of sanctum sanctorum, one can see the two idols of Ganesha in the corridor. On taping the two, you will feel the sound traveling through stone in one idol and through metal on the other. The main hall of the temple is said to have been used by the dancers and musicians performing in service of Shiva. There are some musical pillars producing different sounds when tapped.     3.Kailasa Temple Engineering Marvel Of India’s Master Builders The Kailasha or Kailashanatha temple is the largest monolithic rock-cut temple in the world, located in the Ellora Caves, Maharashtra, India. A megalith carved out of one single rock, it is considered one of the most remarkable cave temples in India because of its size, architecture and sculptural treatment  Construction method The Kailasa Temple is notable for its vertical excavation—carvers started at the top of the original rock and excavated downward. The traditional methods were rigidly followed by the master architect which could not have been achieved by excavating from the front.  where each pillar will speak its divine value   The construction is so pious and strong that several attempts by terrorist aurangazeb and his Islamic followers to break the the temple pillars and cause denigration to the divine structure only led to further decimation of Mughal invasion. And very minor damage was done to some of the elephants present in huge structure    The Kailasa temple is crown and part of the Ellora cave group. It is built at number 16th cave among total of 34 caves. The Ellora caves are not natural caves that is built by nature out of wear and tear of seasons and movement of earth, but spiritual dwellings excavated manually by Hindus out of the face of a cliff. Built between 5- 6 th century.       4. Temples of Mahabalipuram – Chennai , Tamilnadu Mahabalipuram, situated about 60 km south of Chennai in Tamil Nadu, is an ancient port town known for its stone carvings and stone temples. It was built largely between the 7th and the 9th centuries. This port city of Pallavas is a one of a kind tourist destination worth a visit.  According to the legends and history books, Mahabalipuram or Mamallapuram was called ‘Kadalmalai’ meaning the land of sea and mountain. Later it got its popular name Mahabalipuram after the the kind-hearted asura king Mahabali. However, when the Pallavas started ruling the place, the name was changed again and kept after the name of one the first powerful kings from this dynasty namely Narasimhavarman-I who was also known as Mamallan  1. The group of monuments is a UNESCO World Heritage Site.  When seen from a distance it resembles the Dharamraja rath (Chariot). The shore temple is a collection of seven temples or seven pagodas as popularly known. Out of these seven temples five temples are still visible while two temples are submereged in the water. The tip of one such temple can be seen inside the water during a ferry ride which is available near to the beach area. 2. There are five chariots dedicated to the Pandavas.  3. There are bass reliefs (structures protruding from the base of the rock) of the Descent of the Ganges that are very famous.  4. These temples were built by three generations of the Pallava Kings and it took 200 years to plan and create the site.  5. Shore temple is the most prominent of them all.  6. The Shore Temple is the last monument built and was built from the top to the bottom, unlike most others in general.  7. Most of these monuments are monolithic, i.e. carved out of one single rock.  Krishna’s Butter Ball: Weird But True: The mystery of the balancing rock of Mahabalipuram  This is one of those unexplained mysteries in science. At Mahabalipuram the 20 feet high and 5 meter wide rock estimated to weigh over 250 tons seems to pull off a balancing act like no other. Known locally as Krishna’s Butter Ball is not a rock that stands on an extremely small and slippery area of a hill. It’s hard not to wonder how such a big structure is stationary at a place where it’s impossible to be so. And it’s been there for over 1200 years. Yes you heard that right 1200 years seemingly defying the laws of physics. Its original Tamil name is \"Vaanirai Kal\" which literally translates to \"Stone of The Sky God\" Fact: This rock is bigger and heavier than the monolithic stones of Ollantaytambo, Peru or Machu Picchu. The science: The rock is balanced upon a 4 feet area of the hill. Its simple physics that a structure needs a 250 ton rock has a far-fetched chance of resting on a 4 feet area for such a long period. To site imagery, imagine a ball on a slope, unless it has a heavy footing it rolls down pretty fast. The push attempt: In 1908 the then Governor of Madras Arthur Lawley decided the boulder to be too dangerous to nearby homes and wanted it removed. Seven elephants were employed to push the rock. But to everyone’s surprise the rock couldn’t be moved and the task was abandoned. INTERESTING FACTS ABOUT THE SHORE TEMPLE: The Shore Temple was classified as UNESCO World Heritage Site in 1984.Each year in winter (December/January), Dance festival is organized by Department of Tourism, Govt. of Tamil Nadu. Classical Indian dances like Kathakali, Bharatanatyam, Kathak , Mohini Attam, Kuchipudi and Odissi are performed by the stalwarts in the month long festival.The rows of beautifully stone carved Nandi bulls line the boundary of the temple.A large statue of the mythical Varāha (Avatar of Vishnu in the form of boar) stands on the newly excavated new site on the south of the Shore Temple.The Shore temple looks like a chariot when seen from a distance.Thank you for reading hope you have enjoyed the journey. what i know is only limited. There are still more unknown wonders are there . people who has knowledge can share.  I have added two more as there are more request from Quora readers to include.  In South India, five temples were built for each of the five elements – Earth, Water, Fire, Air and Space. These are the Pancha Bhuta Sthalas. Geographically, they are all within the Deccan Plateau – four in Tamil Nadu and one in Andhra Pradesh. The temple for water is in Thiruvanaikaval, fire is Thiruvannamalai, Kalahasti is air and Kanchipuram is earth. The temple for space is in Chidambaram.  The Chidambaram temple is an incredible space. The newer part of the temple is around a thousand years old but no one knows how old the older part of the temple is. People say it is 3,500 years or more  CERN in Switzerland, which is the physics laboratory on the planet, where all the atom-smashing takes place, I saw that there is a Nataraja statue in front of the entrance, because they identified that there is nothing in human culture which is closer to what they are doing right now.  CHIDAMBARAM: Symbolism behind the structure of a Shiva Temple 1. The temple is so constructed as to resemble the human body with all its subtleties.  2. The five walls encircling one another are the kosas ( sheaths) of human existence . a. The outermost is the Annamaya kosa , symbolizing the material body. b. The second is Pranamaya kosa , symbolizing the sheath of vital force or prana. c. The third is Manomaya kosa, symbolizing the sheath of the thoughts, the mana d. The fouth is the Vignyana maya kosa, symbolizing, the sheath of the intellect e. The fifth and innermost is the Ananda maya kosa, symbolizing the sheath of Bliss.  3. The sanctum which is in the prakara symbolizing the Ananda Maya Kosa sheath , houses the lord, seated as the Jiva within us. It is to be noted that the sanctum is an unlit space, just as if within the heart closed on all sides.  4. The entry Gopuras are likened to the feet, as resembling a person who is lying on the back with the toe up.  5. The flag post depicts the sushumna nadi which raises from the Mooladhar (base of the spine ) to the sahasrar ( vertex in the head).  6. Some temples will have three prakarams. There they represent the stoola, sukshma and karana sareeras (bodies) of a human being Some temples have only one and they represent all the five.  CHIDAMBARA RAHASYAM (THE SECRET)  After 8 years of R & D, Western scientists have proved that at Lord Nataraja's big toe is the Centre Point of World's Magnetic Equator. Our ancient Tamil Scholar Thirumoolar has proved this Five thousand years ago!  His treatise, Thirumandiram is a wonderful Scientific guide for the whole world. To understand his studies, it may need a 100 years for us.  Chidambaram temple embodies the following characteristics :  1) This temple is located at the Center Point of world's Magnetic Equator.  2) Of the \"Pancha bootha\" i.e. 5 temples, Chidambaram denotes the Skies. Kalahasthi denotes Wind. Kanchi Ekambareswar denotes land. All these 3 temples are located in a straight line at 79 degrees 41 minutes Longitude. This can be verified using Google. An amazing fact & astronomical miracle!  3) Chidambaram temple is based on the Human Body having 9 Entrances denoting 9 Entrances or Openings of the body.  4) Temple roof is made of 21600 gold sheets which denotes the 21600 breaths taken by a human being every day (15 x 60 x 24 = 21600)   5) These 21600 gold sheets are fixed on the Gopuram using 72000 gold nails which denote the total no. of Nadis (Nerves) in the human body. These transfer energy to certain body parts that are invisible.  6) Thirumoolar states that man represents the shape of Shivalingam, which represents Chidambaram which represents Sadashivam which represents HIS dance!  7) \"Ponnambalam\" is placed slightly tilted towards the left. This represents our Heart. To reach this, we need to climb 5 steps called \"Panchatshara padi\" \"Si, Va, Ya, Na, Ma\" are the 5 Panchatshara mantras.   There are 4 pillars holding the Kanagasabha representing the 4 Vedas.  8) Ponnambalam has 28 pillars denoting the 28 \"Ahamas\" as well as the 28 methods to worship Lord Shiva. These 28 pillars support 64 +64 Roof Beams which denote the 64 Arts. The cross beams represent the Blood Vessels running across the Human body.   9) 9 Kalasas on the Golden Roof represent the 9 types of Sakthi or Energies.   The 6 pillars at the Artha Mantapa represent the 6 types of Sashtras.   The 18 pillars in the adjacant Mantapa represents 18 Puranams.  10) The dance of Lord Nataraja is described as Cosmic Dance by Western Scientists.   Whatever Science is propounding now has been stated by Hinduism thousands of years ago !  Hinduism is not just religion. It's a way of living Chidambaram temple and its symbolism:    Meaning: “Sivalingam is of the form of the human body; So is Chidambaram ; So is Sadasivam ; And so is his divine dance”.  1. Nataraja’s dance is said to indicate the five divine acts which are a. Creation . Nataraja dances with a small drum called damarukam in one of hisright hands. Easwra is nada brahmam. He is the origin of all sounds (nadam).This isthe seed (vindu) from which the tree of the Universe emanated. b. Protection (Operation)- In another of the right hands, he shows the ‘AbhayaMudra’, meaning he is the kind protector . c. Destruction; He has fire in one of his left hands , symbolizing destruction.When everything is destroyed by fire, only the ash will remain which the Lord hassmeared on his body. d. The foot which is planted shows the act of hiding e. The raised foot shows the act of bestowing 2. Nataraja swamy has the Vigraha ( icon) of Devi Sivakama Sundari to his left . This symbolizes Ardhanareeswara , ‘ the Lord who has the female as his left half’. To his right there is a screen. When the deeparadhana – showing lamps takes place to the swamy and to the left side , the screen is removed and we see five vertical long hangings of golden vilva leaves. We see nothing behind it. Sivakami shows the Saguna Brahman (the God with a form) that is Nataraja . The Saguna Brahman leads us to the Nirguna Brahman (the God without form or the God who has formlessness as his form). This is told as ‘Chidambara Rahasyam’ by the Dikshitars , who are the traditional pujaris in the temple. 3. Shiva’s dance is called the cosmic dance by many scholars. In Chidambaram, this dance is called ‘Ananda Tandava’ 4. Lord Maha Vishnu also saw the Divine dance. In a nearby mantapa called Chitrakoota, Maha Vishnu, gives us dharshan in his fully reclining Yoga Nidra pose on the snake bed. If one stands on a small lotus sculpted on the floor slab in front of Narayana, one can at the same time see Nataraja in his right side. 5. Sages Patanjali and Thirumoolar also saw Nataraja’s dance in Chidambaram. Their figures are embossed on the Silver doors of the Chit Sabha. LEPAKSHI TEMPLE:  The guide whipped out a twig from his shirt pocket with a flourish and said dramatically: “Now I show you best part of Lepakshi temple.” He got down on his knees before the large grey pillar before us. Bending forward, he passed the twig slowly under the pillar. From one end to the other! There was an audible gasp from the group of tourists, mostly Europeans, as the twig emerged from the other side. He repeated the exercise with a page of an old grimy newspaper which he pulled out from another pocket.  This was the famed Hanging Column or Pillar of Lepakshi temple, located in Anantapur district in southern Andhra Pradesh. “This is the pillar which does not rest on the ground fully,” the guide said, rising to stand beside us, and beaming triumphantly, almost as if he were the architect of this marvel. There are about 70 pillars at this fabulous 16th-century temple of stone in Vijayanagar style, but this one is the best known and a tribute to the engineering genius of ancient and medieval India’s temple builders. However, it is a bit dislodged from its original position — it is said that during the British era, a British engineer tried to move it in an unsuccessful attempt to uncover the secret of its support. Kindly give your feedback and comments. Thank you. ",
            "date": "Updated July 26, 2019",
            "views": "2559",
            "upvotes": " View 6.2K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Madhav Aditya",
                    "user_href": "/profile/Madhav-Aditya-1"
                },
                {
                    "user_id": "Kamal Pallav",
                    "user_href": "/profile/Kamal-Pallav"
                },
                {
                    "user_id": "Shantanu Pandey",
                    "user_href": "/profile/Shantanu-Pandey-142"
                },
                {
                    "user_id": "Sriyaan Desai",
                    "user_href": "/profile/Sriyaan-Desai"
                },
                {
                    "user_id": "Jayaprakash Dash",
                    "user_href": "/profile/Jayaprakash-Dash"
                },
                {
                    "user_id": "Devendra Khanapurkar",
                    "user_href": "/profile/Devendra-Khanapurkar"
                },
                {
                    "user_id": "Vijay Ganesh I",
                    "user_href": "/profile/Vijay-Ganesh-I"
                },
                {
                    "user_id": "Arpitha Hegde",
                    "user_href": "/profile/Arpitha-Hegde-11"
                },
                {
                    "user_id": "Namrata Jadhav",
                    "user_href": "/profile/Namrata-Jadhav-52"
                },
                {
                    "user_id": "Aayanam Anirudh",
                    "user_href": "/profile/Aayanam-Anirudh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priyanshu Tiwari",
                "href": "/profile/Priyanshu-Tiwari-3"
            },
            "answer_text": "India has been rightly described as the land of mysteries, the subcontinent holds many mysteries across it’s span which cannot be easily explained through logic and science. Some people find them to be divine while some other brush them off as unique natural phenomenons but to date there are no logical explanations for the following: Musical Pillars of Vittala Temple,HampiThe growing Nandi Idol of Yaganti Uma Maheswara TempleFloating Stones of RameshwaramMassive Bird suicides in the village of Jatinga in AssamThe Mystery of Roopkund LakeThe Mysterious Language of the Son Bhandar Cave-Gateway to riches unimaginableMusical Pillars of Vittala Temple,Hampi  Vittala Temple in Hampi is one of the largest structures in the complex of Hampi located on the banks of the Tungabhadra River. This structure is of great historical significance. Apart from this the other thing which catches one’s attention is the 56 pillars which produce musical sounds when tapped. This has been a mystery for a long time, to find out the reason the britishers broke two of the pillars but nothing could be found. Though it is not allowed to tap on it now to preserve the monument but this is one Mystery that Science has not been able to prove. The Mysterious Language of the Son Bhandar Cave  This is a single rock structure which is believed to be holding the riches of Bimbisara, the king who laid the foundation of the great city of Pataliputra, It so happened that Bimbisara’s wife hid the treasures in this cave when the King was imprisoned by his son.There are inscriptions on the wall of the cave in Sankhlipi.It is believed that whoever deciphers the inscriptions, he will be able to open the doorway to the treasure. The activity of opening this doorway was once tried by the British by using their cannonball; result— the British were unsuccessful and they only managed to leave a big black mark on the wall which is still visible. The growing Nandi Idol of Yaganti Uma Maheswara Temple  The Yaganti temple located in the Kurnool district is a popular temple of Lord Shiva and it sees a large amount of people comming every year. The mystery associated with this place is that the statue of the Nandi,which is made of solid rock, keeps on growing every year and this is no myth but the Archaeological Survey of India has certified that the rock used to build the statue shows growing behaviour and it grows by about one inches every twenty years! Floating Stones of Rameshwaram  Hindu mythology has it that to rescue his wife Sita from Ravana, Lord Rama built a floating bridge from Rameshwaram to Sri Lanka across Palk Strait. The bridge is known as Rama Setu or Adam’s Bridge. The mysterious thing about this place is that some stones found around Rameshwaram,the place where the construction of the bridge is believed to have started, have been found to float on water. Though these stones look like normal stones but the unusual thing is that they float on the water. Many scientists have tried to propose theories for this but there is still no concrete explanation. Massive Bird suicides in the village of Jatinga in Assam  Post monsoon period in Jatinga leads to a climatic condition that can be described as misty and foggy and it is during this time that the village witnesses a weird phenomenon. A strange behavioral change is seen in the local and migratory birds. They become disoriented, get drawn towards light, and land on the ground with no attempt to fly again. Contrary to the popular belief that birds commit suicide, such disheveled birds fall victim at the hands of villagers while others hit against objects or trees. However, mysteriously, such a phenomenon is observed only at a particular strip of Jatinga Ridge and not the entire place. Also, what makes the birds stop continuing their flights after landing, is yet to reach a conclusion. The Mystery of Roopkund Lake   Roopkund Lake is around 16500 ft above the sea level situated in the Garhwal region of Uttarakhand this place is famous for its scenic trek,but it is also eerily remembered for the lake of skeletons. In 1942, the skeletal remains were first noticed when the harsh summer started melting the ice. A British forest guard noticed a huge number of human skeletons lying haphazardly and floating along the edges of the lake. Initially, the skeletons were believed to be the remains of those Japanese soldiers who were killed during war, but in 2004 this theory was proven wrong. In 2004, it was discovered that the remains date back to 850 AD. Since then, several theories have been put forward to explain this incident, but nothing concrete has come so far. One can still see these remains during summers when the ice starts melting. Thanks For Reading…. ",
            "date": "Answered July 28, 2019",
            "views": "18",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Evangelyn O'Mohundro",
                    "user_href": "/profile/Evangelyn-OMohundro"
                },
                {
                    "user_id": "Vishay Garib",
                    "user_href": "/profile/Vishay-Garib"
                },
                {
                    "user_id": "Hunter Fuller",
                    "user_href": "/profile/Hunter-Fuller-11"
                },
                {
                    "user_id": "Cindy Stewart",
                    "user_href": "/profile/Cindy-Stewart-110"
                },
                {
                    "user_id": "Margie Soto",
                    "user_href": "/profile/Margie-Soto-10"
                },
                {
                    "user_id": "Kavita Dapke",
                    "user_href": "/profile/Kavita-Dapke"
                },
                {
                    "user_id": "Mae Kim",
                    "user_href": "/profile/Mae-Kim-16"
                },
                {
                    "user_id": "Tyrone Riley",
                    "user_href": "/profile/Tyrone-Riley-14"
                },
                {
                    "user_id": "Daisy Palmer",
                    "user_href": "/profile/Daisy-Palmer-20"
                },
                {
                    "user_id": "Sriram (శ్రీరామ్)",
                    "user_href": "/profile/Sriram-శ్రీరామ్"
                }
            ]
        }
    ]
}