{
    "title": "What are some other types of metaphysics besides 'spiritual metaphysics'? - Quora",
    "tags": [
        "Metaphysics",
        "Spirituality of Everyday Life",
        "Spirituality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce R. Bain",
                "href": "/profile/Bruce-R-Bain"
            },
            "answer_text": "All metaphysics correspond in some way with what is spiritual or supernatural. It is so far as I can tell, impossible to refer to any metaphysical identity as a “physical identity” because they cannot be shown to have any physical element or any physical composition which constitutes the identity. For example, if a beginning is made considering the concept of law (as in natural law) it is not a natural identity but a metaphysical identity. It is not merely the phrase natural law which is a metaphysical identity in science. A significant portion of all scientific vocabulary and phrasing, , if not indeed ALL the scientific vocabulary, corresponds with metaphysical identities. What is referred to as a natural law provides (regarding the words themselves) no natural substance. At best, references to natural law show relationships in the context of Triangulation of Vectors. The primary activity in science (as in the other knowledge domains) is naming and classifying by category of the identity. All names are metaphysical identities. “,2,3,4,5,6,7,8,9, 0,” and “a,b,c,d,e,f, …etc.” are all metaphysical identities. They do not exist as natural phenomena. Such identities do not exist in a chemical relationship. They do not exist in a thermodynamic relationship. They do not exist in a causal relationship. The do not exist in a biological relationship. Attempts to distinguish all of science from “spiritual metaphysics” is associated with such a serious complication, that when attempted, science itself starts to be denied. This is the case with such speculations as “Emergent Theory”. In specific, it eliminates logically the correspondences in the causal relationship. Thus, when the question pursues a nonspiritual metaphysics, it is based upon a contradiction in terms and becomes a logically incoherent inquiry. All metaphysics can be known as correspondences with supernatural phenomena, spirit, or breath, or consciousness or mind. It is inescapable, which is why the ancient problem referred to as The Mind/Body Problem (MBP) continues from the most ancient times to this very day. Mental identities or abstract concepts as they are often called, cannot be reified. Definitions of real continually tend to include a “spiritual metaphysic”. That is why mental objects or “abstract concepts” like natural laws are regarded as real identities. Therefore, when the inquiry has for its subject an identity such as types the domain of the metaphysical (or “spiritual metaphysics” has already been introduced into the address of the subject. If an intelligibility (repeat I N T E L L I G I B I L I T Y or intelligence) is in any way, means, shape, or form, the ancient correspondence with Logos (“The Word”) is continually affirmed. The distinction between nomos and phusis (or physis) does not just go away with a little rhetorical flourish. These form a dichotomy which remains. ",
            "date": "Answered May 7, 2020",
            "views": "74",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Peter Tatford",
                "href": "/profile/Peter-Tatford"
            },
            "answer_text": "There is no such thing as “spiritual metaphysics”. Metaphysics (or at least good metaphysics) is relentlessly logical. Metaphysics explains physics, not fimbly feelings. ",
            "date": "Answered May 11, 2020",
            "views": "18",
            "upvotes": "0"
        }
    ]
}