{
    "title": "What are the patterns in life? - Quora",
    "tags": [
        "Patterns",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Skon",
                "href": "/profile/James-Skon"
            },
            "answer_text": "If something wants to hide, all it has to do is move slowly. *skip to the bottom for the life hack* When I was in High School (aka secondary school) I had an acquaintance that was incredibly smart, worked hard, and we all thought she would “make it.” As time went on, she kept doing more and more - despite a rather undesirable upbringing. Year 11 she started dating a guy who was involved in some less-than-desirable activities. She continued dating him while I knew her, and since I didn’t see much of a change in her I didn’t think anything of it.  Let me take a quick break from her and fill you in on a secret I learned about humans: We don’t tend to notice slow changes. This is known as the slow-change blindness effect.[1] [2] [3] [4] You might be thinking what I thought when I read about this, “What an enormous flaw!” To learn why we have this ‘flaw’, we have to travel back in time.  Imagine with me: You’re hungry, scared, and a bit annoyed…It has been 3 days since your last meal. You want food and you want it NOW. You finally catch your food, eat it, and the day is over. The next day, you wake up to find a chill coming over you…It’s time to move again. Then across the plains you go! Off to the next meal or place to stay. Now we can look at this across time; weeks turn to months, months turn to years, and eventually, we died.  There has been no true reason to remember things across time within ourselves or others. (Outside of the basics for survival.) We only need the next few months or years. (Although the fact you’re on Quora signifies that you’re interested in remembering more than that - Thus improving yourself.[5] )  This starts to become an issue when we are looking to improve ourselves and measure things across time. Don’t believe me? Let me prove it. What are 3 concrete lessons you’ve learned in the last 2 months? If you’re anything like me, you don’t have an answer ready for this question. It’s hard to truly measure! I ask myself this around 6 times a year. Every time it’s the same story, struggle to remember and quantify, examine journal, and solidify my list. (To add to the complexity of this, you can also ask your friends what changes that have noticed in you.)   Here’s a common proverb about this effect: Frogs normally won’t go into boiling water. They’ll jump out and keep themselves away from very hot water. But, if placed in a tub of water at normal temperature that is being heated slowly, according to the anecdote, they don’t react and end up getting cooked in the boiling water.[6][7] (This is FALSE, please don’t go boil a frog. Still a good story nonetheless.)  Back to my acquaintance. She is now a few years older and has slid further than anyone could have imagined. Nothing has changed for the better, and the feedback loop of good habits has almost disappeared. The guy she still dates has ended up doing even worse things and he led her into another terrible feedback loop. She is in a negative feedback loop - A downward spiral to an unfulfilled life. This story has no happy ending. This is a life lived with the slow-change blinders on.  (Don’t live like this.) I saw this happen from the same classroom to thousands of miles away and feel terrible for her. I would never want someone I love to experience this.   My argument: I don’t believe we’re truly capable of tracking ourselves across time.[8] [9][10][11][12] As you’ll see below, I don’t trust myself to remember what I do. We can barely keep up with the changes of our closest friends…what makes me think I can track my own? I keep an Excel sheet of changes to my mood and life, but even that is difficult to objectively measure. The point I’m trying to make is: What are you doing right now that will affect you in 6 months? Are you blind to the things that will affect you over time? How do your feedback loops currently hurt you?  Here’s the life hack. How to track the impact of your feedback loops: There’s a saying by Peter Drucker, “What gets measured gets managed.”[13] If you’re relying on your mind to track your changes… I hate to say it, but you’re wrong.[14] [15] [16] How I track myself across time: I record a video, write 200 words, or record a voice note. Something easy that takes 5 minutes. Then I say “Hey Siri” or “Hey Google” and mention that I’d like to be reminded of this video in 4 months. I’ve become considerably more aware of my own feedback loops and how my friends' feedback loops affect me. When I lived in Germany, I was quite consistent. Almost every video from there is joyful and upbeat. Korea? Same story. Happy and ready to explore.  Now the new story in Hawaii? I’ll tell you in a few months. (Want to start reading more? Here’s my unpopular opinion.) Footnotes[1] A new type of change blindness: Smooth, isoluminant color changes are monitored on a coarse spatial scale[2] Slow change deafness[3] Change Blindness[4] http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.871.1929&rep=rep1&type=pdf[5] The evolution of foresight: What is mental time travel, and is it unique to humans? | Behavioral and Brain Sciences | Cambridge Core[6] The Old Tale of a Boiling Frog[7] Boiling frog - Wikipedia[8] Rational Choice, Agency and Thoughtfully Reflective Decision Making: The Short and Long-Term Consequences of Making Good Choices[9] A Bias Toward Short-Term Thinking in Threat-Related Negative Emotional States[10] ScienceDirect[11] http://richardslaughter.com.au/wp-content/uploads/2018/03/Slaughter_Long-term-thinking-and-the-politics-of-reconceptualization_1996.pdf[12] https://www.tandfonline.com/doi/abs/10.1080/0163853X.2010.541854[13] What Can’t Be Measured[14] Our changeable memories: legal and practical implications[15] ScienceDirect[16] The effect of experience and complexity on order and recency bias in decision making by professional accountants",
            "date": "Updated December 18, 2018",
            "views": "13",
            "upvotes": " View 35 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quiroben Tesado",
                    "user_href": "/profile/Quiroben-Tesado"
                },
                {
                    "user_id": "Korey Daniel",
                    "user_href": "/profile/Korey-Daniel"
                },
                {
                    "user_id": "Joey Lim",
                    "user_href": "/profile/Joey-Lim-172"
                },
                {
                    "user_id": "Sindiso Gumbo",
                    "user_href": "/profile/Sindiso-Gumbo"
                },
                {
                    "user_id": "Manoj Veera",
                    "user_href": "/profile/Manoj-Veera"
                },
                {
                    "user_id": "Abhineet",
                    "user_href": "/profile/Abhineet-17"
                },
                {
                    "user_id": "Thomas Wan",
                    "user_href": "/profile/Thomas-Wan-12"
                },
                {
                    "user_id": "Arsv Manikumar",
                    "user_href": "/profile/Arsv-Manikumar"
                },
                {
                    "user_id": "Brian Zhang",
                    "user_href": "/profile/Brian-Zhang-151"
                },
                {
                    "user_id": "Mark Moniz",
                    "user_href": "/profile/Mark-Moniz-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob White",
                "href": "/profile/Bob-White-255"
            },
            "answer_text": "Though there are many different ways to look at patterns, my belief is that all patterns are originated in our Creator. Our minds are a minute dirivative of that original mind. From our viewpoint, as one grain of sand, look out upon other grains of sand, upon the beaches of sand, upon the shorelines and upon the sand dunes of the earth, upon our planet in orbit around our sun, upon our solar system's position in our Milky Way galaxy, upon the upteen gazillion galaxies of the universe. Now try to contemplate that this viewpoint is just of the nonliving material universe. Now try to contemplate the same viewpoint from a life force origin. An original living bit of material, grouped in a combination of chemical units, arranged in a double helix pattern, pumping out instructions to surrounding living material to duplicate the pattern of the first group, then replicate the same thereafter. From DNA, to cell, to organ, to organism, to creature. The patterns of the universe are everywhere, to be observed with the eye, and to evaluate and contemplate with the mind. ",
            "date": "Answered October 27, 2018",
            "views": "758",
            "upvotes": "0"
        }
    ]
}