{
    "title": "What can I do with a major in International Relations and minor in Economics? - Quora",
    "tags": [
        "Career Planning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andy Johns",
                "href": "/profile/Andy-Johns"
            },
            "answer_text": "I was a fellow international relations major and graduated from UCLA in 2005. Since then I have done absolutely nothing with the degree in terms of practical application in a career. I don't say that to discourage you and say \"you chose a stupid major!\" I say that because that's the reality with just about any degree you get from a major liberal arts institution. The fact is that a minority of schools and a minority of degrees prepare you to do a specific type of work after you graduate, especially within liberal arts schools.  As long as you enjoy the subject you are learning then I'd say you chose a great degree. The same applies to work. If you choose a line of work that you hate then I would say you chose the wrong career. If you choose a line of work that you enjoy doing daily, then you chose a great career. The same logic applies to school. Don't let anyone tell you otherwise. If you decide to dedicate 4 years of your life and $50,000 - $100,000 of cost then you better love what you're studying. Otherwise you're a moron or a masochist.  But that doesn't mean your options are limited if you want to work in a specific field that has no overlap with what you studied in IR. I have worked at startup companies in consumer technology and consumer finance since graduation. The way in which I earned my first job though was unconventional. First, I got every job or internship I could get my hands on in college. That way future employers saw I had work experience which matters much more than the 4.0 GPA (or 2.9 GPA in my case). Of course if you want to get a professional degree (eg Law, Business, Medical) then you need to focus on GPA since that is heavily weighted in graduate school admissions. But otherwise, get good enough grades but get great work experience.  By the time I graduated from college I had nearly 3 full years of work experience averaging 20 - 25 hrs/week. Then instead of focusing on the type of company I wanted to work at or if it was at a big name firm (screw glamour) I wanted to find a good leader and mentor that I could work for. I found a man by the name of Maurice Salter. He had his PhD, was a successful entrepreneur, a family man and a philanthropist. I looked at him and thought \"that is the type of person I want to work for\". So I managed to dig up his personal email address (thank you internet) and spend a Sunday morning at a nearby coffee shop crafting the perfect email. I figured I had one chance to seduce him by email into agreeing to meet with me. I shot him the email and just a few hours later had a response! Coincidentally he was flying to New York for work and saw my email. He responded and agreed to meet for lunch.  About two weeks later I was in his high rise office overlooking Sepulveda in West Los Angeles. I felt like I was in an episode of the apprentice and about to head into Donald Trumps office to make or break my fate. I walked in and sat on his couches. We shook hands and made intros. Then he said \"So, what do you want from me?\" I replied and said \"I want your job\". He laughed and said he wasn't ready to step down as CEO yet (which made me smile) and that's how the relationship began. 3 months later I was in his office grabbing lunch with him when one of his VP's walked by. He flagged him down and told him to write up a job description for me because I was going to start working for him.  That's how I landed my first job. And that's how I got introduced to the startup world.  Fast forward 5 years and I've been fortunate enough to spend them working at Facebook and Twitter as an internet marketer and product manager and have most recently joined Quora as a product manager. I don't have a technical background but I managed to make it work by being scrappy, asking a lot of questions, and finding a way to be successful.  So my advice to you can be condensed down into these points: Study what you enjoy. Don't waste your time paying to study shit you don't like. That's absurd! If the subject matter appeals to you and the professors make it fun to learn, then you're spending your money wisely. Yes, ideally you're studying something you love that also happens to lead to high paying jobs right out of college (eg finance or computer science) but if that isn't the case, who gives a shit. That's rare anyhow. You'll always have options as long as you.....Remain scrappy. Treat your personal life as a startup and build something out of nothing. I made $32,000 a year in my first job out of college. That's less than the amount of college debt I had. Fuck that sucked. But I worked hard and was aggressive and now my debt is gone and my job is awesome and I'm much closer to financial freedom than I would have ever imagined I would be. Get internships. I did all sorts of intern work. I spent 3 months in a cell biology lab cloning plants to isolate gene mutations. I spent 1 week interning at Morgan Stanley only to realize I hated that shit and the douche bag money lovers I had to work for so I quit and moved on. I spent 3 years as a teaching assistant and assistant administrator in the graduate school of education and loved that work. It taught me how to teach and to view education as an exploration of what you love and not an exploration of high paying jobs. I even started writing articles for health and fitness magazines and ended up in an abs informercial (don't even start... being greased up in vegetable oil and doing 10 hours of crunches with a smile on your face... not my finest moment!). From those jobs I experienced a diversity of lifestyles and gained random sets of skills. Most importantly I learned what I hate and that money wasn't worth it.In short, I think International Relations is a great degree. You get to study the dynamics of the world and how that is affected by human sociology, human politics, human triumph and human error. You won't really apply that to any work you do (minus joining the Peace Corps or related organizations). But you can apply that to your lens on life. I decided on International Relations two weeks before starting college because I remember sitting on the couch one morning watching the events of 9/11 unfold. I wanted to understand how and why something like that could happen. It inspired me to learn about the world a bit more. And today I work in consumer technology. 5 years from now I don't know where I'll be. Hopefully doing work that I'm really passionate about and be scrappy enough to make something out of it. ",
            "date": "Answered January 23, 2012",
            "views": "181",
            "upvotes": " View 95 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sabrina Bumstead",
                    "user_href": "/profile/Sabrina-Bumstead"
                },
                {
                    "user_id": "Riccardo Bistolfi",
                    "user_href": "/profile/Riccardo-Bistolfi"
                },
                {
                    "user_id": "Brendi Wilmore",
                    "user_href": "/profile/Brendi-Wilmore"
                },
                {
                    "user_id": "Michael Fernandez",
                    "user_href": "/profile/Michael-Fernandez-65"
                },
                {
                    "user_id": "Bunny Blue",
                    "user_href": "/profile/Bunny-Blue-13"
                },
                {
                    "user_id": "Kevin Bautista",
                    "user_href": "/profile/Kevin-Bautista-57"
                },
                {
                    "user_id": "Violette Lee",
                    "user_href": "/profile/Violette-Lee-6"
                },
                {
                    "user_id": "Lisa Castillo",
                    "user_href": "/profile/Lisa-Castillo-17"
                },
                {
                    "user_id": "Ashique Shajahan",
                    "user_href": "/profile/Ashique-Shajahan"
                },
                {
                    "user_id": "Sarah Jump",
                    "user_href": "/profile/Sarah-Jump"
                }
            ]
        }
    ]
}