{
    "title": "What are some Christian books to help me gain my faith back again? - Quora",
    "tags": [
        "Books About Religion",
        "Faith and Religion",
        "Book Lists",
        "Catholicism",
        "Christians",
        "The Bible",
        "Christianity",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jules Myers",
                "href": "/profile/Jules-Myers-2"
            },
            "answer_text": "I have a ton of of books that I’d love to recommend…but one that I really remember just giving me a new perspective was The Hiding Place- by Corrie Ten Boom. I love hearing peoples testimonies and seeing truly how God works in peoples lives. She has an amazing story…and one that I think would make you want to know this amazing God we service more. I spent the majority of my 20s agnostic and at one point I realized I really wanted to reconsider the Christian faith I grew up in. I decided I needed to know who Jesus was…and there was a book called “The Jesus I Never Knew” that really helped me understand Jesus better. LOVED it. I’d also recommend going to the website “I Am Second” and listening to peoples testimonies…so powerful. On my list of books to read is Seeking Allah finding Jesus as I heard it is a powerful book and testimony as well. Also, I would also suggest…just start talking to God. Pray, sing, write a letter to Him, go out in nature…whatever it might be that would make you feel close to Him and just poor your heart out. He so desires this closeness with you and HOW wonderful that you are seeking that right now! Life can throw us some curve balls that can test our Faith and I like to just remind myself of how powerful and loving HE is and all of the things He has done to transform me. If you have had those moments…reflect on them and be grateful for them and ask for more!! I have some other great sites if you need to get more into the Apologetic s part…there is so much evidence backing up the Christian faith…it isn’t all blind faith alone. ",
            "date": "Answered May 23, 2019",
            "views": "392",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Govardhan",
                    "user_href": "/profile/Govardhan-35"
                },
                {
                    "user_id": "Hannah Faraday",
                    "user_href": "/profile/Hannah-Faraday-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christina Wilson",
                "href": "/profile/Christina-Wilson-137"
            },
            "answer_text": "Hey friend. I’m so sorry to hear you feel like you’ve lost your faith. But I am also so encouraged knowing you want to get it back! I know God is going to meet you in this process and work something so beautiful. One book you might want to look into is Daring to Hope by Katie Davis Majors. A few years ago I was at a really hard place with my faith. I wouldn’t say I had lost it completely, but I was questioning a lot of what I had been taught because of some really hard circumstances in my life. Katie’s book is one of the things that really helped me walk through that. Daring to Hope is a beautifully honest book about finding God in the midst of the darkest, driest seasons. It really helped me understand that God was still present and hadn’t changed even though I was struggling to hard to hear and see Him. I hope the book might be encouraging for you as well :) I’m here if you ever want to talk about anything at all! ",
            "date": "Answered May 23, 2019",
            "views": "402",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Govardhan",
                    "user_href": "/profile/Govardhan-35"
                },
                {
                    "user_id": "Hannah Faraday",
                    "user_href": "/profile/Hannah-Faraday-1"
                },
                {
                    "user_id": "Noemi Rod",
                    "user_href": "/profile/Noemi-Rod-2"
                },
                {
                    "user_id": "Jules Myers",
                    "user_href": "/profile/Jules-Myers-2"
                }
            ]
        }
    ]
}