{
    "title": "What are the differences and similarities between the two linguistics sub-fields semantics and pragmatics? - Quora",
    "tags": [
        "Semantics",
        "English Linguistics",
        "Communication",
        "Linguistics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chu Pi",
                "href": "/profile/Chu-Pi-1"
            },
            "answer_text": "In short, semantics is the study of meaning,pragmatics is the study of context.The study of language actually distinguishes three branches: syntax, semantics and pragmatics. Syntax is concerned solely with relations between linguistic expressions;Semantics with relations between expressions and the objects to which they refer;Pragmatics with relations among expressions, the objects to which they refer, and users or contexts of use of the expressions.One note should be made is that semantics can operate in relative ignorance of pragmatics, but not the other way around. From an automatic interpretation, I can see that many artificial intelligence (AI) attempts have tried to automatically interpret texts’ content but not yet succeeded. The contexts to be considered are just too tremendously large (somewhat arbitrarily large) and we don’t know (yet) all the different ways in which context might influence interpretation. Reference: https://campuspress.yale.edu/zoltanszabo/files/2015/10/The-Distinction-between-Semantics-and-Pragmatics-1n5ehuq.pdf ",
            "date": "Answered June 24, 2016",
            "views": "209",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Ross",
                    "user_href": "/profile/Daniel-Ross-71"
                },
                {
                    "user_id": "Anjani",
                    "user_href": "/profile/Anjani-25"
                },
                {
                    "user_id": "Esra Alshammari",
                    "user_href": "/profile/Esra-Alshammari-1"
                },
                {
                    "user_id": "Abhinay Reddy",
                    "user_href": "/profile/Abhinay-Reddy-1"
                }
            ]
        }
    ]
}