{
    "title": "What are some facts about the Illuminati, not just conspiracy theories? - Quora",
    "tags": [
        "Illuminati",
        "Secret Societies",
        "Conspiracy Theories",
        "Theory and Theories"
    ],
    "response": [
        {
            "author_info": {
                "name": "Axel Hogwood",
                "href": "/profile/Axel-Hogwood"
            },
            "answer_text": "The real \"legitimate\" Illuminati hasn't been around for over 200 years now. The genuine Illuminati had the goal of creating an oligarchy of the scientific and philosophic elite. That said, there are several groups out there that call themselves, or others, \"Illuminati\" whose only real purpose is make money for themselves by preying on the gullible. Some of these use fake Masonic pyramid-scam organizations where the \"Illuminati\" is just one of the branches you can pay to join. One \"Illuminati\" that made infamy in recent years was the bogus \"Absolute Sovereign Supreme Illuminati Baphomet Grand Master David Henry 33' 99' X' 360', Chief of Masonic Fraternal Police\". Some of these are the same type of people as those who dress up in military uniforms and make false claims of heroism with \"above super top secret\" units. There is some form of mental illness there. Classic Walter Mitty syndrome. Studies have shown that manic episodes can often manifest a desire for fame/importance or even belief that the individual has achieved fame/importance. Some of these scams are complex and have fooled top level leaders. I recommend looking at how St. Therese of Lisieux was sucked down the rabbit hole of conspiracy hoaxes by the bogus \"Diana Vaughan\", a creation of swindler Leo Taxil. For an account of the authentic Illuminati (which includes translations of original documents), I recommend the book \"Secret School of Wisdom\" ",
            "date": "Answered October 25, 2018",
            "views": "797",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Havoc Parker",
                    "user_href": "/profile/Havoc-Parker"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Forshaw",
                "href": "/profile/Paul-Forshaw-1"
            },
            "answer_text": "What are some facts about the Illuminati, not just conspiracy theories? The Illuminati does not exist. The modern fable of the Illuminati takes it’s name from a small Bavarian group that went out of existence in the 18th century, but somewhere between little and nothing else. How the secret Illuminati society really did start in GermanyThe rest comes from the pranks of the Discordians and the writings of Robert Shea and Robert Anton Wilson, though not directly, but rather from a process somewhat like Chinese Whispers/Telephone.  The accidental invention of the Illuminati conspiracy Delusional paranoiacs take half remembered snippets, tales and wind-ups (probably from people who have read Illuminatus!) and fuse them with their fever dreams and fantasies, share them amongst themselves and end up believing them. You can occasionally find people claiming to be the Illuminati, but these are either pranksters, or scammers running a con targeting people who are generally too racist to fall for the ‘Nigerian with $10 million’ who wants to temporarily transfer it into your account and will let you keep half of it. ",
            "date": "Answered September 15, 2019",
            "views": "362",
            "upvotes": "0"
        }
    ]
}