{
    "title": "What are the best arguments for and against deontology? - Quora",
    "tags": [
        "Deontology",
        "Ethics (moral philosophy)",
        "Ethics and Morality",
        "Arguments and Argumentation",
        "Ethics",
        "Morals and Morality",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "J. Varner",
                "href": "/profile/J-Varner-1"
            },
            "answer_text": "Deontology is the moral theory that an action is right or wrong depending on the nature of the act itself. It is often presented as the counterpoint to consequentialism, which is the moral theory that an action is right or wrong depending on the conditions that result from the action. The best argument favoring deontological ethics is that its nature allows for the avoidance of ‘the ends justify the means’ being used to justify immoral behavior. Because deontology states that one shouldn’t lie because lying is wrong, rather than one shouldn’t lie because it might hurt someone or have negative consequences, the ends are irrelevant. The best argument against deontology is that it is too rigid to allow for real world instances of moral conundrums. The typical thought experiment used to demonstrate this is as follows: You live in Nazi Germany, and you have agreed to hide your Jewish neighbors in your attic to avoid detection by the SS patrols. But then one day, the SS knocks on your door and flat out asks, “Are you hiding any Jewish people in your home? If so, where are they?” A consequentialist moral philosophy would clearly direct one to lie and save the lives of your neighbors, but a deontological philosophy would require one to tell the truth, and tell the SS exactly where to find them hidden in your home. This clearly isn’t the right thing to do, and thus illuminates a glaring flaw in deontological ethical theory. ",
            "date": "Answered July 18, 2018",
            "views": "4",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aurélio Silva",
                    "user_href": "/profile/Aurélio-Silva-2"
                },
                {
                    "user_id": "Lollitta Poppe",
                    "user_href": "/profile/Lollitta-Poppe"
                },
                {
                    "user_id": "Abigail Artajo",
                    "user_href": "/profile/Abigail-Artajo"
                },
                {
                    "user_id": "Kennedy Cooper",
                    "user_href": "/profile/Kennedy-Cooper-5"
                },
                {
                    "user_id": "David Carter",
                    "user_href": "/profile/David-Carter-500"
                },
                {
                    "user_id": "Darren Blackburn",
                    "user_href": "/profile/Darren-Blackburn-5"
                },
                {
                    "user_id": "John Hudson",
                    "user_href": "/profile/John-Hudson-158"
                },
                {
                    "user_id": "Yamini Chandra",
                    "user_href": "/profile/Yamini-Chandra-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Trejo",
                "href": "/profile/Paul-Trejo-1"
            },
            "answer_text": "The quintessential Ethics of Deontology was given by Moses (ca. 1500 BC), in the Ten Commandments, which still lives in three of the largest religions in history. Deontology means the Law is Right because God said so. That’s the end of it. Personal interest is irrelevant. Personal profit is irrelevant. Personal loss is irrelevant. If one must sacrifice, then so be it. If one benefits, then so be it. God is always right. This is why Deontology is so different from the Ethics of Teleology, the Ethics of Goals and personal interest, of personal Eudemonia or happiness, and of Utilitarianism in all its forms. These versions of Ethics make Personal interest a very important factor in any Moral Decision. Most people follow an Ethics of Deontology, because it simply means conforming to the Law, and staying out of trouble with the police. That is common sense — and that is what most of us do. A few people consider Teleology to be superior, because when faced with a tricky Moral question — like when telling the Truth would hurt somebody — or when following the Law would threaten somebody’s life — most people freeze. They don’ t have the habit of thinking these matters through. The Teleologist does think them through. This is why the first great Utilitarians of England (Bentham ca. 1800, Mill ca. 1850, Sidgwick ca. 1900 ) were also very powerful in the English government, as socio-political advisers to the Crown. Their principle was, “The Greatest Good for the Greatest Number.” That was how public decisions were made (and still are made for much of the world). Yet Teleology tends to be far too complex for the average person — with all the calculations and analysis that is typically done. For most of us, Deontology works fine. Also, the Deontology of Immanuel Kant is sufficient for all possible Ethical cases, say its adherents. It is called the Categorical Imperative. In the Deontological command to “Always tell the Truth,” Kant offers the exception — “except when somebody’s life is at stake.” That is obviously Rational, and Kant insisted that Deontology is truly Rational, when rightly considered. A variation on the exception might read — “except when it would hurt somebody’s feeling unnecessarily.” This is because the Truth could be used as a way to be cruel, as in the phrase, ‘The Truth hurts, doesn’t it?” Cruelty is always immoral. The strengths of Deontology are its simplicity and its great antiquity and tradition. The weaknesses of Deontology — its lack of detail covering the Public Sphere — are allegedly covered by the analytical detail of Teleology in Ethics. Yet some will also argue that the Ten Commandments — when read with generosity — not only cover personal morality, but also Public morality as well. For example, the 9th Commandment does not say, “Always tell the Truth.” Instead, it says, “Never testify falsely in court against your neighbor”. Breaking the 9th Commandment would bring a death penalty in ancient times, because it undermined the entire system of Law, making a mockery of the Law. ",
            "date": "Updated September 27, 2019",
            "views": "2",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Parisha Sehrawat",
                    "user_href": "/profile/Parisha-Sehrawat-1"
                },
                {
                    "user_id": "Aleksandra Januszkiewicz",
                    "user_href": "/profile/Aleksandra-Januszkiewicz"
                },
                {
                    "user_id": "Adolfo Oubiña Neto",
                    "user_href": "/profile/Adolfo-Oubiña-Neto"
                },
                {
                    "user_id": "Keith Ford",
                    "user_href": "/profile/Keith-Ford-30"
                },
                {
                    "user_id": "Rick Merritt",
                    "user_href": "/profile/Rick-Merritt-1"
                }
            ]
        }
    ]
}