{
    "title": "What are some examples of undecidable problems? - Quora",
    "tags": [
        "Problems"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Taller",
                "href": "/profile/Alex-Taller"
            },
            "answer_text": "Here’s probably the oldest known example: Parallel postulate. The 5th postulate states that, given a straight line on a plane and a point on the same plane outside that line, there always exists one and only one straight line passing through that point and not intersecting the first line. This statement seems perfectly common sense, and mathematicians invested considerable efforts in attempts to prove the 5th postulate based on the first four. All those attempts were unsuccessful. Eventually, alternative geometries were suggested: with no parallel lines at all or with multiple parallel lines. The existence of these alternative geometries indicates that the 5th postulate must be an axiom of Euclidean geometry. Gödel's incompleteness theorems essentially states that in every axiomatic theory a predicate can be constructed that can be proven neither true nor false, which implies the inevitability of undecidable problems. A more recent example of an undecidable problem is the Continuum hypothesis. It states that there is no number set that would have more elements than the set of all natural numbers but fewer elements than the set of all real numbers. (Please note that since all these sets are infinite, the terms more and fewer have a somewhat different meaning than they would if we were comparing finite sets.) ",
            "date": "Answered August 30, 2016",
            "views": "727",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lev Kruglyak",
                    "user_href": "/profile/Lev-Kruglyak"
                },
                {
                    "user_id": "Abhilash Gollapalle",
                    "user_href": "/profile/Abhilash-Gollapalle"
                },
                {
                    "user_id": "Ilana Halupovich",
                    "user_href": "/profile/Ilana-Halupovich"
                },
                {
                    "user_id": "Arya Kruddho",
                    "user_href": "/profile/Arya-Kruddho"
                },
                {
                    "user_id": "Bassam Karzeddin",
                    "user_href": "/profile/Bassam-Karzeddin-1"
                }
            ]
        }
    ]
}