{
    "title": "What are some extremely vulgar Indian actresses? - Quora",
    "tags": [
        "Vulgarity",
        "Indian Actors and Actresses",
        "Cinema of India",
        "Bollywood Actors and Actresses",
        "Bollywood",
        "Celebrities",
        "Actors and Actresses",
        "Indian Ethnicity and People",
        "Movies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vinod",
                "href": "/profile/Vinod-504"
            },
            "answer_text": "There are actresses who can do anything for publicity. They know very well how to gain attention of people. They do not possess any real talent except showing their hot bodies and doing some cheap talks. Here are desi 'celebrities' who are so publicity hungry that they would any other country celebrities a great complex. Rakhi Sawant  A televised break-up with former boyfriend, an infamous kiss with a popular singer, a fake Swayamvar in a reality show and a failed attempt at politics. You name it and controversy's brightest child, Rakhi Sawant, has done it all. You should blame foolish people and media for giving actresses like these publicity. Poonam Pandey  Pandey became popular through her social media accounts, including Twitter when she started posting her photos. She has received a lot of coverage over explicit pictures of herself that she has posted. She rose to media spotlight when she promised to strip for the Indian cricket team if it won the 2011 Cricket World Cup. India indeed lifted the World Cup; however, Pandey did not fulfill her promise due to public disapproval, but later claimed she was denied permission by the Board of Control for Cricket in India (BCCI). However, she did upload a video on her mobile app, where she is seen stripping naked at the Wankhede Stadium at night. In 2012, she posed nude after Kolkata Knight Riders won the IPL 5. She went on to have her own mobile application developed. She maintains this application with regular updates on her life, and also uses it as a platform to upload her explicit erotic content. Sherlyn Chopra  Raising the bar to another level, Sherlyn Chopra recently zoomed way ahead in the sleaze contest when she went full Monty for Playboy magazine. Not content with B-grade films and item numbers, Sherlyn tried to 'push the envelope' with the Playboy shoot and literally tore it apart with her flick 'Kamasutra 3D', where the actress goes stark naked once again, sending Indian media to a frenzy! Veena Malik  Though she's not Indian but Veena Malik became a household name in India after her stint in Bigg Boss Season 4. The Pakistani actress was all theatrics inside the house and gained a lot of mileage with her romantic angle with fellow in-mate Ashmit Patel. Malik carried on her fling with the Indian media even after Bigg Boss and gave it fodder time and again with her controversial topless magazine covers (later refuted as morphed) and letter from Taliban among many other incidents! Kashmira Shah  Kashmira Shah is an Indian actress. Born in Mumbai, she is the granddaughter of noted Hindustani classical singer, Anjanibai Lolekar, she has appeared in numerous Hindi and Marathi films. Shah is half Maharashtrian and half Gujarati.[3] Kashmira was a leading celebrity contestant in the first season of the Indian version of the reality TV show Big Brother, Bigg Boss in 2006, she also participated in dance couple reality show Nach Baliye in 2007. If you combine bold statements, provocative dressing, blink-and-miss roles in movies and reality shows into one person, you get Kashmira Shah. Even the media is done with her unimaginative persona which has been the same ever since she entered showbiz. Sambhavna Seth  Sambhavna Seth knows her aggressive behavior works for her and is her USP. A reality TV regular, Sambhavna tries to hog limelight with her unprovoked acts of short temper in reality shows and controversial statements about competing item girls, in the press. Mallika Sherawat  India woke up to this Haryanavi wonder who created a record for most on-screen kisses and controversies in her debut movie itself! Since then, motor-mouth Mallika has been in numerous uncomfortable situations due to her bold scenes in front of the screen and bold comments off it. However, since the starlet has been trying her luck in the West lately, Mallika hogs equal limelight for her blink-and-miss roles outside Bollywood and her outrageous outfits at many red carpet events! ",
            "date": "Answered October 11, 2019",
            "views": "279",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Showri Pratury",
                    "user_href": "/profile/Showri-Pratury"
                },
                {
                    "user_id": "Sangram Sagar",
                    "user_href": "/profile/Sangram-Sagar-1"
                },
                {
                    "user_id": "Ravi Raj",
                    "user_href": "/profile/Ravi-Raj-2838"
                },
                {
                    "user_id": "Deborah",
                    "user_href": "/profile/Deborah-247"
                },
                {
                    "user_id": "Karuna lvk",
                    "user_href": "/profile/Karuna-lvk"
                },
                {
                    "user_id": "Kajal Sharma",
                    "user_href": "/profile/Kajal-Sharma-10"
                },
                {
                    "user_id": "Siddharth Jani",
                    "user_href": "/profile/Siddharth-Jani-7"
                },
                {
                    "user_id": "Ivy Mondal",
                    "user_href": "/profile/Ivy-Mondal-3"
                },
                {
                    "user_id": "Puneet Choudhary",
                    "user_href": "/profile/Puneet-Choudhary-37"
                },
                {
                    "user_id": "Sneha Nandish",
                    "user_href": "/profile/Sneha-Nandish-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nishikant Jha",
                "href": "/profile/Nishikant-Jha-8"
            },
            "answer_text": "Rakhi sawant and poonam pandey. I think vulgarity doesn't means when scripts required you to expose but only for getting an attention you expose yourself , I thought this is the vulgarity.  With this image you understand it.  ",
            "date": "Updated September 22, 2019",
            "views": "18",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditya Prasad Jena",
                    "user_href": "/profile/Aditya-Prasad-Jena-1"
                },
                {
                    "user_id": "Sangram Sagar",
                    "user_href": "/profile/Sangram-Sagar-1"
                },
                {
                    "user_id": "Subhodeep Das",
                    "user_href": "/profile/Subhodeep-Das-30"
                },
                {
                    "user_id": "Thakur Hitesh Singh",
                    "user_href": "/profile/Thakur-Hitesh-Singh"
                },
                {
                    "user_id": "Kartar Singh",
                    "user_href": "/profile/Kartar-Singh-135"
                },
                {
                    "user_id": "Ankit Banerjee",
                    "user_href": "/profile/Ankit-Banerjee-45"
                },
                {
                    "user_id": "Pankaj Singh",
                    "user_href": "/profile/Pankaj-Singh-282"
                },
                {
                    "user_id": "Brijesh Nayar",
                    "user_href": "/profile/Brijesh-Nayar"
                },
                {
                    "user_id": "Juli Phukan",
                    "user_href": "/profile/Juli-Phukan"
                },
                {
                    "user_id": "Shraddha Jagtap",
                    "user_href": "/profile/Shraddha-Jagtap-4"
                }
            ]
        }
    ]
}