{
    "title": "What are some of Saul Kripke's most profound ideas? - Quora",
    "tags": [
        "Novelty",
        "Ideas",
        "Philosophers",
        "Creativity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ali Reda",
                "href": "/profile/Ali-Reda"
            },
            "answer_text": "Kripke argued that there are necessary a posteriori truths, - something Kant has missed from his system- such as the proposition that water is H2O (if it is true). According to Kripke, this statement is necessarily true (since water and H2O are the same thing, they are identical in every possible world, and truths of identity are logically necessary) and a posteriori (since it is known only through empirical investigation). Also it is analytic because analysis of H20 says that it is water. Kripke's controversial analysis of naming as contingent and a priori would best fit into Kant's epistemological framework by calling it \"analytic a posteriori\". Another example is the sentence, \"the evening star\" (Hesperus) is \"the morning star\" (Phosphorus), to demonstrate that the knowledge of something necessary (in this case the identity of Hesperus and Phosphorus) could be empirical (posteriori) rather than knowable a priori, yet it is analytic because the predicate concept is contained in its subject concept. A prioricity, analyticity, and necessity have since been more clearly separated from each other. So he killed Quine's argument in Two Dogmas of Empiricism which stated that analyticity is explained by synonymity and synonymity is explaind by necessaity so we go a full circle again without explaining any of them. Nowadays, the prevailing view-derived substantially from Saul Kripke's Naming and Necessity is that necessity and aprioricity are, respectively, metaphysical and epistemological notions that can stand on their own; moreover, although some truths are both necessary and apriori, there are many examples of each that are not examples of the other. Thus, the relationship between aprioricity, necessity, and analyticity is not easy to discern. the a priori/a posteriori distinction is epistemological, the analytic/synthetic distinction is linguistic, and the necessary/contingent distinction is metaphysical. He also rejected the  descriptivist theory of names, As an alternative, Kripke outlined a causal theory of reference, according to which a name refers to an object by virtue of a causal connection with the object as mediated through communities of speakers. He points out that proper names, in contrast to most descriptions, are rigid designators. That is, a proper name refers to the named object in every possible world in which the object exists, while most descriptions designate different objects in different possible worlds. ",
            "date": "Answered December 16, 2014",
            "views": "583",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Xin Zhang",
                    "user_href": "/profile/Xin-Zhang-379"
                },
                {
                    "user_id": "Bassam Charanek",
                    "user_href": "/profile/Bassam-Charanek-2"
                },
                {
                    "user_id": "Asmaa Reda",
                    "user_href": "/profile/Asmaa-Reda-1"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta"
                },
                {
                    "user_id": "Raffaele Indri",
                    "user_href": "/profile/Raffaele-Indri"
                }
            ]
        }
    ]
}