{
    "title": "What are the most important concepts in art? - Quora",
    "tags": [
        "Concept Art",
        "Contemporary Art",
        "The Arts"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephen Carpenter",
                "href": "/profile/Stephen-Carpenter-24"
            },
            "answer_text": "I’m unsure of the question. “Most important” would imply a single concept but then “concepts” follows.Do we argue down to one, or let everyone have their own?As an artist and as a person with a career in arts education (Art History and public school general arts education), I’ve stayed awake at night with this question.That in itself does not give me license to answer perhaps. So I’ll share my thoughts and leave the real answers to those who have already posted.It seems to me that art has at its root an obsessive idea in the mind of an individual. The idea is a combination of accreted sensory experience that is interpreted and stored in the individual. It’s not factual but situational. It’s not concrete but fluid and dynamic. The idea percolates through the mind until the individual needs to express it.That requires materials and some modicum of courage, skill, or both. The resulting material expression (what we call “art”) is only that- a material expression and it may or may not be accurate. Artists usually see all the things they need to correct while the audience sees the marks they made. I have arrived at this point from a couple of sources. The first is a sensory awareness of “me” and how I relate to the “rest” which is everything else. Asking, “where am I?” implies a relation to “that which is around me” and that includes a canvas, brushes and palette in the simplest of terms. (It’s much more comprehensive than that.) Knowing where I am in space in time is essential, I believe in being able to get paint to canvas. Maybe it’s just me. The other source is the mechanism by which an idea with no material substance is translated into material expression. The closest I can come is to recognize that the paint on my brush represents an aspect of my idea. And once that paint is applied, it is at once a representation of my idea, a material fact in and of itself, and a trigger for the viewer. the first viewer is me, and I evaluate what I see against what I have as an idea. Everything changes and the next stroke goes down on the basis of the change. That process is summed up in the term “metaphor”. It’s where I mostly live with my art production. Again, maybe it’s just me. I would offer that without an active ideation process ongoing in an individual, art would not be possible- at least in a form we recognize currently as art. ",
            "date": "Answered July 23, 2019",
            "views": "458",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe Velikovsky",
                "href": "/profile/Joe-Velikovsky"
            },
            "answer_text": "Q: What are the most important concepts in art? A: Just 3 things. (1) Creativity - and - (2) The 12 cluster criteria of Art, and (3) The 6 P’s of creativity. For 1) Creativity, see: StoryAlity #6 – What is (big-C) Creativity – and How Does It Work? As I don’t have time explain it here. This is THE classic, short-and-snappy Quora answer and frankly, deserves way more upvotes, you ask me. (Ya goddamn ingrates. Nobody thanks anybody any more, like they did when I was a boy, living as we did, in a brown-paper-bag at the bottom of a rushing river, and as a kid every new day I had to get up at dawn and lick the riverbed clean with my goddamn tongue…) And anyways - see also my article on Genius-level Creativity (in both the Arts and Sciences), out now (ie - March 2018, if it matters that much to you) in The Journal of Genius and Eminence. (see: News) And as for 2) - The 12 “cluster criteria” of art: (Dutton 2009) Okay so here we go. Ready? Coming ready or not. `Characteristic features found cross-culturally in the arts can be reduced to a list of core items, twelve in the version given below, which define art in terms of a set of cluster criteria… Direct pleasureSkill and virtuosityStyleNovelty and creativityCriticismRepresentationSpecial focusExpressive individualityEmotional saturationIntellectual challengeArt traditions and institutionsImaginative experience(Dutton 2010, pp. 51-61) ie Read Dutton’s great (2009) book, The Art Instinct. And = for more details on it (if you like that sorta thing) see: StoryAlity #120 – Videogames as Art Yes…? You’re welcome. PS - And Yes - since I noticed, as you were reading, you also wondered this: I am a creative genius. Probably even, a highly-Eminent one. Or not. I’ll be the judge of that, thanks. See: Joe Velikovsky's answer to How do you know if you're creative or not? PPS - OMG I almost forgotted (3) The 6 P’s of creativity. The creative (6.) Person (ality), their creative (5.) Potential (natural biologically determined `talents’, their IQ, Gardner’s Multiple Intelligences and all that), their creative (4.)Process (es), their creative (3.)Product (eg - their: painting, or song - or videogame or movie or novel or a one-liner-joke or scientific theory - or whatevs), their creative (2) Place, (where the heck they are, when they got all creative on us. Some places are empirically more creative than others, and look I don’t have time to get into this. But think of Paris in the Roaring 1920s, or Vienna in the Rennaissance. Or Silicon Valley now.), and finally, their creative (1…) Persuasion. ie How did you (personally) become convinced that Einstein was a genius? A: You listened to other people who told you so. Hey wait - For all you know it’s a big hoax - and wasn’t really Einstein who discovered e=mc squared (namely that Energy and Matter are worth the same in different currencies - and that the speed of light, squared is kinda like the inverse-square law; but, not). I mean, for all you know, it could have been, another guy, also called `Albert Einstein’ and who looked exactly like that other one who claimed all the glory. Were you there at the time? …No? Ok then Mr So-Sure-of-Himself Guy - Then, How do you know, it’s all: true? How do even know this is me, JTV the Genius, actually even writing this? I may have just dictated it to my robot. PPPS - See, my artificial-writer robot: so cool. StoryAlity#141 – The Robo-Raconteur – a StoryAlity Theory Artificial-Writer …The robots are coming, (I sent them). I am now aiming to get everyone on Universal Basic Income so the robots can do all the crappy “work” and “jobs” - and we all can just retire and do our art. (I am just waiting around to collect my Nobel Prize for my discovery of the meme, the unit of culture, first.) But anyways - My Utopia is the best Utopia, ever. Everyone just does art, or, whatever they might feel like. Computers and robots do all the hard (and annoying, and boring) stuff. We do all the: fun stuff. (You should join our Utopia. No really.) ",
            "date": "Answered April 1, 2018",
            "views": "1",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Cardew",
                    "user_href": "/profile/David-Cardew"
                },
                {
                    "user_id": "Naomi Allen",
                    "user_href": "/profile/Naomi-Allen-8"
                },
                {
                    "user_id": "Rohit Madashri",
                    "user_href": "/profile/Rohit-Madashri"
                },
                {
                    "user_id": "Drag D. Mil",
                    "user_href": "/profile/Drag-D-Mil"
                },
                {
                    "user_id": "Eric Fiorina",
                    "user_href": "/profile/Eric-Fiorina"
                },
                {
                    "user_id": "Amy Rivers",
                    "user_href": "/profile/Amy-Rivers-3"
                },
                {
                    "user_id": "Ruvyn Doran",
                    "user_href": "/profile/Ruvyn-Doran"
                }
            ]
        }
    ]
}