{
    "title": "What are some examples of ethics and integrity? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Angela Carleton",
                "href": "/profile/Angela-Carleton-5"
            },
            "answer_text": "What is ethics and integrity? That is something which in Catholic Schools were taught by some of the religious principles which were interpreted by the “Ten Commandments.” Those laws were meant to be understood and implemented in everyone’s home. It’s hard to realize not all schools were taught ethics and integrity. I do believe when teachers in public schools were discussing certain figures of authority such as Lewis and Clark or George Washington our First President - those principles of ethics and integrity came to be discussed because these were men of integrity and how they dealt with situations which they had to be of strong convictions. ",
            "date": "Answered April 24, 2020",
            "views": "528",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Cardew",
                "href": "/profile/David-Cardew"
            },
            "answer_text": "Integrity is being integrated in saying and doing are the same. As Jack Sparrow says: “Me? I’m dishonest, and a dishonest man you can always trust to be dishonest. Honestly. It’s the honest ones you want to watch out for, because you can never predict when they’re going to do something incredibly… stupid” Jack is integral but not ethical. ",
            "date": "Answered June 10, 2019",
            "views": "597",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Himanshi Kapoor",
                    "user_href": "/profile/Himanshi-Kapoor-37"
                },
                {
                    "user_id": "George Doolittle",
                    "user_href": "/profile/George-Doolittle-3"
                },
                {
                    "user_id": "Theresa Kircher",
                    "user_href": "/profile/Theresa-Kircher-1"
                },
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        }
    ]
}