{
    "title": "What are some examples of cultural homogenization? - Quora",
    "tags": [
        "Homogenization",
        "Sociology of Everyday Life",
        "Ethnic and Cultural Differences"
    ],
    "response": [
        {
            "author_info": {
                "name": "Liz Orr",
                "href": "/profile/Liz-Orr-3"
            },
            "answer_text": "Cultural homogenization occurs naturally when the society emphasizes or de-emphasizes aspects of your identity. If people around you disapprove, you look for what they approve of and only show that side, often discarding dress, foods, language, name, in order to fit in. This loss increases with racism and is when a loss of culture causes cultural homogenization. If everyone likes aspects of your culture, it becomes integrated into the surrounding culture(i.e. pizza, yoga) causing cultural homogenization, with a cultural gain. If people you associate with or in your society think everyone’s individualism or culture is acceptable/marvelous, people indulge in their culture every day, and homogenization is lessened. Individually, while most people conform, some people ignore societal pressure, and some people strive to be different, therefore any cultural homogenization will never be universal. In business culture, the loss causing cultural homogenization often occurs with hostile takeovers or running people out of business. Example: remember when there were local grocery stores, drug stores, and hardware stores (mom and pop every 10–20 blocks), and now you have to drive to get to one, and the are all owned by 2 different companies and sell the exact same things. The gain causing cultural homogenization occurs with new products or services that are so popular everyone now offers it (i.e. coffee shops are a recent invention, delivery is now common across many businesses). To lessen business cultural homogenization we would need to go back to small businesses again, but it will not work, because what people buy the most, everyone wants to sell, and the best location is where everyone wants to be, so you will always get cultural homogenization in business (example: everyone who sells produce at the farmer’s market sells tomatoes. Yes, they all sell different produce but everyone sells tomatoes, because everyone wants to buy tomatoes). The pressure in business is sink or swim, the business will die without sales, which is why it cannot avoid cultural homogenization. ",
            "date": "Answered June 13, 2016",
            "views": "433",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edlyn Piañar",
                    "user_href": "/profile/Edlyn-Piañar"
                },
                {
                    "user_id": "Jackie Lou Valdez",
                    "user_href": "/profile/Jackie-Lou-Valdez"
                },
                {
                    "user_id": "Low Yixin",
                    "user_href": "/profile/Low-Yixin"
                },
                {
                    "user_id": "Zeke Lynn",
                    "user_href": "/profile/Zeke-Lynn"
                },
                {
                    "user_id": "Jhon Patrick",
                    "user_href": "/profile/Jhon-Patrick-4"
                },
                {
                    "user_id": "Jessalyn Villaruel",
                    "user_href": "/profile/Jessalyn-Villaruel"
                },
                {
                    "user_id": "Karis Yuen",
                    "user_href": "/profile/Karis-Yuen-2"
                },
                {
                    "user_id": "Cam Fraser",
                    "user_href": "/profile/Cam-Fraser-13"
                },
                {
                    "user_id": "Lawrence Jones",
                    "user_href": "/profile/Lawrence-Jones-115"
                },
                {
                    "user_id": "Mi Huru",
                    "user_href": "/profile/Mi-Huru"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeffrey Shelton",
                "href": "/profile/Jeffrey-Shelton-1"
            },
            "answer_text": "A great example is the fast food industry in which a corporation sells franchises under terms which standardize every aspect of the business from what food is purchased to preparation to pricing. Fifty years ago most restaurants were independently owned. While many offered a range of food choices, others specialized and might pride themselves on having the cuisine of a certain kind in town. Word of mouth was an important way of increasing business, not only around meal quality but service as well. With corportization the diner today chooses among chains which offer similar fare regardless of location. When we hear fast food we may think of MacDonalds or Burger King but all franchises must satisfy the consumer’s desire for quick service in this fast paced society. Most people would prefer to have their orders served in a timely manner rather than have leisurely, pleasant conversation while they wait. One hears phrases like “I know a great little place for fish” less nowadays and most often “I think there's an Applebys or a Texas Roadhouse up on Highway 9 in front of Walmart.” Homogenization is reflected in an ability to recall where one are on Tuesday night. ",
            "date": "Answered May 28, 2016",
            "views": "301",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jimin",
                    "user_href": "/profile/Jimin-77"
                },
                {
                    "user_id": "Phyo Sandarwin",
                    "user_href": "/profile/Phyo-Sandarwin"
                },
                {
                    "user_id": "Sousan Househ",
                    "user_href": "/profile/Sousan-Househ"
                },
                {
                    "user_id": "Tan Shangjien",
                    "user_href": "/profile/Tan-Shangjien"
                }
            ]
        }
    ]
}