{
    "title": "What determines time? - Quora",
    "tags": [
        "Time (physical quantity)",
        "Time (physics)",
        "Relativity (physics)",
        "Time Management",
        "Science of Everyday Life",
        "Physics of Everyday Life",
        "Philosophy",
        "Science",
        "Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Putnam",
                "href": "/profile/James-Putnam-8"
            },
            "answer_text": "Time is an undefined property of physics and has been from the beginning of physics. The best that physics can do is to substitute a count of selected object’s cyclic activity for it. We observe only object behaviors. There is no physics of space. There is no physics of time. Physics is a science dependent upon measurements. The only things that physics measures is the activities of objects. Objects are things that have velocities that can be caused to change. The units of meters and seconds tell you what it is that physicists are measuring. In neither case are they measuring either space of time. There are no isolated, controlled specimens of space or time in any laboratory. That is what it would take in order to have units of measurement for the properties of space and time. In the meantime, physics writes equations solely about what objects do. Theoretical physics adds empirically unverifiable interpretations onto properties in physics equations. There is no direct empirical support for physicists to teach us anything about either time or space being physically involved in effects. [Edit: To those who have taken physics away from a science of measurements to a playfield for their imaginations, physics will get fixed. The reason I know this is because the fix has already been underway while name calling went on. Get right with nature and go back and learn how to correctly define the property of mass. It is the first step in a long revision of physics. Learn that there is a universal constant increment of passage of time. It isn’t a measurement of time itself; however, it is as close as we can hope to get to establishing the existence of a fundamental property of time. Whether this incremental value is a measure of time or not is to be left for philosophical discussions. What it concretely is is the clock of the Universe. Physicists might recognize this to be the case. They know a lot about clocks. James A Putnam] ",
            "date": "Updated January 4, 2019",
            "views": "154",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Yokai Seishinkage",
                    "user_href": "/profile/Yokai-Seishinkage"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Baiev",
                "href": "/profile/George-Baiev"
            },
            "answer_text": "We do not know, our understanding of time has developed since Einstein’s theory, before that we thought that time is just a substance that flows itself, it is like a biblical god, it was not born and will not die, no one created it, and no one determines it, then Einstein introduced the four coordinates space time, and we now know that it is connected, and time can slow down and speed up(depends on speed or force for example of gravity) but it is still homogeneous and isotopic, so we do not know yet for sure what determines time ",
            "date": "Answered January 2, 2019",
            "views": "32",
            "upvotes": " Answer requested by Zacharia Sithole"
        }
    ]
}