{
    "title": "What does 'objective truth' mean? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Johnnie Lockett",
                "href": "/profile/Johnnie-Lockett"
            },
            "answer_text": "Nothing can be true except objectively. Anything else is either an opinion, a perception, a preference, a philosophy, a value, a guess, a hope, a belief, an error, a delusion, or a lie. All of these are subjective. One big problem with philosophical questions is that they produce philosophical answers—which seemingly never seek the simple and practical answer that resolves the issue, but rather to identify and examine what kind of philosophers are involved in the discussion, and/or what kinds of philosophies are being used, and/or what kinds of philosophical errors are being made. Of course, this is starting out as one of those answers. But I'll get to the practical answer in a moment. First, how do you make an answer practical rather than scholarly-but-useless? Answer: By being specific. That is, instead of just speaking in terms of logical forms and logical models using such nondescript inputs such as anything, something, “a thing,” or “no thing,” use specific examples in our forms and models. This forces us to see whether our claims are valid. It also helps us, in this case, to realize what kinds of “things” we are dealing with—which cuts to the heart of the issue. This enables us to see whether our claims are valid. It also helps us, in this case, to realize the kinds of “things” we’re dealing with that can be true—which cuts to the heart of the issue. You see, the only things that can be true (or false) are various kinds of predicative statements—assertions about some aspects of reality. These can be called propositions, claims, confessions, accusations, assumptions, avowals, declarations, deductions, and so on. My point is, these all consist entirely of words, but are not just words that name things—or nouns. Rather, they involve a subject and a verb. Too often on Quora people attribute truth or falsity to a single noun that, by itself, does not make a predicative statement. Or, they ask whether a noun is “true” or “false.” For example, at any given moment, there is a debate ongoing on somewhere on Quora over whether “evolution” is true. Or “religion.” Or a specific religion (usually, “Christianity”). Or some other ism. But none of these can be “true” or “false.” Each of these terms merely identifies a discipline, a broad theory, or a rationale or method that contains multiple claims and assumptions—each of which may (and probably should) be evaluated for truthfulness separately. So, making statements such as “Evolution is a fact” (which I’ve seen too many times) is utter nonsense. Or, “Religion is false [or even true].” Again, nonsense. Now, the statements themselves are assertions and are therefore either true or false. (Okay, if you say, “Evolution happens,” now you have a predicative statement—one that is either true or false.) And the truthfulness or falsity of each statement is objective. (The two above are both false.) All we need to do to know that things true are objectively true, and that things false are objectively false, is to specify several statements about reality we know to be either true or false. Then, each ask ourselves: How do I know this is true? or How do I know this is false? I submit you can only know objectively—or you don’t know. And I’m sure my just saying that doesn’t prove and will not convince anyone. But you may be able to convince yourself if you do the exercise. This assumes you know something—at least one thing in this world—to be true or false. If you’re one of those who insists nothing can be known with certainty, then you consent that you don’t know anything and are thus unqualified—either way—to decide. Now, I intend (in the comments) to come up with my own list of things some of us know to be true. Also, I’ll see if I can come up with some we know to be false. For contrast, I’ll also come up with some things that are opinions, perceptions, lies, and such, to show how some are necessarily subjective—as well as how even these, though subjective, exist (or occur) objectively. As a disclaimer, I don’t claim this will “prove” anything to anyone. That’s not my purpose here, because I hold that proving is each person’s private responsibility. _||_ock ",
            "date": "Answered April 29, 2018",
            "views": "955",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bill Berotti",
                    "user_href": "/profile/Bill-Berotti"
                },
                {
                    "user_id": "Brian Schanker",
                    "user_href": "/profile/Brian-Schanker"
                },
                {
                    "user_id": "Stan",
                    "user_href": "/profile/Stan-95"
                },
                {
                    "user_id": "Dino Fluri",
                    "user_href": "/profile/Dino-Fluri"
                },
                {
                    "user_id": "Daniel Ogbekhilu",
                    "user_href": "/profile/Daniel-Ogbekhilu"
                },
                {
                    "user_id": "Tom Weiss",
                    "user_href": "/profile/Tom-Weiss-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miquon Jackson",
                "href": "/profile/Miquon-Jackson-1"
            },
            "answer_text": "A: Welcome to Philosophy: the only field that doesn’t require you to assume an interpretive answer to this question. Rather, it requires you to think — logically, on one view — about the implications of all the possible answers. As such, since you’ve asked a philosophical question, I’ll give a philosophical answer: It’s pretty complicated.  Well, we could answer with “no, no thing can be objectively true;” but, in doing so, we’ve identified a thing that is objectively true: the fact that no thing is. We could, contrarily, answer with “yes, some thing can be objectively true;” but, then we’d have to devise and justify a methodology to prove that some things can be objectively true. Epistemological nihilists are those who outright deny the possibility of knowledge; i.e., they would go with the former answer. To argue for their position, they might say, “okay, fine, I concede: “some thing can be objectively true;” but, there’s only one thing that is so: the fact that “no thing can be objectively true.” But, they’d still have to prove that there is no other thing that can be objectively true. But, mind you, they really ought to do this by the same standards by which they ‘proved’ that that one thing is true — not just by simply restating that (supposed) ‘fact.’ That is no easy task. But, neither is the modus operandi of the Epistemological Realist. This position disagrees and claims that “knowledge is possible:” i.e., they take the latter answer. Epistemological Realists must, therefore, ‘prove’ the objective truth of some set of things for their answer to be ‘objectively’ justifiable. However, in troth, neither interlocutor seems to have much of a case either way — well, if they’re being honest with themselves. I mean, neither (seems to) have a ‘definite’ methodology nor a ‘definite’ fact from which to start. ",
            "date": "Answered April 29, 2018",
            "views": "912",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lawrence Bloom",
                    "user_href": "/profile/Lawrence-Bloom-2"
                },
                {
                    "user_id": "Nathan Cutrell",
                    "user_href": "/profile/Nathan-Cutrell-2"
                },
                {
                    "user_id": "Dino Fluri",
                    "user_href": "/profile/Dino-Fluri"
                },
                {
                    "user_id": "Benjamin McGraw",
                    "user_href": "/profile/Benjamin-McGraw-1"
                },
                {
                    "user_id": "Machiek Machiek Akuocpiir",
                    "user_href": "/profile/Machiek-Machiek-Akuocpiir"
                }
            ]
        }
    ]
}