{
    "title": "What are the evidences that there is no superior race? - Quora",
    "tags": [
        "Superior Race",
        "Race Relations",
        "White People",
        "Racism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Norman Owen",
                "href": "/profile/Norman-Owen"
            },
            "answer_text": "Not so much “evidences” [sic] as simple logic. First, “race” does not exist as a scientific term. It is an UNscientific way for humans to try to fit everything and everybody into categories, preferably airtight, because that’s how the human mind tends to work. So we grab on certain visible aspects of people, e.g., skin color, and concoct mythologies as to how they are somehow proof of general tendencies that we can group together and treat as if they were real. Which they are not. Second, “superior” is an entirely subjective term, unless specified. Even if there were “races” - which there are not - one might be “superior” on the average in running fast, but another might make music that I find more pleasing. One might be able - on the average - to solve mathematical problems, but another might prove far more adept at tracking deer through the forest. So which is “superior”? Finally, you have reversed the burden of proof. You start with the assumption that there IS a “superior race” and demand from us “evidences” to disprove it. But since you have not established that races exist, nor explained what you mean by “superior” and how you would measure this “superiority” objectively, your demand is empty. And very probably racist. ",
            "date": "Answered September 11, 2018",
            "views": "103",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "James Huang",
                    "user_href": "/profile/James-Huang-243"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raymond Davis",
                "href": "/profile/Raymond-Davis-59"
            },
            "answer_text": "Line dancing. Moving on. Well, it’s not evidence per se, but the ample evidence we should all have if we are wordly and have known a variety of people of diverse backgrounds is that an individual person can be highly intelligent, or very much the opposite, regardless of ‘race’. A person can be a gifted athlete, or very much the opposite, despite what ‘race’ they belong to. This is certainly true of moral and immoral behavior as well. So even if removing all cultural bias and disadvantages of background, if individuals of one broad racial background had an average IQ score (which can be a poor determinant of achievement in other areas anyway) a little higher than another or all other group’s averages, it should not make any difference in how you treat or prejudge an INDIVIDUAL person. ",
            "date": "Answered September 11, 2018",
            "views": "40",
            "upvotes": "0"
        }
    ]
}