{
    "title": "What came first: time, space, or matter? - Quora",
    "tags": [
        "Which Came First...?",
        "Matter (physics)",
        "Spacetime",
        "Time (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Burtay Mutlu",
                "href": "/profile/Burtay-Mutlu"
            },
            "answer_text": "I think,At first even before the Big Bang event, there was only energy as a eternal sea which composed from tiny, stagnant, identical units (quantum). Because of that, they were homogeneous, symmetric and singular (non vibration- motion). This was Pure Space. The balance had been broken between them after an impact occurred on a point in this structure. The impact wave have propagated in this structure by using these units and fluctuated them. So the internal -hidden- potential energy of these packages had joined this propagation. This was the Big Inflation. This caused a hard pressure o n the expansion edges of impact as a pressure (energy density) between in ad out fields.So that, while the impact had been expanding as one unit (quanta), an echo wave released to inside as an echo due to medium density differences.These oscillated echo waves was the Time.These waves fused with the Pure Space and turned it into the Space-Time as our Universe. The texture turned into a super fluid.These waves has a negative slope (comparably normal waves) due to their existence conditions. This slope gave an slope to the Space-Time. When these wavy time had been progression, the transferred energy has been focusing. So that, this caused high pressure in the super fluid texture. as the foreseen by fluid mechanic, the pressure between particles which are very close to each other was smaller than the outer field of them. (Also the speed of fluid increases between them was increasing).So that first particles started to exist. But all of them can not protect their integrity. Because the force of the wavy time had been changing a little due to expanding expansion edges. So, some first heavy particles disintegrated, when the pressure was decreasing. Only a few of them can protect their integrity by the help of wavy time and their spins which allowed them to stand up versus to wavy time as efficiently (like the boat has a stable stance against waves and wind )… Result; The Space, The Time, The Matter… ",
            "date": "Answered May 16, 2020",
            "views": "146",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ludvig Von Holberg",
                    "user_href": "/profile/Ludvig-Von-Holberg"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Sagar",
                "href": "/profile/Don-Sagar-1"
            },
            "answer_text": "When attempting to cover all possibilities relative to the delineation of possibility it is necessary to add a 4th element. In this case it is — “it doesn’t matter.” And, it ‘doesn’t matter’ because the answer is unknowable for us. What we are observing by way of our inherent limitations is “succession in simultaneity” — which we thereafter attempt to constrain to succession alone, because that is what we are limited to doing by way of our knowing process. Anything else is unintelligible for us or irrational. We have got to stop trying to constrain time to being an external something and come to realize that it is an internal construct which we then try to overlay upon everything that appears to be external to us. In short, “time is the orderly progression of event.” That necessitates an orderer. It also necessitates limitations that come to be ordered. ",
            "date": "Answered September 2, 2018",
            "views": "319",
            "upvotes": "0"
        }
    ]
}