{
    "title": "What are examples of emotivism? - Quora",
    "tags": [
        "Ethics of Everyday Life",
        "Ethics and Morality",
        "Philosophy of Religion",
        "Ethics",
        "Morals and Morality",
        "Philosophy",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Micah Siemens",
                "href": "/profile/Micah-Siemens"
            },
            "answer_text": "Emotivism is a theory that claims that moral language or judgement are neither true nor false; express our emotions; try to influence others to agree with us. If I made two statements such as: The Earth is larger than Jupiter. The St. Louis Cardinals won the baseball world series in 1964 Both are declarative statements that are either true or false; both have cognitive content. Now consider the following: Go Manchester United! Dang! Both are exclamatory statements that are neither true or false and have no cognitive content. They express emotions and try to influence others to share the emotion. Emotivists believe that moral language expresses emotions and tries to influence others it has no cognitive content. Now the difference between emotivism and personal relativism (subjectivism) is subtle. When personal relativists say Gandhi was a good man they report their view of Gandhi and this report is true or false depending on whether they are telling the truth but the emotivists claims there is no truth or falsity to moral judgements whatsoever. Emotivist says that different world judgements are just like differences in taste. I like carrots, you don't. Emotivism presupposes that moral disagreements are in capable of being resolved by rational discourse. There is no way to resolve our attitudinal disagreements unless we are persuasive enough. But we have already seen that there's another way to persuade, using reason to support our position. We can provide good reasons why x is right or x is wrong. If we appeal to reason we will have discovered a way to resolve disputes that other than by shouting or leading others into submission. And the freezing plays a role in ethics, then there is truth or falsity about ethical judgements and if that's the case then emotivism is not a sound Theory. ",
            "date": "Answered June 13, 2019",
            "views": "42",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jayboy Siocson",
                    "user_href": "/profile/Jayboy-Siocson"
                },
                {
                    "user_id": "Feminazi Chen",
                    "user_href": "/profile/Feminazi-Chen"
                },
                {
                    "user_id": "Peniel Janvier",
                    "user_href": "/profile/Peniel-Janvier"
                },
                {
                    "user_id": "Chris Jonat",
                    "user_href": "/profile/Chris-Jonat"
                },
                {
                    "user_id": "Anna Hutchinson",
                    "user_href": "/profile/Anna-Hutchinson-30"
                },
                {
                    "user_id": "Alfred Hawkins-Thompson",
                    "user_href": "/profile/Alfred-Hawkins-Thompson"
                },
                {
                    "user_id": "Erin Seeking",
                    "user_href": "/profile/Erin-Seeking"
                },
                {
                    "user_id": "Nicolas Araman",
                    "user_href": "/profile/Nicolas-Araman-5"
                },
                {
                    "user_id": "Sonia Elkes",
                    "user_href": "/profile/Sonia-Elkes"
                },
                {
                    "user_id": "Bonnie Peltier",
                    "user_href": "/profile/Bonnie-Peltier-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Trejo",
                "href": "/profile/Paul-Trejo-1"
            },
            "answer_text": "Here are three classic examples of Emotivism in Western Philosophy: Callicles (400 BC) debated with Socrates, claiming that we humans are only motivated by our Passions and Appetites, so that Reason plays a minor role in life. Callicles believed in the Emotion of Power-lust.David Hume (1750) claimed that Callicles was right, and that “Reason is the Slave of the Passions.”Friedrich Nietzsche (1880) claimed that so-called Reason is merely one person’s attempt to assert his Will to Power over the rest of us. Life is all about the Passions (the Emotions) and especially the Will to Power.Because of the scrambling of Reason during World War Two, and because of the Cold War threat of nuclear annihilation, the philosophy of Nietzsche is alive and well in the 21st century. Emotivism remains a widespread dotrine. ",
            "date": "Answered June 14, 2019",
            "views": "2",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pedro Larios",
                    "user_href": "/profile/Pedro-Larios-2"
                },
                {
                    "user_id": "Brian Cathy Gray",
                    "user_href": "/profile/Brian-Cathy-Gray"
                },
                {
                    "user_id": "Lukas Van der Merwe",
                    "user_href": "/profile/Lukas-Van-der-Merwe"
                },
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        }
    ]
}