{
    "title": "What are the different stages of life? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Vince Favilla",
                "href": "/profile/Vince-Favilla"
            },
            "answer_text": "I teach an entire college class on this! I prefer Erik Erikson's model of life stages. Here's a simplified, possibly more useful version of what he originally proposed: Infancy, Toddlerhood, Early Childhood In these stages, we're learning the absolute basics of how the world works. We're learning whether we can trust other people (i.e., our parents) and whether it's okay to be an individual with unique wants and needs. Childhood Once we hit age 6 or so, we have a basic understanding of how the world works. Up until puberty, we devote time to learning how to become a useful and industrious part of that world. So the focus is on school, good grades, learning skills, and how to get along with other people. Adolescence In this stage, we try to figure out our true identity. This is why most of us are embarrassed by our high school photos -- we try on different \"looks\" and identities that we later decide aren't right for us. Personally, I define \"identity\" to my students as your values, interests, personality, preferences, and self-concept. And we need to figure that stuff out before moving on to the next stage. Early Adulthood Here, Erikson said the focus is on emotional intimacy, which generally means finding a life partner. And if you don't have a strong sense of identity, this is going to be very difficult for you. Other psychologists and myself would add that we also put a big focus on establishing our careers at this stage. And I typically define it as ages 20-35. Middle Adulthood Here, the focus is on your contribution to the world, which Erikson called generativity. We want our existence to mean something, so we pursue meaningful work, mentor others, and typically do our best to raise awesome kids. Due to improved health, middle adulthood is lasting longer and longer these days, so I'd probably define it as ages 35-75. Late Adulthood In our twilight years, we look back on our lives and what we accomplished. If we don't have any major regrets, we feel a sense of satisfaction and happiness. But if we have serious regrets -- like choosing the wrong career or partner -- we often spiral into depression. ",
            "date": "Answered January 8, 2016",
            "views": "174",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prakash Bhatia",
                    "user_href": "/profile/Prakash-Bhatia-5"
                },
                {
                    "user_id": "Ann-Maria Quickley",
                    "user_href": "/profile/Ann-Maria-Quickley"
                },
                {
                    "user_id": "Vedhanth Rathod",
                    "user_href": "/profile/Vedhanth-Rathod-2"
                },
                {
                    "user_id": "Flordeliza Gaspar",
                    "user_href": "/profile/Flordeliza-Gaspar"
                },
                {
                    "user_id": "Priscilla Wangui",
                    "user_href": "/profile/Priscilla-Wangui-4"
                },
                {
                    "user_id": "John Lee",
                    "user_href": "/profile/John-Lee-1949"
                },
                {
                    "user_id": "Jo Close",
                    "user_href": "/profile/Jo-Close-2"
                },
                {
                    "user_id": "Yuvraj Balinge",
                    "user_href": "/profile/Yuvraj-Balinge"
                },
                {
                    "user_id": "Marion Cannon",
                    "user_href": "/profile/Marion-Cannon"
                },
                {
                    "user_id": "Jasmine Shen",
                    "user_href": "/profile/Jasmine-Shen-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hari Shankar",
                "href": "/profile/Hari-Shankar-194"
            },
            "answer_text": "Yes in Hindu scriptures, life is divided into 4 stages on a broad level.Namely: 1. Brahmacharyam - The youth and the time when you are inquisitive and learn about everything around you. This is the stage when you essentially prepare yourself for the life ahead by learning skills and satisfying your curiosity. 2. Grihasthashramam - The married life and the time when you take responsibility of family life and fulfill your duties as a responsible family member 3. Vanaprastham - This is the stage when you are at the end of your professional life and become dependent on others, your kids, having dutifully finished the responsibilities that you had to shoulder in your grihasthshramam. This is the stage of life when you take more to spirituality and prayers and retire from the trappings of Grihasthashramam. 4. Sannyasam - It is that period of life where you have become totally devout and have renounced every possession in life and get ready to transcend to your next life by disassociating with everything that defined you in your life so far. It is not mandatory that one must follow all the 4 stages nor is it mandatory that the order of the stages need to be followed. There are many who have jumped stages to attain sannyasam (It is considered to be the highest stage in terms of intellectual maturity after having experienced everything that life has given and understanding that it is all futile and maya to have had possessions and belongings).  So the life in Hinduism is always a quest to attain moksha and reach the highest stage. Some choose to reach this and some does not. For example, Ramana Maharshi is one such person who stepped straight from Stage 1 to Stage 4 without going through the intermediate stages. His life and philosophies have been very well captured by Paul Brunton and others. ",
            "date": "Answered December 14, 2015",
            "views": "94",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adya Shukla",
                    "user_href": "/profile/Adya-Shukla-9"
                },
                {
                    "user_id": "Gina Page",
                    "user_href": "/profile/Gina-Page-17"
                },
                {
                    "user_id": "Vedhanth Rathod",
                    "user_href": "/profile/Vedhanth-Rathod-2"
                },
                {
                    "user_id": "Harshit Jajoo",
                    "user_href": "/profile/Harshit-Jajoo-5"
                },
                {
                    "user_id": "Mohsin Bin Latheef",
                    "user_href": "/profile/Mohsin-Bin-Latheef"
                },
                {
                    "user_id": "Ayushman Sharma",
                    "user_href": "/profile/Ayushman-Sharma-4"
                }
            ]
        }
    ]
}