{
    "title": "What are the most important teachings of Plato and Aristotle? - Quora",
    "tags": [
        "Aristotle",
        "Plato",
        "Philosophers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mahesh Anand",
                "href": "/profile/Mahesh-Anand-22"
            },
            "answer_text": "Disclaimer : Please read full answer. Here is something I reasearched about Plato and Aristotle. Plato is one of the ancient and great philosopher from Greek, Athens. Plato is highly influenced by the teachings of Socrates. When Socrates died, plato started to concentrate about Philosophy and one of his best students was Aristotle. Plato found an academy in 328 BCE at Athens, thinking that it is the best way to social progress and people will get an opportunity to study. Majority of plato's work is in the form of dialogues and he strongly believed that dialogues help to obtain a deeper understanding of individual the Republic was considered as plato's best work. Here are some of important teachings of plato's work from his best work ‘The Republic' which will make you go 'Wow'. The beginning is the most important part of work.Nothing Is Beautiful without a struggle.Have you ever sensed that our soul is immortal and never dies?the objective of education is to teach us to love what is beautiful.if women are expected to do the same work as men we must teach them the same thing.Bodily exercise when compulsory does no harm to the body but knowledge which is required under compulsion obtains no hold on mind.I am the wisest man alive for I know one thing and that is that I know nothing.——————————————————- Here comes Aristotle, who is the student of our Plato, the great philosopher. Aristotle, unlike Plato, was an empiricist – that is, he was trying to describe what he was seeing, rather than stating what he thought it should be. He is also the teacher of one of the gratest kings in the history - Alexander the Great! Here are some of the important teachings of Aristotle in which he beautifully explained answers for few important questions. 1.What makes people happy? In the nicomachus ethics a book written by Aristotle he set himself the task of identifying the factors that lead people to have a good life or not. he suggested that good and successful people have distinct virtues so that we can see them in ourselves and nurture them in others. Aristotle zeroed on 11 virtues : Courage, Temperance, Liberality, Magnificence, Magnimity, Pride, Patience, Truthfulness , Wittiness , Friendliness, Modesty. Aristotle also observed that everyone seem to be bang in the middle of two voices. (Pride is in the middle of deficiency of unambitiousness and excessive of ambition) people who lack virtues should be understood as unfortunate rather than vicked.  2. What is Art for? Block buster art of that time was tragedy. Aristotle thought what is the point in whole community coming to see the worst horrible things. Aristotle came up with an answer Katharsis. Katharsis : It means kind of clearing. you get rid of bad stuff, in this case cleaning up our emotions, specifically our confusions around the feeling of fear and pity. 3. What are Friends for ? Aristotle identifies three different types of friendship. There is friendship when each other person is seeking fun.their chief intent is their own pleasure and the opportunity of the moment which other person provides. And then there are friendship which are strategic acquaintance : they take pleasure in each others company only in so far as they have hopes of advantages of it. True friend: Who's just like you but someone who isn't you, but about whom you care as much as you care about yourself. the sorrows of a true friend or your sorrows, their Joy’s are yours,it makes you more vulnerable. you expand into the life of another, together you become larger ,clever, more resilient , more fair-minded. you share virtues and cancel out each others defects.friendship teaches us what we ought to be, it is quite literally the best part of life. 4. How can ideas cut through in a busy world? Aristotle was stuck by the fact that the best argument doesn't always win the debate of the battle. Aristotle plotted the ways audience and individuals are influenced by many factors that don't strictly engage with the logic or facts of the case. he invented the art of what we still today call rhetoric. Rhetoric - The art of getting people to agree with you. he wanted thoughtful, serious and well intentioned people to learn have to be persuasive to reach those who don't agree. people makes timeless points ,you have to recognize, acknowledge and soothe peoples fears. you have to see the emotional side of the issue - is someone's pride on the line ,are they feeling embarrassed- and edge around it accordingly. You have to make it funny because attention spans are short. you might have to use illustrations and examples to make your point come alive. Source : Wikipedia , Articles, YouTube. P.S : Thanks for asking, It was very much intresting to study about two great philosophers, I'm glad I could complete the answer after 5 hours of research. Any suggestions and edits are much appreciated. -Thanks for reading! ",
            "date": "Updated April 28, 2018",
            "views": "64",
            "upvotes": " View 28 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tarif Aurangzeb",
                    "user_href": "/profile/Tarif-Aurangzeb"
                },
                {
                    "user_id": "Alyssa Lorraine Peralta",
                    "user_href": "/profile/Alyssa-Lorraine-Peralta"
                },
                {
                    "user_id": "Francis Adrian Morales",
                    "user_href": "/profile/Francis-Adrian-Morales"
                },
                {
                    "user_id": "Akmaral Shulembayeva",
                    "user_href": "/profile/Akmaral-Shulembayeva"
                },
                {
                    "user_id": "Filippo DeAngelis",
                    "user_href": "/profile/Filippo-DeAngelis"
                },
                {
                    "user_id": "Jonathan van Graan",
                    "user_href": "/profile/Jonathan-van-Graan"
                },
                {
                    "user_id": "Benarivo Benarivo",
                    "user_href": "/profile/Benarivo-Benarivo"
                },
                {
                    "user_id": "TARA DERKSEN",
                    "user_href": "/profile/TARA-DERKSEN"
                },
                {
                    "user_id": "Makhija Harsh",
                    "user_href": "/profile/Makhija-Harsh"
                },
                {
                    "user_id": "Mike Walker",
                    "user_href": "/profile/Mike-Walker-277"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Faille",
                "href": "/profile/Christopher-Faille"
            },
            "answer_text": "Big question. Here’s an answer to a piece of it. Plato believed that the human soul is divided into three parts: the intellect, the spirit, and the appetite. The virtue of the intellect is understanding, the virtue of the spirit is courage, and of the appetite is temperance. In wizard-of-oz terms: the scarecrow, the lion, and the tin man co-exist in all of us. To Plato, the intellect ought to be in charge, and it ought to have the assistance of the spirit in keeping the appetites in check. That is the recipe for a good life. Writ large, superimposed on the City-State, that is the recipe for a just society. Philosophers ought to rule, and the armed forces ought to help them keep the rabble i control. Now: was Aristotle similar or different from his master? He was very similar - the usual contrasts between the two are overwrought. Aristotle also believed that the human soul is divided into three parts. He called them the intellect, the animal soul, and the vegetative soul. And although Aristotle isn’t explicit about it, his ethics of the “great-souled man” and the virtues that are all medians between opposed vices carries forward Plato’s point. It is his way of conceptualizing a soul in which the intellect plays its role as the highest part of the whole. And for Aristotle, the key social unit was neither city nor state, nor city-state, It was the family estate — in effect, a small farm run as a self-contained unit. The family estate is the human soul writ large. It should be headed by the pater familias (intellect). He should have the assistance of his wife and children (the spirit of the estate). They should keep control over the laboring beasts and the slaves, who get the actual physical work done (if their appetites are controlled). So here, too, the tripartite structure re-asserts itself. ",
            "date": "Answered August 13, 2018",
            "views": "18",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tarif Aurangzeb",
                    "user_href": "/profile/Tarif-Aurangzeb"
                },
                {
                    "user_id": "Jim Muncy",
                    "user_href": "/profile/Jim-Muncy-3"
                }
            ]
        }
    ]
}