{
    "title": "What causes intuition? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Eric Westfall",
                "href": "/profile/Eric-Westfall-3"
            },
            "answer_text": "Since I write a lot about the Myers-Briggs on here, I’m going to assume the a2a directed at me is about that kind of intuition. In the MBTI intuition is specifically “unconscious pattern recognition.” What makes someone an intuitive is that they pay more attention to, and are more driven by, these unconsciously recognized patterns rather than concrete information from the senses. Because they prefer this type of information, they generally also become very adept with it. To illustrate the difference, watch a political argument between person A, who uses statistics and patterns to make a point, and person B, who emphasizes anecdotes and their personal experiences. While there can easily be a thinker/feeler dichotomy in such an argument, the difference between finding general patterns in social behavior versus arguing with anecdotes and personal experience is an intuitive versus sensor difference respectively. (For clarity, the above example is likely to be an NT debating with an SF. An example of an NF arguing with an ST would be that the former uses general, universal ethical patterns and principles, and the ST emphasizes concrete examples of “how things practically got/get done in the ‘real world.’”)  So what causes intuition? Well, there’s some speculation that it’s genetic and some research to suggest this. In twin studies, identical twins are twice as likely to share Big 5 (the personality system most commonly used by academic psychologists) personality traits as fraternal ones, for example. None of this is nearly conclusive though. Personally I equate personality typology with ego formation. Egos form because we attach to our thoughts and start believing them to be true early in life. We start believing that what we are is our personality, our body, and our mind. This is a mistake in the sense that it’s simply not true, but nearly every human being acts as if it is for their entire lives. Because we believe ourselves to be our personality, body, and mind, we go to great lengths to protect those things. We could lose them and fail to exist! That’s the deepest fear of human beings. To protect them, we form very well formed personality structures that both satisfy our panic to confirm our existence, but also fit into a social role/expectation. It’s very dopamine-rewarding to engage in the behaviors and thought patterns that we identify as “my personality.” It’s a consistent re-confirmation of my own existence and that I have a place in the wider tribe, which will protect me. That’s where I think intuitives come from. I imagine most intuitives grow up being told they’re the smart or at least unusual ones. Intuitives invariably have very colorful and rare personalities and that’s the role/expectation they take on to form that ego structure. ",
            "date": "Answered August 9, 2017",
            "views": "640",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeremy Cornwall",
                    "user_href": "/profile/Jeremy-Cornwall-1"
                },
                {
                    "user_id": "Fusae Shigezawa",
                    "user_href": "/profile/Fusae-Shigezawa"
                }
            ]
        }
    ]
}