{
    "title": "What are the spiritual levels of consciousness? - Quora",
    "tags": [
        "Spiritual Awakening",
        "Spirituality of Everyday Life",
        "Enlightenment (spiritual)",
        "Consciousness",
        "Spirituality",
        "Philosophy",
        "Neuroscience",
        "Psychology",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jean-Pierre Legros",
                "href": "/profile/Jean-Pierre-Legros"
            },
            "answer_text": "There are no spiritual 'levels' of consciousness but spiritual 'contents'. To reach a higher level of consciousness is defined as follows: different categories of conscious contents are organized and form a synthetic concept. For example, how does our personal (intrinsic) image fit with the images of us formed by others? Thinking on this issue builds a real level of self-observation. It does not exist at the child and appears at the teenager. Spiritual contents are learned beliefs and not personal inventions. They are not in themselves promoters of self-observation. Certainly they encourage thinking on self-image within divine and holistic representations. But they forbid the questioning of beliefs, that is, the possibility of observing oneself as a believer versus a non-believer in the individual environment. The levels of consciousness gained are mythological rather than related to the rest of the personal reality. This mythological consciousness can be extraordinarily profitable as well as dreadfully imprisoning, depending on whether or not one has built a true self-observation of oneself drifting into our imaginary worlds. ",
            "date": "Answered April 13, 2019",
            "views": "157",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Daniel Asadov",
                    "user_href": "/profile/Daniel-Asadov"
                },
                {
                    "user_id": "Rares Mircea",
                    "user_href": "/profile/Rares-Mircea-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carlton Newman",
                "href": "/profile/Carlton-Newman"
            },
            "answer_text": "The spiritual levels of consciousness can best be described by a Chart showing those levels. It is called the Chart of the Presence I AM Presence “The mystical heart of the world's religions is the identity of the true Self. The understanding of the Self is the most important insight that any individual can have in life. The Self begins with the permanent atom of being, the cause out of which the effect proceeds. We call this cause the I AM THAT I AM, the Presence of the I AM, or the I AM Presence. This Real Self is seen in relationship to the evolving self on a chart that is called the Chart of Your Divine Self. It illustrates so many of the cosmic truths that have been discovered by the great mystics of East and West. The Chart has three parts and, in a sense, could be called the trinity of your identity.” ",
            "date": "Answered April 16, 2019",
            "views": "93",
            "upvotes": " Answer requested by Omar Lopez"
        }
    ]
}