{
    "title": "What are the differences between new-age classical and traditional classical as far as theory? - Quora",
    "tags": [
        "Classical Liberalism",
        "Classical Music",
        "Theory and Theories"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Weiss",
                "href": "/profile/Dan-Weiss-16"
            },
            "answer_text": "The differences could be described as one being an organized Monet, and there being a clear disruptive upheaval period with Dali, Picasso, and Jackson Pollack, coming out on the other side with a resettled marriage of the two conventions. A good and clear dividing point that you can chart historically would be the premiere of The Rite of Spring by Stravinsky. It caused a riot. Generally speaking, before this point, there had been a pretty solidly established set of rules, generally followed more or less, since Bach. There were marginal progressive ideas in theory and concept, especially by the time we get to Beethoven. What is referred to as 20th Century composition and beyond basically rejects the rules that came before. Relying less on harmonic structures and key centers, it became more about creating order out of organized chaos. Randomly selected or generated target melody points, modulated by symmetrical pattern design. Its the equivalent of splashing the canvas with paint, stepping back and seeing what can be made from it, then getting to work creating form. Things arent nearly as wild as they used to be all the time in new age classical pieces, but the differences are bucked convention, modern sounds, and scouring the trailblazers work through the weird stuff that didnt quite happen to appropriate the few things that did. ",
            "date": "Answered December 3, 2019",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Hooper",
                "href": "/profile/Steve-Hooper-6"
            },
            "answer_text": "New-age music is a genre of music intended to create artistic inspiration, relaxation, and ... significant overlap of sectors of new-age music with ambient music, classical ... age\" by retailers who are often less interested in finely grained distinctions ... with the former and markedly different musical and theoretical movement. ",
            "date": "Answered December 3, 2019",
            "views": "14",
            "upvotes": "0"
        }
    ]
}