{
    "title": "What are the differences between intuition, proof, and certainty? - Quora",
    "tags": [
        "Certainty",
        "Intuition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Traf Rellik",
                "href": "/profile/Traf-Rellik"
            },
            "answer_text": "This is a bit of a mundane question, but I’ll attempt to provide as interesting an answer as possible. I am addressing this in the context of evaluating physical claims (as opposed to, say, conceptual claims like those found in math). Also, I’m ignoring the trivial cases where you are certain of something because it is factually known (as in, first hand experience). Intuition is an active process, a byproduct of allowing our brain to subconsciously process information rather than attempt a conscious evaluation. We employ this technique far more than most people realize, and it tends to generate false positives because we generally rely on it more to sense things like hidden dangers. Proof is the collection of evidence regarding the claim under evaluation. Proof almost always favors false negatives, since reserving judgement (i.e. a healthy skepticism) is more sensible than accepting false beliefs. Certainty is the measurement that gauges the degree to which the available evidence satisfies the burden of proof. Functional certainty is a matter of rationally concluding that the claim has fully satisfied the burden of proof. ",
            "date": "Answered April 28, 2020",
            "views": "824",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeff Moses",
                "href": "/profile/Jeff-Moses-14"
            },
            "answer_text": "Intuition, sometimes called a “gut feeling,” is a sense that something is true or false, right or wrong, safe or dangerous, etc., based on a subconscious balance of experiences and desires. Proof is logical deduction, ideally based on factual data or extensive objective observation, that “something is true or false,” etc. “Proof” always relies on certain unprovable assumptions — such as the “ultimate” reliability of data, knowledge of all relevant factors, etc. Certainty is based on the consistency, over time, of things observed or proven. For example, long before we “proved” gravity, we were certain that apples that broke from the tree would fall to the earth. ",
            "date": "Answered April 29, 2020",
            "views": "958",
            "upvotes": "0"
        }
    ]
}