{
    "title": "What are the differences between self actualization and self awareness? - Quora",
    "tags": [
        "Self-Actualization",
        "Self-Awareness Advice",
        "Identities",
        "Self-Awareness",
        "Consciousness",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mijin Kurum",
                "href": "/profile/Mijin-Kurum"
            },
            "answer_text": "Self-awareness is the capacity for introspection and the ability to recognize oneself as an individual separate from the environment and other individuals. It is not to be confused with consciousness in the sense of qualia. While consciousness is being aware of one's environment and body and lifestyle, self-awareness is the recognition of that awareness.Self-awareness is how an individual consciously knows and understands their own character, feelings, motives, and desires. There are two broad categories of self-awareness: internal self-awareness and external self-awareneess , The concept was brought most fully to prominence in Abraham Maslow's hierarchy of needs theory as the final level of psychological development that can be achieved when all basic and mental needs are essentially fulfilled and the \"actualization\" of the full personal potential takes place. Maslow defined self-actualization to be \"the desire for self-fulfillment, namely the tendency for him [the individual] to become actualized in what he is potentially. This tendency might be phrased as the desire to become more and more what one is, to become everything that one is capable of becoming.\"Maslow used the term self-actualization to describe a desire, not a driving force, that could lead to realizing one's capabilities. He did not feel that self-actualization determined one's life; rather, he felt that it gave the individual a desire, or motivation to achieve budding ambitions. Maslow's usage of the term is now popular in modern psychology when discussing personality from the humanistic approach. A basic definition from a typical college textbook defines self-actualization according to Maslow simply as \"the full realization of one's potential\" and of one's \"true self.\" ",
            "date": "Answered October 12, 2019",
            "views": "557",
            "upvotes": " View 33 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manu Bhandari",
                    "user_href": "/profile/Manu-Bhandari-22"
                },
                {
                    "user_id": "Aruna Rayamajhi",
                    "user_href": "/profile/Aruna-Rayamajhi"
                },
                {
                    "user_id": "Shraddha Prajna",
                    "user_href": "/profile/Shraddha-Prajna"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Edward-962"
                },
                {
                    "user_id": "Maggie-Anne Devlin",
                    "user_href": "/profile/Maggie-Anne-Devlin"
                },
                {
                    "user_id": "Joseph Thomas",
                    "user_href": "/profile/Joseph-Thomas-971"
                },
                {
                    "user_id": "Shubhra Paudyal",
                    "user_href": "/profile/Shubhra-Paudyal"
                },
                {
                    "user_id": "Shalva Quthelia",
                    "user_href": "/profile/Shalva-Quthelia-1"
                },
                {
                    "user_id": "Mukunda Bista",
                    "user_href": "/profile/Mukunda-Bista"
                },
                {
                    "user_id": "Max Khatri",
                    "user_href": "/profile/Max-Khatri-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Siri Perera",
                "href": "/profile/Siri-Perera"
            },
            "answer_text": "As Sri Nisargadatta Maharaj had pointed out as we in mind try and ask the question Who Am I and if personality is it, then there is always an entity behind it in existence that is aware of this question and hence because of this it cannot be personality only in existence in us. Self-actualization is the work of personality and the verbal thinking mind. So one wants to know who is this behind this facade that is me that is always looking at all the questions I am asking about myself. He is always there when I ask the question. Hence your self-awareness is coming from another realm that you are part of. One is not isolated from the Whole. In fact, one is part of the Whole and that Whole is also looking at the self-actualization that is you locally. So Who is that that is being self-aware.  I think we have half a chance of finding it if we find our way to other mind spaces and in that silence, we might get to see who is that behind the personal self that is also watching with us.  Hence we either do it our way alone by self-actualisation through verbal thinking or we work in conjunction with the Watchman or Brahman who is also part of this whole process that is us.  So you choose to either work in the dark with a lie in your head which is what verbal-thinking knows to do or you work together with the Creator by finding Him via one’s silent mind and intuitive thinking with a sense of knowing and a no-mind and know the Truth or live with subjectivity and all the lies in one’s mind.  11 October 2019 ",
            "date": "Answered October 11, 2019",
            "views": "383",
            "upvotes": "0"
        }
    ]
}