{
    "title": "What are virtue ethics? - Quora",
    "tags": [
        "Virtue Ethics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Crider",
                "href": "/profile/Paul-Crider-2"
            },
            "answer_text": "Virtue ethics is an approach to ethics that focuses on character, rather than actions. The key question is something like 'What does the life well lived look like?' The answer to such a question will naturally take the form of looking at characters: real life role models, well fleshed out characters from good literature, or a posited ideal character. What are the traits that a person who is living the good, ethical life have? These are the virtues. In my experience most virtue ethicists don't spend a lot of time actually listing out the virtues, but the ones mentioned in examples are the same virtues urged on us at our mother's knee and from our moral teachers growing up and throughout our lives: traits like courage, self-control, compassion, honesty, prudence, etc. A recurring idea in different conceptions of virtue ethics is 'practical wisdom'. The ideal moral character embodies the virtues, but what happens when virtues conflict (shall I be brave and stand up to the bully or prudent and run away)? And when is courage really courage and not reckless machismo? There are no easy answers to this. Practical wisdom in employing the virtues must be learned by living life and are thus sometimes viewed as similar to skills. Virtue ethicists thus discuss the 'non-codifiability' of ethics. In contrast to at least elementary versions of utilitarianism and rule- or rights-based ethics, virtue ethicists resist anything that smacks of algorithmic morality, where any situation or dilemma has a 'right' solution based on simple ideas (greatest good for greatest number, say, or universalizability). Emotions also play a significant role in virtue ethics. The truly virtuous person would have emotions that are in harmony with her actions. So moral action is not done reluctantly, but with gladness. This is related to the idea that virtuous action is performed for the sake of virtue itself. Virtue benefits the virtuous agent as long as she has internalized virtue as what is truly rational or worthwhile. So the life well lived (or the 'eudaimon' or 'flourishing' life) is the life lived by the virtues, and for virtue. ",
            "date": "Answered January 4, 2015",
            "views": "7",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Carole Quain",
                    "user_href": "/profile/Carole-Quain"
                },
                {
                    "user_id": "Husnain Farooq",
                    "user_href": "/profile/Husnain-Farooq-4"
                },
                {
                    "user_id": "Joshua Callegaro",
                    "user_href": "/profile/Joshua-Callegaro"
                },
                {
                    "user_id": "Ahmed Akram",
                    "user_href": "/profile/Ahmed-Akram-55"
                },
                {
                    "user_id": "Desiree Valdez",
                    "user_href": "/profile/Desiree-Valdez-29"
                },
                {
                    "user_id": "Lhorry Romero",
                    "user_href": "/profile/Lhorry-Romero"
                },
                {
                    "user_id": "Damla SAN",
                    "user_href": "/profile/Damla-SAN"
                },
                {
                    "user_id": "Bo Miao",
                    "user_href": "/profile/Bo-Miao-2"
                },
                {
                    "user_id": "Ron Aldelene Gonzales",
                    "user_href": "/profile/Ron-Aldelene-Gonzales"
                },
                {
                    "user_id": "Lady Villamor",
                    "user_href": "/profile/Lady-Villamor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Kirk",
                "href": "/profile/Andrew-Kirk-17"
            },
            "answer_text": "Virtue ethics is a form of ethical thought generally accepted to originate in ancient Greece. Even still Aristotle is arguably the most frequently cited virtue ethicist though the tradition has continued through individuals like Friedrich Nietzsche and Alastair MacIntyre. It is focused on excellence in virtue, which is being neither too lacking or too filled with a given trait. All ethics concerns right action, but compared more proscriptive ethics virtue ethics is about character not about a set of good and bad deeds. You or I might be virtuous but a philosophy like utilitarianism would analyze our specific actions for their utility or deontology would examine the action’s universalizability. Virtue can fluctuate within a person and not everyone acts properly according to virtue at all times but virtue is cultivated more than utility or universalizable maxims. Here’s the easiest example: Courage. Courage is a virtue but as a virtue you can either be overflowing or lacking in the quality. In war, a soldier who is too cowardly will refuse to fight where one who is foolhardy will endanger their comrades. Virtue is the soldier moderating between their own fear and their desire to fight, with the right virtue being the golden mean between the two. A good teacher can help with this moderation and cultivation of a courageous character in the soldier. ",
            "date": "Answered April 6, 2017",
            "views": "104",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mcroneil Chua",
                    "user_href": "/profile/Mcroneil-Chua"
                },
                {
                    "user_id": "Joshua Callegaro",
                    "user_href": "/profile/Joshua-Callegaro"
                },
                {
                    "user_id": "Laisa Saldo",
                    "user_href": "/profile/Laisa-Saldo"
                },
                {
                    "user_id": "LYU CANCAN ZHOU",
                    "user_href": "/profile/LYU-CANCAN-ZHOU"
                },
                {
                    "user_id": "Hai Ling W Pole",
                    "user_href": "/profile/Hai-Ling-W-Pole"
                },
                {
                    "user_id": "Priyanka Patel",
                    "user_href": "/profile/Priyanka-Patel-138"
                }
            ]
        }
    ]
}