{
    "title": "What are the risks with data if due diligence is conducted with artificial intelligence? - Quora",
    "tags": [
        "Due Diligence",
        "Risk Management",
        "Risk and Risks",
        "Artificial General Intelligence",
        "Big Data",
        "Intelligence",
        "Artificial Intelligence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Errold Moody",
                "href": "/profile/Errold-Moody-2"
            },
            "answer_text": "I can only answer to the software used by the financial industry in its effort to show the unsuspecting public that the computer ‘knows all’. Unfortunately, the inputs vary tremendously because the previous theories and ‘rules of thumbs’ are either wrong or ‘massaged’ by the industry to conform to what they want to see as the answer. That is readily apparent since there has never been standardized risk categories for the most utilized investments- mutual funds and to a lesser degree, ETFs. Article after article simply makes up what they perceive to be a definition- conservative, moderate, aggressive- and subsets thereof- intermediate. One article notes the S&P500 is conservative. Yet others as moderately conservative (whatever that means). Maybe they use stars-***** such as Morningstar. Yet the stars reflect what happened in the past, not the risk of today. HOw about standard deviation? Well, that is a FORM of risk but NOT how much you can lose. It’s pretty much useless for risk analysis. Is it possible to reflect how much the fund or ETF might lose in a recession? Yes Is it used? No Why? Because, at least in one part, it would tell purchasers of the exposure they would have as a risk of loss about every 7.5 to 10 years. That would really screw up sales because the intended purchaser would want to know what the advisor is going to do to control that risk. That ain’t gonna happen Is the risk of loss taught anywhere.? No So if the industry won’t use a standardized risk exposure with current software, it would only become more convoluted from one firm/advisor to another firm/advisor if they were to include it. However if they did include the term ‘artificial intelligence’, the industry/advisor could say that “our software uses AI to determine your allocation” as a marketing gimmick without any inherent value. AI is a tool that can corrupted in its use. It just makes the software sound ‘sexier’- but it does work since marketing rules the world. No sense in going into details because there are NO standards being applied. ",
            "date": "Answered July 13, 2020",
            "views": "560",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Manupatra",
                "href": "/profile/Manupatra-2"
            },
            "answer_text": "The common concerns with AI when performing due diligence are: Limited Data: One of the major issues with machine learning AI is that the algorithms developed and the results generated are as good as the data that has been used for pattern detection by the AI. If biased or prejudicial data was used then the outcome would be directly impacted and the results generated would defeat the purpose of the due diligence exercise. Interpretability and Bias: Even if perfect data is entered into the AI, the pattern detection by machine learning relies on the functions and programming to look for the desired result for generating algorithms. If the programming functions are not targeted at achieving the most relevant results, the entire exercise would be futile. Confidentiality Concerns with AI: Since the team performing the due diligence exercise has access to sensitive information regarding pricing as well as customer information and counter-party competition law claims may arise, it's imperative that utmost independence and confidentiality are exercised. The use of AI to process this information raises relevant cybersecurity concerns and any breach would affect the business transaction directly. ",
            "date": "Answered July 15, 2020",
            "views": "39",
            "upvotes": "0"
        }
    ]
}