{
    "title": "What did Alexis de Tocqueville mean in his observation: 'the more equal human beings became in their condition-intellectually, politically, and spiritually, and economically-the less able they were to act as individuals on their own'? - Quora",
    "tags": [
        "Intellectualism",
        "Political Philosophy",
        "Equality (society)",
        "Philosophy",
        "The Human Race and Condition",
        "Politics",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "T. Collins Logan",
                "href": "/profile/T-Collins-Logan"
            },
            "answer_text": "Although this sounds a bit like the OP is crowdsourcing an answer to their college essay question, it’s interesting enough for me to want to answer it. I think what Tocqueville is getting at is a principle he proposed in his On Democracy in America. He is basically positing that democracy’s pursuit of equality can result in a sort of self-imposed tyranny of uniform individualism that does not tolerate variation, exceptions, or conditionality in its governance. Here is a relevant excerpt (quoted from Democracy In America Bk.4, Ch.2): “The very next notion to that of a sole and central power, which presents itself to the minds of men in the ages of equality, is the notion of uniformity of legislation. As every man sees that he differs but little from those about him, he cannot understand why a rule which is applicable to one man should not be equally applicable to all others. Hence the slightest privileges are repugnant to his reason; the faintest dissimilarities in the political institutions of the same people offend him, and uniformity of legislation appears to him to be the first condition of good government. I find, on the contrary, that this same notion of a uniform rule, equally binding on all the members of the community, was almost unknown to the human mind in aristocratic ages; it was either never entertained, or it was rejected…..On the contrary, at the present time all the powers of government are exerted to impose the same customs and the same laws on populations which have as yet but few points of resemblance. As the conditions of men become equal amongst a people, individuals seem of less importance, and society of greater dimensions; or rather, every citizen, being assimilated to all the rest, is lost in the crowd, and nothing stands conspicuous but the great and imposing image of the people at large. This naturally gives the men of democratic periods a lofty opinion of the privileges of society, and a very humble notion of the rights of individuals; they are ready to admit that the interests of the former are everything, and those of the latter nothing.” Essentially, then, Tocqueville perceives the eventual consequence of democracy’s pursuit of equality — which he nevertheless values and favors — as homogenization of a society’s collective self-concept in “the great and imposing image of the people at large;” in essence, in civil society. So the question then becomes: is the cohesion and apparent necessity of uniformity of governance for civil society a desirable outcome for democratic systems? We could observe that, right now in the U.S., the “individualistic” spirit of many folks seems to chomp at the bit of such uniformity. In fact some have speculated that reactive conservative extremism over the years (the Moral Majority, Tea Party, Trumpism, etc.) has arisen in response to exactly this imposition of a more progressive flavor of uniform equality — and hence, is perceived to have legislated uniformity on folks who really didn’t want it. Ironically, these conservative movements have then sought to impose what was merely their own flavor of uniformity on everyone else, and so were committing exactly the same error. As Tocqueville summarized: “Our contemporaries are therefore much less divided than is commonly supposed; they are constantly disputing as to the hands in which supremacy is to be vested, but they readily agree upon the duties and the rights of that supremacy. The notion they all form of government is that of a sole, simple, providential, and creative power. All secondary opinions in politics are unsettled; this one remains fixed, invariable, and consistent.” In other words, when a conservative government aims to legislate that abortion is illegal, or that massive corporate campaign contributions constitute free speech, or that the priority of government spending should be on the military, or that social security should be privatized…and so on…it is, essentially, imposing exactly the same uniformity of governance on the whole of society that conservatives frequently complain “the liberal agenda” has been doing — just conservative variations on the same theme. And yet…and this is precisely the point Tocqueville eventually drives home…such uniformity is likely an inevitable, even necessary consequence of democracy. The danger, he warns, is that democracies acquiescing to centralized power — who nevertheless remain enthralled with individualistic obsessions — leads to a condition where citizens only care about their own immediate interests, and become utterly disinterested in (and ignorant about) society as a whole and in its governance via the State. They then rely almost entirely on their representatives in government to make decisions. I think Tocqueville was particularly prescient in this regard, because that is pretty much the space much of the U.S. electorate was inhabiting prior to 2016. How can this pitfall be averted? Tocqueville addresses this in Bk.2 Ch.3 (my emphasis in bold): “It is difficult to draw a man out of his own circle to interest him in the destiny of the State, because he does not clearly understand what influence the destiny of the State can have upon his own lot. But if it be proposed to make a road cross the end of his estate, he will see at a glance that there is a connection between this small public affair and his greatest private affairs; and he will discover, without its being shown to him, the close tie which unites private to general interest. Thus, far more may be done by entrusting to the citizens the administration of minor affairs than by surrendering to them the control of important ones, towards interesting them in the public welfare, and convincing them that they constantly stand in need one of the other in order to provide for it…Local freedom, then, which leads a great number of citizens to value the affection of their neighbors and of their kindred, perpetually brings men together, and forces them to help one another, in spite of the propensities which sever them.” Essentially, Tocqueville is advocating one of my own favorite principles: subsidiarity. Empower people to govern themselves at the local level, and they will begin to appreciate the intersect with larger and larger circles of collective concern. And, even more than that, by empowering autonomous democratic institutions at the local level (all the way down to the local community), participants will learn how to contribute reflexively to the public good. As Tocqueville writes: “Men attend to the interests of the public, first by necessity, afterwards by choice: what was intentional becomes an instinct; and by dint of working for the good of one’s fellow citizens, the habit and the taste for serving them is at length acquired.” This is, I think, what had been lost to much of America for many years: that active engagement in local self-governance for the public good. It was a profoundly unfortunate development in the U.S., because it allowed obsessive self-interest to override any sense of political obligation. Thankfully, though, the rise of Donald Trump seems to have single-handedly turned the tide, so that America’s citizens are once more awakened to their collective responsibilities — if only to avoid the insidious despotism that Tocqueville warned would rise up in the absence of our constant wakefulness. My 2 cents. ",
            "date": "Answered July 9, 2020",
            "views": "413",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Theo Tromp",
                    "user_href": "/profile/Theo-Tromp-1"
                },
                {
                    "user_id": "Jenni McCord",
                    "user_href": "/profile/Jenni-McCord"
                },
                {
                    "user_id": "Sean Taylor",
                    "user_href": "/profile/Sean-Taylor-59"
                },
                {
                    "user_id": "James Beck",
                    "user_href": "/profile/James-Beck-62"
                },
                {
                    "user_id": "Len Boatman",
                    "user_href": "/profile/Len-Boatman"
                },
                {
                    "user_id": "John Richardson",
                    "user_href": "/profile/John-Richardson-500"
                },
                {
                    "user_id": "Marcus Lester",
                    "user_href": "/profile/Marcus-Lester-2"
                },
                {
                    "user_id": "Mark Elliott Churchman",
                    "user_href": "/profile/Mark-Elliott-Churchman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marcus Lester",
                "href": "/profile/Marcus-Lester-2"
            },
            "answer_text": "Tocqueville was a French aristocrat, diplomat, political scientist, and historian. I believe that he arrived at this opinion in the light of his aristocratic European views. Basically, aristocrats are seen largely as individuals and the remaining rabble, however interesting it may be, is seen as something of a monolithic bloc. I believe also that today’s experience in the USA is a strong counter-argument to this view. We have become less equal, highly fractured, led by propaganda of all kinds, and suffer greatly from a long-term decline in public education. It is the half-century growth of inequality in our “condition, intellectually, politically, and spiritually, and economically” that leaves us largely unable to act either in concert or individually. ",
            "date": "Answered July 11, 2020",
            "views": "243",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Theo Tromp",
                    "user_href": "/profile/Theo-Tromp-1"
                },
                {
                    "user_id": "John Richardson",
                    "user_href": "/profile/John-Richardson-500"
                },
                {
                    "user_id": "Bill Hazelton",
                    "user_href": "/profile/Bill-Hazelton-1"
                }
            ]
        }
    ]
}