{
    "title": "What are the best philosophy books? - Quora",
    "tags": [
        "Best of X",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Philippus",
                "href": "/profile/Daniel-Philippus-1"
            },
            "answer_text": "Edit: to be clear, I’m uneasy with the idea of an absolute ranking of philosophy books, and I certainly have no such ranking in mind. This, in accordance with the original question that I answered, is a list of what I have found to be good philosophy books. Everything that I’ve read so far and found to be interesting (that I remember), in no particular order: (probably the single most immediately impactful book on the list to this point is The Role Ethics of Epictetus) Meditations, Marcus AureliusA great introduction to StoicismDiscourses, EpictetusA detailed collection of lectures on StoicismEnchiridion, EpictetusA concise summary of Discourses as a sort of Stoic handbookLetters and various essays, SenecaReally well-written, in-depth pieces of advice and philosophyMany dialogues, PlatoIntriguing explorations of philosophy and a great way to learn about the Socratic methodMemorabilia, XenophonA seemingly more trustworthy discussion of Socrates himself, interesting for the emphasis on disciplineCynicism from Diogenes to Dilbert, Ian CutlerAn interesting discussion of the Cynics, plus some interesting thoughts on the continuation of the tradition (including a not half bad argument that Nietzsche was a continuation of the Cynic tradition)Human, All Too Human and The Dawn of Day, NietzscheNo coherent philosophy presented at that point, but a lot of interesting things to think about. I’ve been less impressed (thus far) with The Joyful Wisdom (edit: the last few parts were better, but I can’t say that I’d recommend it on the whole).Sapiens, Yuval Noah HarariThis isn’t philosophy, but it is a great resource on philosophy by helping to understand our origins and how we operate. Know thyself.Edited in later: Prolegomena, KantWritten as a sort of introduction to Critique of Pure Reason, it doesn’t have the full arguments, but I think it gets some of the points across well. An interesting and relatively easy read, compared to what I’ve heard of the Critique.Kant’s first two Critiques, of Pure and Practical Reason (I haven’t read the third)These are tough reading but for a good reason, the newness and complexity of the ideas, which in and of itself is somewhat worthwhile. However, the actual value is that they do introduce new and interesting ideas. While I disagree with much of Kant’s thought and find some of his arguments questionable, they are still powerful ideas worthy of exposure.The Role Ethics of Epictetus, Brian JohnsonJohnson argues that Epictetus, in his Discourses etc, does not simply explain Stoic orthodoxy but actually introduces a novel extension to Stoicism in the form of Epictetean role ethics. The role ethics described are powerful, practical, generally clear, and, interestingly, not dependent on a particular ethical framework (or so I would argue)—I’d point the reader to a fuller discussion I wrote elsewhere: Daniel Philippus's post in Applied Philosophy.I think role ethics is a powerful and novel framework that is worthy of study for anyone, coming from any moral framework.",
            "date": "Updated January 29, 2020",
            "views": "87",
            "upvotes": " View 42 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alex Lumley",
                    "user_href": "/profile/Alex-Lumley"
                },
                {
                    "user_id": "Rahul Tiwari",
                    "user_href": "/profile/Rahul-Tiwari-245"
                },
                {
                    "user_id": "Vijay Vj",
                    "user_href": "/profile/Vijay-Vj-11"
                },
                {
                    "user_id": "Guy Colton",
                    "user_href": "/profile/Guy-Colton"
                },
                {
                    "user_id": "Chuka Anekwe",
                    "user_href": "/profile/Chuka-Anekwe-1"
                },
                {
                    "user_id": "Harsh Sharma",
                    "user_href": "/profile/Harsh-Sharma-123"
                },
                {
                    "user_id": "Heriberto Lanfranco",
                    "user_href": "/profile/Heriberto-Lanfranco"
                },
                {
                    "user_id": "Amr Ashraf Abdelgawad",
                    "user_href": "/profile/Amr-Ashraf-Abdelgawad"
                },
                {
                    "user_id": "Positive ?",
                    "user_href": "/profile/Positive-10"
                },
                {
                    "user_id": "Rahul",
                    "user_href": "/profile/Rahul-4091"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan Holiday",
                "href": "/profile/Ryan-Holiday"
            },
            "answer_text": "Ancient philosophy—and Stoicism in particular—is my favorite topic in the world. Before I recommend some reading suggestions, let me provide some background. Almost exactly ten years ago, I bought the Meditations of Marcus Aurelius on Amazon. It arrived in package like any other book but it landed on my like a ton of bricks. Meditations would be for me, what Tyler Cowen would call “a quake book,” shaking everything I thought I knew about the world (however little that actually was). It was that book that introduced me to Stoicism and a ten year study of philosophy as a whole. It also inspired my own take on the topic The Daily Stoic: 366 Meditations on Wisdom, Perseverance, and the Art of Living, which brings all-new translations of Marcus Aurelius, Seneca and Epictetus (as well as few other Stoics) and a daily stoic thought each morning via email. And before we jump into the recommendations, I want to stress that philosophy is not something you know, it’s something you do. It is medicine. As Marcus Aurelius put it, it’s “a soothing ointment, a warm lotion.” It’s designed to help us deal with the difficulties of life—to heal, as Epicurus said, the suffering of man. It’s meant to be read and re-read, to be discussed, written about and most of all, to be lived. I hope these recommendations get you started along that path and I hope the path is as fulfilling, provocative and helpful as it has been for me. Here we go. You asked for one but I will go crazy on this. Hope that’s ok! ***The Best Of the Stoics*** Meditations by Marcus Aurelius It still strikes now—some 10 years into reading this book—how lucky we are to even have it. Meditations is perhaps the only document of its kind ever made: the private thoughts of the world’s most powerful man about how to make good on the responsibilities and obligations of his positions. Marcus stopped almost every night to practice a series of spiritual exercises—reminders designed to make him humble, patient, empathetic, generous, and strong in the face of whatever he was dealing with. You cannot read this book and not come away with a phrase or a line that will helpful to you next time you are in trouble. Read it, and then read it again as often as you can. (Note: I strongly recommend the Hays’s translation above all others and you can also read my interview with the author here). Letters from a Stoic by Seneca Seneca, like Marcus, was also a powerful man in Rome. He was also a great writer and from the looks of it, a wise man who dispensed great advice to his friends. Much of that advice survives in the form of letters, guiding them and now us through problems with grief, wealth, poverty, success, failure, education and so many other things. Seneca was a stoic as well, but like Marcus, he was practical and borrowed liberally from other schools. As he quipped to a friend, “I don’t care about the author if the line is good.” That is the ethos of practical philosophy—it doesn’t matter from whom or when it came from, what matters is if it helps you in your life, if only for a second. Reading Seneca will do that. (Other collections of his thoughts are great too: Penguin’s On the Shortness of Life is excellent and if you’re looking for an audiobook of Seneca, try Tim Ferriss’s edition The Tao of Seneca: Letters from a Stoic Master) Enchiridion by Epictetus Unlike the other powerful Stoics, Epictetus overcame incredible adversity. A slave who was banished from Rome, he eventually became a philosopher and opened a small school. Notes from his classes survive to us in what is now called the Enchiridion, which translates as a ‘small manual or a handbook’ and it is exactly that. It is the perfect introduction to Epictetus as it is packed with short Stoic maxims and principles. Unlike both Seneca and Marcus, Epictetus is somewhat more difficult to read and I recommend beginning with those two if you haven’t yet read them. The next step would be Epictetus’ Discourses, which are much longer and deserve a bigger commitment. ***Works From Other Great Stoic-Like Philosophers*** The Moral Sayings of Publius Syrus by Publius Syrus A Syrian slave in the first century BC, Publius Syrus is a fountain of quick, helpful wisdom that you cannot help but recall and apply to your life. “Rivers are easiest to cross at their source.” “Want a great empire? Rule over yourself.”“Divide the fire and you will sooner put it out.” “Always shun that which makes you angry.”Those are a few I remember off the top of my head. But all of them are good and worthy of re-reading in times of difficulty (or boredom or in preparation of a big event). Fragments by Heraclitus The Stoics—especially Marcus—loved to draw from Heraclitus, a mystic, ephemeral philosopher whose beautiful fragments are eminently quotable. My favorite line from Heraclitus is his line about how no man steps in the same river twice—because it is not the same river and he is not the same man. Another favorite: “Applicants for wisdom / do what I have done: / inquire within.” And of course, his most direct and timeless remark: “Character is fate.” If you’re looking for philosophy that is poetic but also practical, give Heraclitus a chance. Man’s Search for Meaning by Viktor Frankl Man is sent to a concentration camp and finds some way for good to come of it. Finds some way to turn it into the ultimate metaphor for life: that we have little control over our circumstances, complete control over our attitude, and our ability to make meaning out of the things which happen to us. In Frankl’s case, we are lucky that he was a brilliant psychologist and writer and managed to turn all this into one of the most important books of the 20th century. I think constantly of his line about the man who asks, “What is the meaning of life?” The answer is that you don’t get to ask the question. Life is the one who asks and we must reply with our actions. Essays by Michel de Montaigne Montaigne was deeply influenced by some of the books I mentioned above. He was the epitome of Heraclitus’s line about “inquiring within.” So much so that he spent basically the entire second part of his life asking himself (and other people) all sorts of interesting questions and then exploring the answers in the form of short, provocative essays. (A favorite: Whether he was playing with his cat, or whether he was the toy to his cat). These essays are always good for a helpful thought or two—be it about death, about “other” people, about animals, about sex, or anything. Nature and Selected Essays by Ralph Waldo Emerson While Montaigne’s essays are good for making us think, Emerson’s essays make us act. They remind us that we are ultimately responsible for our own life, for making ethical choices and for fulfilling our potential. I prefer Emerson to the more indolent Thoreau and because unlike most classic writers, he embodies that uniquely American drive and ambition (but in a healthy way). If you have not read Emerson, you should. If you have—and you remember fondly his reminders about recognizing our own genius in the work of others, or his reminders to experience the beauty of nature—that counts as philosophy. See how easy it is? Essays and Aphorisms by Arthur Schopenhauer Schopenhauer is another brilliant composer of quick thoughts that will help us with our problems. His work was often concerned with the “will”—our inner drives and power. “For that which is otherwise quite indigestible, all affliction, vexation, loss, grief, time alone digests.” But he also talks about surprisingly current issues: “Newspapers are the second hand of history”—and that the hand is often broken or malfunctioning. And of course, the timeless as well: “Hope is the confusion of the desire for a thing for its probability.” Maxims and Reflections by Goethe I’d never read or even heard of Goethe until I saw him mentioned in the Hays’ introduction to Marcus Aurelius but I am grateful to have been exposed to the man’s brilliant maxims. The topics range from natural science, art, ethics, literature to observations on chance encounters he’d have. Goethe himself was prolific, writing poetry, dramas, scientific treatises, novels and in the last decades of his life he would begin publishing these short reflections. Some favorite ones from the book: “Behavior is a mirror in which everyone shows his image.” “Absolute activity, of whatever kind, ultimately leads to bankruptcy.” “Tell me whom you consort with and I will tell you who you are.” ***Works About The Stoics*** The Inner Citadel and Philosophy as a Way of Life by Pierre Hadot Pierre Hadot is maybe one of the smartest people I’ve ever read. The Inner Citadel is mostly about Marcus Aurelius and the Stoic concept of the self as a fortress. Philosophy as a Way of Life is essentially a book about the wisdom of ancient philosophers cumulatively acquired and how we can use the same exercises in our struggles. I highly recommend both of these. If you’ve read both and want more from the master, I also suggest The Present Alone is Our Happiness which is a series of interviews with Hadot. Rome’s Last Citizen: The Life and Legacy of Cato, Mortal Enemy of Caesar by Rob Goodman and Jimmy Soni Marcus Cato has certainly earned his place in the history books—he was the Stoic senator who led the opposition against Julius Caesar who then killed himself rather than live under a dictator. Cato was a soldier, a politician, a thinker and, because of how he lived his life, a philosopher. His unassailable place in Roman culture is best seen in the old proverbial expression used to make excuses: “We’re not all Catos.” You can also read an interview with Jimmy Soni over at the Daily Stoic. Marcus Aurelius by Matthew Arnold (essay) Matthew Arnold was a Victorian scholar who fell in the category of ‘sage writers’—the type of writer who instructs and chastises the reader. This is a fantastic essay on Marcus, who as he remarked in 1863, was a man who held the highest power and most powerful station in the world—and the universal verdict of the people around him was that he proved worthy of it. A few other great essays on Marcus: \"Homage to Marcus Aurelius\" by Joseph Brodsky (available in On Grief and Reason: Essays) and “Stoicism in the South” by Walker Percy (available in Signposts in a Strange Land: Essays). Memoirs of Hadrian by Marguerite Yourcenar There are not many great works of fiction about Stoicism, but this is one. Written from the perspective of Hadrian, the book takes the form of a long letter of advice to a young to Marcus Aurelius, who would eventually succeed him as emperor. It’s somber but practical, filled with beautiful and moving passages from a man near death, looking to prepare someone for one of the most difficult jobs in the world. The only other work of fictions about Stoicism I can recommend is Tom Wolfe’s A Man In Full—and then of course, the Loeb edition of Seneca’s plays. During his lifetime, Seneca was actually more famous for his tragedies than he was for his philosophy (there is a line from one of his plays entombed as graffiti at Pompeii). Anyway, I was enthralled by these dark, disturbing but ultimately stoic plays. Dying Every Day: Seneca at the Court of Nero by James Romm I loved this book and read it in one long, long flight. I was riveted and I'm someone who already knew a lot about Seneca. This book is particularly interesting because the author understands that his subject is a person of contradictions but doesn't judge the subject. Instead he seeks to understand it. In Seneca it is this: how can a philosopher accumulate so much political power? How can a wise man tutor such a monster? How can an austere man aspire to (and enjoy) great wealth? How can a philosophical writer also be a passionate playwright? I'll say it again: I loved this book. I don't necessarily agree with all its conclusions but it made me think all the way through. Lives of Eminent Philosophers Volumes I & II by Diogenes Laertius Ironically, Diogenes’ most famous biography in this collection is of the other Diogenes—Diogenes the Cynic. Other excellent and illustrative sketches include Zeno, Ariston, Cleanthes and Chrysippus the Stoic. Heraclitus is another great biography. All of these vary in length. Zeno is over a 150 pages, Herillus (not to be confused with Heraclitus) is 2 pages. But regardless of length, they are all quite good. My favorite little quirk of the book is Diogenes’ weird poem that he writes about each philosopher and of course the credulity with which he reports on their unusual deaths (on that note, you may also like the book The Book of Dead Philosophers, a book on how many of the world’s most famous philosophers supposedly died.) *** All of these can be life-changing and I hope you get around to giving them a try. Of course, I also hope you find the time to give The Daily Stoic a chance! ",
            "date": "Answered October 27, 2016",
            "views": "75",
            "upvotes": " View 71 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Swaroop",
                    "user_href": "/profile/Swaroop-115"
                },
                {
                    "user_id": "Marill H",
                    "user_href": "/profile/Marill-H"
                },
                {
                    "user_id": "Alex Lumley",
                    "user_href": "/profile/Alex-Lumley"
                },
                {
                    "user_id": "Abhishek Krishnan",
                    "user_href": "/profile/Abhishek-Krishnan-64"
                },
                {
                    "user_id": "Muyanja Fahd",
                    "user_href": "/profile/Muyanja-Fahd"
                },
                {
                    "user_id": "Aniket Singh",
                    "user_href": "/profile/Aniket-Singh-8"
                },
                {
                    "user_id": "Mouhamed Ndour",
                    "user_href": "/profile/Mouhamed-Ndour"
                },
                {
                    "user_id": "Terry Jackson",
                    "user_href": "/profile/Terry-Jackson-15"
                },
                {
                    "user_id": "Liam Kalamaros",
                    "user_href": "/profile/Liam-Kalamaros"
                },
                {
                    "user_id": "Pramod Peesapati",
                    "user_href": "/profile/Pramod-Peesapati"
                }
            ]
        }
    ]
}