{
    "title": "What are investigation principles? - Quora",
    "tags": [
        "Investigative Journalism",
        "Crime Scene Investigation",
        "Private Investigators",
        "Investigations",
        "Values and Principles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony Bartlett",
                "href": "/profile/Tony-Bartlett-3"
            },
            "answer_text": "Assume nothing Believe nobody Confirm everything You must go into an investigation with an open mind. Any policy decisions you make should be noted in a policy book together with reasons at the time you make them. When you end up in the High Court in the Strand, London 6 years later having a policy book to rely on will be of great assistance when you are cross examined. There is an old saying in British policing “ if it isn't written down,it didn't happen\" Picture the scene. You are the senior investigating officer at the assassination of an informant in a supermarket car park. First entry in the policy book could read: “I have assumed the role of SIO and l am treating this incident as a murder because: The victim is deceased as confirmed by Dr Jones, There appears to be a gunshot wound behind the victims left ear No firearm is present suggesting that the offender took it with him and that this is not a suicide Decision made at noon hours Day Date, place” You have now set the early parameters fo your investigation ",
            "date": "Answered October 3, 2020",
            "views": "195",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Haden",
                    "user_href": "/profile/Paul-Haden"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steph Groom",
                "href": "/profile/Steph-Groom-2"
            },
            "answer_text": "“Good investigations are based on eight fundamental principles. Investigators must be as independent as possible. Investigators must be trained and experienced. All potentially relevant issues must be identified and, where appropriate, pursued. Investigations must be sufficiently resourced.” These 8 principles are as follows.  What are the 8 Principles of Excellent Investigation? ",
            "date": "Answered May 22, 2020",
            "views": "250",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Krysta Champagne",
                    "user_href": "/profile/Krysta-Champagne"
                },
                {
                    "user_id": "Aman Sharma",
                    "user_href": "/profile/Aman-Sharma-3652"
                }
            ]
        }
    ]
}