{
    "title": "What are the most pointless questions you can think of? - Quora",
    "tags": [
        "Advice for Everyday Life",
        "Questions and Answers",
        "Asking Questions",
        "Questions (Quora content)",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aiku Shinokiba",
                "href": "/profile/Aiku-Shinokiba"
            },
            "answer_text": "This really depends on what you would consider as ‘pointless’. Now, think about that word before you answer. As a matter of fact, I really don’t believe there are really any pointless questions. If it is even classified as a question and is given an answer, it automatically has a purpose. The question had a purpose of being answered, and that’s enough point to be not considered pointless. If a question is a question, then it would logically be there to find an answer. Questions themselves have more purpose than we realize. No matter how you put it, questions have a point either way. To us, questions are something you need in order to get an answer. There are no answers without questions. If you think about, answers aren’t technically answers if there is no question. They are simply just statements if there is no question. When we put questions into the mix, that statement (given to answer that specific question) is automatically considered a question. You can’t place down a question and it will be utterly useless. There is a reason that specific question is being asked. There are literally no pointless questions in the universe. As a matter of fact, nothing in the entire world is pointless. Everything leads to something. There is no everything without something. You can’t have everything if you don’t have at least one thing. That one thing could even be considered something too. Look more into it guys, everything eventually, one way or another, leads to another thing. Even something as small as an atom has a purpose. Eventually, that atom will combine with other atoms to make, well, something! Questions are basically asking for an answer. That itself can be considered a purpose. Even this question isn’t pointless. The fact that there are answers make it not pointless. Everything has a point, and that doesn’t exclude questions. ",
            "date": "Answered May 6, 2019",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lawson Langley",
                "href": "/profile/Lawson-Langley"
            },
            "answer_text": "1. When cheese gets it’s picture taken what does it say?2. If 4 out of 5 people suffer from diarrhea does the 5th one enjoy it?3. Why is there an expiration date on sour cream if it’s already sour?4. If you try to fail and succeed which have you done?5. Why are hot pads not hot?6. If deaf people go to court is it still called a hearing?7. If you choke a smurf, what color does it turn?8. If a man with multiple personalities threatens to kill himself is it a hostage situation?9. What is the speed of dark?10. If you stay awake all night do you still have morning breath?11. If a turtle loses it’s shell is he homeless, naked or both?12. Since most people don’t eat computers why is it called an Apple?13. Can a teacher give a homeless student homework?14. If a cop arrests a mime do they still have to tell him he has the right to remain silent?15. Isn’t Disney World just a people trap managed by a mouse?16. Can a vegetarian eat animal crackers?17. If roses, lilies, and sunflowers are all flowers can you use them to make a cake?18. What happens if a black cat carrying a rabbit’s foot crosses your path?19. If you are innocent until proven guilty why are you arrested and sent to trial?20. If a man speaks in a forest and no woman is around to hear him is he still wrong? ",
            "date": "Answered May 2, 2019",
            "views": "27",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Prab S. Chawla",
                    "user_href": "/profile/Prab-S-Chawla"
                },
                {
                    "user_id": "Devin Banzuelo",
                    "user_href": "/profile/Devin-Banzuelo"
                },
                {
                    "user_id": "Ajinkya Rathod",
                    "user_href": "/profile/Ajinkya-Rathod-2"
                },
                {
                    "user_id": "Andrew Lebedev",
                    "user_href": "/profile/Andrew-Lebedev-2"
                },
                {
                    "user_id": "Petru Daniel Buţu",
                    "user_href": "/profile/Petru-Daniel-Buţu"
                },
                {
                    "user_id": "Kim Church",
                    "user_href": "/profile/Kim-Church-15"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        }
    ]
}