{
    "title": "What are a few bitter truths of life? - Quora",
    "tags": [
        "Truth",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sandeep Sadu",
                "href": "/profile/Sandeep-Sadu-1"
            },
            "answer_text": "Man comes to the earth with empty hand, At the end with empty hand he has to leave this land.An abortion is not as easy to forget as some women might like it to be. For some that fateful choice will always haunt their memories and their hearts with regret.Make the mistake of calling someone a bad name even once and for the rest of your life you will be known as a racist / communal or worse.There are no real friends in this world. There are only people, who use you to meet their wants / needs, then dump you, when you are no longer needed.Never watered a tree, fight for a parking shade.We blame the society, but we are the society.Inter religion marriage still a big question.Road accidents casualties die on the spot in spite of helping them a large crowd surrounding them.A girl walking down an empty street alone just wishes to reach home safely, everyday.Not giving money to a beggar is an act of a devil.Two things that reveals a man’s weakness – anger and violence.Money is the root of all evil, but if you have no money then society will scorn you. The less evil you have the less people will think of you.Love is like a Grocery store of apple: Look all you want, but you will never find a one with a huge dent in it. Nobody is Perfect – Especially Me.There are trillions of organisms upon trillions of planets within trillions of galaxies. And yet you will still meet people who consider themselves as ‘important’. These people are known as ‘men’ and ‘women’. You may want to avoid them.If you turn out to be pretty, Then people will treat you unfairly because everyone assumes that attractive people are just charming and everything is way easier for them. You will not find any sympathy because people think you have a perfect life. This will result in bitter and loneliness from inside. If you turn out to be ugly, Everyone will like you because you are worse looking than them. However nobody will love you because you are worse looking than them. This will result in bitter and loneliness from inside.People do not like good thoughts they like good looksSome say rich people live happy while poor people live in tension, depression, and emotionally unstable most of the time or vice versa. But actually everyone in this world live with both sadness and happiness and have their own problems to tackle them.People respect money and position more than a person.Whole world works for money but there is only one person who is working for you . He is your Father“A person should not be too honest. Straight trees are cut first and honest people are screwed first.”“Never share your secrets with anyone. It will destroy you.”",
            "date": "Answered April 18, 2018",
            "views": "41",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dex Sprinkle",
                    "user_href": "/profile/Dex-Sprinkle"
                },
                {
                    "user_id": "Maya",
                    "user_href": "/profile/Maya-1480"
                },
                {
                    "user_id": "Mark Brackens",
                    "user_href": "/profile/Mark-Brackens"
                },
                {
                    "user_id": "Bryant Mitchell",
                    "user_href": "/profile/Bryant-Mitchell-16"
                },
                {
                    "user_id": "Avi Varos",
                    "user_href": "/profile/Avi-Varos"
                },
                {
                    "user_id": "Megan Nichole",
                    "user_href": "/profile/Megan-Nichole-3"
                },
                {
                    "user_id": "Stacey Keller",
                    "user_href": "/profile/Stacey-Keller-16"
                },
                {
                    "user_id": "Kamruz Borbhuyan",
                    "user_href": "/profile/Kamruz-Borbhuyan-1"
                },
                {
                    "user_id": "Abhishek",
                    "user_href": "/profile/Abhishek-3175"
                },
                {
                    "user_id": "Butter Puff",
                    "user_href": "/profile/Butter-Puff"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Fayed",
                "href": "/profile/Adam-Fayed"
            },
            "answer_text": "1.Most people aren't living the life they wanted as kids Most of us have accepted compromises 2. The perfect partner doesn't exist In the real world people settle all the timeThere are some signs you have found the right partner but not perfect one 3.The perfect country to job also doesn't exist It is a balance between relaxation, lifestyle, money, job satisfaction etc 4. People change And not always for the best 5. Many friendships are fake It is hard to know which friendships are fake until you emigrate, move cities and/or get older 6.Keep reading The world is becoming more and more competitiveAny advantage is key 7. Sales is key No matter what you have learned at university, most business need to care about revenue first and foremostI would recommend the book below 8. Learn about personal finance And spending habitsIt could be the difference between millionaire status and/or security, and financial troublesEither read the evidence or watch the evidenced via ebooks/online etc.Especially learn about passive income. 9. Effort and reward aren't always directly linked Especially if you give up too soonA lot of people ask questions on Quora like `how can I make money online`, and that is a great exampleOnline work is the type of thing that requires loads of work to start with. When I started my Youtube Channel (Expat Strategies). I had 1–2 followers. It took a lot of work to get it to 1,000+ even though people weren't paying. It got easier and easier. Not fair, but rational.Likewise, my Patreon Channel (Adam Fayed is creating Videos and podcasts about financial freedom and passive income | Patreon) is new. It is hard when new, and the original subscribers get more value, as often people increase prices in time. It will get easier and easier over time. In most businesses, original customers get more value than ones who come after 5 years. Is that fair? No. But it is rational. Likewise, Buffett’s original investor, the first one, got more value than anybody after him, and when I went to new hotels, I always got better rates than the ones I find now, once they are established. The market isn't supposed to be fine.Same thing with my writing. It took a while to take off but is now passive - https://www.amazon.co.uk/Steps-F. 10. University doesn't always matter At least not as much as it used to be ",
            "date": "Answered September 16, 2018",
            "views": "1067",
            "upvotes": " View 427 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Paul Regalos Urban",
                    "user_href": "/profile/Paul-Regalos-Urban"
                },
                {
                    "user_id": "Meow Meow",
                    "user_href": "/profile/Meow-Meow-883"
                },
                {
                    "user_id": "Tunda Edgar",
                    "user_href": "/profile/Tunda-Edgar"
                },
                {
                    "user_id": "Shamroz",
                    "user_href": "/profile/Shamroz-1"
                },
                {
                    "user_id": "Elikplim Kudowor",
                    "user_href": "/profile/Elikplim-Kudowor"
                },
                {
                    "user_id": "Laura Lawless",
                    "user_href": "/profile/Laura-Lawless-15"
                },
                {
                    "user_id": "Chetan Thakker",
                    "user_href": "/profile/Chetan-Thakker-6"
                },
                {
                    "user_id": "Megan Nichole",
                    "user_href": "/profile/Megan-Nichole-3"
                },
                {
                    "user_id": "Alex Trình Trần",
                    "user_href": "/profile/Alex-Trình-Trần"
                },
                {
                    "user_id": "Reka Santo",
                    "user_href": "/profile/Reka-Santo"
                }
            ]
        }
    ]
}