{
    "title": "What are the similarities between absolute ethics and relatives ethics? - Quora",
    "tags": [
        "Ethics and Morality",
        "Ethics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ken Filliez",
                "href": "/profile/Ken-Filliez"
            },
            "answer_text": "In essence they are similar in all ways except that relative ethics centers around the idea that everything is subjective and unique and absolute ethics is focused on universality within ethics. For example if you use utilitarianism which says that which serves the greater good is in itself good. That is a normal ethical standpoint, you can apply relativity to it by saying well it's relative per situation you did yourself in. Or you can say, no, this always applies no matter what. So ethics is ethics, and relativism along with absolutism are applied to ethical theory. Something in between the two is the most appealing to me. ",
            "date": "Answered November 14, 2016",
            "views": "947",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nompumalanga Tembe",
                    "user_href": "/profile/Nompumalanga-Tembe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gerald Crawford",
                "href": "/profile/Gerald-Crawford-12"
            },
            "answer_text": "Absolute ethics - Preachers are famous for this. Some have a pretty rigid view of the world, and anything or anyone who disagrees with their narrow approach is condemned as an \"ethical relativist.\" They're much happier with the idea of moral absolutes. And I have to admit that the idea of moral or ethical absolutes is comforting. Relatives ethics - Ethical relativism is the theory that holds that morality is relative to the norms of one's culture. That is, whether an action is right or wrong depends on the moral norms of the society in which it is practiced. The same action may be morally right in one society but be morally wrong in another. Both presuppose that there must be a set of morals and ethics in a society. ",
            "date": "Answered October 21, 2018",
            "views": "629",
            "upvotes": "0"
        }
    ]
}