{
    "title": "What are some examples of people being judgemental? - Quora",
    "tags": [
        "Judging People",
        "Judgment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Heidi Paul",
                "href": "/profile/Heidi-Paul-3"
            },
            "answer_text": "I once heard of a certain person who was married into a family and having two children herself was then offered an overseas trip, which entailed that the person who paid for trip, the children's grandma, offering to take care of the children. So then, since obviously there must have been some personal issues between those two women (titanic power struggle between two narcissists) the younger let it be clearly known… Statement: (referring to the way the grandmother brought up her own children, which included the father of the kids)… “I don't like the way your mother raised you and your sister so I don't want your mother taking care of MY children! “ I think that's offensive and arrogant. . The trouble with judging others is that you don't know the circumstances or the things that have caused this situation. As someone said.. we can't judge another man until we have walked a mile in his shoes. However, when we leave it to God He DOES judge fairly. We must always remember that the way we judge others and the measure we use to judge others is the same measure with which we will be judged..and so if we think of ourselves as “good” then we are mistaken because even Jesus, who never sinned, was careful to say that only God is good. ",
            "date": "Answered April 2, 2020",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ifeanyi Omofuma",
                    "user_href": "/profile/Ifeanyi-Omofuma"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeremy Rinker",
                "href": "/profile/Jeremy-Rinker"
            },
            "answer_text": "Me. All the time, especially when it comest to drugs. But my feelings on the subject are this: The thing that makes people feel judged is usually guilt. So really, the only people who think I’m judgemental are people who are doing things they’re afraid to be judged for. So I use it as a tool: If someone calls me judgemental, I automatically know they’re doing something that makes them feel guilty. And since the only things that really make me “judgey” are either drugs or sex crimes… that narrows my list down pretty severely. ",
            "date": "Answered December 14, 2017",
            "views": "2",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ifeanyi Omofuma",
                    "user_href": "/profile/Ifeanyi-Omofuma"
                },
                {
                    "user_id": "Jake Collinge",
                    "user_href": "/profile/Jake-Collinge"
                },
                {
                    "user_id": "Kevin Brenda Baugher",
                    "user_href": "/profile/Kevin-Brenda-Baugher"
                }
            ]
        }
    ]
}