{
    "title": "What are some things that can only be claimed if you have studied a lot of philosophy? - Quora",
    "tags": [
        "Philosophy",
        "Studying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nandan Choksi",
                "href": "/profile/Nandan-Choksi"
            },
            "answer_text": "Anyone can make any claim at any time. No study of philosophy is ever required. Now, you may become aware of certain things if you study philosophy. But, on the other hand, the earliest philosophers never studied philosophy. However, the way you state your claim and the degree of verifiability of your claim MAY change if you study philosophy before making a claim. For instance, you can claim that the world is a dream. Or, like Plato, you can claim that the world is a copy of a copy. It’s basically the same claim but Plato backs up his claim with what he considers logical arguments. Even schools of philosophy that are against Plato’s ideas must consider his logic first and only then debate the validity of his ideas. And even so, they must present their ideas in a systematic way — not just a logical way but a way that is consistent with the rules of some specific philosophical system — Gnosticism, Stoicism, Epicureanism, etc. ",
            "date": "Answered June 2, 2018",
            "views": "201",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Srikanth Konda",
                    "user_href": "/profile/Srikanth-Konda-5"
                },
                {
                    "user_id": "Jonathan Roberts",
                    "user_href": "/profile/Jonathan-Roberts-35"
                },
                {
                    "user_id": "Jenelle Bruckner",
                    "user_href": "/profile/Jenelle-Bruckner-1"
                },
                {
                    "user_id": "Alberto Martín",
                    "user_href": "/profile/Alberto-Martín-2"
                },
                {
                    "user_id": "Eduardo Coltre Ferraciolli",
                    "user_href": "/profile/Eduardo-Coltre-Ferraciolli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Jonkers",
                "href": "/profile/Andrew-Jonkers"
            },
            "answer_text": "The claim that you have studied a lot of philosophy can be claimed for some negotiated definition of “a lot”. The rest is up for grabs by who gets to it first, or, given time, first in the history books. ",
            "date": "Answered June 9, 2018",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Eduardo Coltre Ferraciolli",
                    "user_href": "/profile/Eduardo-Coltre-Ferraciolli"
                }
            ]
        }
    ]
}