{
    "title": "What are the features of Sankhya philosophy? - Quora",
    "tags": [
        "Sankhya Philosophy",
        "Sankhya",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aalok Chandra",
                "href": "/profile/Aalok-Chandra"
            },
            "answer_text": "The Sankhya system is one of the six Philosophies that attribute their allegiance to the Vedas. Samkhya is the oldest of the orthodox philosophical systems, and it postulates that everything in reality stems from purusha (self or soul or mind) and prakriti(matter, creative agency, energy). It is a duelist philosophy, although between the self and matter rather than between mind and body as in the Western duelist tradition, and liberation occurs with the realization that the soul and the dispositions of matter (steadiness, activity and dullness) are different. ",
            "date": "Answered April 24, 2018",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anachophy Chophy",
                    "user_href": "/profile/Anachophy-Chophy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harishwr K",
                "href": "/profile/Harishwr-K"
            },
            "answer_text": "Samkhya Philosophy as the sound may deal with Rational side of the Philosophical inquiry. Purusa, aneka rupa daityantam namami purushottamam What needs to be understood is that, refined nature of things. Principle which, makes the refinement possible. Prakriti, Gross form as it may look like. It may be Duality, in approach Philosophically, but ends meet at VEDANTA, forming the Essence. That's it for now folks ",
            "date": "Answered April 26, 2018",
            "views": "803",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Uday Padhye",
                    "user_href": "/profile/Uday-Padhye-1"
                }
            ]
        }
    ]
}