{
    "title": "What are the best arguments against libertarianism? - Quora",
    "tags": [
        "Classical Liberalism",
        "Libertarianism (politics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kabelo Moiloa",
                "href": "/profile/Kabelo-Moiloa"
            },
            "answer_text": "The notion that individual rights are absolutely inviolable, that no one may steal a penny from a rich man, may scratch a person’s nose, or do anything else that violates a person’s individual liberty-rights for any reason except for rectification of prior rights violations by that person is intuitively plausible but false. Let’s call this notion Hardcore Exceptionless NAP (non-agression principle) or HENAP for short. First, children have substantial positive rights to be cared for by their parents. Imagine a Adam and Eve choose to make a child Jacob. After making the child Jacob, they go jet-setting and leave Jacob on his own to fend for himself at the tender age of 5. Let’s postulate that the house door and keys are available to Jacob, so that Jacob has access to the external neighbourhood to fend for himself. Of course Jacob is likely to merely remain crying out of hunger inside the house. Is it wrong for me to trespass Adam and Eve’s property to feed Jacob? According to the HENAP it is, for no one may violate private property rights except for restitution. Am I trespassing to restore some liberty-rights of someone? No. According to the HENAP, I’m a mere criminal if I trespass to feed Jacob. If I see that Jacob will die in the next 30 minutes, and so I break a window to save him I am a mere vandal. This is not a strawman, indeed Rothbard believed this: Applying [HENAP] to parents and children, this means that a parent does not have the right to aggress against his children, but also that the parent should not have a legal obligation to feed, clothe, or educate his children, since such obligations would entail positive acts coerced upon the parent and depriving the parent of his rights. The Ethics of Liberty, Murray Rothbard Of course if you shouldn’t have a legal obligation to feed your children, then failure to feed your children cannot protect a person who trespassed or damaged your property to feed them against damage claims. But of course, there is nothing wrong with trespassing Adam & Eve’s property to feed Jacob who has been neglected by his parents. I would even hold that if Jacob is about to die in the next half an hour, and the only way someone can reach him is by breaking Adam and Eve’s window then any person may break the window, and no one should suffer no legal consequences for that. Also pace Rothbard, parents should have a legally enforceable duty to care for their children and their rights may be violated to provide for the child. Roderick T. Long[1]insists that we do not have to abandon NAP completely, just modify it. Here is his modification: “Every person has the right not to have her boundaries violated, and also not to have her boundaries invaded unless such invasion is necessary to end some wrongful boundary-invasion of hers, and such invasion is also not disproportionate to the seriousness of her boundary-invasion.” So consider then the situation where a pilot goes on strike mid-flight, he dons his parachute and jumps off leaving his passengers to fend for themselves. On trial before the jury he says, “I am under no obligation to work for someone, when I jumped off any of the passengers could’ve operated the plane I merely was a bystander in their death, I have not killed them.” This is clearly inadequate. Long says that the pilot has killed the passengers, because the passengers are in the air through the pilot’s voluntary actions. The passengers agreed to go into the pilot’s plane on the understanding that they would be brought to the destination airport safely, and the pilot instead abandoned them to death. So Long proposes the following plausible principle: “If S voluntarily places O in a situation where S’s failure to take positive action on O’s behalf will result in O’s death, then such a failure on S’s part is a killing, not merely a letting-die.” The implication here for parents, is that they voluntarily placed their children in a situation where their failure to act causes the children causes them to die, which amounts to killing an innocent, which is boundary-crossing and should be prohibited by law. There are two problems with this view: The HENAP theorist may consider the pilot’s actions as a kind of fraud. The normal definition of an “airline ticket from Pretoria to Cape Town for Mango airlines,” is a token that when presented to Mango officials results in a positive obligation on their part to fly you at the time shown on the ticket from Pretoria to Cape Town taking all safety precautions that are usually taken by airlines. A pilot jumping out on strike is clearly not following usual safety measures. Roderick’s principle is unnecessary to explain why the action is wrong.Consider the situation where the mother is alcoholic and there is a drug that instantly cures her alcoholism. But she hesitates to take it, and her child is thus born with fetal alcohol syndrome. The mother has harmed the child by giving them fetal alcohol syndrome, and so should be liable for damages paid to the child (when he grows up and becomes an adult). So the principle is correct but incomplete, it needs to be generalised to: “If S voluntarily places O in a situation where S’s failure to take positive action, will result in a very grave harm to O, then S is responsible for harming O not just letting O become worse off.” Already we have left the language of individual rights.Second, according to HENAP only the absolute prohibition of pollution of any type is morally acceptable. Where I pollute someone’s property, if I send matter/radiation of absolutely any type into his private property. For instance, I pollute by sending WiFi through my computer to his apartment next door, or by driving past his window. Why? Well persons have the right to control the configuration of their property, and by sending matter and radiation through any medium into their property I violate this control. HENAP theorists usually get around this by trying to explain a trespass/nuisance distinction[2] . Trespass: A boundary crossing that is “sensible” and “interferes with a person’s exclusive possession and use of their property.”Nuisance: A boundary crossing that is not “sensible.”Trespass is supposed to be outlawed according to HENAP, and Nuisance can only be outlawed given “proof of harm beyond a reasonable doubt.” Here “harm” is defined to mean “interference with the use and possession of someone’s property, including their property in their body.” The intuition here is that trespasses violate property rights prima facie whereas nuisances require further evidence in order to establish whether they violate property rights. So radio waves are nuisances, because you can’t see, touch, smell or feel them and so prima facie they don’t interfere with the use or possession of your property. On the other hand, air pollution of visible but otherwise harmless gasses is supposed to be outlawed because it interferes with the use and possession of my property, e.g. “I can’t see the beautiful view from outside my window because of the smog from that factory.” The natural question then becomes, what counts as “interference with the use and possession of my property.” For HENAP to be tenable I should be the person who defines that, and my definition can be quite arbitrary. To boost your intuition consider the following situations: Suppose that I leave my car outside on my house’s driveway. John deliberately scratches the car but otherwise doesn’t leave a trace. John has clearly violated my property rights. Now suppose that I engraved the digits of [math]\\pi[/math] at the nanometer scale on my car. John deliberately pokes micro holes with a pin on my car. John still violated my property rights, I can control how my car looks down to the nanometer scale and John may not cross my boundaries. John may not excuse himself saying: “But the micro holes aren’t sensible.” Indeed they are sensible, I used a microscope to engrave my car, and to look at the digits of [math]\\pi[/math] and I used it to show the damage. The lesson here is that scientific instruments can be used by the owner of a piece of property to define “inteference” with that property. I control all physical properties of my car’s state, not merely the stuff I can see with my unaided senses. Consider an evangelical Christian Baker Josiah. Josiah puts up a sign outside his bakery: “I am an evangelical Christian, according to my religion if I allow gays into my house I will be punished eternally in the Hellfire. So if you are gay please do not enter my bakery.” HENAP theorists want to say that if a well known gay celebrity enters his bakery, then he is trespassing in a way that a non-gay person is not if he does the same. Suppose a gay person says in response: “But the harm caused to you by my presence here is not sensible. I don’t interfere with your use or possession of your property any more than heterosexual Joe over there in the other table. In any case God doesn’t exist, and even if he does he probably won’t punish you, homosexuality isn’t wrong (esp. according to HENAP theory).” This is inadequate, since this is Josiah’s bakery he should be able to determine who harms him by entering his bakery, and it is irrelevant whether this harm claim truly holds. The lesson is that the property’s owners are the rightful definers of what “interference” with that property is. Finally consider someone who throws a cigarette onto a forest. A forest fire starts and engulfs James’ house. That person is now liable to repay James, he is responsible for the house’s destruction and cannot excuse himself by saying: “It is not my fault the fire reached James’ house the wind carried it there.” This is the basis for the HENAP prohibition on pollution, it is wrong to interfere with someone’s control of their property either directly by say placing a large stone there or by bringing about a sequence of events that disrupts this control. So accepting these principles, consider an radical environmentalist named Cheryl. Cheryl believes that radio waves cause cancer, and by that principle she may forbid anyone with a radio from entering her property just as Josiah can forbid gays from entering his bakery. It is irrelevant whether radio waves actually cause cancer. If she can do that, she can also forbid her next door neighbour from pointing a radio wave beam at her window. If she can do that, she can also forbid anyone else from emitting radio waves that reach her. She is permitted to use a device to measure the intensity of radio waves, just as in the John case above. Now of course most HENAP theorists don’t believe this, but this is the logical implication of their view. Third, HENAP rejects the moral relevance of risk. Consider a group of firearms enthusiasts who love shooting bullets in randomly chosen directions. Let’s say one of these bullets falls from the sky, and hits someone. By conservation of energy this bullet will gravely harm this person and it does. Let’s also stipulate that it is impossible to determine which firearms enthusiast fired the bullet. According to HENAP, no one should be punished for the harm inflicted on the person since HENAP only recognizes rights violations by individual X on individual Y as bad enough to legally prohibit, all else is “collectivism.” This is incorrect, all the firearms enthusiasts are liable for reckless endangerment because it is a mere matter of chance that one of them actually caused harm, if the activity was prolonged or the winds shifted a bit any number of the firearms enthusiasts would’ve likely gravely harmed a person. So there should be some legal punishment of this hobby. Of course, the probability of harm times the magnitude of the resulting rights violation must be sufficiently high to generate such a judgement. EDIT: So, HENAP is false. That isn’t bad, all it means is that it is sometimes okay to violate someone’s liberty rights for non-restitution related reasons. That doesn’t even disprove the entirety of libertarianism per se, as Micheal Humer shows in his book The Problem of Political Authority, the fact that rights may sometimes be violated does not give justification to the vast majority of such violations by governments. But for instance, if one is an anarcho-capitalist but Hobbes is right about predation in the state of nature, then one ought to abandon anarcho-capitalism and it is right to coerce individuals to the minimal extent necessary to establish a minimal state. Footnotes[1] Abortion, Abandonment, and Positive Rights[2] Law, Property Rights, and Air Pollution",
            "date": "Updated October 19, 2020",
            "views": "47",
            "upvotes": " View 34 Upvoters",
            "upvoters": [
                {
                    "user_id": "FBI Agent",
                    "user_href": "/profile/FBI-Agent-31"
                },
                {
                    "user_id": "Adam Ahmad",
                    "user_href": "/profile/Adam-Ahmad-32"
                },
                {
                    "user_id": "Philippe Samuel",
                    "user_href": "/profile/Philippe-Samuel"
                },
                {
                    "user_id": "Arkajyoti Majumdar",
                    "user_href": "/profile/Arkajyoti-Majumdar"
                },
                {
                    "user_id": "Tom Ensalada",
                    "user_href": "/profile/Tom-Ensalada"
                },
                {
                    "user_id": "Cole Meyers",
                    "user_href": "/profile/Cole-Meyers-4"
                },
                {
                    "user_id": "Alex Orr",
                    "user_href": "/profile/Alex-Orr-17"
                },
                {
                    "user_id": "Raji Ayodele",
                    "user_href": "/profile/Raji-Ayodele"
                },
                {
                    "user_id": "Łukasz Pluszyński",
                    "user_href": "/profile/Łukasz-Pluszyński"
                },
                {
                    "user_id": "Bernie Jimenez",
                    "user_href": "/profile/Bernie-Jimenez-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kai Peter Chang",
                "href": "/profile/Kai-Peter-Chang"
            },
            "answer_text": "I consider myself libertarian, and I see this as in interesting exercise: articulating the reasons why intelligent and thoughtful people may disagree with my positions.  This is an exercise I would encourage all partisans (Republicans, Democrats, Libertarians, Socialists, Communists, Christians, Atheists) take part in. Sharpens your senses, makes you a more formidable debate opponent, and, perhaps, may change your perspective! :)  Here goes:  The most important thing to remember is that there is a broad and disparate range of people and ideologies that fall under the libertarian banner, from anarcho-capitalists to survivalist small-store owners in Montana, to socially-liberal Republicans disenchanted with the religious aspects of the GOP.   Painting them all with one brush would a rather loathsome form of bigotry which I hope we all abhor.  With that said, lets go for the easy target and low-hanging fruit first:  Anarcho-capitalists ( http://en.wikipedia.org/wiki/Anarcho-capitalism ) are absolutists and philosophically oppose any sort of statutory laws, viewing them all as different levels of oppression. Every example that anarcho-capitalists trot out as a 'successful' example of an AnCap society is at least 200 years old:  Ancient EuropeMedieval IcelandAmerican Old WestEarly (1800s) Pennsylvania  It is telling that there are no modern, thriving societies even close to the AnCap ideal - any place where there are indeed minimal statutory laws are wastelands (Somalia, etc.)  It would seem that *some* laws and infrastructure/government is better than *none* and there are no examples of a modern thriving society that contradicts that statement.  Invisible-hand capitalists: A lot of opponents falsely claim that libertarians have a mythical belief, in the words of Joseph N. Liss, \"virtuous individual who should be left free to do as he will, is a naive idealism that is utterly inadequate to address the actualities of modern socioeconomic life.\"  I have witnessed lazy libertarians do a similiar thing and claim that big-government advocates believe that government agencies are virtuous institutions who should be funded by high taxes so they can do their mission, a naive idealism that is utterly inadequate to address the inefficiencies and self-defeating aspects of a modern government agency.  No libertarian I know believes consumers or producers are virtuous and utterly rational economic actors. Too, very few big-government advocates and Democrats I know believe the state is infallible and incapable of inefficiency, graft and outright corruption. Libertarians do believe that the market, in aggregate, is more effective at solving complex economic issues through the price-signaling (which allows consumer demand to accurately signal  Setting aside the easy straw men, let's tackle the tougher questions.  A primary objection to a pure libertarian society is its inadequate response to the classic economic phenomenon described as the Tragedy of the Commons ( http://en.wikipedia.org/wiki/Tragedy_of_the_commons ): where individuals rationally acting in their own self-interest will, in aggregate, make deeply suboptimal decisions that are a detriment to the group. Even if members of the group recognize the dynamic and attempt to act in concert to prevent it, all it takes is one defector who acts in his own best interest at the group's expense to ruin the arrangement.  \"The commons\" could be things like issues related to pollution, safety standards for buildings, etc. If there were no uniform standards, the first company or individual to cut corners can turn a handsome profit for himself, and once that dam is broken, it can be a rush to the bottom to see who can extract the remaining profit from cheap & dangerous construction/gross pollution/etc.  Secular, Socially-liberal Republicans: Refuting moderate libertarians who acknowledge a need for government is the most difficult, but it boils down to a matter of trust.  Those who favor lower taxes, more local control, lower regulations trust that businesses and the free market are more effective ways for society to run and that a freer, lower-tax, less-regulated market offers more class mobility. They are skeptical of government authorities and believe that increasing the power of central government will inevitably decrease the amount of freedom and increase the level of oppression.  The contrary claim would reverse the locus of trust: governments are beholden to voters (who represent ALL citizenry, rich and poor) and not shareholders (mostly the rich) and so governments are in a better position to make decisions to the benefit of all citizens, and an unfettered market would concentrate power more and more into the hands of those who are efficient at accumulating profits.  To that argument, Libertarians would counter that crony capitalists (which I, and most libertarians despise), whose source of profits come from befriending powerful government officials who they have corrupted with bribes (*cough* campaign contributions), have turned this dynamic around: increasing the power of central government has made them even MORE beholden to the rich, well-connected special interests who profit from back-room deals with bought-and-paid-for politicians.  Those opposed to libertarianism have faith that in the voting system and trust the idea that if a politician is sufficiently corrupt or incompetent, he or she can always be voted out, but a bad business can entrench itself for decades with no accountability except to its deep-pocketed shareholders. ",
            "date": "Answered October 31, 2012",
            "views": "156",
            "upvotes": " View 93 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vonn Russell",
                    "user_href": "/profile/Vonn-Russell-1"
                },
                {
                    "user_id": "Matthew Cummings",
                    "user_href": "/profile/Matthew-Cummings-29"
                },
                {
                    "user_id": "Tim Dawes",
                    "user_href": "/profile/Tim-Dawes"
                },
                {
                    "user_id": "Artyom Fischer",
                    "user_href": "/profile/Artyom-Fischer"
                },
                {
                    "user_id": "Jimmy May",
                    "user_href": "/profile/Jimmy-May-2"
                },
                {
                    "user_id": "Ciro Silvano",
                    "user_href": "/profile/Ciro-Silvano"
                },
                {
                    "user_id": "Ryan Standerfer",
                    "user_href": "/profile/Ryan-Standerfer-1"
                },
                {
                    "user_id": "Matt Ambler",
                    "user_href": "/profile/Matt-Ambler-4"
                },
                {
                    "user_id": "Benjamin Pulgar-Guzman",
                    "user_href": "/profile/Benjamin-Pulgar-Guzman"
                },
                {
                    "user_id": "Max Laraia",
                    "user_href": "/profile/Max-Laraia"
                }
            ]
        }
    ]
}