{
    "title": "What book is recommended for modern stoicism? - Quora",
    "tags": [
        "Stoicism",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hemant Singh Tanwar",
                "href": "/profile/Hemant-Singh-Tanwar-6"
            },
            "answer_text": "Hey, Today in this blog i will tell you about 6 books you should read to get started with stoicism in order to make your life better. I would like to start with Ego Is The Enemy by Ryan Holiday.  Ego Is The Enemy. \"A powerful meditation on the nature and danger of ego\" If someone asked me to describe this book in one line i would say “A powerful meditation on the nature and dangers of ego”; This is a book which will help you to know how our biggest enemy “EGO” manifest inside our self. And the person who read this will find same inside themselves. The author Ryan Holiday divides this book into three phases of our life : Aspiration.Success.Failure.since we all are one of these phases of our life and we needed our ego to be controlled accordingly. The author explain how it is affecting every phase of our life and how can we overcome that. When you are reading this book you have to be utmost honest with yourself and for doing that you requires lot of courage because in author’s own words, “it is not easy to go head-to-head with one’s ego”; to accept first ego must be there, during the reading of this book as each page goes up you will realize the underneath, hidden, unconscious self-examination. Now, here is a tip only exam yourself, don’t judge. At moment you start judging everything will be lost. This is the first books on Stoicism which i read and got influenced.  Stoicism And The Art Of Happiness. Practical wisdom for everyday life. Ancient tips for modern challenges. Ancient truth that will change your life. Its not a type of book that you real only once and boom you will get benefit from it. NO, its not like that you have you read this again and again to draw all its information present in this book for you. But if you real this again and again than you will be able to understand a most thorough introduction to how to start Stoicism and how can it be used in modern life. The author does a very good job in combining stoicism with CBT advice, which gives the old text a new breadth of modern relevance. Ignore the philosophical snobs(funny they call themselves stoic) who will tell you that they will understand Stoicism you need to refer to ancient text of Aurelius or Epictetus like a bible. Of course you should read them their is no harm in them but the modern world needed something which is grounded in modern well researched practice. In this book the thought are so well written and so demonstrative. The author clearly shows and understand the importance of placing ancient text within the modern context, and this thing which i really enjoyed during reading. Don;t back off by its sightly repetitive nature. Don’t back off by the fact that author name is not Aurelius. The only thing that the author (Donald Robertson) has proven with this book, its that one of the greatest thing about Stoicism is that the lesson given by stoicism is not to be hold reverence of ancient almost bibical like figure. And the fact is that the beauty of stoic lessons is that they can be sown to hold a relevance that is according to modern life. And it is the idea and the lesson are themselves are the key, not those that are speaking them selves. This is the second books on Stoicism.  Meditation By Marcus Aurelius. \"Dwell on the beauty of life. Watch the stars, and see yourself running with them\" In the book Meditation Marcus Aurelius wrote his meditation in the series of spiritual exercises. At what extend human being make themselves complete by the belief in human progress. According to Marcus people are stuck in the cycle repeat themselves generation to generation- “marring , raising children, getting sick, dying, and complaining.” . There is nothing we can to change it. ” Hold your breadth until you turn blue, they will still doing it. but once you accept this you will be cheered. KEY LESSON FROM MEDITATIONS: The evil or bad things done by the people will harm you only when you do evil in response.Fame and desires they are not worth of pursuing.The universe is change.The things which we see as problem are basically not a problem they are created by our mind.The greatest asset of human being is their rational mind.Deepest lesson in meditation is about Mortality and shortness of life.And this is the third books on Stoicism which I read.  Discourses and Selected Writing (Penguin Classics). By Epictetus. When I first stated reading about Stoicism orI can say when a was a new practicing Stoic. this is my third book on Stoicism. The tenets set forth in this book are more relevant to modern life and , me myself personally. THE MAIN THEME OF BOOK IS: Freedom of mind from external thought.Producing inner tranquility.Awareness.And self-control of need and desires.If you are a newbee than you must start with this this will definitely change your life or at last show some impact on your amazing life and made it more amazing. This book contains the full Enchridion in the back. Epictetus for many people is most moralizing and for many, the least interesting to be read, but this dos not show any type of sign that he is not brilliant. In many times when you were reading the book you will realize the clarity he shows in the book is so amazing that you will shake up from your core. This is the fourth books on Stoicism you should read.  Letter From A Stoic. 'It is philosophy that has the duty of protecting us ... without it no one can lead a life free of fear or worry' This is the book which I recommend to someone who want to utilize every spare moment for the betterment of their mind an d personality. Who wanted to spend time with their loved ones in calm way. Who is serious about the personal virtue. Than this book is made for you, you must get acquainted with Seneca. More significantly if you started following the advice given in the book than you will definitely able to move out of the turbulent situation very easily. Or maybe they would not hit you as frequently they are hitting on you. Acceptance of death with a logical and relatively unruffled mind (tells how to practice death mentally like Stoic say, of course:-)) Between all of the Stoic I found Seneca most approaching and practical. Probably the Dover Edition you are getting which I personally read about 50 times. The fifth book on Stoicism you should give it a try.  Seneca On Shortness of Life. Timeless advice on the art of living well, from the celebrated Penguin Great Ideas series The Problem Seneca urges to examine in our life to make it better are: Ambition.Giving all your time to others.And engaging in vice.He says we are not living our life we just got engaged with it and just living a short life. how do we regain the spent time? just by reading the philosophy and working towards it. KEY LESSON FROM SENECA ON SHORTNESS OF LIFE: You are the most important asset.How little is left over for you.How to live with duty and purpose.Last but not the least books on Stoicism which I read.Hope for best let’s get started without ant delay. ",
            "date": "Answered April 21, 2020",
            "views": "523",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Varun Sharma",
                    "user_href": "/profile/Varun-Sharma-449"
                },
                {
                    "user_id": "Arnav Bibhuti",
                    "user_href": "/profile/Arnav-Bibhuti"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelsie Major",
                "href": "/profile/Kelsie-Major"
            },
            "answer_text": "Stoicism: A Stoic Approach To Modern Life  It's a well-recorded phenomenon that words are liable to develop different meanings in common modern usage compared to those they had their origins and how people “in the know” would use them. This is doubly true for philosophical concepts – the word Epicurean, for example, has been transmuted from identifying the very sober and level teachings of the Greek philosopher Epicurus to being a synonym for wanton pleasure-seeking and hedonism. Stoicism hasn't suffered as severe a distortion. The modern understanding of what it means to be stoical is never showing any form of outward emotion regardless of all circumstances, good or bad, and indeed not having any emotions whatsoever. The entire species of the Vulcans in the popular science fiction franchise Star Trek exemplifies the popular definition. But it's easy to recognize an absence of outward emotion as not necessarily being a good thing – it is possible, after all, for someone to have a calm and blank exterior and yet be screaming inside. Having no internal emotion at all is also a less-than-ideal situation as well. Without emotion, how could one possibly enjoy life? Being immune to the negatives and vicissitudes of life in this way is something we can all stand to benefit from. Our modern lives are so full of worries and insecurities, and peace and fulfillment are something most people try to find outside of themselves. Stoicism teaches that these are things we can only find from inside ourselves, and gives us the tools and mindset necessary to build them up. What this book will endeavor to do is to introduce the philosophy of Stoicism to the modern person and make a case for how it can drastically improve our outlook and quality of life It will begin with a brief retelling of the early history of Stoicism, followed by an examination of the mindset that Stoics employ and the core tenet from through which we interpret everything we come across. It will then move on to two extremely powerful practical exercises – one physical and one mental – by which we can gain control over our internal state. After that it will give a rundown of some of the most powerful pieces of advice and implications of Stoicism as they have been passed down through the ages. Finally, because it is important to see the benefits of Stoicism in action, it will give some practical, more modern examples of people who have used it to overcome trials and adversity. And, because no single book could ever encompass the full breadth of Stoical wisdom, a short bibliography for the individual who wishes to explore further is given at the very end. Here's a preview of what's inside Stoicism and StoicismA Brief History of StoicismThe Stoical MindsetDifferentiating ControlPractical exercises for eliminating negative emotions and promoting inner peaceGeneral precepts and adviceDownload your copy today to receive all of this information. Just Scroll to the top of the page and select the Buy Button ",
            "date": "Answered February 8, 2019",
            "views": "380",
            "upvotes": "0"
        }
    ]
}