{
    "title": "What are some must read books for people in their 20s? - Quora",
    "tags": [
        "Self-Help Books",
        "20s (age)",
        "List Question",
        "Reading",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Casey Hill",
                "href": "/profile/Casey-Hill-22"
            },
            "answer_text": "I write a business book review blog and I culled a list of books that I rated 7/10 or higher. These are non-fiction, and focused on business/SaaS/CEOs/Managers/Founders…. The Hard Thing About Hard Things by Ben Horowitz Ben helps run one of silicon valley’s most successful venture capital firm’s Andreessen Horowitz. He is a thought leader in the space of entrepreneurship, management and start-ups. I found the book one of my go-to recommendations for people looking to understand how to grow a tech company and what lies behind galvanizing leadership, from someone who works with many of the up and coming tech companies in the industry. He also helps paint the picture of what types of leaders are needed at what times in an organization, famously painting the dichotomy between “war-time” and “peace-time” CEOs. Who would like it: I think this a great read if you are looking to better understand what goes behind management, if you are looking to understand that it is not one-size-fits all when it comes to leaders, and you are looking for a no-fluff look at what it takes to be successful My rating: 9/10 The Lean Startup by Eric Reis Eric details a handful of vital lessons for early start-ups, and discusses everything from the importance of the MVP (minimum viable product) to accentuating on the metrics that matter and not “vanity stats”. He also expounds on the importance of making customer oriented pivots and the pitfalls of thinking you are smarter than the customer during the design process. Who would like it: Anyone who is in an early stage start-up and wants to understand the new, agile environment that we live in. The Lean Start-up is a seminal work in understanding what to focus on, when to switch and how to pivot effectively. My rating: 8/10 Like a Virgin: Secrets They Won’t Teach You at Business School by Richard Branson Richard Branson is one of my favorite entrepreneurs and as such perhaps it paints a bias in my reviews of his work, but his account on business and how he has effectively grown dozens and dozens of companies under the Virgin brand was remarkable. Branson here is not only discussing business insights, but also the value in your brand, what it means and how to protect it’s sanctity. This book also focuses on people, how to manage them, how to inspire them and how to properly reward desired behavior. He highlighted a great example where an employee broke policy and procedure but in the name of best taking care of a customer. He lauded and supported the employee fully and in doing so sent a message to the company: “Value the customer and customer experience first”. This book is less weighty data and actionable pull-aways and more a reminder that the fundamentals matter to: Elevate and support your team, take accountability as a leader, do things differently (don’t be burdened by precedent” etc.. Who would like it: Anyone looking for a light read or who feels a sort of disconnect between themselves and their employees, or feels like things at their company have gotten too rote and need innovation. My rating: 9/10 Crossing the Chasm by Geoffrey Moore Crossing the Chasm is an exceedingly rare example of a book that holds actionable wisdom and insight in the tech world despite being several decades old. Crossing the Chasm chronicles the different stages that early tech companies go through with customer acquisition, from the fervent visionary customers, excited about what a technology can do and lenient with the bumps in the road, to the late adapters, who want a refined and polished product that accomplishes a specific task for them. Crossing the Chasm is also chalk full of actual tangible examples of businesses at various phases and what they did effectively to scale. Who would like it: This is another must-read for anyone who is at a growing tech company and is looking for what is needed as the company transitions to the next phase of their business. My rating: 7/10 Zero to One by Peter Thiel Zero to One is a look at the the most innovative businesses in the world and what it took them to grow. He talks about how it is immensely more difficult to start something truly pioneering than it is to simply repurpose and reiterate on existing technology. But he argues it is also more worthwhile. He talks about some of his businesses, like Paypal, and talks about innovation and how they came to be. Often times the books references the importance of being contrarian, and I remember finding his insights on differentiation interesting (he recommends having virtually nobody have the exact same job. He says people are obsessed with competition but the most successful companies allow their employees to gain ownership and pride in a specific duty and that breeds more productivity. I tend to agree with that). Who would like it: This is a great book for anyone looking to create something fundamentally different then what is out there. It is also an important book for management to read in understanding the vital importance of not getting swept up in the crowd mentality and looking to do things in an innovative and unique way. My rating: 8/10 The Sales Acceleration Formula: Using Data, Technology, and Inbound Selling to Go from $0 to $100 Million by Mark Roberge Written by the old Hubspot SVP of sales, Mark details in stunning clarity, the sales journey from understanding what matters in hiring, to what matters in keeping talent around. The book is chalk full of tangible and executable insights from a leading player in the inbound marketing space. You leave reading this book with solid ideas of how to navigate the process of growing your sales team, what attributes really matter and a tested roadmap. Who would like it: Anyone in management at a sales organization that is looking to make sure they are selecting on the right criteria and growing their team in a sustainable way. Great book. My rating: 8/10 Jab, Jab, Jab, Right Hook by Gary Vaynerchuk Although Gary Vaynerchuk is a polarizing figure with his “hustle 15 hours” a day mantras, he is also a respected resource when it comes to social media marketing. This book is essentially a collection of social media ads on various platforms (Facebook, Insta, Twitter etc. ) and a look at ones that were successful and ones that flopped. The book is about storytelling, how to create excitement and how to use simplicity in your work. I was pleasantly surprised by it. Who would like it: Anyone trying to learn social media who isn’t sure what type of ads are best on what mediums or what will really perform. This is a great guide to that. My rating: 8/10 The Art of the Start 2.0: The Time-Tested, Battle-Hardened Guide for Anyone Starting Anything by Guy Kawasaki Guy was a leading Apple evangelist and now works with Mercedes and Canva. This book is about detailing the process of growing a business, from picking a name to navigating the common pitfalls and traps. Guy just says it like it is. He doesn’t sugar-coat things and he isn’t the guy to get advice from if you want to build a widget. Guy talks about building things that really matter, that bring purpose, that have the ability to 10x the existing industry competition. In typical silicon valley style he also talks about funding, how to pitch your product and that realm of business growth as well. Who would like it: Anyone looking to get business building insight from a genuine industry thought leader, who will provide you actionable advice and knows the story. Also a great book for people looking to better understand social media, the changing tech landscape and how it all intertwines. My rating: 7/10 Extreme Ownership: How Navy Seals Lead and Win by Jocko Willink and Leif Babin This book is a leadership book by two navy seals who have since turned to consulting management in the corporate world. The book follows a structured flow with each chapter following a story from the battlefield, then the principle at play they want to discuss and closing with a real world example of it’s execution in the corporate world. This is the type of book I honestly expected to dislike. I tend to like books with actionable, tangible steps and find management and leadership books tend to have a lot of psychology and cliche ideas, but not a lot of substance. I was pleasantly surprised with this book. The principles presented gravitated with me and showed the importance of leadership, team and how to embrace accountability in any role. Who would like it: This is a great book for anyone leading a company or in management who is looking to understand how to better connect with and draw out better results from their team. I would recommend this to anyone who feels a sense of disconnect with their employees or anyone who feels there is some external factors, or team members, who are at fault for their failure (spoiler alert: as a leader the buck ends with you). My rating: 7/10 Lost and Founder: A Painfully Honest Field Guide to the Startup World by Rand Fishkin This book follows the story of Rand, the founder of SEO company, Moz, in a painful, honest and deeply revealing journey through start-up life. It debunks many of the glorified myths of Silicon Valley and humanizes the reality of running a tech company, with all its trials and tribulations. It also speaks in a practical sense about things to be aware of, how to lead, how to hire and how to navigate getting funding. In this first person account Rand comes across as vulnerable, open and genuinely looking to help. Who would like it: Anyone with aspirations to run a technology/SaaS company needs to read this book. People need to understand that the journey to growing a technology business is more than just chasing the unicorn exit or basking in media fame. The book also contains many practical takeaways to help founders as they are structuring their teams and figuring out how to sustainable grow. It’s a great mix of qualitative and quantitative analysis. My rating: 8/10 This Is Marketing: You Can’t Be Seen Until You Learn to See by Seth Godin This book investigates modern market and what makes companies successful and resonate. It looks at the “why” behind marketing, the narrative story telling and the emotions behind affiliation in marketing. People support brands that align with who they want to be Seth argues. Seth challenges some of the conventional mediums that people use for advertising, arguing that the standard PPC ad strategies often lack substance and mission behind them. Overall, the book was a great reminder that fundamentally marketing is about creating a feeling or emotion around using your brand and associating the related experience or success that your brand brings with that story. For instance, Disneyland isn’t about riding roller coasters, it’s about quality time with your family. REI isn’t about outdoor gear, it’s about getting in to nature and unplugging. Who would like it: I think this is a great read for anyone in marketing, any founders or anyone responsible for the branding behind a company. The book looks to retool some of the conventional ways of thinking and brings you back to critical fundamentals. My rating: 8/10 From Impossible to Inevitable: Hyper-Growth Companies Create Predictable Revenue by Aaron Ross and Jason Lemkin This book is a seminal work in the field of SaaS sales and focuses in on a number of critical cogs in the growth process of a business. Here are some of the key take-aways Go narrow: don’t be a generalist. “Nail a niche”Hire based on who you would personally want to buy from.Move up in deal sizesHire VPs or leaders that have worked at the same deal size as you are sellingFocus on growing your existing base, in terms of referrals, upsells etc. before anything else.Employee Ownership – Make sure employees have something specific that is just theres, that they have full autonomy and control over. Note that this is not delegating responsibility or telling someone “Hey you need to do X task each week”. Instead it’s “You need to produce X outcome” and let them get there whatever way makes sense (of course, considering limitations of resources.Employee profiles – CEO mindset, Career mindset, Clock-in-Clock-out mindset, Complainer mindset. Focus your effort on the CEO and career mindset individuals as they are those with the passion and drive to move the organization forward.Who would like it: This is a great book for anyone in an executive or leadership role within their organization, specifically though for sales managers and sales leaders. It helps unpack a lot of common misconceptions, gives actionable advice and is not filled with “fluff” or over the top personal narrative. Bottom line is if you are in SaaS sales you need to read this. My rating: 8/10 Fanocracy: Turning Fans into Customers and Customers into Fans by David Meerman Scott and Reiko Scott I just finished reading Fanocracy, by David and Reiko Scott, and I must say my head is still swimming. It is a phenomenal and galvanizing read and after dozens and dozens of business book reviews it is officially the very first to get a 10/10 rating from me. Fanocracy deep dives into the heart of how companies are building raving fans and customer advocates. It uses tangible use cases, scientific analysis and a human narrative to capture the essence of why and how building authentic connections matters. It talks about how unexciting industries, like insurance, can still produce customer evangelism by connecting over shared passions (like classic cars) with their users. It talks about how companies like Hubspot are winning by giving employees significant autonomy and ownership in their roles. I love this quote, “Authentic advocacy from inside your organization will inspire enthusiasm, enjoyment and passion that create Fanocracy” I have long advocated for the importance of hiring and firing around passion for a companies mission and this hits the nail on the head. Reading Fanocracy felt like a nostalgic walk through time too, as the author talked about staples from my childhood, from Harry Potter to Magic the Gathering. Magic the Gathering and Harry Potter were both franchises that seeded my passion and love for fantasy, and were much bigger than just books or card games. In fact, it was Magic the Gathering that inspired me to build my own gaming company and we even use a handful of MTG artists at our company because the level of quality is unparalleled. Reading through the importance of Magic the Gathering and Harry Potter to David and Reiko created a deep sense of connection, even though I have never met either of them, and I think this is at the heart of one of the tenants of this book. Fanocracies are built when you bring people together over shared passions and authentic connection. I also love how the book talks about how you need to go beyond features, beyond the service or product itself, to the emotion it creates. Going to Disneyland is about family time, not roller coasters. Wearing a pair of Nikes is more than just a pair of shoes, it’s a symbol of your values. The part on partners and brand ambassadors was also resonant. Today so many businesses struggle to figure out how to get more product advocates to spread the word. They offer incentives, bonuses and all manner of financial draws to try and get people to talk about them. The reality though is the very best partners and brand ambassadors are always the people who genuinely love your product. Think about the products and services that you talk about. How excited and enthusiastic you are to share with zero benefit back to you. That is because those brands have created an emotional experience with you when you use their products and people want to share that. Furthermore, we live in a crowded world of high competition and companies often forget how many similar products are attacking the same problems. So how do you stand out? It’s not by having that one niche difference in your product features. As David states, “Focus on product alone results in a race to the bottom” It’s about service and connection and giving back to your customers in a way that makes your brand rise above all the rest. I could honestly write a small novel as a review in why I think this book deserves to be on every business owners shelf but instead, I will end by encouraging all of you to pick it up. Who would like it: Anyone who runs a business and has customers. It’s as simple as that. If you run a business, from a clothing company to a SaaS enterprise technology business, you can benefit from building more Fanocracy around your brand. This book is the blueprint. My rating: 10/10 Enchantment: The Art of Changing Hearts, Minds and Actions by Guy Kawasaki In a quick and easily digestible read, iconic Apple/Mercedes/Canva product evangelist Guy Kawasaki walks you through what it takes to create an enchanting experience as a company. Through a series of use cases and tangible examples Guy talked about the psychology behind a memorable experience, he talks about the internal structures of an organization required to facilitate it and he even touches on how to resist these persuasive influences that the end of the book. In a nutshell, Enchantment touches on a lot of core concepts we feel like we intrinsically know already: Be honestBe OpenMake things simpleTest a lotBe PatientShow social proofGet personalAnd on and on. But the reality is even if we feel like these ideas are things we know, the execution is often lacking. Guy talks you are a world-class tour of enchantment and its a great read for anyone running a brand or small business. Who would like it: I think Enchantment is a valuable read for entrepreneurs, marketers and sales people. It teaches key lessons in how to relate to customers, how to relate internally with your team and how to create an aura that draws people in. My rating: 7/10 Superfans by Pat Flynn Superfans is one of a handful of seminal works that defines the genre around building customer advocates. His book is broken up in to phases, showing you how to bring people from casual supporters to active supporters, active supporters to connected customers and connected customers to superfans. He covers a wide range of topics on how to get your audience involved, seen and incorporated in as part of your brand. He uses concrete examples, both from his own impressive business ascent and that of his vast network. You can tell Pat genuinely cares and is invested in the topic of customer advocacy (he isn’t just spewing things to make a buck). Having superfans is one of the most surefire ways to ensure explosive growth in your business and this book has the roadmap. Who would like it: Anyone looking for a field guide on how to build deeper relationships with your community & customers will benefit from this book. This is a must read for any business owner or manager. My rating: 9/10 ",
            "date": "Answered June 4, 2020",
            "views": "4",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arjun P.V",
                    "user_href": "/profile/Arjun-P-V"
                },
                {
                    "user_id": "Nandini Khaneja",
                    "user_href": "/profile/Nandini-Khaneja-1"
                },
                {
                    "user_id": "Hagen Qian",
                    "user_href": "/profile/Hagen-Qian-1"
                },
                {
                    "user_id": "Sravanthi B",
                    "user_href": "/profile/Sravanthi-B-7"
                },
                {
                    "user_id": "Dino Hadzic",
                    "user_href": "/profile/Dino-Hadzic-2"
                },
                {
                    "user_id": "Daniell Robertson",
                    "user_href": "/profile/Daniell-Robertson"
                },
                {
                    "user_id": "Carlos Andrés Campo González",
                    "user_href": "/profile/Carlos-Andrés-Campo-González"
                },
                {
                    "user_id": "Tess Rempel",
                    "user_href": "/profile/Tess-Rempel-1"
                },
                {
                    "user_id": "Jose Rodriguez",
                    "user_href": "/profile/Jose-Rodriguez-48"
                },
                {
                    "user_id": "Victor Awe",
                    "user_href": "/profile/Victor-Awe-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Welch",
                "href": "/profile/James-Welch-26"
            },
            "answer_text": "I feel that, in your twenties, you need to acquire a basic understanding of the world (if you have not done so already) and how it operates. First, how is your grasp of history? Please don’t think that just because you went through high school classes means you know all about history. What do you know about South American history? Australia? East Asia? South Asia? The Middle East? Africa? Europe? Learning history is a lifelong task. How can, for example, you understand what is happening in the Middle East if you don’t know the backstory? Then, you need to understand why history happened when and where it did. GUNS, GERMS, AND STEEL, by Jared Diamond. Hiroshima, John Hersey. The first, and best, account of nuclear weapons effects. It deals, of course, with the nuking of Hiroshima. Two things will happen when you read this: One, you will be grossed out to the max. You think Faces of Death or Friday the 13th was gross? This is much worse. Second, you will become anti-nuclear weapons. Any rational person is; this will give you the evidence you need. The Making of the Atomic Bomb, Richard Rhodes. The backstory of Hiroshima. The continuation volumes, Dark Sun, Arsenal of Folly, and Twilight of the Bombs, are also well worth reading. The True Believer, Eric Hoffer. Explains the operation of fanaticism. Writtten by a longshoreman philosopher in San Francisco in the 1950s, but still relevant today. The Lexus and the Olive Tree, and The Word is Flat, by Tom Friedman. How the world changed from being subdivided to being globally integrated. NOT political, but economic and social. They really are one book, in my opinion. The Rise and Fall of the Great Powers, by Paul Kennedy. Why fiscal resposibility matters in a country attaining and keeping power. Makes you wonder if the Republicans have read it. Finally, The Drukard’s Walk, by Leonard Mlodinow. How randomness affects our lives. Deals with mathematics in such a way that even a math dummy like me can understand it. Depending on how fast you read, it should take you a few months to a year to read all these. Start with Guns, Germs, and Steel. There are only 2 reactions to the book: One, “I’m bored”; Two, “Wow, did I read that right? I have to read it again!” Also the best one-volume refutation of racism I have ever read. ",
            "date": "Answered November 8, 2018",
            "views": "13",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Abe Nemon",
                    "user_href": "/profile/Abe-Nemon"
                }
            ]
        }
    ]
}