{
    "title": "What are some of the harsh truths of life? - Quora",
    "tags": [
        "Bitter Truths",
        "Truths of Life",
        "Truth",
        "Important Life Lessons",
        "Experiences in Life",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Siva Shankar",
                "href": "/profile/Siva-Shankar-912"
            },
            "answer_text": "Life is no picnic. All too often, we have to overcome obstacles in order to survive. Read these 14 harsh truths of life to help you get stronger and be more self-confident. “We spend much of our lives going about completely blind to reality, and yet we still have the gall to act victimized when it invariably catches up to us.” – Nenia Campbell 1. You cannot always rely on friends. You will need certain life skills when nobody else is around. In this way you can rely on yourself to get out of trouble. It is a sad fact of life that we cannot count on other people most of the time. Make sure you have the following skills: You can cook You can drive You know about the power switches in your home You have a spare set of keys in a secret place for when you get locked out You can manage your time You learn something new about information technology every day to become computerate. 2. Make time for your passion. Whatever you love doing, make sure you do it at a set time. This is important because you find that friends, family, your boss, and your pet will be constantly yapping at your heels trying to steal your time. You have to build in the following defense mechanisms to stop people making unreasonable demands at the wrong moment: Switch off your phone Turn off the computer Go out and do it or lock yourself in 3. You accept challenges. In order to grow in being sociable, stronger both physically and mentally, you have to accept challenges on a regular basis. You are pushing yourself to get better and stronger. 4. You like being alone but you are not a loner. “If you’re lonely when you’re alone, you’re in bad company.” – Jean-Paul Sartre It is impossible to exist without social contact. You can be as strong and self-sufficient as you like, but at the end of the day you need to interact in a real, personal and meaningful way, which is neither Facebook nor Twitter. You need to be in contact with real people for this. At the same time, you can enjoy quiet time alone and you are comfortable with that. The health benefits range from increased creativity, less depression and improved memory. 5. Lower your expectations. “I’m not in this world to live up to your expectations and you’re not in this world to live up to mine.” – Bruce Lee Don’t think that people will always be there when you fall or fail. The phone will go silent. Many friends will suddenly be very busy with their own problems. When I was recovering from a fall, not one person in my condo offered to help me with carrying the shopping! 6. Prepare for bad times. Stuff happens and it can get nasty! You will have to learn to be stronger and not give up. But the good news is that adversity and suffering will make you appreciate life afterwards. Those who endured hardships, like being homeless, divorced or ill, found that they been able to develop better coping strategies and were more socially active. “Hope for the best and cope with the rest.” – Anon 7. You cannot be popular with everybody. It’s just chemistry. There are people who will rub you up the wrong way, will be bitchy, and will be downright unhelpful in the workplace. You can adopt a few avoidance strategies to reduce the fallout. Get over it and enjoy the company of the real friends you have. 8. You learn from failure. Everybody screws up. You know that perfection is impossible. Every time you have a disaster, do not beat yourself up. Just ask yourself how you could have avoided the trap or planned it better. In this way you can learn a few life lessons from failure. 9. Nobody else will praise you. Time to give yourself a pat on the back for all your achievements. Don’t be afraid to list them in your head when you get discouraged. Give yourself a score for each finished task. This keeps you strong when facing life’s harsh realities. 10. Toxic company is bad for you. You know the people I mean. These are the whiners, the pessimists, the miserable ones, the cheap ones, the nasty types, and the prejudiced. They make a lousy team. Try to gravitate towards the optimistic and passionate people who will help you see the brighter side of life. 11. Money is tight. Nobody wants to be stalked by debt or creditors. You have to work out how best to stay within your budget. Think of ways to save, like having packed lunches. Never go shopping without a list. Avoid impulsive buys. Use cash as much as you can. Leave the credit cards at home as they tend to lull you into a fantasy world. 12. Invest in kindness. Doing acts of kindness every day to people at work or those in difficulty will pay handsome dividends. People will return the kindness. Investing in kindness is like having savings in the bank. They will always earn a little interest. What goes around comes around. There is also an added bonus in that it makes you feel good for a while. 13. Be accountable for your behavior. If you behave badly, rudely or take unnecessary risks, then you have to be totally accountable for what you have done. You have to take the responsibility for your behavior. Another harsh lesson from the life arena! Taking the consequences, not blaming others and apologizing for harm done have to be on your to do list. 14. Look forward. There is no escape. Life is wonderful but it is really hard work. Now is the time to start afresh. “All the world is full of suffering. It is also full of overcoming.” – Helen Keller “Yesterday ended last night.” – John Maxwell Thanks for reading. Regards. Siva Shankar One Stop ----> UPSC [1] Footnotes[1] 14 Harsh Life Truths You Need To Know To Be Stronger",
            "date": "Answered October 11, 2020",
            "views": "111",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rishab Dang",
                    "user_href": "/profile/Rishab-Dang"
                },
                {
                    "user_id": "Jhansi",
                    "user_href": "/profile/Jhansi-61"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mahendra Mathur",
                "href": "/profile/Mahendra-Mathur-2"
            },
            "answer_text": " Death of King Harold at Hastings, 1066 Man can literally eat man. In 1881 a Greek expedition ws commissioned by the US Government to collect meteorological data from the North Pole and was billed as the most ambitious scientific research mission ever dent to the Arctic. Adolphus Greely, a Civil War veteran, and his party made it further North than any preceding expeditions but in in 1883 his ship hit an iceberg and sank. With no food, he and his crew began to starve. Three years later of the original 25, Greely and his emaciated colleagued were found still alive. The rest had perished. Given the length of time they had spent on the frozen barren ice without any food, how had they stayed alive. Half-eaten remains of the deceased crew members pointed to one direction - cannibalism.Even if you are a king, in a battle, you can end up being meat on the hoof! At the battle of Hastings in 1066, this is what happened to king Harold according to an eye-witness. “He was killed by an arrow through his eye. The first Norman knight split Harold’s chest, driving the point of his sword through the king’s shield. The gushing torrent of blood drenched the Earth. The second knight struck off his head below the helmet and the third stabbed the inside of the belly with a lance. The fourth cut off his leg and carried it away.”",
            "date": "Answered October 23, 2020",
            "views": "27",
            "upvotes": " Answer requested by Anuj Singh"
        }
    ]
}