{
    "title": "What are the best arguments against existentialism? - Quora",
    "tags": [
        "Existentialism",
        "Pros and Cons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Naccarato Garufi",
                "href": "/profile/Matt-Naccarato-Garufi"
            },
            "answer_text": "Not to get too in-depth, Kierkegaard is often regarded as the first existentialist, and his idea was that each individual is solely responsible for giving meaning to life and living it authentically. This mindset is a precursor to modern psychology, where the patient is meant to interpret the events of his or her life in a way that allows the patient to accept and move forward. The power shifts from \"these terrible things happened to you\" to \"although these terrible things happened to you, you can shape what comes of it\". There aren't many good arguments against it, but just taking Kierkegaard's point, the stress would be on the \"solely\" aspect. The assumption being made is one that many Enlightenment thinkers shared as far as autonomy and free will are concerned. They downplay, to no real fault of their own, the enormous impact that our parents, childhood, geography, demography, and so many more influences have on how and why we think what we do. Going back to the psychology/therapy point, the therapist is telling the patient how to interpret, although giving off the appearance that the patient is doing it him or herself. A sort of noble lie that shows a person can overcome the trauma in a specific way, whereas if that person chose to overcome the trauma in a self-destructive way, that would be authentic in terms of existentialism, but not so in a psychological way.  At the end of the day, we're forced to wrestle with whatever plagues us, and in this sense we're \"doing\" existentialism. However, what plagues us, and even our methods of thinking about how to deal with what plagues us, usually comes from outside us, whether it's in a psychological, spiritual, scientific, or social medium. A step further, existentialism says that we make decisions based on subjective meaning, not \"pure\" rationality. I think the big flaw there is that it equates knowledge with meaning, which is easily shown to not be the case. I can very well no cigarette smoking is bad for me, but that doesn't mean I care enough not to. On the flip side, there are some people who know that smoking is bad for them, and although their subjective feeling is to continue smoking, they have the mental will-power to quit. People make decisions usually in some sort of \"dance\" of both, so to say one over the other is better, does a disservice to both. ",
            "date": "Answered August 6, 2013",
            "views": "154",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Keith Grohowski",
                    "user_href": "/profile/Keith-Grohowski-1"
                },
                {
                    "user_id": "Shua Kim",
                    "user_href": "/profile/Shua-Kim-2"
                },
                {
                    "user_id": "Adolfo Oubiña Neto",
                    "user_href": "/profile/Adolfo-Oubiña-Neto"
                },
                {
                    "user_id": "Alice Mo",
                    "user_href": "/profile/Alice-Mo"
                },
                {
                    "user_id": "Bilal Khan",
                    "user_href": "/profile/Bilal-Khan-2113"
                },
                {
                    "user_id": "Muh Syukron",
                    "user_href": "/profile/Muh-Syukron-1"
                },
                {
                    "user_id": "Linda Mangan",
                    "user_href": "/profile/Linda-Mangan-3"
                },
                {
                    "user_id": "Evan YANG",
                    "user_href": "/profile/Evan-YANG-59"
                },
                {
                    "user_id": "Abhishek Chatterjee",
                    "user_href": "/profile/অভিষেক-চট্টোপাধ্যায়-Abhishek-Chatterjee"
                },
                {
                    "user_id": "Robert Todd",
                    "user_href": "/profile/Robert-Todd-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Crisp",
                "href": "/profile/Dave-Crisp-2"
            },
            "answer_text": "Since the main principle is that the individual finds or gives meaning to their life entirely on their own (by being ‘authentic’ which is to say by being ‘what they really are’), the best counter-argument is the same as for any individual-directed philosophy. That is to say that individuals can be totally wrong. They may try to be authentic, but not know what they truly are or they may achieve being authentic, but be an evil person who produces a ‘meaning’ in life that we don’t want to see carried forward. In other words, do we trust individuals to do the right things? It may be true, as Existentialists assert, that this is the only meaning human life CAN have, but that doesn’t necessarily make it a good thing. Of course the alternative is to allow some other force to dictate meaning in your life. Most often that is religion, but religions are man-made. Although they all claim to come from a higher power of some sort dictating the rules to some man (rarely a woman), who then dictates these rules to the rest of us, that doesn’t make it true that the rules are supernatural and therefore better than what an individual might come up with on their own. If we don’t trust individuals, why would we trust some individual or group of individuals who make up rules, claiming to be the mouthpieces for a non-existent god figure. If you ‘belong’ to a particular religion you are supposed to adhere to those rules, whether they make sense to you or not, whether they seem right or wrong, and the leaders can ‘reinterpret’ them at any point to be different from what was initially written or intended… and they do. You then have to ‘choose’ which religion, since there are many, buy into it all or keep some individual choice aside to suit yourself anyway… and follow the dictates of the leaders. So instead of thinking for yourself, you commit to letting some other person(s) think for you. Personally I prefer to trust the individual consciences of most people (and also identify a few as evil to avoid) rather than trust a group rule set up by others whom I do not know who expect me to believe stuff I cannot seriously believe they’ve been told by whomever they claim to have been told it by. I’ve never found such a group whose rules did not seem contradictory and negative in some parts, but I can often rely fairly well on the good intentions and behavior of many individuals I meet who think for themselves (and most do, even when they profess membership in one of the many groups with rules to follow). ",
            "date": "Answered October 12, 2018",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rizwana Yawar",
                    "user_href": "/profile/Rizwana-Yawar-1"
                },
                {
                    "user_id": "Alandro Assurbanipal",
                    "user_href": "/profile/Alandro-Assurbanipal"
                },
                {
                    "user_id": "Eric Hart",
                    "user_href": "/profile/Eric-Hart-45"
                }
            ]
        }
    ]
}