{
    "title": "What are some common examples of empirical evidence? - Quora",
    "tags": [
        "Empirical Research",
        "Evidence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Greg Olson",
                "href": "/profile/Greg-Olson-10"
            },
            "answer_text": "Empirical evidence is just any information received from the senses. Examples: The pain from a wasp stingYou see and listen to Shrek 2The discomfort in your arm due to an attractive stranger falling asleep on it on a bus, and eventhe pleasure this gives you which makes you not want to move.What to do with this information and any additional criteria gets into Epistemology. The belief that empirical evidence is the most important way to know things is called Empiricism. Empiricism is pretty mainstream. The belief that empirical evidence, with certain additional limits, is the only way to know things is called Positivism. Any other aspects of human experience, or anything about reality understood by means of other branches of epistemology, are assumed to be either irrelevant or not real. Positivism is less mainstream, and it has a few pragmatic issues—most significantly, there’s no way around the Is–ought problem, so the concepts of importance, morality, and goals become meaningless, or at least entirely subjective. Most of the time you can make inferences about how people approach empirical evidence and epistemology based on what major worldview or religion they believe. For example, Muslims can be empiricists or rationalists but not positivists, and they must be moral realists. ",
            "date": "Answered May 30, 2020",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Hamill",
                "href": "/profile/Robert-Hamill-3"
            },
            "answer_text": "The phrase empiric evidence is not restricted to science, In court, a lawyer may say, “I have empiric evidence my client could not have committed the crime. Here is a photograph of him at a convention a thousand miles away from the scene of the crime. There are seven witnesses that will swear he was at the convention the day of the crime.” In the scientific world, it’s worthwhile to consider the story of Galileo dropping two differently massed balls from the Leaning Tower of Pisa and they both striking the ground at the same time. That’s many peoples first introduction to empirical evidence, supporting the notion that objects fall with the same acceleration under the force of gravity. However, it also reveals a caution to keep in mind. If you drop a feather and a rock, the rock will hit the earth first. The point is that another physical phenomenon, air drag, was ignored in the first experiment, so the Leaning Tower empirical evidence doesn’t necessarily support conclusions where other forces are involved. Scientists don’t discard the initial conclusion. They append a qualification to it. ",
            "date": "Answered April 27, 2018",
            "views": "94",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Trevor Stathatos",
                    "user_href": "/profile/Trevor-Stathatos"
                },
                {
                    "user_id": "Sobuj Mridha",
                    "user_href": "/profile/Sobuj-Mridha-1"
                }
            ]
        }
    ]
}