{
    "title": "What are philosophical paradoxes? - Quora",
    "tags": [
        "Paradoxes",
        "Logic (philosophy)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nathan Coppedge",
                "href": "/profile/Nathan-Coppedge"
            },
            "answer_text": "Actual paradoxes: “paradoxes”. Just look them up. There are many examples. Each example of a paradox is a paradox, and paradoxes are an invention of philosophy. A paradox to philosophy is like irony to literature, but more complex. It is almost like a math problem, but that won't help. They are traditional or new problems which are ironic, difficult, contradicting themselves. For example, a shoe that won't tie itself is like a stupid paradox. The real ones are more respected, although sometimes they sound stupid and are not. It helps to know that philosophers are sometimes seen as respectable fools. But not really fools, wise men who act like fools. A paradox is one of the most philosophical things, like having an unsolvable problem that you are honestly-honorably concerned about. People respect you (traditionally) for being concerned with the problem, but they don't talk about it. They just say “he's being philosophical” or “that’s incomprehensible” something like that. Many of the most famous paradoxes are actually thousands of years old, grom the time of Zeno of Elea, who wrote 40 pages of them. It was a long time before anyone tried to be more prolific. A version of Zeno: Paradoxes of Zeno The closest example I could find from my own work is: Problems and Solutions ",
            "date": "Answered January 25, 2018",
            "views": "349",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Aissata Sow",
                    "user_href": "/profile/Aissata-Sow-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bevan Audstone",
                "href": "/profile/Bevan-Audstone"
            },
            "answer_text": "A philosophical paradox It could be when you inundate twins with social media Memes and phone them at home - :) But it’s usually when we present information that is completely contradictory and yet from two completely different perspectives, both appear to be true I think therefore I am So says Descartes Some other dude kicks a rock to say -the whole thing is ridiculous Thus I refute Berkeley Or bishop or something maybe it was a bishop who said it ,I don’t remember I happen to be a believer that this isn’t real at all ; any of it But a 14 billion year persistent illusion seems to kick my ass every time That would be a philosophical paradox OR Ashleigh Brilliant- the worlds only professional epigramist said I have a theory that nothing can be proven But I can’t prove it ",
            "date": "Updated July 24, 2019",
            "views": "17",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                },
                {
                    "user_id": "Harley Burton",
                    "user_href": "/profile/Harley-Burton-3"
                },
                {
                    "user_id": "Jane Lee Holmes",
                    "user_href": "/profile/Jane-Lee-Holmes"
                },
                {
                    "user_id": "John Stone",
                    "user_href": "/profile/John-Stone-6"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Paul Ryberg",
                    "user_href": "/profile/Paul-Ryberg"
                },
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                },
                {
                    "user_id": "Jeff Mackenzie",
                    "user_href": "/profile/Jeff-Mackenzie"
                },
                {
                    "user_id": "Alexander Taylor",
                    "user_href": "/profile/Alexander-Taylor-61"
                }
            ]
        }
    ]
}