{
    "title": "What are the major differences between Eastern and Western philosophies? - Quora",
    "tags": [
        "Eastern Philosophy",
        "Comparisons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Bush",
                "href": "/profile/Paul-Bush-4"
            },
            "answer_text": "There are probably exceptions to any statements about this, but the major difference is that Western philosophies (WP) are dualistic and thus materialistic while Eastern (EP) are not. By \"dualistic\" I am not referring to the mind/body dualism of Descartes but the identification with a mind/body and consequent disidentification with the rest of reality. This leads a number of false beliefs and in the end is responsible for all suffering. Beliefs such as \"I am a person. Matter is real, only* matter is real and it exists independently of me\". The mystical core of religion forms the basis of EP, whereas religion and philosophy became increasingly divorced in the west. This may seem to be due to the rise of science and rational thinking, but the scientific approach itself arose from dualism, the belief in a self, independent of the world, acting on it and mastering it in order to put it to use. Science arose from the same perspective that reduced religion to a paternalistic God, a sky-daddy with a human personality, ever separate from but always lording over his helpless subjects. Such a perspective leads to philosophies that agonize over questions of meaning and direction, left with only rational analysis to apply to questions such as free will and morality, so getting nowhere and unable to fulfill their purpose. In EP these questions don't arise; if you view yourself as not different from the world there is no difference between acting for yourself and acting for everyone. The western approach is not all bad of course. It's better not to be sitting in a mud shack dying of disease. But now that the internet is removing the distinction between east and west it's time to take the best of both EP and WP, recognizing that yes, we can make our material life comfortable, but that isn't the purpose of life and to believe that it is will only lead to suffering. *More recently Einstein showed the unity of matter and energy, which is problematic for materialism since energy is hard to define, having to do with the transformation of matter. ",
            "date": "Answered March 18, 2016",
            "views": "199",
            "upvotes": " View 27 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eduardo Dela Cruz",
                    "user_href": "/profile/Eduardo-Dela-Cruz-21"
                },
                {
                    "user_id": "Ananthu",
                    "user_href": "/profile/Ananthu-19"
                },
                {
                    "user_id": "Arliss Banks",
                    "user_href": "/profile/Arliss-Banks-1"
                },
                {
                    "user_id": "Gabriel Cserei",
                    "user_href": "/profile/Gabriel-Cserei"
                },
                {
                    "user_id": "Manoj Rahul",
                    "user_href": "/profile/Manoj-Rahul-1"
                },
                {
                    "user_id": "Lou Vink",
                    "user_href": "/profile/Lou-Vink"
                },
                {
                    "user_id": "Alfian Hidayat",
                    "user_href": "/profile/Alfian-Hidayat-1"
                },
                {
                    "user_id": "Brandon Kim",
                    "user_href": "/profile/Brandon-Kim-15"
                },
                {
                    "user_id": "V A Griffin",
                    "user_href": "/profile/V-A-Griffin"
                },
                {
                    "user_id": "Patrick Henehan",
                    "user_href": "/profile/Patrick-Henehan-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Qwato",
                "href": "/profile/Sam-Qwato"
            },
            "answer_text": "Q. What are the fundamental differences between Western and Eastern philosophy?  Short answer: WorldviewPrimacy of societal well-being over the Individual.Broadly, Eastern versus Western summary. (1) On Thought Eastern (E): Dialectic thinkingWestern (W): Logical cause and effect  (2) Context E: Continental, limited by geography and resources.W: Maritime, boundless resources, expansionary.   Above: Manifest destiny (3) On Logic E: The Deductive, and the Inductive, in an easy continuum.W: Uneasy with the inductive. Binary. Systemization. Mathematization. Paradigmization.   (4) On Consciousness No problem can be solved from the same consciousness that created it.E: Embraces itW: Fights it  (5) Worldview E: Collectivist, acceptance of authority, holistic and multidimensional view.W: Enforced individualism, democratic, sanctity of individual property rights.    (6) On Self E: Out → In. Self-aware, seek truth through subjective inward enlightenment.W: In → Out. Open to boundless enquiry. Seek outward knowledge and looking for external reasons, but gradually becoming more self-conscious.  (7) On Nature E: Acceptance of uncertainty, imperfection and therefore borders on mysticism and superstition.W: Seek universal theory of everything through Science/Technology, strive for theoretical perfection.   (8) On Society E: Complex relationships aid strategic wisdom and insights.W: Logical modelling (9) On Ethics E: Shame-basedW: Guilt-based    (10) On Faith E: Faith indistinguishable from Philosophy. Those who hallucinate are revered as religious leaders, who have a gigabit uplink to the spirit world.W: Faith-Reason tension. Faith leaders who hallucinate belong to the funny farm.  ",
            "date": "Answered February 8, 2018",
            "views": "67",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jennifer Luna Tuazon",
                    "user_href": "/profile/Jennifer-Luna-Tuazon"
                },
                {
                    "user_id": "Gunjan Panara",
                    "user_href": "/profile/Gunjan-Panara"
                },
                {
                    "user_id": "Ananthu",
                    "user_href": "/profile/Ananthu-19"
                },
                {
                    "user_id": "Manoj Rahul",
                    "user_href": "/profile/Manoj-Rahul-1"
                },
                {
                    "user_id": "Sun Keren",
                    "user_href": "/profile/Sun-Keren-1"
                },
                {
                    "user_id": "Anderson Brown",
                    "user_href": "/profile/Anderson-Brown-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Joey-Of-Texel"
                },
                {
                    "user_id": "Molly Kissinger",
                    "user_href": "/profile/Molly-Kissinger-3"
                },
                {
                    "user_id": "S.Y. Tao",
                    "user_href": "/profile/S-Y-Tao-陶-思源"
                },
                {
                    "user_id": "Gabe Gronlund",
                    "user_href": "/profile/Gabe-Gronlund"
                }
            ]
        }
    ]
}