{
    "title": "What are the two similarities between Plato and Descartes? - Quora",
    "tags": [
        "René Descartes",
        "Plato"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stefano Zamboni",
                "href": "/profile/Stefano-Zamboni"
            },
            "answer_text": "I do not think there are only two similarities between Plato and Descartes. However, certainly the point of union is the dualism mind body.This problem, today considered outweighed in favor of materialistic monism, was often noted but avoided by other philosophers, Aristotle and Augustine considered man as a synology of spirit and matter, the former referring to the acting spirit, the latter considering it a mystery prepared by God , but their reflection, with opposite results, was centered on the immortality of the soul, true for the Christian Augustine, false for Aristotle.The central point of dualism lies in the transcendence of the mind, inasmuch as the mind resembles, or at least knows how to grasp, the realm of ideas, which are eternal and unalterable.Take for example the concept of square root, is out of any time and any space because it is always and everywhere equal to itself. This makes it transcendent to matter, which always has a place and a moment. Since nothing of matter is similar to ideas (in addition to the fact that matter is disposed according to clearly transcendent laws, according to the point of view of our discourse) both Plato and Descartes derive from it that the mind (or soul) is a substance separate from substance material. ",
            "date": "Answered October 21, 2018",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charles Gray",
                "href": "/profile/Charles-Gray-45"
            },
            "answer_text": "There are more than two similarities between Plato and Descartes, but here are two general ones. They both believe that knowledge is indefeasible, immutable, and recalled rather than learned. And they both present versions of the dream doubt to argue that empirical knowledge lacks indefeasibility and so is not really knowledge. ",
            "date": "Answered June 11, 2019",
            "views": "12",
            "upvotes": "0"
        }
    ]
}