{
    "title": "What are some counterintuitive economic facts? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Siddharth Pathak",
                "href": "/profile/Siddharth-Pathak-10"
            },
            "answer_text": "Economies will always defy the Platonic attempts to hijack their complexity in theoretical cages. And because the complexity vastly exceeds the theoretical abilities of humans to be encapsulated in its entirety (which I suspect is a function of cognitive biases), the work to “understand everything” will always prove to be an elusive fruit. Like Mother Nature throwing everything into chaos in the physics departments right when the arrogance of physicists is at its high for everything is supposed to have been “explained”, the complex collective breathing beasts called economies will always have the upper hand over humans’ attempts at Platonifying it. I would say this is something that isn’t a counter-intuitive economic fact, because it seems to be counter-intuitive to the economic academia as well. In fact it would be counter-intuitive to humans in general, as we all seem to be cognitively driven to always make neat and nice models, when the reality all around us is fuzzy. ",
            "date": "Answered September 8, 2017",
            "views": "442",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rahul Vaidya",
                    "user_href": "/profile/राहुल-वैद्य-Rahul-Vaidya"
                },
                {
                    "user_id": "Gopalavasan Govindarajan",
                    "user_href": "/profile/Gopalavasan-Govindarajan"
                },
                {
                    "user_id": "Samual Gorrche",
                    "user_href": "/profile/Samual-Gorrche"
                },
                {
                    "user_id": "Rohan Mehere",
                    "user_href": "/profile/Rohan-Mehere"
                },
                {
                    "user_id": "Akshat Prakash",
                    "user_href": "/profile/Akshat-Prakash-5"
                },
                {
                    "user_id": "Sayantan Venkatesh",
                    "user_href": "/profile/Sayantan-Venkatesh"
                },
                {
                    "user_id": "Anshuman Nanda",
                    "user_href": "/profile/Anshuman-Nanda-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan Avent",
                "href": "/profile/Ryan-Avent"
            },
            "answer_text": "Textbooks are full of lots of counterintuitive economic facts. The government’s budget does not work like a household budget, for instance, and increasing immigration into a country does not imply that natives are being forced out of their jobs. My favorite economic fact, though, is that the more productive a part of the economy becomes, the less important its economic role becomes. Take farming, for instance. Farming has become vastly more productive since the 19th century, such that the amount of food per person has risen even as global population has soared. The effect of that growth is that almost no one works as a farmer and farming’s share of GDP is tiny. Weirdly, it’s the stuff that isn’t very productive that becomes an economic bottleneck, soaking up lots of workers and accounting for a huge amount of GDP. Like medical care. ",
            "date": "Answered September 8, 2017",
            "views": "55",
            "upvotes": " View 262 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tsvetan Borisov",
                    "user_href": "/profile/Tsvetan-Borisov"
                },
                {
                    "user_id": "Nikhil Garg",
                    "user_href": "/profile/Nikhil-Garg"
                },
                {
                    "user_id": "Vasant Surya Teja",
                    "user_href": "/profile/Vasant-Surya-Teja"
                },
                {
                    "user_id": "Bhasker Kinjal",
                    "user_href": "/profile/Bhasker-Kinjal"
                },
                {
                    "user_id": "Shakhawat Hossain",
                    "user_href": "/profile/Shakhawat-Hossain-1"
                },
                {
                    "user_id": "Sagar Nilay",
                    "user_href": "/profile/Sagar-Nilay"
                },
                {
                    "user_id": "Francisco Barraguirre",
                    "user_href": "/profile/Francisco-Barraguirre"
                },
                {
                    "user_id": "Scott Borden",
                    "user_href": "/profile/Scott-Borden-1"
                },
                {
                    "user_id": "David Ollodart",
                    "user_href": "/profile/David-Ollodart"
                },
                {
                    "user_id": "Shubham Kejriwal",
                    "user_href": "/profile/Shubham-Kejriwal-2"
                }
            ]
        }
    ]
}