{
    "title": "What are three absolute truths? - Quora",
    "tags": [
        "Truth",
        "Belief and Beliefs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Owen Skarpness",
                "href": "/profile/Owen-Skarpness"
            },
            "answer_text": "(1) It is potentially true that everything is an illusion: in reality everything is One.(2) You are not what you think you are, you are far more: you are everything.(3) And, perhaps most importantly: you substantiate the real. A short explanation:(1) All distinctions are based upon assumptions. A series of assumptions substantiates a system. All systems have some foundational assumption which effectively \"gets it off the ground.\" All foundational assumptions are fundamentally unprovable, effectively taken on some degree of \"faith,\" if you prefer to call it that (as opposed to certainty). The lack of all certainty establishes the potential to the alternative that all distinctions are false or illusory. In the event that all distinctions are legitimately illusory, everything is legitimately one - the whole remains wherever distinction is absent. (2) If everything is One, then you are also that thing. Serious pursuit of the question \"what am I?\" yields ever to further questions, especially where time is involved. Were you yourself when you were sick / younger / intoxicated / unconscious / unaware / or any other way different than you are now? Were you responsible then? Identically or to a degree? What differentiates you from another accused? What substantiates the difference between your experience and mine? What arbitrates those values? Where does my nose end the rest of the world begin? All that which is perceived is done so by a perceiver of the real. Does real not perceive itself, then? All that stands between communicating beings (surprisingly) amounts to everything. (3) Given the spuriousness of yourself and the entirety of the distinctions you have created, this is perhaps the most important principle of the three: you substantiate the real. Not only do you define and make the sum total of all distinctions that you have, will, and can ever potentially make, but you (the non-arbitrary one) are also the only thing which perceives the universe. Since the universe only exists as experienced by cognitive entities, the real is only truly substantiated by the sum total of that which perceives - you. Additionally, that which you do, experience, and propagate substantiates all that is done, experienced, and propagated. So, most importantly of all, you substantiate the real. ",
            "date": "Updated June 24, 2017",
            "views": "22",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rick Ruppenthal",
                    "user_href": "/profile/Rick-Ruppenthal"
                },
                {
                    "user_id": "Shayna Biswas",
                    "user_href": "/profile/Shayna-Biswas"
                },
                {
                    "user_id": "Jess Cummins",
                    "user_href": "/profile/Jess-Cummins-12"
                },
                {
                    "user_id": "Kavya Sharma",
                    "user_href": "/profile/Kavya-Sharma-4"
                },
                {
                    "user_id": "Phil Garcia",
                    "user_href": "/profile/Phil-Garcia-1"
                },
                {
                    "user_id": "Chris Cooper",
                    "user_href": "/profile/Chris-Cooper-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Voight",
                "href": "/profile/Adam-Voight"
            },
            "answer_text": "While I agree with almost all the previous answers, they are nowhere even close to being ABSOLUTE truths. Aristotle came up with three absolute truths long ago, and these truths are so absolute that not even \"Every event has a cause\" or \"I think therefore I am.\" can even come close. The first law is: \"For any thing called 'A', A=A and A!=notA.\" \"A\" can be anything from a noun to an entire set of statements; if anyone says A, he must mean A and must therefore disagree with notA. If not, then he is not really saying anything, but is rather making nonsensical noises that have no real meaning. I would hesitate to consider it poetry, it would simply be nonsense. The three laws of thought show the essential nature of that which can be either true or false. For the other laws, look here: Law of thought An important result of the above is that atheists and theists have the same ultimate foundations for all their beliefs, in contradiction to the common belief that theists found theirs on 'faith' while atheists are based on 'materialism'. Nope, all humans, whatever they  may think, actually share the same Three Laws. Doubting these laws means that you have left the realm of meaningful thought or discourse, something all humans share whatever their beliefs. ",
            "date": "Answered August 13, 2014",
            "views": "3",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Himanshu G",
                    "user_href": "/profile/Himanshu-G-19"
                },
                {
                    "user_id": "Shayna Biswas",
                    "user_href": "/profile/Shayna-Biswas"
                },
                {
                    "user_id": "Mickey Clay",
                    "user_href": "/profile/Mickey-Clay-1"
                },
                {
                    "user_id": "Manan Sikka",
                    "user_href": "/profile/Manan-Sikka-1"
                },
                {
                    "user_id": "Tim Ross",
                    "user_href": "/profile/Tim-Ross-6"
                }
            ]
        }
    ]
}