{
    "title": "What can we know about the immaterial aspect of existence? - Quora",
    "tags": [
        "Immaterialism",
        "Theoretical Physics",
        "Existence",
        "Science",
        "Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marcus Lester",
                "href": "/profile/Marcus-Lester-2"
            },
            "answer_text": "I like your question on a number of levels. Science tells us that there is such a thing as energy. We know something about energy and forces of various kinds, for example, gravity, electromagnetic radiation, perceptible sound, thermal radiation, etc. This body of knowledge is well accepted by many people. Science has more to tell us. The molecules, atoms, and subatomic particles are made of tiny bits of material, if that, which are almost unimaginably small in relation to the space in which they move with great energy. Thus, the “material” of our world is vastly empty of matter, and it is more correctly a shifting pattern of local condensations of energy. What we perceive as material is mostly, if not entirely, devoid of matter. We know this also. Now, returning to our perceptible world, a rock is still “hard” and if it falls on me, it will surely injure or kill me. Thus, a rock is and is not a rock. It both is and is not different than we perceive it to be. And we know all this from science. This, of course, raises interesting questions about the nature of awareness in such a reality, but that leads us away from your original question. I hope this was helpful to you. ",
            "date": "Updated July 8, 2018",
            "views": "102",
            "upvotes": " Answer requested by Emmanuela Louis",
            "upvoters": [
                {
                    "user_id": "Michael Watmon",
                    "user_href": "/profile/Michael-Watmon-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Lyashenko",
                "href": "/profile/Alex-Lyashenko-1"
            },
            "answer_text": "We hardly can know anything about it in the sense of everyday knowlege. Some of us can feel it. Some of us can believe it. I admit that there are people who really know it for sure out of personal experience. Like people who survived a clinical death. But when they try (if they try) to share their knowlege they understand that this is impossible. We used to trust the empirical experience, the science theories, the sensations that we receive through our senses. But most of us are not ready to admit something rare and unusual without direct evidences. So if this question is very important for and you need a definite answer, try to find anybody who deals with it on scientifical basis. Or deal with it yourself and probably you will find an unexpected answer. ",
            "date": "Answered June 4, 2018",
            "views": "111",
            "upvotes": " View 1 Upvoter"
        }
    ]
}