{
    "title": "What are your axioms in life? - Quora",
    "tags": [
        "Axioms (logic and mathematics)",
        "Philosophy of Everyday Life",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rahul Hans Chaudhary",
                "href": "/profile/Rahul-Hans-Chaudhary"
            },
            "answer_text": "I am a propentine fretful guy who loves to explore places, people, food and technology sometimes. I am not that kind of guy who has so much experience about life and how to live a good life. But i wrote on this just because i have seen the different phases of life. For me as i am very interested guy in Mathematics since the early days of my Engineering, i can correlate that life also has some axioms. So here goes the list… Axiom 1: The god of your life will be your greatest university and school.  Image sources : Google Images Axiom 2: The more you want to change something, the more that stays in your life… Axiom 3 : You are only responsible for your acts in the life, it doesn’t depend whether those acts are good or bad. Axiom 4 : If you want good things in life, first try to learn that how will you save them in your life. A fool person can also make money but a wise person knows better that how to save that money. Axiom 5 : Life is not about good start, it’s all about the good finish. Because finishing a thing very well give you the satisfaction or motivation towards your work. Axiom 6 : Failure is the best friend of your life rather than to achieve constantly success in life. Axiom 7: Don’t reveal your greatest strengths or greatest weaknesses. Because if you reveal it then your greatest strength may become greatest weakness. Axiom 8: Something that may happen or not happen, it’s not your business. It is the business of nature. We can only try to achieve something. We have omly controls on our input rather than output. Axioms 9: Always try to communicate rather than to talk, always try to listen rather than to hear. Axiom 10: We are not brought to earth just to be born into mortality. We came with a mission and a purpose—and that is to endure to the end.  Image Source - Google Images  I didn’t explain these axioms. Because these axioms have indepth meaning and analysis. So explore it by yourself and find the eternal truth of life. Cheerio :) ",
            "date": "Answered October 23, 2017",
            "views": "43",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raul Bascones",
                    "user_href": "/profile/Raul-Bascones"
                },
                {
                    "user_id": "David Ortega",
                    "user_href": "/profile/David-Ortega-104"
                },
                {
                    "user_id": "Ed Roan",
                    "user_href": "/profile/Ed-Roan"
                },
                {
                    "user_id": "Franklin Jose",
                    "user_href": "/profile/Franklin-Jose-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Naga Pramod",
                "href": "/profile/Naga-Pramod"
            },
            "answer_text": "‘Amor Fati’ — ( \"love of fate\") is a Latin phrase that may be translated as \"love of fate\" or \"love of one's fate\". As taken from Wikipedia.  That right there is my favourite axiom in my life. I’ve come across stoicism when Ryan Holiday wrote about it in his blogs. I was intrigued by the idea of stoicism. I have a great amount of respect for Ryan Holiday and I always held a high opinion for his thoughts and writings. Therefore, when he strongly admired and wrote about stoicism, I naturally got intrigued by it and had my fair share of reading. Amor Fati as the meaning says, is the love for fate of life. It just doesn't translate to merely accepting everything as a part of happening because of fate or whatever. It means that sometimes, things in life are out of control and suffering is a part of life too. There are many different parts of this saying that make sense to me. Love for fate: Life has infinite number of chances to get influenced by many aspects which we can be totally unaware of. In such cases, regardless of planning and proper execution, there are always unintended consequences. Instead of being disheartened by such surprises thrown at us by life, accepting the possibility for such occurrences and moving on is a better choice.Suffering is a part of life: If there’s one thing that I learnt this year, then it was this. Suffering is okay and it is a necessary evil. All our life, we try evading suffering and shy away; heck, we even tend to fear it. Nevertheless, suffering is mandatory and would always be lurking in some corner in our lives. Honestly, it is okay. As they say, one can appreciate light only when there’s darkness.Acceptance of situations: Accepting things for what they are is a very enriching and a calming thing. Most often, we spend time beating around the bush or we tend to lack the courage to accept things for what they are. Most of the times, accepting things for what they are requires courage and self esteem. But at the end of it all, accepting things for what they are is the right thing to do.Cheers! ",
            "date": "Answered August 24, 2018",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Evan Kuchar",
                    "user_href": "/profile/Evan-Kuchar"
                }
            ]
        }
    ]
}