{
    "title": "What are the benefits of becoming stoic? - Quora",
    "tags": [
        "Stoic Habits",
        "Stoicism Today",
        "Stoicism",
        "Philosophers",
        "Philosophy",
        "Psychology",
        "Self-Improvement",
        "Psychology of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Philippus",
                "href": "/profile/Daniel-Philippus-1"
            },
            "answer_text": "Resilience, tranquility, and clarity. Resilience and tranquility: a core teaching of Stoicism is the dichotomy of control, which is the recognition that we don’t control externals (e.g. outcomes) and the resultant choice to place value only on virtue, which is internal to us. Since virtue requires action, this doesn’t lead to inaction; it only leads to a mindset where, to the extent that one has perfected their Stoic practice, they become “unshakeable”, unable to be harmed by hardship and viewing it instead as an opportunity for growth. This produces, to the extent that the practice is perfected, secure tranquility and perfect resilience.Clarity: Stoicism (like other schools of virtue ethics) is a comprehensive moral framework. Hypothetically, for absolutely any decision, a particular Stoic will be able to determine which choice is most virtuous (or if multiple choices are equally virtuous, in which case they can choose by preference). However, this is in the context of the person’s own roles, so the requirements of virtue are flexible and highly responsive to individual situations. This provides clarity without sacrificing flexibility.",
            "date": "Answered January 3, 2020",
            "views": "224",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ngugi Maina",
                    "user_href": "/profile/Ngugi-Maina-2"
                },
                {
                    "user_id": "Vibha Madabushi",
                    "user_href": "/profile/Vibha-Madabushi"
                },
                {
                    "user_id": "Giovanni Gatto",
                    "user_href": "/profile/Giovanni-Gatto-5"
                },
                {
                    "user_id": "Dan Manalili",
                    "user_href": "/profile/Dan-Manalili"
                },
                {
                    "user_id": "Ashton Hennessy",
                    "user_href": "/profile/Ashton-Hennessy"
                },
                {
                    "user_id": "George Unknown",
                    "user_href": "/profile/George-Unknown-2"
                }
            ]
        }
    ]
}