{
    "title": "What are the points to be covered in a statement of purpose for applying for graduate school? - Quora",
    "tags": [
        "Graduate School Advice",
        "Graduate School Statements of Purpose",
        "Personal Statements",
        "Graduate School Education",
        "Graduate School Admissions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben Y. Zhao",
                "href": "/profile/Ben-Y-Zhao"
            },
            "answer_text": "Interesting answers. Let me add a different point of view.  I've been a professor for 10 years, and have looked through hundreds of SOPs every year as part of grad admissions for our CS department.   OK, this is going to be slightly disappointing to some of you, but at least my personal view is that, with the exception of a couple of points which I'll mention below, in general, the SOP just doesn't matter.  You have to realize we admissions committees look through hundreds of these. So everyone will have some version of \"I found my first PC when I was 4 years old and fell in love...\" story.  It's cool, and it means a lot to many of the applicants, but it doesn't do much to help their case for why THEY should be admitted over the other hundreds of students in the pool.  So yes, do NOT make grammatical errors, do not say inane things that reflect *negatively*.  But beyond that, most SOPs will do little to hurt or help your application. Now let me get to the exceptions. Yes, there are ways to stand out amongst the piles and piles of applications and make a faculty member remember you. How?  Simple: talk research.  The best way to convince the admissions committee you're ready for a phd is to talk research. Tell us your ideas, what's your vision for your area, what big inevitable trends do you see in the future, and how do you capitalize on them? What are hard problems you've already tried to tackle, and how did you succeed/fail?  This is where an applicant can show that they have the clarity of thought to think hard about a real problem, and show the reasoning skills (and intuition for identifying tricky or interesting problems). I'm always excited by the rare applicant who clearly has thought through a research area, and has some ideas and real thoughts about problems he/she wants to tackle. It's fine if the ideas are not likely to succeed, or if the thoughts are not realistic for current research. What matters is that the student showed their logical reasoning skills, and their passion for research at the same time. ",
            "date": "Updated September 15, 2013",
            "views": "1968",
            "upvotes": " View 2.3K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Colin Phillips",
                    "user_href": "/profile/Colin-Phillips-13"
                },
                {
                    "user_id": "Karthik Abinav",
                    "user_href": "/profile/Karthik-Abinav"
                },
                {
                    "user_id": "Arvin Chang",
                    "user_href": "/profile/Arvin-Chang"
                },
                {
                    "user_id": "Jessica Su",
                    "user_href": "/profile/Jessica-Su"
                },
                {
                    "user_id": "Kara Jo Levery",
                    "user_href": "/profile/Kara-Jo-Levery"
                },
                {
                    "user_id": "Lisa Dooley Fisk",
                    "user_href": "/profile/Lisa-Dooley-Fisk"
                },
                {
                    "user_id": "Vishnu Pamula",
                    "user_href": "/profile/Vishnu-Pamula"
                },
                {
                    "user_id": "Ritik Mandal",
                    "user_href": "/profile/Ritik-Mandal-1"
                },
                {
                    "user_id": "Neelima Sunil",
                    "user_href": "/profile/Neelima-Sunil"
                },
                {
                    "user_id": "Edward Edberg Halim",
                    "user_href": "/profile/Edward-Edberg-Halim"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neil Traft",
                "href": "/profile/Neil-Traft"
            },
            "answer_text": "These are the boxes you are looking to tick with your personal statement: Good communications skills (esp. writing skills) — Whether you're in liberal arts or science, grad school will have you writing a whole lot. A lot of science majors underestimate how much these skills will help their application. Plus, there's a good chance you'll be expected to teach at some point, so if you have any prior teaching or tutoring experience you should mention it.Hard working and motivated — You can't just say you're \"self-motivated\" like every other boob writes on their resumé. You have to offer an anecdote or evidence that demonstrates your motivation. For me, this was an anecdote about the DARPA Grand Challenge where we lost due to our reliance on GPS sensors. This motivated me to want to solve the problem of robot navigation without GPS.Understanding of the field — If you don't have this, spend a week reading whitepapers and Wikipedia articles. This will give you enough keywords to let you talk conversationally in terms that an insider will recognize. It will make a big difference. Google Scholar and CiteCeerX are your friends.Reasonable expectations about what you will achieve — Don't tell them you're hell bent on being the next President of the United States. That's childish and unrealistic. Present a balanced perspective that shows ambition, optimism, and hopefulness, but also restraint.A focus on research — This will differ from field to field, but in most fields what they really want to hear about is research. Like teaching, if you have any research experience it should feature prominently in your essay. In addition to the research you've already done, they'll want to hear about the research you plan to do in grad school. Show that your plans are focused by being specific, but also show that you are open to other possibilities. Ideally, you should already know the scientific question you want to answer. If you don't know this, then you should be able to present some ideas to show that you're already thinking about problems (though this is less important for an MS). If you haven't done any research at all, you're in serious trouble unless you have impeccable grades to make up for it. So dig deep. Find anything that remotely resembles research. You need to prove to them that you can do research on your own, without guidance.Finally: How are you going to stand out?? — How are you going to stand out in the admissions officer's mind?? What will they call you to remember you by? \"Oh, that's the librarian who's interested in accessibility of information,\" or \"that's the guy who went backpacking in Europe,\" or \"the guy who competed in the DARPA Grand Challenge.\" This doesn't have to be something academic. It just has to be the one thing that is really, truly unique, interesting, and memorable about your essay. It doesn't even have to be a significant moment in your life. It just has to be something that the mind of the reviewer can latch onto, something so they will still remember and identify you after reading hundreds of essays just like yours (no problem, right?).One last tip: Try to write your essay so that it still reads the same if a reviewer reads only the first sentence of each paragraph—sometimes this is all they will have time to read! (In case you didn't notice, this is how I've written this post!) Also, you should read the following books. Whereas I've only tried to give you the overall themes you should strike upon, these books will give you the in-depth view. Try to find them at your local library. Graduate Admissions Essays, Fourth Edition: Write Your Way into the Graduate School of Your Choice, by Donald AsherHow to Write the Perfect Personal Statement, by Mark Alan StewartGetting What You Came For, by Robert L. PetersA PhD is Not Enough, by Peter J. Feibelman",
            "date": "Answered January 1, 2013",
            "views": "196",
            "upvotes": " View 54 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kara Jo Levery",
                    "user_href": "/profile/Kara-Jo-Levery"
                },
                {
                    "user_id": "Abdesselem Dehdouh",
                    "user_href": "/profile/Abdesselem-Dehdouh"
                },
                {
                    "user_id": "Asad Rizvi",
                    "user_href": "/profile/Asad-Rizvi-33"
                },
                {
                    "user_id": "Amber Huyghe",
                    "user_href": "/profile/Amber-Huyghe"
                },
                {
                    "user_id": "Siddhant International",
                    "user_href": "/profile/Siddhant-International"
                },
                {
                    "user_id": "Zeba Saraf",
                    "user_href": "/profile/Zeba-Saraf"
                },
                {
                    "user_id": "Karthik Subramani",
                    "user_href": "/profile/Karthik-Subramani-32"
                },
                {
                    "user_id": "Anais Ruiz",
                    "user_href": "/profile/Anais-Ruiz-4"
                },
                {
                    "user_id": "Advait Gilankar",
                    "user_href": "/profile/Advait-Gilankar-1"
                },
                {
                    "user_id": "Emin Burak Onat",
                    "user_href": "/profile/Emin-Burak-Onat"
                }
            ]
        }
    ]
}