{
    "title": "What are the basic problems of phenomenology? - Quora",
    "tags": [
        "Existential Phenomenology",
        "Edmund Husserl",
        "Phenomenology (philosophy)",
        "Problems",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rey Blanco",
                "href": "/profile/Rey-Blanco"
            },
            "answer_text": "I think that phenomena (appearances) have a fundamental problem of “subjectivity.” That is, science is involved with a consensus (or even an infinite amount of observers) that can agree on the same thing(s). Whereas in psychology, you have one observer that sees infinite objects. Each individual has a different pov, thus sporadic ephemeral events that leave no traces that can be verified by others can be implemented right under most noses and eyes, eluding thresholds of awareness. Thereby, phenomenology has a burden for a methodology that is usually excluded by those who do not see the same thing, and if they “same thing” is observed, the “interpretations,” “explanations,” “meanings,” and so on become too diverse for some disciplines. In my particular study, I’ve managed to use a methodology to categorize synchronicity, trivial thru profound, easy to compound by using basic logic. The axioms are formed from affirmative universal propositional statements, definitions for the concept, interpretive principles, and methodology. That means that any narrative (fictional or factual) describing this phenomena can be categorized thru a simplistic method of putting the facts on the right side and any “explanations” on the right side. Usually we find that with most phenomena that is not understood, there are a priori ready made “explanations” that are used as if a posteriori identification of the facts. For example, if an individual account is not dismissed as just another anecdotal something or other, a “ready made” ad hoc “Look how many times it did not happen, look everywhere else, it is all random chance.” This is a looped truism and not really an “explanation” because it mis directs the focus toward the plurality, a blurred view of the empirical facts. There may be a statistical value attached, hopefully, but the argument is a non starter. However, this is a major problem because if many individuals experience some strange phenomena and you have others who don’t believe it or rule it out as just someones imagination, then there is not enough curiosity let alone interest to take these appearances seriously. Thus, the discipline can be a thankless job and those involved might have to be satisfied that not everyone else need to know. Yet, like most areas of knowledge and discipline, there is probably a lot of great insights and profound revelations about the nature of existence. ",
            "date": "Answered September 23, 2019",
            "views": "403",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Suraj Siddhartha",
                    "user_href": "/profile/Suraj-Siddhartha"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Nathaniel Greer",
                "href": "/profile/William-Nathaniel-Greer"
            },
            "answer_text": "Phenomenology ranges from physicalism to idealism, but its main thrust seems to suffer from a lack of spiritual appreciation — especially the accounts of NDEs and psychic or religious reports. It deals with such questions and issues as: It asks, “How do we experience situations and phenomena?”It is largely dependent on the inaccuracies and inconsistencies of personal reports; which are usually verbal, but can also examine data from diaries, drawings and observation.It typically relies on statistically shallow small sample sizes (often fewer than a dozen people).It employs open-ended questions (allowing people to describe individual experiences personally and at length) — that are difficult to quantify.Its studies are sometimes corrupted or tainted with biases, cultural norms, traditions and preconceptions.Its focus on experience of environment, body, time and human relations leave much to be desired in terms of transcendental considerations.Its statistical methods and data analyses occasionally fail to adequately establish themes or patterns of perception and experience.A good source of information: Center for Innovation in Research and Teaching ",
            "date": "Answered September 23, 2019",
            "views": "282",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Suraj Siddhartha",
                    "user_href": "/profile/Suraj-Siddhartha"
                }
            ]
        }
    ]
}