{
    "title": "What causes some people to become overly attached to their pets? - Quora",
    "tags": [
        "Social Psychology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Radhika Vivek",
                "href": "/profile/Radhika-Vivek-2"
            },
            "answer_text": "I am not sure how you define \"overly attached to pets\". If overly attached means considering your pet to be a family member and making it a vital part of your life, then explaining \"over attachment\" is easy. As human beings we develop feelings for people and things. I know of people who are hugely \"attached\" to their books/toys/clothes/shoes. So why not their pets?  Your pet depends on you for food, shelter and affection. And reciprocates the affection in spades. It is easy to emotionally bond with your pet and make it an integral part of your life. As human beings, we are programmed to form attachments. Its what makes us who we are.   That said, I think the question refers to the psychology of attachment. Attachment theory is one of the most important theories in psychology. According to a study, the way we relate to important people in our lives very often mirrors the way we relate to non human figures in our lives. According to a UMass study,  it was found that people with a high degree of attachment anxiety when it came to their relationships with important/key people in their lives also showed a similar degree of attachment anxiety with their pets. So if you are insecure about your relationships and tend to be needy or clingy with key people in your life, chances are that you develop the same kind of neediness when it comes to your pet. There is a particularly informative article on attachment to pets in this blog:http://www.psychologytoday.com/blog/fulfillment-any-age/201202/how-emotionally-attached-are-you-your-pet ",
            "date": "Answered May 28, 2014",
            "views": "7",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nora Edwards",
                    "user_href": "/profile/Nora-Edwards-5"
                },
                {
                    "user_id": "Gimaggio Funes",
                    "user_href": "/profile/Gimaggio-Funes"
                },
                {
                    "user_id": "Subhajit Shome",
                    "user_href": "/profile/Subhajit-Shome-1"
                },
                {
                    "user_id": "Tessa R.B",
                    "user_href": "/profile/Tessa-R-B"
                },
                {
                    "user_id": "Wassim Naboulsi",
                    "user_href": "/profile/Wassim-Naboulsi"
                },
                {
                    "user_id": "Prerana Cv",
                    "user_href": "/profile/Prerana-Cv"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leslie Anthony",
                "href": "/profile/Leslie-Anthony-7"
            },
            "answer_text": "Humans of all sorts are under stress as adults no matter what financial situation or iob/career you are in. Add to that mental, physical, social problems, life events good or bad and daily pressure to do everything right and enthusiastically every day all day to survive while under constant scrutiny, and having to juggle life struggles with career demands, health issues and financial stresses. Your mom and dad, your siblings, your partners in business and life, your shortcomings etc. Humans around you will continuously reprimand you, have mental meltdowns, get angry or violent to you, beg for stuff you can't do, get in trouble and ask you to fix it. Help them move house, hate you for saying no……etc. But your sweet happy little pet doesn't ask for more than a meal and a walk. They rush to the door to greet you but never ask why you forgot about them. It's a wordless, blameless, symbiotic relationship you can never achieve with any other human that will not change until death in any way because of falling out or daily stresses. Your pup, or kitty are ways so happy every second with you. ",
            "date": "Answered May 29, 2019",
            "views": "2",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tiffany Austin",
                    "user_href": "/profile/Tiffany-Austin-75"
                },
                {
                    "user_id": "Subhajit Shome",
                    "user_href": "/profile/Subhajit-Shome-1"
                },
                {
                    "user_id": "Elizabeth Rice",
                    "user_href": "/profile/Elizabeth-Rice-47"
                }
            ]
        }
    ]
}