{
    "title": "What are things you believe to be absolutely true about this world? - Quora",
    "tags": [
        "Truth",
        "Belief and Beliefs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rik Levesque",
                "href": "/profile/Rik-Levesque"
            },
            "answer_text": "It’s round, NOT flat!It’s in trouble from dirty humans not cleaning up after themselvesIt’s a finite resource: we can’t just scoop it out like a magically renewable container of ice creamShort of a revolutionary change in the laws of physics, it’s the only place we know OF or can get TO that’s suitable for us to live, so we’d better start doing a better job of getting along, and start taking points “2 & 3” above seriously. Otherwise, some 50–200 million years from now, archaeologists or interstellar explorers will be debating exactly how we went extinct.",
            "date": "Answered March 30, 2018",
            "views": "117",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Leier",
                "href": "/profile/Mark-Leier-1"
            },
            "answer_text": "That it has mass. That it acts as an anchor for its only close neighbor, the moon. It possesses an atmosphere. It is the third planet from the sun in a planetary system consisting of seven other planets, and one newly titled ‘minor’ planet, Pluto. The earth is the only planet we know of - so far - that inhabits life; its physical characteristics also make it the most unique planet so far discovered, both within our solar system as well as the hundreds of others discovered beyond it. I also believe it’s a fragile place, and . . like anything fragile? it will take only so much abuse before experiencing catastrophic failure. Lastly? I believe we need to respect the earth as much as most Americans, who own cars or homes, respect them as well. ",
            "date": "Answered March 30, 2018",
            "views": "171",
            "upvotes": "0"
        }
    ]
}