{
    "title": "What are the differences between 'moral', 'value', and 'moral value'? - Quora",
    "tags": [
        "Moral Values",
        "Ethics of Everyday Life",
        "Similarities and Differences",
        "Ethics and Morality",
        "Values and Principles",
        "Ethics",
        "Morals and Morality",
        "Philosophy",
        "English (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Quenneville",
                "href": "/profile/Richard-Quenneville"
            },
            "answer_text": "MORAL is defined as: an adjective, The definition of moral is something that relates to the rules of right and http://wrong.An example of moral is governing principles of a religious group. As a noun, Moral is defined as a principle that governs right and wrong or the lesson of a fable. An example of moral is the commandment \"Thou shalt not kill.\"An example of moral is \"Slow and steady wins the race\" from \"The Tortoise and the Hare.\" VALUE is defined as: noun, plural noun: values, 1.the regard that something is held to deserve; the importance, worth, or usefulness of something.\"your support is of great value. EXAMPLE: Similar:meritworthusefulnessuseutilitypracticalityadvantagedesirabilitybenefitgainprofitgoodservicehelphelpfulnessassistanceeffectivenessefficacyavailimportancesignificancepointsensemileage 2. a person's principles or standards of behavior; one's judgment of what is important in life. EXAMPLE: \"they internalize their parents' rules and values\" MORAL VALUES mens the set of moral statements that someone highly valuess, such that they habitually do them! ",
            "date": "Answered June 17, 2020",
            "views": "31",
            "upvotes": " Answer requested by Azura Rynain"
        },
        {
            "author_info": {
                "name": "Paul Fodor",
                "href": "/profile/Paul-Fodor-5"
            },
            "answer_text": "Each one is a different aspect of “good” or “goodness”, closely related. Morality refers to what is intrinsically good. Values are the goals (the good) of a group or individual, what they consider good. Moral values are what they consider intrinsically good. ",
            "date": "Answered June 11, 2020",
            "views": "17",
            "upvotes": " Answer requested by Azura Rynain"
        }
    ]
}