{
    "title": "What determine the truth? - Quora",
    "tags": [
        "Absolute Truth",
        "Truth"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Donahue",
                "href": "/profile/Richard-Donahue-13"
            },
            "answer_text": "Almost two thousand years ago, Truth was put on trial and judged by people who were devoted to lies. In fact, Truth faced six trials in less than one full day, three of which were religious, and three that were legal. In the end, few people involved in those events could answer the question, “What is truth?” After being arrested, the Truth was first led to a man named Annas, a corrupt former high priest of the Jews. Annas broke numerous Jewish laws during the trial, including holding the trial in his house, trying to induce self-accusations against the defendant, and striking the defendant, who had been convicted of nothing at the time. After Annas, the Truth was led to the reigning high priest, Caiaphas, who happened to be Annas’s son-in-law. Before Caiaphas and the Jewish Sanhedrin, many false witnesses came forward to speak against the Truth, yet nothing could be proved and no evidence of wrongdoing could be found. Caiaphas broke no fewer than seven laws while trying to convict the Truth: (1) the trial was held in secret; (2) it was carried out at night; (3) it involved bribery; (4) the defendant had no one present to make a defense for Him; (5) the requirement of 2-3 witnesses could not be met; (6) they used self-incriminating testimony against the defendant; (7) they carried out the death penalty against the defendant the same day. All these actions were prohibited by Jewish law. Regardless, Caiaphas declared the Truth guilty because the Truth claimed to be God in the flesh, something Caiaphas called blasphemy. When morning came, the third trial of the Truth took place, with the result that the Jewish Sanhedrin pronounced the Truth should die. However, the Jewish council had no legal right to carry out the death penalty, so they were forced to bring the Truth to the Roman governor at the time, a man named Pontius Pilate. Pilate was appointed by Tiberius as the fifth prefect of Judea and served in that capacity A.D. 26 to 36. The procurator had power of life and death and could reverse capital sentences passed by the Sanhedrin. As the Truth stood before Pilate, more lies were brought against Him. His enemies said, “We found this man misleading our nation and forbidding to pay taxes to Caesar, and saying that He Himself is Christ, a King” (Luke 23:2). This was a lie, as the Truth had told everyone to pay their taxes (Matthew 22:21) and never spoke of Himself as a challenge to Caesar. After this, a very interesting conversation between the Truth and Pilate took place. “Therefore Pilate entered again into the Praetorium, and summoned Jesus and said to Him, ‘Are You the King of the Jews?’ Jesus answered, ‘Are you saying this on your own initiative, or did others tell you about Me?’ Pilate answered, ‘I am not a Jew, am I? Your own nation and the chief priests delivered You to me; what have You done?’ Jesus answered, ‘My kingdom is not of this world. If My kingdom were of this world, then My servants would be fighting so that I would not be handed over to the Jews; but as it is, My kingdom is not of this realm.’ Therefore Pilate said to Him, ‘So You are a king?’ Jesus answered, ‘You say correctly that I am a king. For this I have been born, and for this I have come into the world, to testify to the truth. Everyone who is of the truth hears My voice.’ Pilate said to Him, ‘What is truth?’” (John 18:33–38). Pilate’s question, “What is truth?” has reverberated down through history. Was it a melancholy desire to know what no one else could tell him, a cynical insult, or perhaps an irritated, indifferent reply to Jesus’ words? In a postmodern world that denies that truth can be known, the question is more important than ever to answer. What is truth? A Proposed Definition of Truth In defining truth, it is first helpful to note what truth is not: • Truth is not simply whatever works. This is the philosophy of pragmatism – an ends-vs.-means-type approach. In reality, lies can appear to “work,” but they are still lies and not the truth.  • Truth is not simply what is coherent or understandable. A group of people can get together and form a conspiracy based on a set of falsehoods where they all agree to tell the same false story, but it does not make their presentation true.  • Truth is not what makes people feel good. Unfortunately, bad news can be true.  • Truth is not what the majority says is true. Fifty-one percent of a group can reach a wrong conclusion.  • Truth is not what is comprehensive. A lengthy, detailed presentation can still result in a false conclusion.  • Truth is not defined by what is intended. Good intentions can still be wrong.  • Truth is not how we know; truth is what we know.  • Truth is not simply what is believed. A lie believed is still a lie.  • Truth is not what is publicly proved. A truth can be privately known (for example, the location of buried treasure). The Greek word for “truth” is aletheia, which literally means to “un-hide” or “hiding nothing.” It conveys the thought that truth is always there, always open and available for all to see, with nothing being hidden or obscured. The Hebrew word for “truth” is emeth, which means “firmness,” “constancy” and “duration.” Such a definition implies an everlasting substance and something that can be relied upon. From a philosophical perspective, there are three simple ways to define truth: 1. Truth is that which corresponds to reality. 2. Truth is that which matches its object. 3. Truth is simply telling it like it is. First, truth corresponds to reality or “what is.” It is real. Truth is also correspondent in nature. In other words, it matches its object and is known by its referent. For example, a teacher facing a class may say, “Now the only exit to this room is on the right.” For the class that may be facing the teacher, the exit door may be on their left, but it’s absolutely true that the door, for the professor, is on the right. Truth also matches its object. It may be absolutely true that a certain person may need so many milligrams of a certain medication, but another person may need more or less of the same medication to produce the desired effect. This is not relative truth, but just an example of how truth must match its object. It would be wrong (and potentially dangerous) for a patient to request that their doctor give them an inappropriate amount of a particular medication, or to say that any medicine for their specific ailment will do. In short, truth is simply telling it like it is; it is the way things really are, and any other viewpoint is wrong. A foundational principle of philosophy is being able to discern between truth and error, or as Thomas Aquinas observed, \"It is the task of the philosopher to make distinctions.\" Challenges to Truth Aquinas’ words are not very popular today. Making distinctions seems to be out of fashion in a postmodern era of relativism. It is acceptable today to say, “This is true,” as long as it is not followed by, “and therefore that is false.” This is especially observable in matters of faith and religion where every belief system is supposed to be on equal footing where truth is concerned. There are a number of philosophies and worldviews that challenge the concept of truth, yet, when each is critically examined it turns out to be self-defeating in nature. The philosophy of relativism says that all truth is relative and that there is no such thing as absolute truth. But one has to ask: is the claim “all truth is relative” a relative truth or an absolute truth? If it is a relative truth, then it really is meaningless; how do we know when and where it applies? If it is an absolute truth, then absolute truth exists. Moreover, the relativist betrays his own position when he states that the position of the absolutist is wrong – why can’t those who say absolute truth exists be correct too? In essence, when the relativist says, “There is no truth,” he is asking you not to believe him, and the best thing to do is follow his advice. Those who follow the philosophy of skepticism simply doubt all truth. But is the skeptic skeptical of skepticism; does he doubt his own truth claim? If so, then why pay attention to skepticism? If not, then we can be sure of at least one thing (in other words, absolute truth exists)—skepticism, which, ironically, becomes absolute truth in that case. The agnostic says you can’t know the truth. Yet the mindset is self-defeating because it claims to know at least one truth: that you can’t know truth. The disciples of postmodernism simply affirm no particular truth. The patron saint of postmodernism—Frederick Nietzsche—described truth like this: “What then is truth? A mobile army of metaphors, metonyms, and anthropomorphisms … truths are illusions … coins which have lost their pictures and now matter only as metal, no longer as coins.” Ironically, although the postmodernist holds coins in his hand that are now “mere metal,” he affirms at least one absolute truth: the truth that no truth should be affirmed. Like the other worldviews, postmodernism is self-defeating and cannot stand up under its own claim. A popular worldview is pluralism, which says that all truth claims are equally valid. Of course, this is impossible. Can two claims – one that says a woman is now pregnant and another that says she is not now pregnant – both be true at the same time? Pluralism unravels at the feet of the law of non-contradiction, which says that something cannot be both “A” and “Non-A” at the same time and in the same sense. As one philosopher quipped, anyone who believes that the law of non-contradiction is not true (and, by default, pluralism is true) should be beaten and burned until they admit that to be beaten and burned is not the same thing as to not be beaten and burned. Also, note that pluralism says that it is true and anything opposed to it is false, which is a claim that denies its own foundational tenet. The spirit behind pluralism is an open-armed attitude of tolerance. However, pluralism confuses the idea of everyone having equal value with every truth claim being equally valid. More simply, all people may be equal, but not all truth claims are. Pluralism fails to understand the difference between opinion and truth, a distinction Mortimer Adler notes: “Pluralism is desirable and tolerable only in those areas that are matters of taste rather than matters of truth.” The Offensive Nature of Truth When the concept of truth is maligned, it usually for one or more of the following reasons: One common complaint against anyone claiming to have absolute truth in matters of faith and religion is that such a stance is “narrow-minded.” However, the critic fails to understand that, by nature, truth is narrow. Is a math teacher narrow-minded for holding to the belief that 2 + 2 only equals 4? Another objection to truth is that it is arrogant to claim that someone is right and another person is wrong. However, returning to the above example with mathematics, is it arrogant for a math teacher to insist on only one right answer to an arithmetic problem? Or is it arrogant for a locksmith to state that only one key will open a locked door? A third charge against those holding to absolute truth in matters of faith and religion is that such a position excludes people, rather than being inclusive. But such a complaint fails to understand that truth, by nature, excludes its opposite. All answers other than 4 are excluded from the reality of what 2 + 2 truly equals. Yet another protest against truth is that it is offensive and divisive to claim one has the truth. Instead, the critic argues, all that matters is sincerity. The problem with this position is that truth is immune to sincerity, belief, and desire. It doesn’t matter how much one sincerely believes a wrong key will fit a door; the key still won’t go in and the lock won’t be opened. Truth is also unaffected by sincerity. Someone who picks up a bottle of poison and sincerely believes it is lemonade will still suffer the unfortunate effects of the poison. Finally, truth is impervious to desire. A person may strongly desire that their car has not run out of gas, but if the gauge says the tank is empty and the car will not run any farther, then no desire in the world will miraculously cause the car to keep going. Some will admit that absolute truth exists, but then claim such a stance is only valid in the area of science and not in matters of faith and religion. This is a philosophy called logical positivism, which was popularized by philosophers such as David Hume and A. J. Ayer. In essence, such people state that truth claims must either be (1) tautologies (for example, all bachelors are unmarried men) or (2) empirically verifiable (that is, testable via science). To the logical positivist, all talk about God is nonsense. Those who hold to the notion that only science can make truth claims fail to recognize is that there are many realms of truth where science is impotent. For example: • Science cannot prove the disciplines of mathematics and logic because it presupposes them. • Science cannot prove metaphysical truths such as, minds other than my own do exist. • Science is unable to provide truth in the areas of morals and ethics. You cannot use science, for example, to prove the Nazis were evil. • Science is incapable of stating truths about aesthetic positions such as the beauty of a sunrise. • Lastly, when anyone makes the statement “science is the only source of objective truth,” they have just made a philosophical claim—which cannot be tested by science. And there are those who say that absolute truth does not apply in the area of morality. Yet the response to the question, “Is it moral to torture and murder an innocent child?” is absolute and universal: No. Or, to make it more personal, those who espouse relative truth concerning morals always seem to want their spouse to be absolutely faithful to them. Why Truth is Important Why is it so important to understand and embrace the concept of absolute truth in all areas of life (including faith and religion)? Simply because life has consequences for being wrong. Giving someone the wrong amount of a medication can kill them; having an investment manager make the wrong monetary decisions can impoverish a family; boarding the wrong plane will take you where you do not wish to go; and dealing with an unfaithful marriage partner can result in the destruction of a family and, potentially, disease. As Christian apologist Ravi Zacharias puts it, “The fact is, the truth matters – especially when you’re on the receiving end of a lie.” And nowhere is this more important than in the area of faith and religion. Eternity is an awfully long time to be wrong. God and Truth During the six trials of Jesus, the contrast between the truth (righteousness) and lies (unrighteousness) was unmistakable. There stood Jesus, the Truth, being judged by those whose every action was bathed in lies. The Jewish leaders broke nearly every law designed to protect a defendant from wrongful conviction. They fervently worked to find any testimony that would incriminate Jesus, and in their frustration, they turned to false evidence brought forward by liars. But even that could not help them reach their goal. So they broke another law and forced Jesus to implicate Himself. Once in front of Pilate, the Jewish leaders lied again. They convicted Jesus of blasphemy, but since they knew that wouldn’t be enough to coax Pilate to kill Jesus, they claimed Jesus was challenging Caesar and was breaking Roman law by encouraging the crowds to not pay taxes. Pilate quickly detected their superficial deception, and he never even addressed the charge. Jesus the Righteous was being judged by the unrighteous. The sad fact is that the latter always persecutes the former. It’s why Cain killed Abel. The link between truth and righteousness and between falsehood and unrighteousness is demonstrated by a number of examples in the New Testament: • For this reason God will send upon them a deluding influence so that they will believe what is false, in order that they all may be judged who did not believe the truth, but took pleasure in wickedness” (2 Thessalonians 2:11–12, emphasis added). • “For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men who suppress the truth in unrighteousness” (Romans 1:18, emphasis added). • “who will render to each person according to his deeds; to those who by perseverance in doing good seek for glory and honor and immortality, eternal life; but to those who are selfishly ambitious and do not obey the truth, but obey unrighteousness, wrath and indignation” (Romans 2:6–8, emphasis added). • “[love] does not act unbecomingly; it does not seek its own, is not provoked, does not take into account a wrong suffered, does not rejoice in unrighteousness, but rejoices with the truth” (1 Corinthians 13:5–6, emphasis added). What is truth? - Conclusion The question Pontius Pilate asked centuries ago needs to be rephrased in order to be completely accurate. The Roman governor’s remark “What is truth?” overlooks the fact that many things can have the truth, but only one thing can actually be the Truth. Truth must originate from somewhere. The stark reality is that Pilate was looking directly at the Origin of all Truth on that early morning almost two thousand years ago. Not long before being arrested and brought to the governor, Jesus had made the simple statement “I am the truth” (John 14:6), which was a rather incredible statement. How could a mere man be the truth? He couldn’t be, unless He was more than a man, which is actually what He claimed to be. The fact is, Jesus’ claim was validated when He rose from the dead (Romans 1:4). There’s a story about a man who lived in Paris who had a stranger from the country come see him. Wanting to show the stranger the magnificence of Paris, he took him to the Louvre to see the great art and then to a concert at a majestic symphony hall to hear a great symphony orchestra play. At the end of the day, the stranger from the country commented that he didn’t particularly like either the art or the music. To which his host replied, “They aren’t on trial, you are.” Pilate and the Jewish leaders thought they were judging Christ, when, in reality, they were the ones being judged. Moreover, the One they convicted will actually serve as their Judge one day, as He will for all who suppress the truth in unrighteousness. Pilate evidently never came to a knowledge of the truth. Eusebius, the historian and Bishop of Caesarea, records the fact that Pilate ultimately committed suicide sometime during the reign of the emperor Caligula—a sad ending and a reminder for everyone that ignoring the truth always leads to undesired consequences. ",
            "date": "Answered May 7, 2019",
            "views": "384",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Linda Pettit",
                    "user_href": "/profile/Linda-Pettit"
                },
                {
                    "user_id": "Brett Passmore",
                    "user_href": "/profile/Brett-Passmore"
                }
            ]
        },
        {
            "author_info": {
                "name": "Burak Arıcı",
                "href": "/profile/Burak-Arıcı-1"
            },
            "answer_text": "Truths are determined in different fields and types in our lives. I classify truth into 7 categories: Daily TruthReligious and Moral TruthsIntersubjective TruthTechnical TruthScientific TruthMathematical TruthPhilosophical TruthDaily TruthDaily truths are located into our ordinary lives. To determine a daily truth, we use our everday experiences. If the weather is rainy, and seeing this, I say it is rainy, that which it is rainy is the truth. Religious and Moral TruthsWhat make those truth are faith, tradition, and culture, encoded into people’s background. There is a non-obvious acceptance. Intersubjective TruthThis is closely related to the previous category. To determine the truth, an acceptance is required. Money is one of the best examples of it. We all agree that money is valuable to purchase a product, but in reality, it is no more than a piece of paper or iron. Being valuable of a piece of paper is the truth so long as we accept this. Technical TruthHere, the indicator of the truth is usefulness. How a screwdriver is used in a useful way, for example, is a technical truth. Scientific TruthToday, as a method, falsifiability of a hypothesis or theory, asserted by Karl Popper, is generally accepted by academies to prove a scientific hypothesis or theory. If an assertion can be falsifiable, this is a scientific suggestion. After several tests, if this is not falsified and furthermore, new and adequate data supports the correctness of it, it is proved and becomes a scientific truth. Mathematical TruthMathematics consists of certain expressions and axioms, and compatible with itself. The truth is evaluated by mathematics, and coherent with other components of it. Philosophical TruthEvery philosophy tries to expound the truth by different explanations. Hence, inevitably, the truth becomes subjective. Philosophers generally use axioms, propositions, as well as logic to determine the truth consistent with other ingredients of theory, and the truth becomes truth in a philosophical system. ",
            "date": "Answered September 2, 2018",
            "views": "14",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ömer Faruk Gökan",
                    "user_href": "/profile/Ömer-Faruk-Gökan"
                },
                {
                    "user_id": "Michel Drake",
                    "user_href": "/profile/Michel-Drake"
                },
                {
                    "user_id": "Juan Rodriguez",
                    "user_href": "/profile/Juan-Rodriguez-1288"
                },
                {
                    "user_id": "Berkay Bıçakcı",
                    "user_href": "/profile/Berkay-Bıçakcı"
                },
                {
                    "user_id": "Dennis Sutherland",
                    "user_href": "/profile/Dennis-Sutherland-5"
                },
                {
                    "user_id": "Steven Hamlin",
                    "user_href": "/profile/Steven-Hamlin-1"
                },
                {
                    "user_id": "Osman BAHTİYAR",
                    "user_href": "/profile/Osman-BAHTİYAR"
                },
                {
                    "user_id": "Kurtoğlu",
                    "user_href": "/profile/Kurtoğlu"
                },
                {
                    "user_id": "Dino Fluri",
                    "user_href": "/profile/Dino-Fluri"
                }
            ]
        }
    ]
}