{
    "title": "What are universal traffic signs look like? - Quora",
    "tags": [
        "Road Signs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ciro Pabon",
                "href": "/profile/Ciro-Pabon"
            },
            "answer_text": "There are two “competing” standards, the European and the one from the Americas. European system: Vienna Convention on Road Signs and Signals Americas system: Inter-American Manual on Traffic Control Devices for Streets and Highways The European system is used in Europe and most of Asia. The Americas system is used in the Americas, Australia and New Zealand and some other countries. Of course, each country (usually) has a detailed manual applicable only for the country, but tries to respect as much as possible one of the two international standards to make easier (and safer) international travel. However, let me tell you, every time you cross a border, you will find traffic signals that will leave you stumped. What exactly does this thing mean?  ",
            "date": "Answered April 7, 2020",
            "views": "121",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Alexander",
                    "user_href": "/profile/David-Alexander-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elwood Beauchamp",
                "href": "/profile/Elwood-Beauchamp"
            },
            "answer_text": "Most all Universal Traffic Signs are Symbolized with a Circle, or Circle and a Slash across the Circle, and a silhouette of the person or thing it Allows or Prohibits. Attached is a sample and most every one is easily understood. There is a link to The British listing of these with explanations which is very good. https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/519129/know-your-traffic-signs.pdf Should you plan a visit to a foreign country, I advise to memorize as many as possible if you plan to drive upon arrival.  ",
            "date": "Answered January 27, 2018",
            "views": "472",
            "upvotes": "0"
        }
    ]
}