{
    "title": "What are rights and obligations? - Quora",
    "tags": [
        "Social Obligation",
        "Obligations",
        "Rights"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sirpa Kulonen",
                "href": "/profile/Sirpa-Kulonen"
            },
            "answer_text": "Every human being has or should have certain rights. He/she should be taken care of as child, nurtured and loved, have the right to go to school etc. Every human being has or should have the right to be treated with respect and as an unique person. Our obligation is to make this happen. Our duty is to treat other people (and ourselves) right: with understanding, acceptance and respect. Our obligation is to protect those who need help – be them mistreated, ill etc. These are the basic rights and obligations, I think. There are many others stemming from these. But without the basic ones the others get easily misunderstood and even misused. ",
            "date": "Answered May 14, 2017",
            "views": "39",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Visudi Kiso",
                    "user_href": "/profile/Visudi-Kiso"
                },
                {
                    "user_id": "Amy E. Brown",
                    "user_href": "/profile/Amy-E-Brown-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chad Zimmerman",
                "href": "/profile/Chad-Zimmerman-6"
            },
            "answer_text": "A right is something that you can do or not do if you choose to. An obligation is a duty to perform. You can have sex with anyone of legal age that will consent to it, that is your right. If you get married, you have an obligation to not cheat on your spouse. You still have the right to sleep with anyone you want, but you entered into an agreement where you said you would not do it. You have a duty to not cheat on your spouse now or you will pay the consequences of breaching that agreement. ",
            "date": "Answered December 4, 2019",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dheeraj Boppi",
                    "user_href": "/profile/Dheeraj-Boppi"
                },
                {
                    "user_id": "Aaron Chen",
                    "user_href": "/profile/Aaron-Chen-193"
                },
                {
                    "user_id": "Keerthi Suresh",
                    "user_href": "/profile/Keerthi-Suresh-40"
                }
            ]
        }
    ]
}