{
    "title": "What are some examples where philosophy meets science? - Quora",
    "tags": [
        "Philosophy of Life",
        "Philosophy of Physics",
        "Philosophy of Science",
        "Philosophers",
        "Science of Everyday Life",
        "Philosophy",
        "Science",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mass Usuf",
                "href": "/profile/Mass-Usuf"
            },
            "answer_text": "There are three types of knowledgeable people….the philosopher, the scientist and the artist. Their traits never mingle with each other. The philosopher cannot observe like a scientist would…………….he only thinks on lines of logic and reasoning. Nor can he be imaginative like the artist! The scientist can never be imaginative like an artist nor can he philosophise as his primary motive is to observe and record. The artist is free of all shackles……….he can paint what he wants, sculpt what he desires, engage in poesy! They are all trapped and wallow in the morass of ‘knowledge’. Only the artist has the possibility of becoming ‘intelligent’…………and, therefore, different! That is because he is not contained by the fetters that bind the philosopher and the scientist! ",
            "date": "Answered June 6, 2019",
            "views": "661",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Khuram Rafique",
                    "user_href": "/profile/Khuram-Rafique"
                },
                {
                    "user_id": "Aaron Lipner",
                    "user_href": "/profile/Aaron-Lipner-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Brocklehurst",
                "href": "/profile/Paul-Brocklehurst-2"
            },
            "answer_text": "Can you provide some examples where philosophy meets science? No because philosophy is based on opinion but science is based on evidence. Sometimes a philosophical opinion attains evidence at which point it becomes science. ",
            "date": "Answered June 6, 2019",
            "views": "26",
            "upvotes": "0"
        }
    ]
}