{
    "title": "What are some good arguments against universal healthcare? - Quora",
    "tags": [
        "Libertarianism (politics)",
        "Health Care Policy",
        "Arguments and Argumentation",
        "Political Conservatism",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Critelli",
                "href": "/profile/Michael-Critelli"
            },
            "answer_text": "There are no arguments against giving everyone access to some level of care. The debate is always about how much care, for what, by whom, with what kind of standards of care relative to time delays, and who controls access to specialists. If we think of a continuum in which one extreme is that everyone can get as much care as they want anytime from anyone they choose as soon as they can and that they control access, not a primary care physician, this would an unaffordable system. For example, the US insurance plans do not cover purely cosmetic surgeries, including vision correction surgeries (popularly referred to as Lasik surgeries). Brazil routinely covers cosmetic surgery as a basic feature in its health plans. The US does not cover what it calls “experimental” healthcare processes, drugs, or diagnostic processes. In effect, even a promising therapy, up until recently, would not be covered if it had not been approved by the FDA. Recently, this standard has been loosened for terminally ill patients who have exhausted all approved therapies. We mandate coverage in some states for fertility treatments, even though these are not traditionally considered treatments to address illnesses, injuries, or diseases. These treatments add cost. They are covered because of strong advocacy by special interest groups. We have tried to control healthcare costs by narrowing provider networks, but leave many people without access to best-in-class treatments that are only available outside of the network. We allow the most aggressive therapies that someone wants, such as surgeries or high-cost specialty drugs when a more conservative treatment might be better for the patient. In other countries, for example, a person recovering from surgery would not receive a prescription opioid, but would be required to take over-the-counter pain relievers. The question of what is adequate hospital care varies. When my son was hospitalized in Italy, he was in a semi-private room. Many American hospitals now have only private rooms. Does universal care include the right to a private room when someone is hospitalized? That is the kind of question we would need to address. In many countries, primary care physicians must refer patients to a specialists. In the US, we do not control specialist access, except in a few plans. We tried that more broadly in the early 1990’s, through health maintenance organizations, and the political fallout caused Congress to pull back on it. In the US, we would want someone needing hip replacement surgery who is in severe pain to get access to surgery as soon as he or she can be ready. In Canada, the waiting time might be several months. In the US, we would not stop someone and his or her loved ones from keeping a 95-year-old with no hope of recovery in intensive care in a hospital. In another country, the patient would be steered into hospice care, often at home. In short, no one would deny the right of all citizens to get healthcare that is needed, but the fundamental question is what that means. Other countries manage to secure universal care by compromising on many practices that would not be politically palatable in the United States. As a society, we have to make difficult choices to pull back on this unlimited right to care, which ends up making care unaffordable for too many people. Today, we give Americans lower premiums, but have made deductibles so high that their annual out-of-pocket costs are punitively high. Ultimately, we need to be healthier and use the healthcare system more selectively. Insurance plans need to reward people who do that, and bring overall system costs down for everyone. ",
            "date": "Answered August 3, 2018",
            "views": "18",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lauren Michelle",
                    "user_href": "/profile/Lauren-Michelle-1"
                },
                {
                    "user_id": "Cryptzog Stickybumps",
                    "user_href": "/profile/Cryptzog-Stickybumps"
                },
                {
                    "user_id": "Adithya Anand",
                    "user_href": "/profile/Adithya-Anand-14"
                },
                {
                    "user_id": "Alvin Rodriguez",
                    "user_href": "/profile/Alvin-Rodriguez-3"
                },
                {
                    "user_id": "Caroline Epner",
                    "user_href": "/profile/Caroline-Epner"
                },
                {
                    "user_id": "Laura Wrzeski",
                    "user_href": "/profile/Laura-Wrzeski"
                },
                {
                    "user_id": "John Pilger",
                    "user_href": "/profile/John-Pilger-1"
                },
                {
                    "user_id": "Will Pasto",
                    "user_href": "/profile/Will-Pasto"
                },
                {
                    "user_id": "Derrik Pates",
                    "user_href": "/profile/Derrik-Pates"
                },
                {
                    "user_id": "Scott Welch",
                    "user_href": "/profile/Scott-Welch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Drew Henry",
                "href": "/profile/Drew-Henry-2"
            },
            "answer_text": "There are a few arguments against universal healthcare, from a libertarian perspective. The first follows from the non-aggression principle (assuming you believe in such a principle). Universal healthcare is provided or paid for by the government, i.e. it is funded via taxation which is non-voluntary, i.e. it violates the non-aggression principle. The second is exclusive to the United States and follows from the 10th Amendment and the purpose of the states. Healthcare is a state issue, not a federal one. If you would like universal healthcare, you should be petitioning your state government, not the federal government. The third follows from necessity. The free market has already provided a solution (multiple solutions, actually, but this one is the most prominent) to the problem of catastrophe risk. That solution is health insurance and the Occam's razor of libertarianism says that given two solutions to the same problem, you choose the one that doesn't rely on government and doesn't violate NAP. Of course, government involvement in health insurance and the healthcare industry in general has greatly reduced the effectiveness of health insurance in solving this problem. The fourth follows from cost. Government services are provided buffet style (for a one time payment, you can use all the services that you want) which inevitably increase use of services relative to pay-per-use services. Government bureaucracy and lack of competition also tend to inflate the cost of services (and often to prevent innovation of those services as well). I will concede, though, that there are additional arguments to be had (by economists and actuaries, not by me) about the efficacy of preventive care. If it can be shown that healthcare is cheaper, on average, with insurance than with universal care, then insurance is the better solution. As for the less affluent, implementing universal healthcare for the sake of a small minority of people that allegedly may not be able to afford health insurance is equivalent to killing an ant with a sledgehammer, as the saying goes. The fifth follows from allocation of resources. Healthcare is scarce and will increase infinitely in cost before you reach the maximum amount of care possible. Where you draw the line is, ultimately, arbitrary (between emergency care, preventive care, etc.). In a free market society, you get what you can pay for (or what your insurance policy covers), or what altruism will offer you. That may sound harsh (do keep in mind, though, that if people weren't altruistic then there wouldn't be any push for universal healthcare to begin with; also see my earlier point about ants and sledgehammers), but it works (cost doesn't run amok and demand doesn't dwarf supply). The sixth follows from the ineffectiveness of government. The government, the U.S. government at least, isn't very good at doing things. If something can be done without getting the U.S. government involved, then the best course of action is usually to not get the U.S. government involved. The seventh follows from distrust of government. Government has a lot of power and history shows that government likes to abuse that power. A lot of people don't like the idea of trusting the government (or, more generally, a single entity, i.e. a monopoly) with their health. ",
            "date": "Updated June 28, 2017",
            "views": "36",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joel Goodman",
                    "user_href": "/profile/Joel-Goodman-27"
                },
                {
                    "user_id": "James Macatangay",
                    "user_href": "/profile/James-Macatangay-1"
                },
                {
                    "user_id": "William Jones",
                    "user_href": "/profile/William-Jones-208"
                },
                {
                    "user_id": "Ramiroramiro Fabrica",
                    "user_href": "/profile/Ramiroramiro-Fabrica"
                },
                {
                    "user_id": "Terry Rick",
                    "user_href": "/profile/Terry-Rick"
                },
                {
                    "user_id": "Liora Alizade",
                    "user_href": "/profile/Liora-Alizade"
                },
                {
                    "user_id": "Josh Yates",
                    "user_href": "/profile/Josh-Yates-25"
                },
                {
                    "user_id": "Chaim M. Zishe Hanstater",
                    "user_href": "/profile/Chaim-M-Zishe-Hanstater"
                },
                {
                    "user_id": "Tim Welles",
                    "user_href": "/profile/Tim-Welles"
                },
                {
                    "user_id": "Forest Du",
                    "user_href": "/profile/Forest-Du"
                }
            ]
        }
    ]
}