{
    "title": "What comes to your mind when you hear the word 'philosophy'? - Quora",
    "tags": [
        "Words",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joseph Petrick",
                "href": "/profile/Joseph-Petrick-3"
            },
            "answer_text": "When I hear the word “philosophy,” I think of its etymological derivation from the Greek, “love of wisdom.” It is different and more profound than “philology,” that is essentially “love of words;” it is different and more modest than “theosophy,” that is essentially the claim of “divine wisdom.” Philosophy is the secular pursuit of wisdom in the western and non-western worlds that has occurred over the centuries. The study of philosophy deals with the evidence and arguments for the logically foundational beliefs about what is real, true and valuable in order to understand and improve the human condition. Philosophy provides a critical perspective on the limits of lives devoted to the love of power, the love of wealth, the love of fame, the love of sensual pleasure, and even the love of knowledge. Philosophy can provide guidance regarding decisions about the future, critical analysis of past decisions from which to learn and insightful appreciation of the experience of the present. Leaders who have not studied philosophy deeply usually end up unconsciously living out some dead philosopher’s philosophy of life. Often they fall prey to the love of power or the love of wealth or the love of fame and neglect the development of leadership wisdom that addresses the needs of multiple stakeholders and improves the human condition. ",
            "date": "Answered October 24, 2020",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tadziu Johnson",
                "href": "/profile/Tadziu-Johnson"
            },
            "answer_text": "I think of guidelines. Root word meanining “lover of wisdom” and certainly the philosopher loves learning, as Socrates tells in Plato’s The Republic Book II. I think of it as a law or moral, but it is superior to both those things. It is better because it provides for understanding. See in the traditional sense of moral or ethics, its adherence to the cultural sentiment, but a lot of times that moral is not well understood. So, gray area behavior is sometimes unfairly persecuted or changes the culture for the worse. In law, especially in law that is not important to the culture, anything can be used to argue it. With a philosophy, there is understanding. When things don't follow an ideal, you know where to bend and how to adjust. If a mechanic fixing a car follows moral (without question) he says “I can't fix the car because it's not right. You have to get a new motor.” The other mechanic who lets law govern (without question) says, “you maybe, could, fix it, the law is to get a new motor.” A mechanic that follows philosophy says, “I can fix it, but I shouldn't because of the potential to go wrong again, not to mention it's illegal because it's unsafe.” Maybe owner of the vehicle comes to the same conclusion with each person. The difference is, the choice made after developing a proper philosophy is more wise. It's more informed, and if they decide to proceed, they know the risk, and you're fully prepared. ",
            "date": "Answered August 1, 2016",
            "views": "219",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Reyje Donxque",
                    "user_href": "/profile/Reyje-Donxque"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bryer Sophia-Gardener",
                "href": "/profile/Bryer-Sophia-Gardener"
            },
            "answer_text": "Human beings have the unique ability to engage in long range planning. Consequently, we can either work on providing ourselves the best answer to the question, \"How should I live my life,\" or we can ignore the question. \"Philosophy\", a word coined by Socrates or Plato, was intended by them to mean the loving pursuit of genuine wisdom. In other words, Philosophy is the systematic search for the best answer to the question, \"How should I live my life\" undertaken with the passion that arises when one understands that a good answer to this question is the cornerstone of a well lived life: a good life. Understood in this way, a person engaged in Philosophy experiences it in a way that is similar to the joy of eating a highly nutritious and delicious meal. Thanks to the variety of issues, it is a joy that never grows old. It is also like the joy of designing and building a wonderful home. This home being designed is the one called \"mind\". It is the home we spend our entire lives in. It is a joy that is not only artistic, and intellectual, but also social, because it turns out that good answers to the question, \"How should I live my life\" are fully entertained with good answers to the question, \"How should we live our lives together.\" A philosophical life is any life in which the systematic pursuit of good answers to these questions has risen to a place of prominence. At the heart of the philosophical life is a paradox. To systematically pursue our two leading questions, we need to answer the question, \"How should we understand the word \"should\"? It would seem that we must already have the answer to the question in order to develop an answer it. But, that would seem to mean that any answer would be tainted by errors in our pre-existing assumptions about what \"should\" should mean. The resolution of this paradox is to be found in what has been called \"dialectic\". Our idea of \"should\" is not frozen. It develops. We are creators designing the basic terms of our life (like our idea of \"should\") based on situations we have been given. Included in those situations are prior understandings of \"should\". Those prior understandings do not imprison us, but guide us toward better, even more useful, understandings. Thus, the idea \"should\" has a history. We have been creatively negotiating with each other about it from the dawn of history, and we have succeeded in developing a more useful concept. One proof of our success can be found in the extraordinary reduction in violence that has occurred during human history which has been documented by Steven Pinker in The Better Angels of our Nature. Philosophy is not properly understood as a limited enterprise or academic discipline. It is an all encompassing way of organizing life through an at least partially reflective project of planning how to make our human lives better. It draws on all of the academic disciplines, not only the one we call \"Philosophy\". ",
            "date": "Answered August 6, 2017",
            "views": "475",
            "upvotes": " View 27 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ichimay Deul",
                    "user_href": "/profile/Ichimay-Deul"
                },
                {
                    "user_id": "Leo John",
                    "user_href": "/profile/Leo-John-106"
                },
                {
                    "user_id": "Ken Paulo Villazur",
                    "user_href": "/profile/Ken-Paulo-Villazur"
                },
                {
                    "user_id": "Crystal Mae Lacasandile",
                    "user_href": "/profile/Crystal-Mae-Lacasandile"
                },
                {
                    "user_id": "Mia Daguplo",
                    "user_href": "/profile/Mia-Daguplo"
                },
                {
                    "user_id": "Manuela Escobar",
                    "user_href": "/profile/Manuela-Escobar-9"
                },
                {
                    "user_id": "Sed Jos Sta Maria",
                    "user_href": "/profile/Sed-Jos-Sta-Maria"
                },
                {
                    "user_id": "Mariel Agao",
                    "user_href": "/profile/Mariel-Agao"
                },
                {
                    "user_id": "Shianne Rhyl",
                    "user_href": "/profile/Shianne-Rhyl-1"
                },
                {
                    "user_id": "Julie Ann Camacho",
                    "user_href": "/profile/Julie-Ann-Camacho-2"
                },
                {
                    "user_id": "RICKY JR. SALAZAR",
                    "user_href": "/profile/RICKY-JR-SALAZAR"
                },
                {
                    "user_id": "Frank Vincent Bernas",
                    "user_href": "/profile/Frank-Vincent-Bernas"
                },
                {
                    "user_id": "Bianca Abellar",
                    "user_href": "/profile/Bianca-Abellar"
                },
                {
                    "user_id": "Marichan Corbita",
                    "user_href": "/profile/Marichan-Corbita-1"
                },
                {
                    "user_id": "Thea Angela Rosario",
                    "user_href": "/profile/Thea-Angela-Rosario"
                },
                {
                    "user_id": "Crys Tel",
                    "user_href": "/profile/Crys-Tel-3"
                },
                {
                    "user_id": "Mark Joseph Bangcaya",
                    "user_href": "/profile/Mark-Joseph-Bangcaya"
                },
                {
                    "user_id": "Edrian Antonio",
                    "user_href": "/profile/Edrian-Antonio"
                },
                {
                    "user_id": "Lynn Lockhart",
                    "user_href": "/profile/Lynn-Lockhart-4"
                },
                {
                    "user_id": "Niel Tarinay",
                    "user_href": "/profile/Niel-Tarinay"
                },
                {
                    "user_id": "Erian Abayon",
                    "user_href": "/profile/Erian-Abayon"
                },
                {
                    "user_id": "Ronaliza Javier",
                    "user_href": "/profile/Ronaliza-Javier-2"
                },
                {
                    "user_id": "Mary Melody Saraos",
                    "user_href": "/profile/Mary-Melody-Saraos"
                },
                {
                    "user_id": "Niks Briones",
                    "user_href": "/profile/Niks-Briones"
                },
                {
                    "user_id": "Unday Brunday",
                    "user_href": "/profile/Unday-Brunday"
                },
                {
                    "user_id": "Daniela Escuadro",
                    "user_href": "/profile/Daniela-Escuadro"
                },
                {
                    "user_id": "Sharmaine Tibi",
                    "user_href": "/profile/Sharmaine-Tibi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Cuminale",
                "href": "/profile/Robert-Cuminale"
            },
            "answer_text": "I tend to agree with Bea Arthur in Mel Brooks’ “History Of The World Pt 1. Mel Brooks comes to pick up his unemployment money. Arthur asks him what he does for a living he answers, “Stand up philosopher.” She writes down, “Bull Shitter.” Philosophy talks a good deal about hypothetical situations but never seems to come to a conclusion. It’s like talking to my attorney or accountant. I ask a question and I get a number of choices but in the end I have to choose one. And no philosophy seems to present a system in actual operation but you have to borrow from others to form a system you can agree with. For instance I like Free Market Capitalism but realize it needs some degree of regulation or we’d be eating bread made with a measure of sawdust mixed into the dough. Socialism produces nothing and ends up eating all the capital until it’s bankrupt. Libertarianism tends to selfishness with the individual being a power unto himself and incapable of existing in a society. So I think the only solution is an amalgam of the three to form a fourth system that tries to avoid the extremes. I believe it was Hegel who posited that theses produce antitheses which produce more theses infinitely. And the bullshitting continues. ",
            "date": "Answered June 9, 2019",
            "views": "98",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lynn Lockhart",
                    "user_href": "/profile/Lynn-Lockhart-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lola Bode",
                "href": "/profile/Lola-Bode"
            },
            "answer_text": "Atheism The believe that God does not exist. When people come across me as a Philosophy student and ask “Hey Sis, what are you studying? ‘ philosophy ‘ oh! So you don't believe. God exist.” Just as most people has programmed their mind that all snakes are harmful to the extent that some one will pull over, kill a lost snake just looking for insects to feed on, enter his car and drive off feeling like he just saved a life. There are still few out there who think Philosophy is not all about God does not exist. To those few, I owe you an handshake. And to those whose mind has been programmed, you should know that philosophy will not tell you that ‘ God does not exist’ Philosophy will say if you believe God exist, prove it. If you claim God does not exist, Prove it rationally. We have people who know nothing about philosophy that are atheist. And we have philosophers like Rene Descartes, Spinoza, Liebniz and others who argued for the existence of God. ",
            "date": "Answered February 12, 2018",
            "views": "74",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ryan Q.Y. See",
                "href": "/profile/Ryan-Q-Y-See"
            },
            "answer_text": "Philosophy? It’s…dialectic, the art of learning how to learn, how to logic, how to be rational. Arguments about arguments, not personal attacks (i.e. ad hominem). Also the history of thoughts about thought, recursions about recursion, and ideas of the world and nature, internal and external. Greek in particular, I’ve got the Platonic Cycle somewhere that I really need to get stuck into. I know that I know nothing, and nothing I know is so much as more nothing dressed up as something, and that something I know because someone taught me is something that I know, because I have a tendency to commit ignorance and double ignorance very often. Although the word “philosophy” itself mostly just reminds me that I have reading to do and a society of philosophers I need to learn about, so I can raise points every now and then and hopefully learn more about knowing something instead of nothing, and perform double ignorance less. ",
            "date": "Answered June 29, 2017",
            "views": "185",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mary Jane Domanico",
                    "user_href": "/profile/Mary-Jane-Domanico"
                },
                {
                    "user_id": "Agam James",
                    "user_href": "/profile/Agam-James"
                },
                {
                    "user_id": "Hannah Mae Oflas",
                    "user_href": "/profile/Hannah-Mae-Oflas"
                },
                {
                    "user_id": "Robby Shima",
                    "user_href": "/profile/Robby-Shima"
                },
                {
                    "user_id": "Just Kips",
                    "user_href": "/profile/Just-Kips"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martti Suomivuori",
                "href": "/profile/Martti-Suomivuori"
            },
            "answer_text": "Unfortunately, in the world of today, it means ‘cop out’. The Western Civilization (thank you mr, Gandhi, it does exist)Is polarizing to an extreme. We have robots landing on distant planets. We re-edit our genome. We do spare body parts to replace worn-out joints and cardiac valves. blocked arteries are reopened and replaced by grafts. A retinal implant is in progress. Retroviruses have been tamed to treat mucoviscidosis. So many mortal epidemics have been ended by the use of insecticides, antibiotics, early diagnostics, and vaccinations. Where are the philosophers? At the same time when the whole idea of democracy is being questioned by external forces and its own shortcomings, what are the philosophers offering as a replacement? Silence. For the first time ever in the history of humankind, even the poor have access to knowledge on the Internet. Also, the craziest people find their kin and organize, The futility of the mainstream media becomes evident as streaming videos from the hotspots of the world show us what they do not want to acknowledge at all. All these changes. They are deeply philosophical changes.But where are the philosophers?What is their contribution? Even stand-up comedians and YouTube with its PewDiePie and the Dark Web self-appointed know-alls have deeper input to the deep questions of modern everyday life than anything coming from the Academy. Popper taught the scientists how to question, how to falsify. Good.Only that nobody is telling us what to appreciate.The philosophers leave that question to be answered by entertainers and the Big Money, old and new. Not to be. That is the answer. ",
            "date": "Answered December 23, 2018",
            "views": "78",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lynn Lockhart",
                    "user_href": "/profile/Lynn-Lockhart-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Adkison",
                "href": "/profile/Andrew-Adkison-2"
            },
            "answer_text": "How much I appreciate my imagination, its literally my best friend and I have great friends. Honestly, though an old book called “Worlds of Existentialism” a good friend of mine had in his apartment at college. I was introduced to the philosophy side of Kafka, heard of Sartre for the first time a couldn't make it through a one paragraph excerpt from his most notable essay on existentialism. That book is the first association that is personal to me, I mean everyone probably thinks of Socrates, Plato an em' getting drunk having a symposium or something but I knew that wasn't what you wanted. ",
            "date": "Answered June 25, 2018",
            "views": "53",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gerald Pierson",
                "href": "/profile/Gerald-Pierson"
            },
            "answer_text": "“What comes to your mind when you hear the word philosophy? And why?” It depends on the context. The word on its own could invoke thoughts of the theory of knowledge, my immediate philosophical interest, the way the broader word “law” will immediately bring to mind my working interest in torts. If someone says they have an “interest in philosophy,” I mentally pause until I get more information. The phrase could describe a professional philosopher who wrote her dissertation on Kant’s Grundlegung zur Metaphysik der Sitten, a well-educated Christian who seeks refuge from his doubt in Wittgenstein’s fideism, any number of folks who really grok Ayn Rand or Robert Pirsig, to true believers in esoteric doctrines from tarot to Kabbalah. ",
            "date": "Answered June 6, 2019",
            "views": "233",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ernie Herrera Jr",
                    "user_href": "/profile/Ernie-Herrera-Jr"
                },
                {
                    "user_id": "Shaira Mae Dicdiquin",
                    "user_href": "/profile/Shaira-Mae-Dicdiquin"
                },
                {
                    "user_id": "Nica Joyce Arceño",
                    "user_href": "/profile/Nica-Joyce-Arceño"
                },
                {
                    "user_id": "April Jullana Digap",
                    "user_href": "/profile/April-Jullana-Digap"
                },
                {
                    "user_id": "Elsa Kristian",
                    "user_href": "/profile/Elsa-Kristian"
                },
                {
                    "user_id": "Jennie Balfour",
                    "user_href": "/profile/Jennie-Balfour-1"
                },
                {
                    "user_id": "Michael Willhoite",
                    "user_href": "/profile/Michael-Willhoite-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan Roessler",
                "href": "/profile/Ryan-Roessler"
            },
            "answer_text": "Deeper than a set of rules, but that being said, a way of interpreting the things that happen to you in life that gives you some grounding to deal w them. The death of a child, your mortality. Robert Kennedy read the greek philosophers to deal w the death of his brother JFK. How to live a rich and full life and yet live honorably could also be a definition of philosophy. That might be the kind taught in college but it wouldn't be our current President’s philosophy. In fact when an aid was asked what his international view was he replied “ we’re America, bitch!” not a pleasant philosophy but certainly it is one and explains his whole philosophy in life. Not one I agree with, but it did take him all the way into the oval office. ",
            "date": "Answered June 23, 2018",
            "views": "4",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pratik Hiray",
                "href": "/profile/Pratik-Hiray"
            },
            "answer_text": "Philosophy for me is a good poem that resonates with my heart. Philosophy for me is good music that makes you sing along. Philosophy for me is good discussions wherein you have something to contribute. Philosophy for me is my work where I get pushed to new boundaries everyday. Philosophy for me is the deep conversation with my grandma deciphering life. Philosophy for me is myself and the infinite universe inside me that knows no bound. ",
            "date": "Answered October 18, 2017",
            "views": "526",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Princess Dianne Prado",
                    "user_href": "/profile/Princess-Dianne-Prado"
                },
                {
                    "user_id": "Anna Mae Tanoy",
                    "user_href": "/profile/Anna-Mae-Tanoy"
                },
                {
                    "user_id": "Charish Segovia",
                    "user_href": "/profile/Charish-Segovia"
                },
                {
                    "user_id": "Lynn Lockhart",
                    "user_href": "/profile/Lynn-Lockhart-4"
                },
                {
                    "user_id": "Mary Melody Saraos",
                    "user_href": "/profile/Mary-Melody-Saraos"
                },
                {
                    "user_id": "Jana Marie Rodriguez",
                    "user_href": "/profile/Jana-Marie-Rodriguez"
                },
                {
                    "user_id": "Meyah Pelobello",
                    "user_href": "/profile/Meyah-Pelobello"
                },
                {
                    "user_id": "Theresa Sotto",
                    "user_href": "/profile/Theresa-Sotto-2"
                },
                {
                    "user_id": "Rodge Ensila",
                    "user_href": "/profile/Rodge-Ensila"
                },
                {
                    "user_id": "Rayyan Ali",
                    "user_href": "/profile/Rayyan-Ali-18"
                },
                {
                    "user_id": "Suyog Darde",
                    "user_href": "/profile/Suyog-Darde"
                },
                {
                    "user_id": "Jan Layton",
                    "user_href": "/profile/Jan-Layton"
                },
                {
                    "user_id": "Priyal Batheja",
                    "user_href": "/profile/Priyal-Batheja"
                },
                {
                    "user_id": "Eeshan Deshpande",
                    "user_href": "/profile/Eeshan-Deshpande"
                },
                {
                    "user_id": "Rimpi Sharma",
                    "user_href": "/profile/Rimpi-Sharma"
                },
                {
                    "user_id": "Aman Virani",
                    "user_href": "/profile/Aman-Virani-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandy Perlmutter",
                "href": "/profile/Sandy-Perlmutter"
            },
            "answer_text": "WARNING: This is purely a personal set of ideas. I used to read a lot of philosophy when I was in high school. I stopped at that point. When natural philosophy became science, I took the science fork. I still read the interesting articles in the Times: The Stone My younger brother seems to have joined a cult called the School of Practical Philosophy. It is not as lethal as Scientology, but it did take over his life for a while. He was always doing work for them, his wife also. School of Philosophy & the SES ",
            "date": "Answered June 27, 2017",
            "views": "62",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nairah Boco",
                    "user_href": "/profile/Nairah-Boco-1"
                },
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                },
                {
                    "user_id": "Jonathan Buttall",
                    "user_href": "/profile/Jonathan-Buttall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Thompson",
                "href": "/profile/Nathan-Thompson-65"
            },
            "answer_text": "“Usefulness,” or “Point?” are usually the first two, because those are ultimately what you are looking for in the era of pretentious wannabes. You want to judge a piece based on its efficacy toward which goal(s) its author wants to be useful. Beyond that, some philosophy is bitterly self evident while still others are completely devoid of a point. If an author can’t get to his thesis point within a few pages, I’m usually on to better subjects. (Obviously I have more patience within a literary novel, who are meant to grab you anywhere from 50–100 page marker at the earliest). If we’re talking about letter format, you’d probably have to read all of them to get to the ultimate point…I’d strongly suggest hearing any author out or confronting them only AFTER you have taken in all sources you can find on the given subject… ",
            "date": "Answered December 3, 2018",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tricia Labrie",
                "href": "/profile/Tricia-LaBrie"
            },
            "answer_text": "Humm. Almost passed this up as I tend to lean towards the spiritual rather than the philosophical. I think about thought and being able to have thoughts about subjects based on your maturity, experiences, information gathered over years and somewhat the mind. I believe we can be too anything and this is one of them. Being too philosophical is not good. Hitting a balance is worthwhile. There were/are folks that sit around for hours and hours and wax philosophical. ",
            "date": "Answered June 29, 2017",
            "views": "4",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "B",
                    "user_href": "/profile/B-659"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shane Butcher",
                "href": "/profile/Shane-Butcher"
            },
            "answer_text": "For me, philosophy is a way of looking at things from various view points. Its about seeing the connection to other areas and an understanding of the connection between mind, body and spirit. We learn from lifes lessons and it can be as simple as turning your back to a wave on the shore. It may catch you off guard and knock you off your feet. You can swear and curse at what just happened or spit the sand out of you mouth and say “ That will teach me to turn my back on the sea “. You understand what happened was from your own actions, you became compacent with nature and it gave youva wake up call to pay attention. That understanding is apart of the philosphical thinking. ",
            "date": "Answered June 27, 2017",
            "views": "39",
            "upvotes": " Answer requested by Alexander Zynex Aparte",
            "upvoters": [
                {
                    "user_id": "Reden Villavelez",
                    "user_href": "/profile/Reden-Villavelez"
                },
                {
                    "user_id": "Natalia Popova",
                    "user_href": "/profile/Natalia-Popova"
                },
                {
                    "user_id": "Sohail Ahmed",
                    "user_href": "/profile/Sohail-Ahmed-7"
                },
                {
                    "user_id": "Tracy Calder",
                    "user_href": "/profile/Tracy-Calder"
                },
                {
                    "user_id": "Akshay Pratap Shandilya",
                    "user_href": "/profile/Akshay-Pratap-Shandilya"
                },
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                },
                {
                    "user_id": "Jim Cejka",
                    "user_href": "/profile/Jim-Cejka"
                },
                {
                    "user_id": "Barbara Carleton",
                    "user_href": "/profile/Barbara-Carleton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohamed Tamer",
                "href": "/profile/Mohamed-Tamer-21"
            },
            "answer_text": "probably over thinking, but we can say it's not always negative.. Indeed philosophy is a shpe of over thinking, but can you deney that it has been useful to all of us mere moderate thinking humans, without philosophy which we will agree to call positive over thinking, we wouldn't have probably reached all modern democracy and laws, we may couldn't have reached to all modern scientifical theories as well. ",
            "date": "Answered June 6, 2018",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bennett W. Nelson",
                "href": "/profile/Bennett-W-Nelson"
            },
            "answer_text": "Thoughts, possibilities, plans, theories constructed to explore obscurities. Philosophy is a way to connect the known in ways to better understand and (maybe) find a path to solutions. ",
            "date": "Answered November 9, 2013",
            "views": "57",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rodge Ensila",
                    "user_href": "/profile/Rodge-Ensila"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raghav Watts",
                "href": "/profile/Raghav-Watts-1"
            },
            "answer_text": "This is usually confused by another word “psychology\", though both are about human behaviour but: Psychology - is the study of human mind and to seek every possible dimensions in it. Philosophy - mingles with only one aspect of human behavior. That difference strikes my mind because it is very vague yet unique. ",
            "date": "Answered June 23, 2018",
            "views": "25",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gale Bruce",
                    "user_href": "/profile/Gale-Bruce"
                },
                {
                    "user_id": "Dominic Antigua",
                    "user_href": "/profile/Dominic-Antigua-1"
                },
                {
                    "user_id": "Oanh Nguyen - NOAA Federal",
                    "user_href": "/profile/Oanh-Nguyen-NOAA-Federal"
                },
                {
                    "user_id": "Christopher Weaver",
                    "user_href": "/profile/Christopher-Weaver-7"
                },
                {
                    "user_id": "Abhiraj Singh",
                    "user_href": "/profile/Abhiraj-Singh-105"
                },
                {
                    "user_id": "Milind Avirash",
                    "user_href": "/profile/Milind-Avirash"
                },
                {
                    "user_id": "Chandrika Deb",
                    "user_href": "/profile/Chandrika-Deb-1"
                },
                {
                    "user_id": "Bishwajit Adhikary",
                    "user_href": "/profile/Bishwajit-Adhikary"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rey Blanco",
                "href": "/profile/Rey-Blanco"
            },
            "answer_text": "The syllables as sensible expressions forming a “unity” of meaning, in this case, “love of wisdom.” If it were “theosophy,” the syllables would reference “wisdom of ‘God’” as another example. The “reaction” is subjective because some people may nod in appreciation, while others might nod in disapproval. ",
            "date": "Answered November 13, 2019",
            "views": "21",
            "upvotes": " Answer requested by Mac Mac",
            "upvoters": [
                {
                    "user_id": "Kaylee Lowe",
                    "user_href": "/profile/Kaylee-Lowe-5"
                },
                {
                    "user_id": "Hugh Damwright",
                    "user_href": "/profile/Hugh-Damwright"
                },
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "G Aayush Kumar",
                "href": "/profile/G-Aayush-Kumar"
            },
            "answer_text": "Some flamboyant and innovative set of sentences used to describe the flaws of human behaviour !! ",
            "date": "Answered June 9, 2018",
            "views": "16",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexander Taylor",
                    "user_href": "/profile/Alexander-Taylor-61"
                },
                {
                    "user_id": "Bruce Silverstein",
                    "user_href": "/profile/Bruce-Silverstein-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Ussery",
                "href": "/profile/Steven-Ussery"
            },
            "answer_text": "What comes to my mind is the actual meaning of the word “philosophy” in ancient Greek. It means “the love of wisdom.” The cool thing about that is that you don’t have to actually be wise, you just have to love the pursuit of it. And, that is what I have done for almost 30 years. ",
            "date": "Answered April 28, 2020",
            "views": "24",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Siddharth Yadav",
                    "user_href": "/profile/Siddharth-Yadav-50"
                },
                {
                    "user_id": "Adam Uraynar",
                    "user_href": "/profile/Adam-Uraynar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yeong Kim",
                "href": "/profile/Yeong-Kim-3"
            },
            "answer_text": "What idea comes to your mind when you hear philosophy? A story I heard from a real philosopher, and I’ll adapt it... I was sharing a pizza with a philosopher friend. The pizza was rather small, and I was ravenous. So was my friend. So how do we share the pizza? I get the material pizza, the real pizza. My friend the philosopher gets the idea of the pizza. Hope he is satisfied. ",
            "date": "Answered June 29, 2018",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Works",
                "href": "/profile/Michael-Works"
            },
            "answer_text": "A collaboration of infinitely complicated and infinitely dense topics of its own category, ranging from the most broad to the most abstract connections and perceptions achievable using the power of humanity to make sense of the different dimensions of reality. ",
            "date": "Updated July 11, 2015",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Glenda Pliler",
                "href": "/profile/Glenda-Pliler"
            },
            "answer_text": "‘Philosophy’ is one of my favorite words. Philo is love, and Sophia is the goddess of wisdom, so the word means, ‘love of wisdom.” Wisdom is what I think of when I hear the word. It brings me joy to think of it. ",
            "date": "Answered October 20, 2017",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adarsh Anand",
                    "user_href": "/profile/Adarsh-Anand-91"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doug Hilton",
                "href": "/profile/Doug-Hilton"
            },
            "answer_text": "Question everything. That was the conclusion of my one and only philosophy course. Chapter One. Understand and accept this philosopher's view. Chapter Two. This new philosopher totally disagrees with the first guy. Understand and accept the new guy's view. All following chapters repeat Chapter Two. ",
            "date": "Answered October 24, 2020",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steffy Lemon",
                "href": "/profile/Steffy-Lemon"
            },
            "answer_text": "The search for truth -- the key word being search because truth is too ambiguous to actually be found. When 2 or more people engage in that type of discussion, it is exciting because you are not limited to only your own perception. ",
            "date": "Answered June 7, 2019",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lee Rowley",
                "href": "/profile/Lee-Rowley-8"
            },
            "answer_text": "First, Love. Second part, Wisdom. Love of wisdom. Wisdom can take a twenty volume set of heavy books - which took over thirty years to write, to try to attempt an - opinion - regarding wisdom. Or, one can sleep when tired, and eat when hungry. But that doesn’t take as many heavy books, so the advice may be thought much less-of. ",
            "date": "Answered October 24, 2020",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Whipp",
                "href": "/profile/Steve-Whipp"
            },
            "answer_text": "Immediately I think of a pipe smoking Bertrand Russell, who for me exemplifies the qualities I think of when I imagine a philosopher. ",
            "date": "Answered October 18, 2017",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vee Panaché",
                    "user_href": "/profile/Vee-Panaché"
                },
                {
                    "user_id": "Chrys Jordan",
                    "user_href": "/profile/Chrys-Jordan"
                },
                {
                    "user_id": "Pradeep N Rao",
                    "user_href": "/profile/Pradeep-N-Rao"
                },
                {
                    "user_id": "Jim Euclid",
                    "user_href": "/profile/Jim-Euclid"
                }
            ]
        },
        {
            "author_info": {
                "name": "Claude Lambert",
                "href": "/profile/Claude-Lambert-1"
            },
            "answer_text": "Plato comes to my mind and a Professor I kmew and liked very much Chaim Perelman who wrote The New Rhetoric: A Treatise on Argumentation (9780268004460): Chaim Perelman, Lucie Olbrechts-Tyteca, John Wilkinson, Purcell Weaver: ",
            "date": "Answered June 27, 2017",
            "views": "17",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ashton Hennessy",
                    "user_href": "/profile/Ashton-Hennessy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arti Gupta",
                "href": "/profile/Arti-Gupta-1"
            },
            "answer_text": "I think of- Life Rumi Bhagwat Gita Buddha ",
            "date": "Answered October 18, 2017",
            "views": "14",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "FlynnRyder",
                    "user_href": "/profile/FlynnRyder"
                },
                {
                    "user_id": "Micaya Operio",
                    "user_href": "/profile/Micaya-Operio"
                },
                {
                    "user_id": "Jason Carlson",
                    "user_href": "/profile/Jason-Carlson-30"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stefan Milicevic",
                "href": "/profile/Stefan-Milicevic-3"
            },
            "answer_text": "Names of Philosphers Kant, Spinoza, Descartes, Arthur, Hegel, Hume, Locke, Platon, Aristotle, Nietzsche, Russell, Ludwig, Søren and many more. I instantly think of Philosophers and their Philosophy they created. And besides that, endless exciting questions comes into my Mind. ",
            "date": "Answered June 11, 2018",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Essay Dolan",
                    "user_href": "/profile/Essay-Dolan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elliott Moos",
                "href": "/profile/Elliott-Moos"
            },
            "answer_text": "Trying to say what can’t be said. ",
            "date": "Answered June 11, 2018",
            "views": "15",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Hainly",
                    "user_href": "/profile/John-Hainly"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adan Vazquez",
                "href": "/profile/Adan-Vazquez-6"
            },
            "answer_text": "Someone who knws alot not becaousd you learn a faster way to do it doesnt mean you dint want to do it. It just means you use your brain to get you throught somethin thts how your knowledge lets you get wise too ",
            "date": "Answered November 11, 2019",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dragan Milunovic",
                "href": "/profile/Dragan-Milunovic-1"
            },
            "answer_text": "A handful of greatest minds in human history and an army of pretentious epigone scholars who compromise the results of those greatest minds. ",
            "date": "Answered June 28, 2017",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cris Tine Antonio",
                    "user_href": "/profile/Cris-Tine-Antonio"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Brown",
                "href": "/profile/Robert-Brown-218"
            },
            "answer_text": "I think of one of the most difficult and rigorous courses that I had in college. It was also a wonderful, mind-expanding experience. ",
            "date": "Answered October 18, 2017",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Olanike Omojola",
                    "user_href": "/profile/Olanike-Omojola"
                }
            ]
        },
        {
            "author_info": {
                "name": "Majo ElTayeb",
                "href": "/profile/Majo-ElTayeb"
            },
            "answer_text": "PlatoSocrates Love of Knowledge (actually hear this in my philosophy teacher's voice) ",
            "date": "Answered September 14, 2014",
            "views": "24",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Samuel You Jianfeng",
                "href": "/profile/Samuel-You-Jianfeng"
            },
            "answer_text": "I would think of “Socrates” or “Aristotle”, as it evokes images of Greek men wearing togas debating about their world views. Or I would think of “Gachimuchi” or “Wrestlers”, about a Japanese fanbase who turned several wrestlers’ quarrels into joking life lessons. Yugamineena! ",
            "date": "Answered June 10, 2018",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charing Kam",
                "href": "/profile/Charing-Kam"
            },
            "answer_text": "Disclaimer: I didn’t study philosophy so this is just, literally, the first thing that popped into my mind when I thought about it.  Sorry. ",
            "date": "Answered June 29, 2018",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Trang Nguyễn",
                "href": "/profile/Trang-Nguyễn-41"
            },
            "answer_text": "Exurb1a, a biriliant YouTube channel on the topic. ",
            "date": "Answered June 10, 2018",
            "views": "1",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Indhu Soundararajan",
                "href": "/profile/Indhu-Soundararajan-1"
            },
            "answer_text": "“Wow let me hear some philosophy “ is the feel I get when I hear about it. Because i basically like to know about it. ",
            "date": "Answered June 24, 2018",
            "views": "976",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Magezi Michael",
                "href": "/profile/Magezi-Michael"
            },
            "answer_text": "Ijust feel happy coz philosophy as being a subject of its own!enriches the knowledge of teacher and manage the classroom. ",
            "date": "Answered October 20, 2017",
            "views": "826",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarvesh Guruji Sharmaa",
                "href": "/profile/Sarvesh-Guruji-Sharmaa"
            },
            "answer_text": "When I heard the word philosophy the first thing comes in my mind is to think differently in every aspect of life . ",
            "date": "Answered June 24, 2018",
            "views": "900",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ed McManus",
                "href": "/profile/Ed-McManus-5"
            },
            "answer_text": "A joke (naturally)! How do you get a philosopher off your back porch? Pay him for the pizza. ",
            "date": "Answered June 6, 2018",
            "views": "1",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "George Cedar",
                "href": "/profile/George-Cedar"
            },
            "answer_text": "A sitting person with his chin propped up on his fist contemplating thoughts that nobody had considered before. ",
            "date": "Answered July 5, 2018",
            "views": "818",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Karl Smithe",
                "href": "/profile/Karl-Smithe"
            },
            "answer_text": "European pseudo-intellectual BS. Nothing worth paying attention to since Socrates. ",
            "date": "Answered October 19, 2017",
            "views": "770",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ramesh S K",
                "href": "/profile/Ramesh-S-K-1"
            },
            "answer_text": "Easily available from strangers but not from rightfull persons. Most of them are confusing others but not all. ",
            "date": "Answered June 11, 2018",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Gunoskey",
                "href": "/profile/Robert-Gunoskey"
            },
            "answer_text": "The following question- Why is there something instead of nothing? ",
            "date": "Answered June 11, 2018",
            "views": "749",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "E Schott",
                "href": "/profile/E-Schott"
            },
            "answer_text": "Outllok on life that has a realistic meaning that isnt religious ",
            "date": "Answered June 23, 2018",
            "views": "794",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hemant C. Lodha",
                "href": "/profile/हेमन्त-लोढा-Hemant-C-Lodha"
            },
            "answer_text": "Journey towards ultimate truth ",
            "date": "Answered August 7, 2017",
            "views": "626",
            "upvotes": " Answer requested by Alexander Zynex Aparte"
        },
        {
            "author_info": {
                "name": "Pablo Rendon",
                "href": "/profile/Pablo-Rendon-5"
            },
            "answer_text": "Deep mind bending thoughts ",
            "date": "Answered June 11, 2018",
            "views": "782",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yeswanth Ramamurthy",
                "href": "/profile/Yeswanth-Ramamurthy"
            },
            "answer_text": "Swami Vivekananda's teachings! His words helped me groom into a better human today. All his words are thoughtful and powerful which will definitely help anyone to understand the power of an individual and beauty of Life. ",
            "date": "Answered June 24, 2018",
            "views": "993",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Austin",
                "href": "/profile/Andrew-Austin-34"
            },
            "answer_text": "hmmmmmmmmm…  ",
            "date": "Answered November 7, 2018",
            "views": "740",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "BreAnna Massey",
                "href": "/profile/BreAnna-Massey-2"
            },
            "answer_text": "Way of thinking ",
            "date": "Answered June 23, 2018",
            "views": "733",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alan Flansberg",
                "href": "/profile/Alan-Flansberg"
            },
            "answer_text": "Get a life! ",
            "date": "Answered July 7, 2018",
            "views": "661",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Irfan Mirza",
                "href": "/profile/Irfan-Mirza-46"
            },
            "answer_text": "Tergiversation. ",
            "date": "Answered June 10, 2018",
            "views": "698",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christopher Weaver",
                "href": "/profile/Christopher-Weaver-7"
            },
            "answer_text": "It is the direct limit of all link chains in Wikipedia. ",
            "date": "Answered June 23, 2018",
            "views": "677",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jenny Talia",
                "href": "/profile/Jenny-Talia-4"
            },
            "answer_text": "Food. ",
            "date": "Answered June 10, 2018",
            "views": "648",
            "upvotes": "0"
        }
    ]
}