{
    "title": "What are the best arguments for libertarianism? - Quora",
    "tags": [
        "Libertarianism (politics)",
        "Political Philosophy",
        "Pros and Cons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Binfield",
                "href": "/profile/Mark-Binfield"
            },
            "answer_text": "I believe all ideologies are flawed, limited, and incomplete. So, I can't and won't argue that libertarianism has all the answers. I do think, however, that libertarianism brings something unique and valuable to the political conversation. Sometimes libertarianism is described as socially liberal and fiscally conservative. That's reasonably accurate, but it also makes libertarianism sound unnecessary: the country could adopt liberal social policies and conservative fiscal policies, and nobody would need to talk about libertarianism at all. So, consider a different way of thinking about political beliefs: who do we trust to make decisions? Liberals trust the government. They believe government is generally good (or at least, that it can be made good) and will do the right thing. They believe the government is needed to make sure that individuals and private organizations like businesses do the right thing. In a liberal framework; the solution to any problem is to find the right government policy to address it. Conservatives trust the institutions of the private sector, especially business and organized religion. They believe businesses and religious groups (at least the religious groups they're affiliated with) are generally good and will do the right thing. They want government to stand aside and allow business and religion to operate freely. They believe that the private sector should get the first crack at solving a problem, and that the government should step in only if the private sector can't fix something. Libertarians trust individuals. They believe that individual people are generally good and can be trusted to do the right thing. They are wary of all institutions, public and private, that try to exercise power over people. They worry that any institution can put its goals above the needs and rights of individual people, and they believe individuals should have the final say in their own life, unless they're harming others. Personally, I see all three viewpoints as useful frames. I believe institutions are valuable. But every institution is made up of people, and people can be foolish or selfish or cruel. That means government is fallible, and can be harnessed for cruel or selfish ends. Businesses, religions, and other private organizations are fallible and can be harnessed for cruel or selfish ends. And individuals are fallible too. They may hurt themselves or others through foolishness or cruelty or selfishness. If you look at the world solely through liberal or conservative frames, you're alternating between putting too much trust in government, and putting too much trust in private institutions. So, what does the libertarian focus on individual choice mean in practice? Sometimes it means there are distinctive libertarian positions, but often the difference is in priorities. The classic examples would be in drug policy and criminal justice. Some on the left and right have always been in favor of saner drug laws and worried about giving too much power to law enforcement, but it wasn't a big priority in mainstream politics. The major US parties in the 1990s were both in favor of policies that were anti-drug and tough on crime. Now, both conservatives and liberals are starting to come around to more libertarian positions on these issues. But here's a more interesting and contemporary example: over-use of occupational licensing. This is an issue almost no one, other than libertarians, is paying attention to. Chances are, you've never thought about it until this moment. The number of occupations that require professional licensing has grown significantly in the modern era. A license regime means that people can't legally engage in a particular type of work unless they've applied to the government, proved that the meet whatever criteria the government imposes, and usually paid some sort of licensing fee. If you aren't a hardcore libertarian (and I'm not), some occupational licensing is sensible. I want somebody to certify that my doctor has a minimally acceptable level of training. Same with my lawyer. But what about hairdressers? Some states require licensing for occupations like cosmetology, or for semi-skilled trades like roofing. Licensing is the most extreme way to control risk in an occupational setting. It's attractive to state and local governments because it can be used to raise revenue while appearing to protect the public. But licensing only makes sense when the risk of harm to the public from an untrained worker is high. There are less restrictive options, like registration (which just requires that the government know you're practicing an occupation), or mandatory insurance requirements, that should be sufficient in most cases. Overuse of licensing is harmful in a number of ways. It makes it significantly harder for lower-skilled workers to enter new occupations, which reduces upward mobility in society. By reducing competition from new people entering the occupation, it makes the services provided by that occupation more expensive to consumers. It also reduces people's freedom to move around the country, because someone moving to a new place now has to satisfy the licensing requirements of their new home. Getting a new license can be a costly and time consuming process; someone who is already an experienced worker doesn't want to start at the beginning. Liberals and conservatives don't necessarily disagree with these arguments. It's just not an issue that either liberals or conservatives are ever likely to notice or care about. Liberals are inclined to assume that government regulations exist for a good purpose, and that over-regulation is something only rich businessmen whine about. They care about the working class people whose opportunities are reduced by occupational licensing, but they don't recognize that the harm is happening. Meanwhile, conservatives tend to be pro-business, and existing businesses are fine with occupational licensing. After all, an existing business and its staff already have any licenses they need; they don't want the requirement to go away, because that would expose them to more competition. And trade schools that exist to meet licensing requirements will lobby to ensure that students continue to be required to take their classes. Overall, over-licensing is a problem that's hard to notice because the damage it does is indirect and distributed across a lot of people. It's true that more people would have jobs if licensing restrictions were lessened. But you can't generally point to a specific person and say \"He'd be working as a roofer right now, if his state weren't one of the few states that thinks roofers should get occupational licenses. Instead he's working part time bagging groceries.\" And slightly higher consumer prices hurt everyone, but they don't hurt any one person very much, and the damage isn't visible even to the people it affects. When someone gets their roof replaced, nobody says \"your roof cost $XX more because your state requires roofers to be licensed.\" Basically, this is a problem that's likely to be ignored, unless someone looks at it through an ideological lens that emphasizes individual choice and freedom. And that's where libertarians have something to offer. ",
            "date": "Updated January 31, 2018",
            "views": "22",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Imme Roerdinkholder",
                    "user_href": "/profile/Imme-Roerdinkholder"
                },
                {
                    "user_id": "Michael Estes",
                    "user_href": "/profile/Michael-Estes"
                },
                {
                    "user_id": "Alfredo Hernandez",
                    "user_href": "/profile/Alfredo-Hernandez-4"
                },
                {
                    "user_id": "Sean McManus",
                    "user_href": "/profile/Sean-McManus-24"
                },
                {
                    "user_id": "Vidya Vasudeva",
                    "user_href": "/profile/Vidya-Vasudeva"
                },
                {
                    "user_id": "Siddhartha Sahu",
                    "user_href": "/profile/Siddhartha-Sahu"
                },
                {
                    "user_id": "Bill Carpenter",
                    "user_href": "/profile/Bill-Carpenter-29"
                },
                {
                    "user_id": "Harsh Jain",
                    "user_href": "/profile/Harsh-Jain-130"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/De-Fido-Sole"
                },
                {
                    "user_id": "Bob Haagen",
                    "user_href": "/profile/Bob-Haagen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Moncman",
                "href": "/profile/Tony-Moncman"
            },
            "answer_text": "I think the best argument for libertarianism to argue against what it isn’t. First off, true libertarianism is based on maximum individual freedoms until those freedoms begin to interfere with the freedoms of others. Part of this concept is that at some point my freedoms and rights may interfere with your freedoms and rights. The solution to that problem is a government that protects us from each other while allowing the greatest possible freedoms for each of us. A side benefit of that government would be the ability to do things collectively the things that one individual could not do themselves. There are two opposing ideas these ideals. The first is widely confused with libertarianism, but is very different. This is the idea of anarchy. Anarchy wants total and absolute freedom of the individual. It would be up to each one of us to protect those rights. The end result of any such system would be a dog eat dog, survival of the fittest world. The strong would dominate, the weak would be dominated. The second is the idea that is employed by both liberals and conservatives. This is the idea of not only protecting you from others but also protecting you from yourself. Each of these ideologies seek to impose their ideas of how to achieve this by utilizing the power of government to force you to comply. So in order to prevent a woman from having an abortion the right attempts to enact laws to prevent it. Or, in order to prevent you from discriminating the left attempts to enact laws to prevent that. In either case whether you agree or disagree, you must comply or suffer the consequences of government action. So for me, the argument in favor of libertarianism is that I do not want to be told what to do and I want to be protected from you. In a libertarian world, to use abortion as an example, you would be free to act or not act based on what you feel is in your best interests. You may believe it is a sin against God, but the consequences of your actions would be between you and your God and not between someone who believes otherwise and yourself. The US was largely founded on libertarian ideas. The Constitution defines government’s role and is largely silent about the rights of any individual. It is a document which limits government but largely leaves each of us to act in our own best interests. The US Constitution is one of the most libertarian documents ever written. Sadly many do not understand that and attempt to abuse those ideals to impose their ideas on every one else, as done by both the GOP and the Democrats. ",
            "date": "Answered June 21, 2020",
            "views": "142",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ryan Britt Dietz",
                    "user_href": "/profile/Ryan-Britt-Dietz"
                }
            ]
        }
    ]
}