{
    "title": "'Virtual reality vs. the real thing' is under which branch of philosophy? - Quora",
    "tags": [
        "Epistemology",
        "Virtual Worlds",
        "Philosophy of Science",
        "Augmented Reality",
        "Virtual Reality (VR)",
        "Reality",
        "Philosophy",
        "Science",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Balbir Kaur",
                "href": "/profile/Balbir-Kaur-188"
            },
            "answer_text": "Virtual reality is a simulated environment often showed and offered by technology through science fiction and imagination by our minds. This can be played and stopped or organized and built in our preference or even towards our own definition of perfection. Real thing or reality is the surrounding natural environment and state a person lives in. This cannot be played or stopped in our own liking but can be organized and built in a way that fits our current situation and such. They all fall under the branch of philosophy called metaphysics, wherein it is the study that focuses on human’s nature and the nature of the world he is living in. ",
            "date": "Answered October 23, 2020",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Weber",
                "href": "/profile/Mark-Weber-133"
            },
            "answer_text": "Epistomology. Ontology explores the “real world” and epistomology explores conscientiousness and knowledge or “how do I know I’m not dreaming all of this?” Most of us have experienced an “epistomological moment” when we were stopped at a light and a truck or car next to us starts moving forward slowly. We catch it out of our peripheral vision and suddenly feel like we are moving backwards. Of course we have all experienced them while we were dreaming a very vivid dream that had us convinced that we actually experiencing what we were dreaming. ",
            "date": "Answered October 11, 2020",
            "views": "192",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Allen",
                    "user_href": "/profile/John-Allen-1016"
                },
                {
                    "user_id": "Seth Hiles",
                    "user_href": "/profile/Seth-Hiles"
                }
            ]
        }
    ]
}