{
    "title": "After completing community college, does my high school GPA matter when I apply for a 4-year university? - Quora",
    "tags": [
        "Community College",
        "Grade Point Average and University Admissions",
        "Grade Point Averages",
        "The High School Experience",
        "Colleges and Universities",
        "College and University Admissions"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Leland Harp",
                "href": "/profile/James-Leland-Harp"
            },
            "answer_text": "A2A. After completing community college, does my high school GPA matter when I apply for a 4-year university? Some transfer programs require you high school transcripts and your standardized test scores. If you want only your college transcript evaluated, you would not apply to those schools. ",
            "date": "Answered October 21, 2020",
            "views": "92",
            "upvotes": " Answer requested by Robert Coss"
        },
        {
            "author_info": {
                "name": "Jan Dawson",
                "href": "/profile/Jan-Dawson-3"
            },
            "answer_text": "No, the university will not be concerned with your high school transcripts if you completed 2 years or graduated, except in unusual cases, or if you had some questionable AP classes from the same community college that you attended. ",
            "date": "Answered October 21, 2020",
            "views": "26",
            "upvotes": " Answer requested by Robert Coss"
        },
        {
            "author_info": {
                "name": "Anne Agard",
                "href": "/profile/Anne-Agard"
            },
            "answer_text": "I’m not sure what you mean. The normal process is to complete two years at a community college and then transfer to a four-year school for your junior and senior years. Acceptance for university transfer is based very largely on your community college GPA. ",
            "date": "Answered October 21, 2020",
            "views": "78",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael George",
                "href": "/profile/Michael-George-92"
            },
            "answer_text": "A2A. The matter some, but much less than your Community College GPA. The two years you spend there give you a chance to show what you can do in college for the last 2 years of your BA/BS. ",
            "date": "Answered October 21, 2020",
            "views": "62",
            "upvotes": " Answer requested by Robert Coss"
        },
        {
            "author_info": {
                "name": "Joel Dykstra",
                "href": "/profile/Joel-Dykstra-1"
            },
            "answer_text": "Generally, after you complete about 12 college credits, you are considered a transfer student. Most colleges or universities will look at your college record at that point and not GPA or ACT/SAT scores. ",
            "date": "Answered October 22, 2020",
            "views": "32",
            "upvotes": "0"
        }
    ]
}