{
    "title": "All my classmates are just classmates. How can I make friends and talk with people normally? - Quora",
    "tags": [
        "Classmates",
        "Friendship Advice",
        "Friendship",
        "Social Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ian E Smith",
                "href": "/profile/Ian-E-Smith"
            },
            "answer_text": "I'm going to be harsh with you, because I think you need to hear this. You're pretty much me in my sophomore year, and I wish someone had told me this I have good news and bad news for you. Good news: you are not alone in the way you feel, you are not abnormal or a freak for not fitting in. You can improve your situation. The bad news: You need to change yourself. It won't be easy, it will take time, amd it will seem frustrating or pointless at times, but it will get better. Right, let's tackle this piece by piece: “The kids in my class are constantly screaming, flirting with each other…” Here is the unfortunate reality: you go to highschool. Highschool is full of teenage boys and girls. Teenage boys and girls are going through this fun thing we call puberty. They are at or reaching the apex of sexual attraction and restlessness. So sometimes they like to flirt, and sometimes they get a little loud, misbehave, whatever. You have to accept that this behavior happens because it's a natural party of maturity and becoming an adult. Stop be angry/frustrated, start being understanding. On a side note on the flirting: it can be pretty entertaining to watch, at least superficially. “Freaking out over grades” You seem like a smart guy. You do well in school. Things come easy, or at least you work hard. Good for you. But see, that's not the case for everyone. The fact is, people care about their futures, and they care about their lives, and some of those people have a really hard time in school. Learning isn't easy and it isn’t natural for them. So school is stressful, and so freaking out is a natural result. Again, natural. Have empathy for those that struggle. “\"I quit all EC’s” Do not join extracurriculars solely for the purpose of making friends. The way that you bond with people extracurriculars is by sharing a common interest on the common drive for a sport/topic/ common-pursuit. You come together through your mutual passions. You become a team through your combined toils. You become friends through the affection and brotherhoods that come from these toils. Join and EC you have a real intrest in, let friendships spring up naturally. “Socially, I want to have a relaxing time with people….” Some teenagers have the unfortunate luck of maturing a little bit faster than their peers. As a result they feel alienated ostracized, unable to connect through common interests or behaviors. I have a suspicion that this is your situation. I'm sorry if it is. Here are some tips: -try to find even the slightest common interests, movies, shows, books, beliefs, religion, politics, anything works. -talk.talk.talk. Teenagers are just people. Ive noticed something about people: everyone has a story. They all have hopes, dreams, trials, victories and losses. They all have a unique voice. Maybe they don't show it, maybe they don't like to project it, but that unique perspective is there. -ask people questions, learn about them. Display a genuine interest in their views. Don't expect that someone will just come up to you and be your friend. You have to go get them. -be wise. You don't to be friends for everybody. Take a few people that you think are interesting or at least you want to get to know better. Focus on them, and garner good relationships. -avoid developing your superiority complex. I'm getting a sense that you realize that you're a little bit different than other kids. Maybe you think you're a little bit better. Try to rid yourself of that believe. Even if you don't think that you show express it, and other people can't tell, they can. They can tell in your body language and in your actions. Nobody's going to get up on your high horse with you and offer to be your friend. -Make a few female friends. You don't need to go on a date with somebody, just talk to some girls. Highschool is a great time to start honing your social skills with members of the opposite sex. Don't be so frustrated with your classmates and your predicament that you miss this. And hey, girls tend to be a bit more mature, and active bit more levelheaded, so it's a win-win. Final thing. Remember that if you ever want to talk to someone that has had similar experiences and can relate to your predicament, feel free to shoot me a PM (that goes for anyone reading this). Good luck on the friends. -Ian Smith ",
            "date": "Answered February 11, 2017",
            "views": "89",
            "upvotes": " View 44 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mariem Baazouzi",
                    "user_href": "/profile/Mariem-Baazouzi"
                },
                {
                    "user_id": "The World According To Remy",
                    "user_href": "/profile/The-World-According-To-Remy"
                },
                {
                    "user_id": "Ahmed Elnaggar",
                    "user_href": "/profile/Ahmed-Elnaggar-67"
                },
                {
                    "user_id": "Taylor Swift",
                    "user_href": "/profile/Taylor-Swift-482"
                },
                {
                    "user_id": "Andrea Charis",
                    "user_href": "/profile/Andrea-Charis"
                },
                {
                    "user_id": "Exekiel Villanueva",
                    "user_href": "/profile/Exekiel-Villanueva"
                },
                {
                    "user_id": "Emile Heskey",
                    "user_href": "/profile/Emile-Heskey-51"
                },
                {
                    "user_id": "Samantha Cook",
                    "user_href": "/profile/Samantha-Cook-217"
                },
                {
                    "user_id": "Abdelmoezz Alsharif",
                    "user_href": "/profile/Abdelmoezz-Alsharif"
                },
                {
                    "user_id": "Frost Flower",
                    "user_href": "/profile/Frost-Flower-2"
                },
                {
                    "user_id": "Sabrina Rocha",
                    "user_href": "/profile/Sabrina-Rocha-21"
                },
                {
                    "user_id": "Dhruv Garg",
                    "user_href": "/profile/Dhruv-Garg-56"
                },
                {
                    "user_id": "Shina Cohen",
                    "user_href": "/profile/Shina-Cohen"
                },
                {
                    "user_id": "VJ Rodriguez",
                    "user_href": "/profile/VJ-Rodriguez-2"
                },
                {
                    "user_id": "Ajin Baby",
                    "user_href": "/profile/Ajin-Baby-2"
                },
                {
                    "user_id": "Christine Monica Man",
                    "user_href": "/profile/Christine-Monica-Man"
                },
                {
                    "user_id": "Maya Shah",
                    "user_href": "/profile/Maya-Shah-84"
                },
                {
                    "user_id": "Anna Paul",
                    "user_href": "/profile/Anna-Paul-91"
                },
                {
                    "user_id": "Queen B",
                    "user_href": "/profile/Queen-B-31"
                },
                {
                    "user_id": "Cs Re",
                    "user_href": "/profile/Cs-Re"
                },
                {
                    "user_id": "Erin Rachel",
                    "user_href": "/profile/Erin-Rachel-2"
                },
                {
                    "user_id": "GhostNova",
                    "user_href": "/profile/GhostNova"
                },
                {
                    "user_id": "Yoong Dominic",
                    "user_href": "/profile/Yoong-Dominic"
                },
                {
                    "user_id": "Vincent Chu",
                    "user_href": "/profile/Vincent-Chu-57"
                },
                {
                    "user_id": "Feroz Emanuel",
                    "user_href": "/profile/Feroz-Emanuel"
                },
                {
                    "user_id": "Natalie Lasater",
                    "user_href": "/profile/Natalie-Lasater-2"
                },
                {
                    "user_id": "Callissia Lim",
                    "user_href": "/profile/Callissia-Lim"
                },
                {
                    "user_id": "Bruva Michal",
                    "user_href": "/profile/Bruva-Michal"
                },
                {
                    "user_id": "Mayur Vaish",
                    "user_href": "/profile/Mayur-Vaish-1"
                },
                {
                    "user_id": "Tom Nguyen",
                    "user_href": "/profile/Tom-Nguyen-143"
                },
                {
                    "user_id": "Adam Schneider",
                    "user_href": "/profile/Adam-Schneider-72"
                },
                {
                    "user_id": "Sandeep Kumar",
                    "user_href": "/profile/Sandeep-Kumar-2188"
                },
                {
                    "user_id": "Vlogging Channel GONE WRONG IN THE HOOD",
                    "user_href": "/profile/Vlogging-Channel-GONE-WRONG-IN-THE-HOOD"
                },
                {
                    "user_id": "Philip",
                    "user_href": "/profile/Philip-135"
                },
                {
                    "user_id": "Homofa G. Got",
                    "user_href": "/profile/Homofa-G-Got"
                },
                {
                    "user_id": "Mei Yuan",
                    "user_href": "/profile/Mei-Yuan-17"
                },
                {
                    "user_id": "Frederick Noe",
                    "user_href": "/profile/Frederick-Noe"
                },
                {
                    "user_id": "Elijah John Gadbury",
                    "user_href": "/profile/Elijah-John-Gadbury"
                },
                {
                    "user_id": "Abigail Copeland",
                    "user_href": "/profile/Abigail-Copeland-1"
                },
                {
                    "user_id": "Claudia Lam",
                    "user_href": "/profile/Claudia-Lam-4"
                },
                {
                    "user_id": "Leinad Olsson",
                    "user_href": "/profile/Leinad-Olsson"
                },
                {
                    "user_id": "KAren FEagler",
                    "user_href": "/profile/KAren-FEagler"
                },
                {
                    "user_id": "Syed Hasan",
                    "user_href": "/profile/Syed-Hasan-82"
                },
                {
                    "user_id": "Cara Jurrett",
                    "user_href": "/profile/Cara-Jurrett"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anindito Alfaritsi",
                "href": "/profile/Anindito-Alfaritsi"
            },
            "answer_text": "Thanks for the question. I don’t know whether this will help or not, but here goes. IMO, the root of your problem lies in your lack of interest with other people. You’re satisfied with the things you already have, and I’m happy that you do. But to make friends, you have to show interest on the things they have first, if you wish for it to work the other way around. Come to think of it, there once was a friend in my class who sounded a bit like you. He was never really particularly close to anybody, but nobody really hated him. He grew up into a decent, if quiet, person with a pretty good job. I think the work space where he worked in eventually grew him closer to other people. So I think once you get pass school, your problem will be resolved on its own. But if you really want to build a close friendship from now… This may sound weird, but I recommend you to start reading detective and suspense novels. It’ll help build a people-centered mindset. Besides that, practice smiling. You sound like a good person. So I’ll pray for your success. ",
            "date": "Answered July 29, 2016",
            "views": "53",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ahmed Elnaggar",
                    "user_href": "/profile/Ahmed-Elnaggar-67"
                },
                {
                    "user_id": "Taylor Swift",
                    "user_href": "/profile/Taylor-Swift-482"
                },
                {
                    "user_id": "Zainab Ali",
                    "user_href": "/profile/Zainab-Ali-336"
                },
                {
                    "user_id": "Frost Flower",
                    "user_href": "/profile/Frost-Flower-2"
                },
                {
                    "user_id": "VJ Rodriguez",
                    "user_href": "/profile/VJ-Rodriguez-2"
                },
                {
                    "user_id": "Esther Ho",
                    "user_href": "/profile/Esther-Ho-24"
                },
                {
                    "user_id": "Satish",
                    "user_href": "/profile/Satish-403"
                },
                {
                    "user_id": "Lưu Zin",
                    "user_href": "/profile/Lưu-Zin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vedamalika",
                "href": "/profile/Vedamalika"
            },
            "answer_text": "I can really understand this well.Dear,we are all a part of a large society.We will meet people with different interests,thoughts and ideas.Its all about coping with everything and everyone. Be unique,being unique is something to be proud of.But nevertheless,try making friends . It doesn’t matter whether you guys share same interests.Talk about everything you know and hear about their interests too.Don’t lose your uniqueness,but sharing interests and knowledge can make you a better person . Be cheerful and friendly.You can start up with asking about family,hobbies,friends,favorite food,favorite TV shows,Life at home,sports etc..These are just simple and common topics which can be shared irrespective of any differences.You said you are a good student,so you can help your friends in studies.These above measures are enough for a good bond.And life is more vast than you think . So in the future years you will automatically meet a person with the same interest as yours . So for now,feel free and make friends. ",
            "date": "Answered February 2, 2017",
            "views": "39",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ahmed Elnaggar",
                    "user_href": "/profile/Ahmed-Elnaggar-67"
                },
                {
                    "user_id": "Taylor Swift",
                    "user_href": "/profile/Taylor-Swift-482"
                },
                {
                    "user_id": "VJ Rodriguez",
                    "user_href": "/profile/VJ-Rodriguez-2"
                },
                {
                    "user_id": "Gerald Njue",
                    "user_href": "/profile/Gerald-Njue"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joey Devine",
                "href": "/profile/Joey-Devine"
            },
            "answer_text": "Stop giving it so much thought. You're so focused on making friends that, you are losing touch with who you are. No more stressing and friend searching. Just be yourself. Next, you need to interact with your fellow classmates. Join a club, be part of a movement, look for a group that interests you. If no one is coming to you than, you must, not directly, go to them. Put yourself out there in the public eye. Develop your character, accept your flaws, and be comfortable with yourself. Don't let your anxiety get the best of you. There's nothing to be nervous about. They're all people looking for friends too. Trust me, you're not the only one looking for a friend. Be yourself and don't worry so much. ",
            "date": "Answered July 28, 2016",
            "views": "66",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frost Flower",
                    "user_href": "/profile/Frost-Flower-2"
                },
                {
                    "user_id": "Shina Cohen",
                    "user_href": "/profile/Shina-Cohen"
                },
                {
                    "user_id": "VJ Rodriguez",
                    "user_href": "/profile/VJ-Rodriguez-2"
                },
                {
                    "user_id": "Althea Camacho",
                    "user_href": "/profile/Althea-Camacho"
                },
                {
                    "user_id": "Amy Makuto",
                    "user_href": "/profile/Amy-Makuto"
                },
                {
                    "user_id": "Rajesh Mishra",
                    "user_href": "/profile/Rajesh-Mishra-319"
                },
                {
                    "user_id": "Rachael Strom",
                    "user_href": "/profile/Rachael-Strom"
                },
                {
                    "user_id": "Julia Bräunlein",
                    "user_href": "/profile/Julia-Bräunlein"
                },
                {
                    "user_id": "Sahil Mansukh Thummar",
                    "user_href": "/profile/Sahil-Mansukh-Thummar"
                }
            ]
        },
        {
            "author_info": {
                "name": "A.D. Ross",
                "href": "/profile/A-D-Ross"
            },
            "answer_text": "Make sure you feel confident about your appearance. Make sure your clothes fit well and you feel good. Have a style that you feel comfortable with. Your comparability makes you relaxed and therefore “Cool.” Be cool, be relaxed, but be picky on who you want to be friends with. Sometimes the “cool kids” in school are the troublemakers which seems at first the people you want to hang out with but they’re not. If you don’t like the kids, it may be better to be a loner till you find kids that match your vibe. I’m assuming you’re a guy. Focus on talking to the girls and making friends with them first. Focus on school work second. If any other dudes seem cool, then they’re lucky to become your friend. ",
            "date": "Answered November 1, 2018",
            "views": "14",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frost Flower",
                    "user_href": "/profile/Frost-Flower-2"
                },
                {
                    "user_id": "VJ Rodriguez",
                    "user_href": "/profile/VJ-Rodriguez-2"
                },
                {
                    "user_id": "Vincent Chu",
                    "user_href": "/profile/Vincent-Chu-57"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarvesh Kannan",
                "href": "/profile/Sarvesh-Kannan"
            },
            "answer_text": "This situation was going one with my classmates during the first semester of college. Both guys and girls knew we had to become friendly but we just a bunch of strangers. My birthday came up and I invited the whole class to the canteen(all the guys wanted me to,I never had the guts to ask a girl to come to canteen :p). For all those who showed up,from then on we became quite friendly and for those who didn't show up… they graduated as strangers. Unless someone actually puts in some effort,your class will never get united. ",
            "date": "Answered February 1, 2017",
            "views": "23",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Frost Flower",
                    "user_href": "/profile/Frost-Flower-2"
                },
                {
                    "user_id": "Friss Gal",
                    "user_href": "/profile/Friss-Gal"
                },
                {
                    "user_id": "Ayushmaan Pandey``",
                    "user_href": "/profile/Ayushmaan-Pandey-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohan Bose",
                "href": "/profile/Rohan-Bose-11"
            },
            "answer_text": "Be what you are. You'll eventually get friends. Now don't tell me you won't get friends because even I am introverted and I have friends. Generally the weirdest ones get the best of friends. So wait for your chance. ",
            "date": "Answered February 1, 2017",
            "views": "2",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Frost Flower",
                    "user_href": "/profile/Frost-Flower-2"
                },
                {
                    "user_id": "VJ Rodriguez",
                    "user_href": "/profile/VJ-Rodriguez-2"
                },
                {
                    "user_id": "Sabrina Wu",
                    "user_href": "/profile/Sabrina-Wu-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anushya Krishnan",
                "href": "/profile/Anushya-Krishnan"
            },
            "answer_text": "Since you have good grades try Helping your classmates in subjects .create a reason for them to interact with you . ",
            "date": "Answered March 18, 2015",
            "views": "2",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaruni Tiwari",
                    "user_href": "/profile/Aaruni-Tiwari"
                },
                {
                    "user_id": "VJ Rodriguez",
                    "user_href": "/profile/VJ-Rodriguez-2"
                },
                {
                    "user_id": "Friss Gal",
                    "user_href": "/profile/Friss-Gal"
                },
                {
                    "user_id": "Amy Makuto",
                    "user_href": "/profile/Amy-Makuto"
                },
                {
                    "user_id": "Ayushmaan Pandey``",
                    "user_href": "/profile/Ayushmaan-Pandey-6"
                },
                {
                    "user_id": "Sabrina Wu",
                    "user_href": "/profile/Sabrina-Wu-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Raider",
                "href": "/profile/Jonathan-Raider"
            },
            "answer_text": "Well there is always alternative way to make friends rather than making it in classroom. You probably make good friends in your neighborhood or in social media. ",
            "date": "Answered February 11, 2017",
            "views": "705",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Taylor Swift",
                    "user_href": "/profile/Taylor-Swift-482"
                },
                {
                    "user_id": "Frost Flower",
                    "user_href": "/profile/Frost-Flower-2"
                },
                {
                    "user_id": "Seshadri Ramakrishnan",
                    "user_href": "/profile/Seshadri-Ramakrishnan"
                },
                {
                    "user_id": "Ayushmaan Pandey``",
                    "user_href": "/profile/Ayushmaan-Pandey-6"
                },
                {
                    "user_id": "Taha Alam",
                    "user_href": "/profile/Taha-Alam-2"
                },
                {
                    "user_id": "Kaustav Das",
                    "user_href": "/profile/Kaustav-Das-75"
                },
                {
                    "user_id": "Murali Krishna Kesapragada",
                    "user_href": "/profile/Murali-Krishna-Kesapragada"
                },
                {
                    "user_id": "Billy Liu",
                    "user_href": "/profile/Billy-Liu-15"
                }
            ]
        }
    ]
}