{
    "title": "Am I too old for taking another degree? - Quora",
    "tags": [
        "Academic Advice for Careers",
        "College Advice for Careers",
        "Academic and Educational Advice",
        "College Advice",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charles Slade",
                "href": "/profile/Charles-Slade"
            },
            "answer_text": "I wouldn't ever consider yourself \"too old\" to do anything. But you should carefully consider this move, perhaps more carefully than you would have when you were doing this the first time through. First: consider why you're looking to do this again -- your motivation.  Often, when people are graduating from school or otherwise facing the process of moving to a new phase in life, there's a strong (but sometimes unconscious) resistance.  One way that plays out is for people to not want to leave school.  So they concoct reasons to stay in school or go back.  They find a sudden interest in another field -- their true calling.  Or maybe they suddenly learn that there are amazing career prospects in another field.  Or maybe they realize that they \"might as well\" get a graduate degree, so that they can better compete in the job market.  Or who knows what other reason. My point is, ask yourself why you're really considering this move.  If you think it's for a better career, seriously research what the career options are.  Talk to other recent graduates who have that degree, and get their input.   (In other words, do not take career advice from brochures, pamphlets, or recruiting materials from schools themselves.  They do not have your interests in mind.) Balance all this against some life/financial realities.  Financial questions:  what is your next best alternative to school?  (If you had to get a job right now, what would it be?)  What is the cost of going back to school?  Do you expect to earn more money after a second degree?  If so, how much more?  How long do you have to work in the new field before you \"turn the corner,\" meaning that the total you earn in the new field would exceed the total you would have earned at the next best alternative?   Re-run this calculation for best case scenarios and worst case scenarios. Meanwhile, life questions:  do you have a family?  Do you want one?  Are you tied to a particular geographic area?  If so, are there career opportunities in that area?  Why the sudden interest in this field?  (Why didn't you study it the first time around?)  Can your first college degree somehow dovetail with this degree?  There are no concrete answers here, to be sure.  But I would recommend an approach that involves (a) making sure this new interest is genuine, and not some reaction to an external event in life; (b) identifying all the financial implications and risks in making a move like this, (c) making sure you can tolerate those risks, which includes (d) having a backup plan if everything goes badly. ",
            "date": "Answered August 14, 2015",
            "views": "24",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nik Bielski",
                    "user_href": "/profile/Nik-Bielski"
                },
                {
                    "user_id": "Lucas Monteiro",
                    "user_href": "/profile/Lucas-Monteiro-15"
                },
                {
                    "user_id": "Robert Vincelette",
                    "user_href": "/profile/Robert-Vincelette"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Vincelette",
                "href": "/profile/Robert-Vincelette"
            },
            "answer_text": "It is not too late. I was 62 when I got my PhD, which was necessary because age discrimination makes it impossible to get hired by any corporation but it is not as bad for getting started teaching at a university. Granted that adjunct salary is little more than minimum wage, but for me, if they don't produce something better this year I plan to live off social security because my small house was paid for years ago, but at least it is something and I had reasons beyond career aspirations for earning a PhD and the unique dignity it gives me. In your case, when you finish, and as others tell you, when it is what you really want to do for a living, you will be nowhere near an age where you have to worry about age discrimination. Go for it. ",
            "date": "Answered August 13, 2015",
            "views": "11",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Reddav Neor",
                    "user_href": "/profile/Reddav-Neor"
                },
                {
                    "user_id": "Cláudia Anjos Lopes",
                    "user_href": "/profile/Cláudia-Anjos-Lopes"
                },
                {
                    "user_id": "David Long",
                    "user_href": "/profile/David-Long-54"
                },
                {
                    "user_id": "Anthony Albertorio",
                    "user_href": "/profile/Anthony-Albertorio-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jacob Bacon",
                "href": "/profile/Jacob-Bacon-1"
            },
            "answer_text": "There are many people who are much older than you who are pursuing advanced degrees. The average age for MBA students in the US is around 28. It is more a question of whether you can survive financially during your studies and whether this degree will take you to where you want to be in your academic or professional career. If Bpharm will allow you to pursue a career in pharmacy, then it can make sense. You may want to see if there is an advanced (Master's) degree that can help you in this field, rather than doing another undergraduate degree. In most cases, it is not too late to gain more education and knowledge. You just need to plan your future and be financially responsible while doing so. Good luck! ",
            "date": "Answered August 20, 2015",
            "views": "652",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lucas Monteiro",
                    "user_href": "/profile/Lucas-Monteiro-15"
                },
                {
                    "user_id": "Lital Helman",
                    "user_href": "/profile/Lital-Helman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Selim Jamil",
                "href": "/profile/Selim-Jamil"
            },
            "answer_text": "That's not too late at all... Most people who go into health careers don't really get to start working until they are in their 30s.  Doctors, physical therapists, pharmacists all need to go to school for a long time and not everyone knows they want to go right away. An extra year of coursework isn't bad... Enjoy it. ",
            "date": "Answered August 13, 2015",
            "views": "883",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lucas Monteiro",
                    "user_href": "/profile/Lucas-Monteiro-15"
                },
                {
                    "user_id": "Anthony Albertorio",
                    "user_href": "/profile/Anthony-Albertorio-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Long",
                "href": "/profile/David-Long-54"
            },
            "answer_text": "I had a great time with my PhD cohort when I started my degree at the age of 40.  Many of my lab mates were just a bit over half my age.  I didn't let that bother me or them. We always laughed when the MIT PhD students called our house to talk to my 12 year old son.  He was consulting on which video games they should buy for their dorms' common rooms.  (We also have great pictures of the 12 year old playing Rock Band with my classmates.) ",
            "date": "Answered August 14, 2015",
            "views": "602",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shaza Selvarajoo",
                    "user_href": "/profile/Shaza-Selvarajoo"
                },
                {
                    "user_id": "André Hernández",
                    "user_href": "/profile/André-Hernández-1"
                },
                {
                    "user_id": "Reddav Neor",
                    "user_href": "/profile/Reddav-Neor"
                },
                {
                    "user_id": "Anh Mai",
                    "user_href": "/profile/Anh-Mai-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yvonne Taylor",
                "href": "/profile/Yvonne-Taylor-5"
            },
            "answer_text": "You are 24 years old! You will take one year of science courses and will achieve a high score and pass your interview. A pharmacy program is four years. You will be 29 or 30 when you graduate. Still young. Don't settle on a just a job if being a pharmacist is what you want to be. It is not too late. Get started now and my best wishes on your achieving your goals. :) ",
            "date": "Answered August 13, 2015",
            "views": "595",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Anthony Albertorio",
                    "user_href": "/profile/Anthony-Albertorio-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Leland Harp",
                "href": "/profile/James-Leland-Harp"
            },
            "answer_text": "A2A What you are describing is a career change  that will occur depending on the opportunities. You are doing one thing now and wish to do something different. That something is pharmacy. To do that you need to take the necessary science courses and pass the exam. What are the pros and cons? I'm not sure of the pros but the only con I see is that you take the necessary courses and the fail exam. And you will never know if this is viable career change unless you try. Depending on your pros - a career as a pharmacist - this may or may not be a good choice. However, one con is not your age. ",
            "date": "Answered August 20, 2015",
            "views": "840",
            "upvotes": " Answer requested by Bincho Tan",
            "upvoters": [
                {
                    "user_id": "Sakshi Chabbra",
                    "user_href": "/profile/Sakshi-Chabbra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nitish Bansal",
                "href": "/profile/Nitish-Bansal-17"
            },
            "answer_text": "I can give you my perspective. I started my masters degree at 27. That is by all means ’old’ in my country. That’s the age where people get married and have babies and buy houses!! So, it’s not impossible or weird for you to do this at 24. We had a guy doing the same program as I and he was well into his thirties. People go back to college at all ages, so 24 is not bad at all. I can say, 25 would be the average age of students in my batch of masters. ",
            "date": "Answered June 21, 2020",
            "views": "253",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Raven Azar",
                "href": "/profile/Raven-Azar"
            },
            "answer_text": "Thanks for the a2a. I don't think it's too late, particularly for a medical degree as others have said I think exploring in the 20s is good. It may help prevent a lot of regret later on if you work in a field you don't like. You can work in the mean time as well. I know many people who are going back for medicine in their 30s and 40s. Hope that helps. ",
            "date": "Answered August 15, 2015",
            "views": "423",
            "upvotes": " Answer requested by Bincho Tan"
        },
        {
            "author_info": {
                "name": "Derek Sathre",
                "href": "/profile/Derek-Sathre"
            },
            "answer_text": "I went at 25 for associate’s degrees. I think as long as you want to learn do it. BUT, things cost money, so be smart about it. End rant. ",
            "date": "Answered April 20, 2020",
            "views": "70",
            "upvotes": "0"
        }
    ]
}