{
    "title": "Are there any academic journals for high school students? - Quora",
    "tags": [
        "Papers in Academic Journals",
        "Academic Journals",
        "High School Students",
        "Academic Papers",
        "The High School Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Austin R. Justice",
                "href": "/profile/Austin-R-Justice"
            },
            "answer_text": "There are several magazines and online publications that fashion themselves “journals” intended for high schoolers. In truth, the vast majority (perhaps all) of these self-proclaimed academic journals do not meet the standards of an actual academic journal published by a university or professional organization. That’s not to say that they’re all scams (some are, so be aware) — some might well encourage deeper critical thought and writing among high school students, which is never a bad thing, so feel free to submit your writings to them. But they aren’t recognized, legitimate academic journals and do not serve the purpose of an academic journal. In fact, most high school students would have trouble producing the kind of quality original research in a specialized field to publish in an actual journal; it can take years for a university professor to get his/her work published in one sometimes. That being said, after high school you’ll find that there are several journals for university students such as the Gettysburg College Journal of the Civil War Era and Berkeley Undergraduate Journal of Classics. These journals are designed for undergraduate students to publish their research. If you truly feel that you’ve produced a piece of genuine, original research as a high school student though, you can submit to any recognized academic journal. I know of a high schooler years ago who got published in a professional academic journal by Oxford. Such journals are intended for academics in specific fields, but they aren’t closed to submissions by anyone — it’s just that most don’t make the final cut. Best of luck! ",
            "date": "Answered November 22, 2016",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dustin K. MacDonald",
                    "user_href": "/profile/Dustin-K-MacDonald"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roberta FI Visone",
                "href": "/profile/Roberta-FI-Visone"
            },
            "answer_text": "I do not know :( ",
            "date": "Answered November 22, 2016",
            "views": "130",
            "upvotes": " Answer requested by Alex Miller"
        }
    ]
}