{
    "title": "Are you for or against Samsung ditching curved screens? - Quora",
    "tags": [
        "Samsung Products and Services",
        "Mobile Phone Screens",
        "Tablet Devices",
        "Computer Monitors and Screens",
        "Samsung Mobile",
        "Samsung (conglomerate)",
        "Samsung Galaxy Phones",
        "Android (operating system)",
        "Technology",
        "Smartphones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jona Arkenson",
                "href": "/profile/Jona-Arkenson"
            },
            "answer_text": "I am very happy. FINALLY for once SAMSUNG LISTENED to their fans and most people hate the curved screen.. it's POINTLESS and it also makes the phone extremely non-ergonomic and uncomfortable to hold and use.. especially since we are seeing thinner designs with ZERO bezel displays. Now, I don't know if Samsung is making this decision based on user's requests.. OR that the fact that they are heading towards a zero bezel screen phone so it would be absolutely impractical for a curved glass screen because there is literally NOWHERE for your hand to hold the phone.. so having a flat screen will make it somewhat easier and prevents “phantom touches” (accidental touch of the screen). Now the next thing Samsung needs to do and listen to is BRING BACK THE HEADPHONE JACK! Samsung LIED and said they removed the headphone jack on the Note 10 series because there was “no more space” and that they wanted room for a bigger battery.. well, their Note 10 Lite was just showcased and it has a headphone jack! Thus DEBUNKING their own claims. But sadly, Samsung did announced they are no longer having a headphone jack on their flagships.. only their budget, mid-range, mid-high-range budget phones like the Note 10 Lite will have the headphone jack.. but their premium top tier phones will not. Hope they will listen.. Either way, having a flat screen again is FINALLY the step in the right direction.. Samsung has been going in the wrong direction in my opinion as an Android enthusiast.. they keep focusing on making a stylish and beautiful phone at the cost of sacrificing ergonomics.. and they have been stripping away features like the headphone jack and the manual mode on their cameras. My FAVORITE Samsung phone was the Galaxy S5 and the Galaxy Note 4.. these were definitely the “enthusiast's phone” with lots of features and very ergonomic design.. the Galaxy S5 today is still one of the most ergonomic phone and it feels much better with a FLAT glass screen. Another thing about flat screens is that it's much easier to install a glass screen protector over it since glass screen protectors cannot attach to a curved surface… people WANT to use screen protectors, especially a glass screen protector. If Samsung was smart, they'd make the screen FLAT and make money off of glass screen protectors that they sell themselves. So I guess it's a step in the right direction.. though most likely it will have a 2.5d curve still (just like ob the Pixel and iPhone, there's a slight curve but it's very minimal) .. just a slight curvature at the very edge but overall the display portion will not be curved. The problem with the regular Galaxy S7 was that although the screen was not curved, the 2.5d was too much and it didn't allow you to install a glass screen protector..so I hope Samsung is reading this and make sure their next Galaxy S20 is capable of installing a glass screen protector.. even on the iPhone 11 Pro you can still install a screen protector and the screen still has a 2.5d curve. ",
            "date": "Answered January 18, 2020",
            "views": "464",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steven Zhang",
                    "user_href": "/profile/Steven-Zhang-265"
                },
                {
                    "user_id": "John Collins",
                    "user_href": "/profile/John-Collins-444"
                },
                {
                    "user_id": "Mihir Srivastava",
                    "user_href": "/profile/Mihir-Srivastava-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Boros",
                "href": "/profile/John-Boros-2"
            },
            "answer_text": "Against. Curved screens are more prone to break after a drop. Glass screen protectors are less effective as are cases. ",
            "date": "Answered January 21, 2020",
            "views": "102",
            "upvotes": "0"
        }
    ]
}