{
    "title": "Are you required to submit IB exam scores to colleges? What if they are bad? - Quora",
    "tags": [
        "International Baccalaureate (IB)",
        "College and University Admissions",
        "Education",
        "Exams and Tests"
    ],
    "response": [
        {
            "author_info": {
                "name": "Linda Farbar",
                "href": "/profile/Linda-Farbar"
            },
            "answer_text": "It differs from one country to another.. some universities like In the UK and other parts of Europe they definitely do. The offer given to you would be conditional based on minimum score required by them. some other universities they consider your predicted grades like in the US and Canada (but not all of them) and they don’t give any consideration to the IB score.. the IB system usually would ask you to name 6 universities where they will directly upload your score into their system automatically. now, if you get less than what they requested, you might get rejected. In some cases, if the score is a bit low ( not a big drop) they would still consider you and approve your spot. If the drop is high , they might offer you other majors that match your score but would withdraw the initial offer. in case the IB results in that particular year has dropped internationally, they do take that into consideration. in the Uk, they might offer you to join the foundation year. good luck. ",
            "date": "Answered August 12, 2020",
            "views": "38",
            "upvotes": " Answer requested by Lily Davis"
        },
        {
            "author_info": {
                "name": "Cheri Pestes",
                "href": "/profile/Cheri-Pestes"
            },
            "answer_text": "Your school adviser/counselor/mentor/ registrar will have a more definitive answer than me. Best I can tell, it depends entirely on the college/university you are applying to. Some require a certain score in each subject for admission. Some don’t. Virtually all have a particular score required if you want college credit for it. The lowest score I saw that would get credit is a 4 - but this totally depends on the school. I recommend going to the school’s website and searching IB scores and see what they say about them. I think that is your best bet. Blessings! ",
            "date": "Answered August 12, 2020",
            "views": "27",
            "upvotes": " Answer requested by Lily Davis"
        },
        {
            "author_info": {
                "name": "Andrew Crawford",
                "href": "/profile/Andrew-Crawford-3"
            },
            "answer_text": "Yes, you are required to submit your exam results. Your offer will in almost all cases be contingent on them. If they are bad, then your offer may be rescinded. But trying to conceal them will not produce a better outcome. ",
            "date": "Answered August 12, 2020",
            "views": "31",
            "upvotes": " Answer requested by Lily Davis"
        }
    ]
}