{
    "title": "Are Liberal Arts Colleges good for Computer Science? - Quora",
    "tags": [
        "Liberal Arts Colleges",
        "Liberal Arts",
        "Computer Science Education Advice",
        "Computer Science Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alvin Grissom II",
                "href": "/profile/グリサム-アルビン-Alvin-Grissom-II"
            },
            "answer_text": "I got my bachelor of arts degree at a liberal arts college (Hendrix College).  If I had to make the decision again, I would still choose a liberal arts college.   There are many personal reasons I choose Hendrix, but one of the most appealing practical considerations was the low student:faculty ratio.  In my graduating class, we had five computer science majors.  This meant that we had one-on-one attention that, for undergraduates, would be unheard of at a large university.   I also had interests outside of science that I wanted to pursue.   When I went to grad school at Emory  a year after earning my BA, I didn't feel unprepared.  There were things I didn't know, obviously, but there are things that everyone doesn't know.  My liberal arts background meant that I knew things that other people didn't, as well; they were just different things.  There weren't fundamental gaps in my knowledge. There's more to an education than checking off lists of courses.  If I could do one thing differently, it would be trying harder to get a real publication.  As an undergraduate, I just didn't understand that publications were the best way to prove that I could be a researcher.  This is only an issue for those applying to grad schools, though. Small, liberal arts colleges usually have less visibility and national recognition, which may put one at a disadvantage when applying for jobs outside of the region.  Generally, the people who attend such schools are less interested in the the prestige game than in the college experience itself.  That was certainly my attitude.  I thought I wanted to go to UT-Austin, which had already admitted me, for computer science.  Then I visited Hendrix and changed my mind within a few hours, fully aware that few outside of Arkansas would be impressed by my decision.  Those attending engineering schools were, at times, genuinely bemused by my decision to study at a liberal arts college for computer science, but frankly, they didn't know what they were missing.  Even now, some people, many of whom should know better, assume that because they were undergraduates at a more prestigious or science-centric school, they learned more then I did.  It's annoying, but that's how some people think.  But again, if you're seriously considering a liberal arts college, you probably already have an inkling of just how absurd the prestige game is.  This is not to say that I didn't have doubts about my decision.  I definitely did.  But in hindsight, it was a good one. In terms of our track records, no one had trouble getting a job.  Out of the five people in my graduating class, two (including me) have master's degrees, and I am trying (desperately) to finish a Ph.D.  The others have good jobs, one at Google and another at a firm in Tokyo.  We've done alright. The subsequent class was similar.  One of my friends in that class just finished his Ph.D.  Another has had a very successful career after getting a master's. ",
            "date": "Answered October 1, 2015",
            "views": "44",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nguyen Ha Thanh",
                    "user_href": "/profile/Nguyen-Ha-Thanh-4"
                },
                {
                    "user_id": "Favour Oluwole",
                    "user_href": "/profile/Favour-Oluwole-2"
                },
                {
                    "user_id": "Jeon Taehyung",
                    "user_href": "/profile/Jeon-Taehyung"
                },
                {
                    "user_id": "Prashant Sehgal",
                    "user_href": "/profile/Prashant-Sehgal-14"
                },
                {
                    "user_id": "Amer Esmail",
                    "user_href": "/profile/Amer-Esmail"
                },
                {
                    "user_id": "Quân Chần",
                    "user_href": "/profile/Quân-Chần"
                },
                {
                    "user_id": "Jocelyn C. Palmer",
                    "user_href": "/profile/Jocelyn-C-Palmer"
                },
                {
                    "user_id": "Patricia O'Reilly",
                    "user_href": "/profile/Patricia-OReilly-6"
                },
                {
                    "user_id": "Gyno Riley",
                    "user_href": "/profile/Gyno-Riley"
                },
                {
                    "user_id": "David Grier",
                    "user_href": "/profile/David-Grier-10"
                },
                {
                    "user_id": "Amanda Baker",
                    "user_href": "/profile/Amanda-Baker-36"
                },
                {
                    "user_id": "Gabriel J. Ferrer",
                    "user_href": "/profile/Gabriel-J-Ferrer"
                },
                {
                    "user_id": "Carlos Eguiluz",
                    "user_href": "/profile/Carlos-Eguiluz"
                },
                {
                    "user_id": "Gillian Shen",
                    "user_href": "/profile/Gillian-Shen-1"
                },
                {
                    "user_id": "Jing Guo",
                    "user_href": "/profile/Jing-Guo-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kim Tracy",
                "href": "/profile/Kim-Tracy-2"
            },
            "answer_text": "I wouldn't discount getting a CS education at a good liberal arts school.  See my prior answer at Kim Tracy's answer to Why do you attend liberal arts schools for CS?.  In Swarthmore's case, I would go visit them and see what the CS department is like.  You'll likely get different sorts of opportunities than you'd get at UIUC, but you may just go to graduate school there after going to Swarthmore and get the best of both worlds. ",
            "date": "Answered September 21, 2015",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amanda Baker",
                    "user_href": "/profile/Amanda-Baker-36"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jan Dawson",
                "href": "/profile/Jan-Dawson-3"
            },
            "answer_text": "In my opinion, the preferred CS program studies would be at an accredited small liberal arts college. A private college would be even better since you (will get) or got that scholarship. The all-around environment, including campus,  class size and instruction methods are just some of the benefits of going to a decent small liberal arts college.  It's a \"no-brainer,\" actually.U of I-UC would be fine, but not if you have to pay for it (loans) as opposed to a scholarship.UIUC may be one of the finest public research colleges in the country, but Swarthmore is more \"slouch\" either.I think that pretty much either one would be fine, but with a scholarship that isn't much of a decision, really.Go for it. ",
            "date": "Answered September 23, 2015",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Barry Rountree",
                    "user_href": "/profile/Barry-Rountree"
                }
            ]
        }
    ]
}