{
    "title": "Are secondary schools and high school the same? - Quora",
    "tags": [
        "Secondary School Education",
        "High Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Geier",
                "href": "/profile/Bob-Geier"
            },
            "answer_text": "I had a fun discussion with another Quoran on this in a different thread. Maya Holt has the right of it, it really depends on your location. The U.K. and much of Europe treat secondary schools as age 12 and up (roughly puberty and up). In the U.S., our history is different. Traditionally U.S. primary schools ran through age 14 (grades 1–8), and that constituted primary school. So in the U.S. case, secondary school and high school were the same. Over the past 50 years or so, most of the public school systems introduced junior high schools or middle schools, largely for economic and logistic rather than educational reasons. Middle schools run roughly age 11–14, junior highs age 12–15, but there are a lot of different permutations now based on the size of the school district and local choices. Almost all of the U.S. non-public schools remain on the original K-8 primary, 9–12 secondary model. Middle schools fall in the funny middle, and make the progression elementary school, middle school, then high school. While traditionally middle school years would be classified as “primary” and only high schools would be considered “secondary”, the actual program of instruction is transitional between the two. Teachers with primary/elementary certification can teach in middle schools in the U.S., as can teachers with secondary certification. It’s most common still to consider secondary schools and high schools to be the same thing (plus some 8–12 or 7–12 schools). However, some states and particularly urban areas lump middle schools in with “secondary” for structural reasons. In the U.S., parents prefer “neighborhood” elementary schools, so elementary schools tend to be smaller, and several elementary schools may feed into just one middle school. This means that the district supervisors for elementary education have many more schools to deal with, so it’s more practical to have middle schools report to the secondary level supervisors. That’s true even in states where middle schools aren’t considered “secondary”. As an aside, middle schools in the U.S. are an unqualified educational disaster; pretty much every measurable student educational and social outcome declines precipitously during middle school years. ",
            "date": "Answered August 15, 2019",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Emmanuel Effiong",
                    "user_href": "/profile/Emmanuel-Effiong-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maya Holt",
                "href": "/profile/Maya-Holt-3"
            },
            "answer_text": "Honestly, this really depends on your location. If you are referring to the American high school and the English secondary school, then no. In terms of teaching (as put in an answer before mine, then it is both a yes and a no, but I digress). English secondary schools have a different age demographic, for the majority of state schools (not private paid for/not a grammar school) the entry age is eleven/twelve as a Year Seven. Generally, they will remain with this same school until they are sixteen in Year Eleven, before joining a separate institute, or taking an apprenticeship, for sixth-form college. In the USA, on the other hand, students join high school at age fourteen as a ninth grader, or freshmen. They graduate at eighteen as seniors, at which point they either begin working or go to university. American high school students work to maintain a GPA (Grade Point Average) which is based on a combination of formative assessments and examined essays, it can be kept as a record from a student’s first year in school to their last. To show their capabilities in education to universities for better acceptance chances, students take final SATs (Scholastic Aptitude Tests) or ACTs (American College Tests). Back in England, secondary school students also have final exams in their last year. These are our GCSEs (General Certificates of Secondary Education), which are used by sixth-form college acceptance, and later university’s. For example, the college I am intending to join in a September needs me to achieve a Grade 7 in Chemistry, Biology, and Maths just to get into my chosen A-level subjects. Students in English secondary schools have to narrow down their studies for GCSEs, they must select a handful of subjects to continue to study, and the rest are dropped. This does not include English Language, Mathematics, and Science, all of which must be continued. Depending on the kind of American high school you join, the amount of subjects you can drop varies, as does the number of lessons a student has per day. In the UK this is typically five one hour lessons, but in the US there can be shorter classes but students do more each day. A lot of the different social environment factors between an American high school and an English secondary school are due to just the general culture of the country, and the difference in age groups. The maturity gap between an eighteen and fourteen year old in a high school is probably quite a bit larger than between a twelve and sixteen year old. There are different foods, of course, which affect the lunches you would typically receive in either. So, no, secondary schools and high schools are not the same- at least not in these terms. If this is not what you are referring to, please drop me a comment and I will try to answer your question more accurately. Have a good day! ",
            "date": "Answered April 8, 2018",
            "views": "16",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Leah Crowder",
                    "user_href": "/profile/Leah-Crowder-2"
                },
                {
                    "user_id": "Emmanuel Effiong",
                    "user_href": "/profile/Emmanuel-Effiong-6"
                },
                {
                    "user_id": "Bob Geier",
                    "user_href": "/profile/Bob-Geier"
                },
                {
                    "user_id": "Emil Beckstrøm",
                    "user_href": "/profile/Emil-Beckstrøm"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Howard",
                "href": "/profile/Michael-Howard-158"
            },
            "answer_text": "Within the United States, yes, but no. “Secondary school” generally refers to post-primary education. Primary school generally refers to what Americans call “elementary school,” and Secondary is the public schooling that comes after that. In some places, that is just high school. But in most places, secondary school consists of both middle/jr. high school AND high school. For example — I have a degree in Secondary Education. With that, I am certified to teach in middle schools, jr. high schools, and high schools. ",
            "date": "Answered April 4, 2018",
            "views": "306",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kate Moore",
                "href": "/profile/Kate-Moore-149"
            },
            "answer_text": "Is Secondary School high school? In the U.S secondary is junior high or middle school and high school. Before middle school is elementary. After high school is called post-secondary or tertiary. Middle school/junior high buildings range from grades five through eight; sometimes grade nine is included, but ninth graders are always transcripted as high school freshmen, even if they are housed with a middle school or a junior high. The most common pattern is 6–8 for middle school; when I started teaching, 7–9 was the most common assignment of grades for junior high. ",
            "date": "Answered April 21, 2020",
            "views": "73",
            "upvotes": " Not for Reproduction"
        },
        {
            "author_info": {
                "name": "Isacc Bridger",
                "href": "/profile/Isacc-Bridger"
            },
            "answer_text": "Yes secondary school is typically consider high school in pretty much every country besides the U.S. However, in China secondary school is actually middle school when translated. High school in Chinese is translated as 高中校, which essentially translates directly to ““high middle school”. cheers LY ",
            "date": "Answered April 21, 2020",
            "views": "81",
            "upvotes": "0"
        }
    ]
}