{
    "title": "Are private schools worth it to get into elite universities? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Jeremy Burnett Rae",
                "href": "/profile/Jeremy-Burnett-Rae"
            },
            "answer_text": "The worth of a private school to the children (whatever the snob value to the parents) is neither necessarily nor sufficiently measured by University entrance. The school could well be worth its price for the education it provides itself: its university entrance statistics may be a very crude measure of that education. In the UK, families have often gone to the same expensive \"Public School\" for generations, although their thick children may not have been university material at all, ( at least until the last thirty years, when many more kids now go to uni.)  As well as academic lessons in class, private schoolchildren may have many more exrtra-curricular activities: sporting, cultural, musical, artistic, dramatic etc. Beyond that, they may learn a recognisable private school ethos, in interpersonal skills with schoolfriends who are the children of parents with similar values, to which both sets of parents aspire for their children. (It may be a pity the parents are generally from the same social or intellectual circles, or it may be an advantage). For the children, the bond of comradeship in shared adversity is lifelong, Networking from an early age can pay.! In England, children at private schools work for much longer hours, both  in class and at homework, than state school pupils: then they have extra-curricular activities as well. That may make for a fundamentally different longterm attitude to work, a well as a higher standard in the short term, In academically exclusive private schools, it can help bright children to work with their intellectual equals, both in class and later in life when they recognise them in a less rarefied outside world. That hothousing may not be available in other schools. As you say, the brightest students can go to an elite university a lot more cheaply than by going to an expensive private school; but good schools help the borderline candidates by giving them a stronger basis for university entry. Otherwise, despite all the other adantages, I expect fewer parents would be prepared to make substantial sacrifices in their standard of living. ",
            "date": "Answered August 28, 2012",
            "views": "22",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zorie Todorova",
                    "user_href": "/profile/Zorie-Todorova"
                },
                {
                    "user_id": "Angus Hsu",
                    "user_href": "/profile/Angus-Hsu-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Chiu",
                "href": "/profile/Nathan-Chiu-2"
            },
            "answer_text": "Personally, I don't think private school is worth the expense. Like your friend, I had the option of attending a great private school, but I chose to stay in public school because my town had an excellent school. While academically, my public school wasn't as demanding as private school, I managed to challenge myself as much as possible by taking the hardest classes available and skipping grades in math and science. I agree with you that your friend would have done well regardless of whether she chose to go to Harker or public school.  One major benefit of attending a prestigious private high school, however, is the connections. Prestigious private schools tend to be feeders for elite universities like the Ivies.  Even with connections, private school is really not worth 40+k a year. Save that money for college tuition.  Sticking with public school was my best choice. I got to stay with my friends and still ended up getting accepted to an \"elite\" university. ",
            "date": "Answered January 2, 2016",
            "views": "738",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angeline He",
                    "user_href": "/profile/Angeline-He-1"
                },
                {
                    "user_id": "Evan Wilkins",
                    "user_href": "/profile/Evan-Wilkins"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sania Baker",
                "href": "/profile/Sania-Baker"
            },
            "answer_text": "It is very difficult to access the worth of a private school on the basis of a number of students getting into elite universities after completing the school education. A reputed private school prepares a student from every aspect. They make a student mentally strong, and also make him skilled in many subjects. Some schools even emphasize on the real interest of the student and try to make him more perfect in that area, so that the student can pursue his career in that area in future, if he desires. A reputed private school, like Archbishop Molloy High School, emphasizes on complete education and overall growth of a student. By complete education, they mean education that will make a student think independently, and that would enable a student to pursue higher studies in a specific subject. They also emphasize on extra curriculums, because without sports, good hobbies, and real-world skills, no education could be completed. ",
            "date": "Answered April 12, 2017",
            "views": "455",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe Farkas",
                "href": "/profile/Joe-Farkas-1"
            },
            "answer_text": "Going to a private school buys your way into an exclusive culture. That may correlate with higher academic standards (which can be declared arbitrarily) or personal achievements (which depend on home life, not school), but most often it correlates with wealthier and more powerful students/parents, and the opportunities they expect the school to secure/provide/create with their money. You're buying into opportunities and connections not otherwise available to the public. When a kid succeeds in an environment like that, the stakes are higher, and the audience is more capable of propelling that student to an elite university with their influence. ",
            "date": "Answered July 6, 2012",
            "views": "695",
            "upvotes": "0"
        }
    ]
}