{
    "title": "Are online classes stressful? - Quora",
    "tags": [
        "Online Classes",
        "Online Coaching",
        "Online Courses",
        "Classes",
        "Online Training",
        "Online",
        "Stress (psychological)",
        "E-learning",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paris Benson",
                "href": "/profile/Paris-Benson-7"
            },
            "answer_text": "Very. And I don’t mean to stress you out about it, but the short answer is YES. And for a number of reasons. It’s harder to get motivated. If you’re actually physically at school, you’ll be more energized and you’ll feel more encouraged to work. But if you’re at your own house, things get more difficult. It’s harder to find the motivation to do any online work, due to being in a familiar, comfortable environment that you’ve created habits with.It’s difficult to keep up. In school, teachers will typically assign work one assignment at a time, but in online school, it’s multiple assignments given by multiple teachers. They forget that we’re not used to this and that all this work is to stressful for us. It’s extremely difficult to get several assignments done at the right due dates if we’re already struggling on one. This causes us to fall behind and our grades drop.It isn’t the same learning experience. This connects to the first reason. Doing work and learning from home just isn’t the same as going to an actual class. During my time dealing with online school, I haven’t really “learned” anything. I just do the work (or at least try to) assigned. Being at home causes several distractions, making it more difficult to focus and work.It’s excruciatingly boring. Simply way they talk, the whole aura of the room, is just boring and awkward. Again, making it difficult to feel focused and motivated. 90% of the time the students are silent while the teacher attempts to present something with their slow internet. When the teacher asks a question to the class, there’s like 10 seconds of awkward silence before someone finally answers (if anyone answers at all).I’d go on, but you know. I don’t want to so, ¯\\_(ツ)_/¯. Point is online classes suck, and are in no way shape or form equal to real school at all. Remember! Reality is an illusion, the universe is a hologram, buy gold! Bye! Reply ",
            "date": "Updated October 25, 2020",
            "views": "14",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nhân Thiện",
                    "user_href": "/profile/Nhân-Thiện"
                },
                {
                    "user_id": "Julie Simmons",
                    "user_href": "/profile/Julie-Simmons-93"
                },
                {
                    "user_id": "Lizzie Tresenio",
                    "user_href": "/profile/Lizzie-Tresenio"
                },
                {
                    "user_id": "Khushboo Solanki",
                    "user_href": "/profile/Khushboo-Solanki-60"
                },
                {
                    "user_id": "Reem Reem",
                    "user_href": "/profile/Reem-Reem-34"
                },
                {
                    "user_id": "Alishba Ahmed",
                    "user_href": "/profile/Alishba-Ahmed-2"
                },
                {
                    "user_id": "REAPD",
                    "user_href": "/profile/REAPD"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anuttama Chakrabarty",
                "href": "/profile/Anuttama-Chakrabarty"
            },
            "answer_text": "Online classes are relatively new to India, but it is a strong component of today’s learning. Virtual classes are very much enjoyable as well as visual clarity is also established during the classes. From School children to job seekers it is a platform of never-ending opportunities. In this platform, you have an enormous storage of knowledge, waiting to be explored. Any subject, theoretical or practical can be easily available. There are many affordable channels[1] [2] which can supply you various audio-visual lectures as well as doubt clearing classes. Now, come to the point. Our children are not familiarized with computers and I beg your pardon, most of our parent is not either. As a result in this Covid-19 situation, most of them are at sea when online classes are introduced in India. I can guarantee you that the online class will remain even after the COVID situation is over, as it is the future of learning. Yes, there is stress, but should you and your children follow the safety guidelines, it can be minimized. There should be a minimum gap of 15 minutes between each session and eyes should be washed with water during this break. In this smartphone oriented world, both the parent and the children have already exposed to radiation, moreover, their time is wasted for nothing. Now you have to reduce that wastage by channelizing their time into this vast virtual world of learning. Yes, it is a stress for the children, who can not afford the luxury of being part of internet learning. In such cases, their teacher, their schools, NGOs, social workers, and the Government should help them to conquer their thrust of knowledge. Lastly, stress is now part and parcel of our life, then why not familiarize the children at the beginning ?? At least we can prepare them in such a way so that they can tackle this stress more efficiently than us. Footnotes[1] http://www.unacadamy.com[2] Get Your Personal Teacher Online from Vedantu",
            "date": "Answered June 27, 2020",
            "views": "17",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhoomika Ramesh",
                "href": "/profile/Bhoomika-Ramesh-7"
            },
            "answer_text": "Yes, Sometimes I feel online classes are stressful from my experience. I am a student of Computer Applications always. I would feel stress and discomfort if i continuously use my laptop for 5 to 6 hours for executing the lab programs or to complete my project, then i would not use it for next few days because i would be having headache and eye pain. But as of now i should attend the online classes due to the pandemic regularly for 3 hours and there would be a 3lab per 3 days in a week hence i have to extend my times to give attention towards the class and note down the notes and execute the programs to get output.If there is any error you have to go through it till you get the perfect output. If there are any computer students who are reading these they understand my effort of time we put into the problem solution And not only attending classes after the scheduled time of classes also, i have to complete our assignments,classworks or do some hands on work. For these completion of tasks i have to be referring to the notebooks/pdfs/ppts which are available digitally on google classrooms,we have to go through the video lectures virtually or get the answer from google or most simple way is to copy it from the friends assignment.But still for these i should go through my phone and copy it which leads me for my continuous eye pain, water moisture from eyes and soreness . This is because people are sensitive towards the rays or brightness which we have been exposed to on a continuous basis.Sometimes i would get lots of stress which results in my headache. Home scenario: Me: I get a headache and to get relief I apply the balm may be iodex or amrutanjan to reduce it.(Amma caught me applying) Mother : Don't use much phone,it is all because of it and you will use it 24/7 hours (my mind : i used only for 7 hours) But she thinks it is 24 hours that I would be holding the phone and chatting as  I know if I don't use the phone I could not complete my daily assignments. Because of this I would skip my online classes for two or three days in a week or I would just login and don't give any concentration to the class. For the people who are very sensitive to the brightness of a computer/phone and also too many tasks along with the work of personal activity leads to stress . Small tips give your eyes a rest as much as possible and take a cloth roll it with ice cubes and give an massage to your eyes. I would prefer not to be stressed. Be a learner but dont impose it on value of your health. Thank you for the question Shashi Kumar ",
            "date": "Answered July 21, 2020",
            "views": "21",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vinayak Kokane",
                    "user_href": "/profile/Vinayak-Kokane-3"
                },
                {
                    "user_id": "Fardin Khan",
                    "user_href": "/profile/Fardin-Khan-88"
                },
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fardin Khan",
                "href": "/profile/Fardin-Khan-88"
            },
            "answer_text": "This answer varies from person to person .Some students they do like offline classes because they do love physical interaction. Some are opposite .Basically those are introvert they do like online classes ,they feel very comfortable to ask question and to give answer . During class you have to put ear phone which sometimes give us headache .While attending classes background noise makes you very irritate.Very important issues are electricity and network ,sometimes student from rural area they don’t get strong and stable network so they faces problem . Most of the Rural area student they don’t have gadgets ,sometime they do take phone from their neighbour or from their parents ,sometime it makes them irritate because they have also some work on their mobile .What are the things that makes student comfortable for attending online classes :- While attending Physical classes you are completely depending on college administration’s rules and regulation.But in the case of online you can take time in-between classes .Some are very glutton they can keep some snacks while attending class . Forget about attending classes for hours, sitting in an uncomfortable chair, and suffering from back pain by the end of the day. All lectures and needed materials are provided via online platforms, so you’ll easily access them from the comfort of your home.Best part is that you will be habituate with technology.NOTE : Make your online classes effective and enjoyable . ",
            "date": "Answered July 21, 2020",
            "views": "12",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shashikant •́ ‿ •̀",
                    "user_href": "/profile/Shashikant-́-̀"
                },
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                },
                {
                    "user_id": "Ipsita Bal",
                    "user_href": "/profile/Ipsita-Bal-6"
                },
                {
                    "user_id": "Kaisary Khatun",
                    "user_href": "/profile/Kaisary-Khatun"
                },
                {
                    "user_id": "Ancil Verma",
                    "user_href": "/profile/Ancil-Verma-4"
                },
                {
                    "user_id": "MINA KHATUN",
                    "user_href": "/profile/MINA-KHATUN-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ananya Mathur",
                "href": "/profile/Ananya-Mathur-31"
            },
            "answer_text": "There are two kinds of online classes. One is online teaching and another is online self-paced classes/courses. And it depends on person to person, because something which might be stressful to me maybe not be for you. I’ll be talking about me in here! For online teaching, it can be stressful yes! Online books, pdfs and tests can seem a lot as compared to hard copies, reason being in online books you cannot mark generally (even though new technologies are coming up, but India is still much behind in building awareness about such things) and there’s a lot of scrolling and so you need to be a tech savvy and also have a good internet connection in case your books are stored on apps like google drive etc. They can be boring as well, as there’s no physical human contact, you might take them lightly and not take it as seriously as offline classes. I love the online self-paced classes, but again, you have to be very picky as not all educators have nice, understandable content. Sites like Udemy, Edx, Coursera, Netacad and so many more have made online self paced courses easier for me. And you might think why I am on so many e-learning platforms? Because as I mentioned earlier, you got to be picky and that’s what I am! I like some content of Udemy and other of edx and some other of coursera and so on. But I got to know what I like (what I understand, what content is for me) by trial and error! Online self paced courses are amazing to invest in during holidays, free time and especially now. All you need to do is choose good courses. Even youtube courses a.k.a youtube playlists are amazing! Some subjects which are related to business do not need to be viewed and so the audio lessons in such cases are so handy while walking and travelling! Instead of listening to interviews and even music, you can choose to learn a whole new topic. Hope this helps! ",
            "date": "Answered July 14, 2020",
            "views": "924",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fardin Khan",
                    "user_href": "/profile/Fardin-Khan-88"
                },
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akshaya Deviv",
                "href": "/profile/Akshaya-Deviv"
            },
            "answer_text": "according to me it is quite useful …but at times you may feel stressful…. i am attending 7 hrs of online classes daily except on sundays…and also during sundays i attend 3 hrs of online class too…my daily online class schedule starts by 7;30…before these online classes i used to study at least 6 to 8 hrs by my own …but now i could only study 4 hrs max… and also i have a lot of bending works which i cannot complete in this 4 hrs of self study…so sometimes i start hating these classes… but on the other hand it is also quite useful because they are completing the syllabus faster than before…and also we are able to ask our doubts without embaracement personally also….but stilll online classes create their own timetables…just check out mine…they give 30 min break after two classes what do you think we will be able to do in that 30 min??? they are telling us to have our breakfast and lunch during these breaks…and i feel stressful as i couldn’t read what i wish to read that day …so sometimes i feel exhausted… this is what i feel…and there a lot of guys out there just enjoying the classes…check out them too!!! byee…. ",
            "date": "Answered June 20, 2020",
            "views": "563",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Utkarsh Khandelwal",
                "href": "/profile/Utkarsh-Khandelwal-79"
            },
            "answer_text": "I think it’s the opposite. Online classes provide a wide scope for students to learn at their own pace and the stress causing factor “time” is eliminated because the students have a lot of time on their hands. So let’s discuss how online learning can positively impact a student’s mind: Online classes can provide a student enough time on hands by saving the commuting time.The studies are interactive helping them understand concepts easily with all the resources on their hand.The stress of exams can also be reduced online due to the available amount of test practices and quizzes.Students can work in an environment that they feel comfortable in and thus, reducing anxiety and stress triggers.Students can schedule online classes and studies according to a time they feel comfortable.With online studies, many LMS these days inculcate help for dealing with mental stress in students.Students who don’t feel comfortable asking for doubts can anonymously ask in the online classes messaging column.These are some of the ways online learning can help students dealing with stress. ",
            "date": "Answered June 27, 2020",
            "views": "445",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Subash Koonamkotil",
                "href": "/profile/Subash-Koonamkotil"
            },
            "answer_text": "Don't think it as a stress … If u r looking your mobile or PC for a long time for watching movies you won't be stressed..it is because of ur interest.. But we r not interested to listen to online classes .. Think what is the need of online classes . ??? Yes to complete the syllabus.. IF THE SYLLABUS IS NOT COMPLETED WHOM IT IS GOING TO AFFECT?? IT'S ONLY YOU .. U should be happy to attend online classes because you didn't need to go to school u can study from your home itself, no need to pay money in bus ,if u r going by walking u didn't need to walk ..at all the points u r lucky and u r in ur comfort zone itself.. We should appreciate the hardwork of ur teachers to complete your syllabus ..so be cooperative with them .. And you didn't need to pay fees also if u r studying in a private institute..online classes r free too..only net consumption included it is negligible as compared to fees of the institute So we r gaining so much things .. Take maximum advantage from that.. Hope it helps… Stay home and stay safe ",
            "date": "Answered May 3, 2020",
            "views": "486",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "S Kumar",
                "href": "/profile/S-Kumar-67"
            },
            "answer_text": "No. My pretty & naughty nieces in US are doing online since 4 years. My sister-in-law just sees to it that they attend all online classes. Even when I was on a holiday with them , my sister-in-law saw to it that they didn’t a class even when we were in the flight. On any of their holidays , they don’t have a holiday, they are now trained this way. As their socialisation is concerned with kids of their age , their earlier school friends have a night over etc. Even in US my Sister-in-law & bro have put their kids online where not many opt. But today it’s a way of life. Moreover they have opted for the best academic school . So can you. So bottomline: Routinise yourself to this kind of online academics. ",
            "date": "Answered May 15, 2020",
            "views": "297",
            "upvotes": " Answer requested by Shashi Kumar",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srinivasan Buddha",
                "href": "/profile/Srinivasan-Buddha"
            },
            "answer_text": "No. In fact they are more convenient and comfortable especially in these prowling pandemic times. No need to go out of home and maintain social distance, use sanitizers and masks. You can watch them at your own convenient time in the comfort of home environment sipping steaming tea/coffee. If you are in a bad mood, you can switch off your system/smartphone and watch them later when you regain your lost spirits/mood. The online YouTube videos of PTBD Academy are not only informative, incisive and innovative but are laced with wit and humour that drive away your stress, anxiety and fear. Just watch them free on YouTube. Learning must be fun, joyful and cheerful so that students develop liking towards studies. Online videos have those ingredients that help you to realise your dream. ",
            "date": "Answered July 18, 2020",
            "views": "289",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajavel KS",
                "href": "/profile/Rajavel-KS"
            },
            "answer_text": "Based on my experience, it will be depended based on the lecturer and the pace at which the course is set. Lecturer aspect There are a variety of online classes to start with. Full length courses recorded / live - These courses are somewhat interactive and they are less stressful. You will see the students asking doubts, making witty comments etc. For instance - Mr. Eddie Woo / Prof Leonard Math lectures on Youtube are great examples for this. The professors are very humorous.On the other side of the spectrum MOOCs by online course behemoths like NPTEL, edX etc will have a hyper-focused course videos which doesn’t help with pause and ponder, which are somewhat stressful as it demands complete attention.Self-paced courses / Instructor-paced courses.Self-paced courses are courses which have free schedules, which helps in our study plans. They are very flexible, hence more power. And have a word of warning - More power, corrupts more. It will be entirely your self-discipline to ensure you do learn it strategically.Coursera, Udemy, Udacity, Lynda (Now LinkedIn Learning) and some edX courses fall in this category.Instructor-paced courses are courses which have a specific time scheduled for passing through every course checkpoint. From what I saw from edX, it helps the TAs to answer only to a specific week’s queries by learners. These types of courses had to be made sure timely efforts are given to study the material.Most edX and NPTEL courses fall in this category.",
            "date": "Answered July 23, 2020",
            "views": "324",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Chandan Singh",
                    "user_href": "/profile/Chandan-Singh-3163"
                },
                {
                    "user_id": "Bindita Sinha",
                    "user_href": "/profile/Bindita-Sinha"
                },
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suman Chakraborty",
                "href": "/profile/Suman-Chakraborty-128"
            },
            "answer_text": "Hi Shashi Kumar There is no doubt that e-learning may affect students’ learning. Thanks to the latest technology, through which learners can now attend class from the comfort of their homes. Whether it is stressful or not, you decide after reading my answer! One of the main benefits of taking online courses is its flexible schedule from the comfort of your own home. It allows you to study at your own pace and it can be accessed anywhere, at any time. The basic requirements is meeting the deadlines. Online learning can help you in finding your strengths and minimize weaknesses. At the end of the day, it’s up to you to decide! ",
            "date": "Answered May 5, 2020",
            "views": "302",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ranveer Aryan",
                "href": "/profile/Ranveer-Aryan"
            },
            "answer_text": "Just a request, here we share experiences not the answers. Proven and well written answers are available on internet. Please Google these answers first so that we can discuss better things here instead of flooding my inbox. Please take my comment in a positive way as you hove done nothing wrong to me and that’s why no grudge against you. Btw answer to your question is yes, Online classes are stressful. ",
            "date": "Answered July 19, 2020",
            "views": "199",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Naina Mittal",
                    "user_href": "/profile/Naina-Mittal-34"
                },
                {
                    "user_id": "Sanu Santhosh",
                    "user_href": "/profile/Sanu-Santhosh-7"
                },
                {
                    "user_id": "Sparsh Saxena",
                    "user_href": "/profile/Sparsh-Saxena-19"
                },
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simanto K",
                "href": "/profile/Simanto-K-2"
            },
            "answer_text": "Conventional instruction in a classroom setting, understudies can learn and socialize with their peers. The educators can educate understudies numerous profitable lessons of life which cannot be learned through tutorials Younger understudies learn superior socially and scholastically in a classroom. Interaction makes it simpler for them to pay center and learn Students can learn and create reliability and great think about habits. A instructor serves as a direct through instruction prepare which may be a huge portion of life. There is this bond between the educators and the understudies which might not be built online. Online classes are more costly than conventional classes ",
            "date": "Answered October 6, 2020",
            "views": "112",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bharti Goel",
                "href": "/profile/Bharti-Goel-29"
            },
            "answer_text": "No, online classes are supposed to be less stressful. You have the comfort of attending the classes from home. If the sessions are pre-recorded, you also have the convenience to attend the session any time and you can revise it again and again too. Online classes have all these advantages, so there is no chance of it being stressful. We at Edu4Sure conduct online classes too. And, the feedback that we get is that they enjoy our classes very much. ",
            "date": "Answered May 4, 2020",
            "views": "262",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pushpreet Bhasin",
                "href": "/profile/Pushpreet-Bhasin"
            },
            "answer_text": "It totally depends on the way of teaching and the internet connection. If both of these things are tuned fine then online classes can be more fun than stressful. one of the application named plantspark is one good application for kids learning this can be tried for better experience.you can check their website to know more. ",
            "date": "Answered May 5, 2020",
            "views": "158",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jacob Sarkar",
                    "user_href": "/profile/Jacob-Sarkar-1"
                },
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raiza",
                "href": "/profile/Raiza-12"
            },
            "answer_text": "In a way they are very stressful, and in some other ways they are quite relaxing too. online class can put a lot of stress in the mind and bodies of students, and prolonged hours staring at a screen may lead to eye sight problems too. and they are relaxing in a way that you have so much time to do your homework and assignments, you can study according to your own timings because you don’t have a school to go to now. ",
            "date": "Answered August 1, 2020",
            "views": "182",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Riyansh Meena",
                "href": "/profile/Riyansh-Meena-1"
            },
            "answer_text": "They are stressful to your eyes but they are good for learning experience because whenever we do them We hear, we write important points , and we read the text with help of slides . It is a good way of teaching but it effect to your eyes you can’t take 2 or 3 hrs of online teaching but not more than that ",
            "date": "Answered June 14, 2020",
            "views": "150",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maanya Singh",
                "href": "/profile/Maanya-Singh"
            },
            "answer_text": "They definitely are, My younger brother who's in grade 3 , gets severe headaches when he's attending them as sitting in front of mobile screen causes stress in the eyes and when he doesn't attend them or leave them mid session, his teachers marks him as absent which causes stress in the mind. Imagine a 8 year old getting stressed out. It's like a nightmare. Anyway, the answer is YES, THEY'RE REALLY STRESSFUL. ",
            "date": "Answered July 22, 2020",
            "views": "160",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Khushpreet Veer",
                    "user_href": "/profile/Khushpreet-Veer"
                },
                {
                    "user_id": "Elif Karakas",
                    "user_href": "/profile/Elif-Karakas-2"
                },
                {
                    "user_id": "Money Veer",
                    "user_href": "/profile/Money-Veer-1"
                },
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "King Age",
                "href": "/profile/King-Age-1"
            },
            "answer_text": "Yes, in my opinion as alot of students unable to access online classes because of lack of internet facilities. Also,some private teachers (those are not teaching online ) are on edge of losing their jobs . Some Students are also don't know how to learn online. Thus , in my opinion YOUTUBE is the best and easiest and cheapest way to teach. which is also easy to use. YOUTUBE is ultimate source of knowledge. Hope you find your answer. If you like please upvote . Thankyou. ",
            "date": "Answered May 3, 2020",
            "views": "204",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elif Karakas",
                    "user_href": "/profile/Elif-Karakas-2"
                },
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sai Krishna Chowdary Bagadhi",
                "href": "/profile/Sai-Krishna-Chowdary-Bagadhi"
            },
            "answer_text": "Online classes may be stressful because long period of watching classes from phone , computer , etc may cause effect to eyes and back bone and some members do not have high speed internet connection so they may be in great stress ",
            "date": "Answered May 9, 2020",
            "views": "138",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trip ConeHead",
                "href": "/profile/Trip-ConeHead"
            },
            "answer_text": "Absolutely. My district decided to only make us manage three classes per quarter which is nice, but it also means that teachers are cramming a semester’s worth of work into half the time. Teachers have downright forgotten that we as students need breaks. The amount of work being piled on me has caused severe stress, anxiety, and sadness. ",
            "date": "Answered September 29, 2020",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sudeshna Das",
                "href": "/profile/Sudeshna-Das-140"
            },
            "answer_text": "Yes, most of the time. Mostly at a young age, you feel bored doing classes alone. Nobody to monitor whether you are there in front of the screen or not. People lack motivation. ",
            "date": "Answered May 16, 2020",
            "views": "128",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajendar Jain (Crazy Teenage Coach)",
                "href": "/profile/Rajendar-Jain-Crazy-Teenage-Coach"
            },
            "answer_text": "Online classes are a something new being experienced by the students. At least majority of them . Adjusting to the new methods, techniques, and adopting to it is certainly stressful. I am sure they will adjust to it and it will be less stressful as the process evolves. ",
            "date": "Answered July 18, 2020",
            "views": "109",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                },
                {
                    "user_id": "Evelyn Medrano (에벨 린 메드 라노)",
                    "user_href": "/profile/Evelyn-Medrano-에벨-린-메드-라노-イヴリンメドラーノ"
                }
            ]
        },
        {
            "author_info": {
                "name": "Luis Abreu",
                "href": "/profile/Luis-Abreu-61"
            },
            "answer_text": "Dependent-upon, but probably you’d probably think maybe not as so as so; after-all, you’re at your best spaced-confort-zone overall. But too, it’s also too dependent-upon as well as’s off. ",
            "date": "Answered May 2, 2020",
            "views": "175",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhavna Garg",
                "href": "/profile/Bhavna-Garg-37"
            },
            "answer_text": "I think sometimes they are stressful because you have to constantly sit in front of your laptop or use a phone that strains your eyes. ",
            "date": "Answered June 13, 2020",
            "views": "103",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chaitanya Kaushik",
                "href": "/profile/Chaitanya-Kaushik-12"
            },
            "answer_text": "No, online classes are not stressful. You can sit comfortably to attend the class You can keep some juices to drink with you No disturbance of the whole class It saves time Apart from these things, what do you think is stressful ",
            "date": "Answered July 11, 2020",
            "views": "99",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priyanshu Solanki",
                "href": "/profile/Priyanshu-Solanki-25"
            },
            "answer_text": "No, online classes are not stressful because in that we have 3 types of method listeningwatching videoreading which can refresh our mind and taking interest in it which gives us knowledge .",
            "date": "Answered May 6, 2020",
            "views": "102",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thomas Kaduvinkal",
                "href": "/profile/Thomas-Kaduvinkal"
            },
            "answer_text": "Yes,online classes are stressful. It has more disadvantages than advantage It consumes more time to understand anything. ",
            "date": "Answered June 18, 2020",
            "views": "84",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dinesh Tripathi",
                "href": "/profile/Dinesh-Tripathi-135"
            },
            "answer_text": "It depends on the quality of the content. But you have a choice to pause & restart at your will. So ultimately it can't be stressful. ",
            "date": "Answered May 8, 2020",
            "views": "90",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ranju Singh.",
                "href": "/profile/Ranju-Singh-197"
            },
            "answer_text": "Because in online class we are studying from home and no tension of going toilet, and drinking water we can do online class with full comfortable. ",
            "date": "Answered May 17, 2020",
            "views": "103",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shashi Kumar",
                    "user_href": "/profile/Shashi-Kumar-3565"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shekhar Hardikar",
                "href": "/profile/Shekhar-Hardikar-1"
            },
            "answer_text": "Online classes are meant to help learner become self- regulated learner. If the learner doesn’t in regulation, any class could be stressful. ",
            "date": "Answered July 24, 2020",
            "views": "73",
            "upvotes": " Answer requested by Shashi Kumar",
            "upvoters": [
                {
                    "user_id": "Aahana Sharma",
                    "user_href": "/profile/Aahana-Sharma-83"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vidyananda K",
                "href": "/profile/Vidyananda-K"
            },
            "answer_text": "No but continous watching lessons it may effect. after 40 minutes take a break ,its good for your eyes and mind ",
            "date": "Answered August 1, 2020",
            "views": "74",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Amaya Shukla",
                "href": "/profile/Amaya-Shukla-1"
            },
            "answer_text": "Yes and no. Well, they make my eyes tired. And also the completion of syllabus occurs slowly when taught online. ",
            "date": "Answered June 14, 2020",
            "views": "108",
            "upvotes": " View 1 Upvoter "
        }
    ]
}