{
    "title": "Are teachers allowed to sell things to students? - Quora",
    "tags": [
        "Teachers",
        "Teaching",
        "Students",
        "Legal Issues and Law in Everyday Life",
        "Law"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lisa Payne",
                "href": "/profile/Lisa-Payne-96"
            },
            "answer_text": "Well, I think it depends on the context. I would not and should not sell from my classroom or promote my business from my classroom. Now, would I mention that I work somewhere as a side gig? Well, probably only if I don’t mind if they show up. It’s ok if I accidentally end up delivering them a pizza or Chinese. If I’m working the concession stand or a bookstore(are they still around? I worked at one in high school), yes I’m totally ok with selling to them. If they contact me because they heard I sell Mary Kay or my bumper sticker for some other mlm tipped them off- I would sell but cautiously. My point is, I think it’s unethical to market or do a hard sell on your kids(students). There’s a certain amount of trust that you build that is already fragile because of what people think or emote upon teachers. One bad transaction could not only destroy that but also make you look like you’re using a position of power to profit. I tutored a whole lot several years ago but I would not tutor my own students unless I did it for free. I did do the pro bono thing a few times because the kids needed a little extra push and I didn’t want money to be a part of the equation. When I tutor students outside my sphere of students there is a charge and honestly I do my research to get the max going rate. ",
            "date": "Answered April 20, 2020",
            "views": "492",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Antoine Nunano",
                "href": "/profile/Antoine-Nunano"
            },
            "answer_text": "What you are allowed to do, and what is ethical are two different things. I have written a number of educational texts, and I made an agreement with my publisher that I will be given free copies for all my students because I don’t believe in selling something I’ve written to my students. I don’t use my own name on my books, and most of the time, the students had no idea I had written the book. I prefer it that way. However, I know plenty of teachers who write books and use the same books in their class, and they sleep just fine at night. I think you need to look at the reasoning behind what you are doing. If you are selling something to make learning more convenient for the students, awesome. If you are selling something you believe in, fine. If you are selling something so you can make more money … not so much. ",
            "date": "Answered August 22, 2019",
            "views": "11",
            "upvotes": " Answer requested by Jadon Ogala"
        },
        {
            "author_info": {
                "name": "Andrew Gregg",
                "href": "/profile/Andrew-Gregg-14"
            },
            "answer_text": "Greetings, No. In fact, our district policy explicitly forbade the practice after a less-than-professional colleague was discovered selling single-serving envelopes of hot chocolate to students. Sincerely, AJG. ",
            "date": "Answered August 22, 2019",
            "views": "300",
            "upvotes": " Answer requested by Jadon Ogala"
        },
        {
            "author_info": {
                "name": "Wei Shen",
                "href": "/profile/Wei-Shen-5"
            },
            "answer_text": "If you mean supplies yes. but they can’t sell them for a profit. If it’s to round off the change so it’s easer then yes from 3cents to 5cents or to dollar and not charge the 3 cents. Otherwise no. Teachers are not to make business or personal gain during school hours. They have a job and that is to teach! ",
            "date": "Answered August 21, 2019",
            "views": "432",
            "upvotes": " Answer requested by Jadon Ogala"
        },
        {
            "author_info": {
                "name": "Rene Schmidt",
                "href": "/profile/Rene-Schmidt-4"
            },
            "answer_text": "Usually not. Decades ago publishers used to recruit teachers to sell encyclopedias as a part time job. Parents might buy from trusted “Mr. Bob’s Teacher” when he came by after school. The conflict of interest in that became obvious and new rules in most school boards forbade the practice. ",
            "date": "Answered April 20, 2020",
            "views": "172",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Maples",
                "href": "/profile/Richard-Maples-2"
            },
            "answer_text": "In many cases the district doesn’t frown upon it. I’ve sold firewood to students a number of times. I bring it in the truck to school and pass it off to them in the parking lot. I had extra insulation and sold that to a student’s parents as they built an addition on their house. ",
            "date": "Answered April 20, 2020",
            "views": "121",
            "upvotes": "0"
        }
    ]
}