{
    "title": "As an illiterate person, what would you advise to somebody highly educated? - Quora",
    "tags": [
        "Illiteracy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Venkatasubramanian Meenakshisundaram",
                "href": "/profile/Venkatasubramanian-Meenakshisundaram"
            },
            "answer_text": "What is the use of your high education if it is not giving any dividends to the society that you share with us.Remember the amount of money and time invested on you by the Government to bring you to this level. It is the tax payer’s money and you are responsible for giving back something positive to the society.All your support services are taken care of by people like us and if you want to lead the life of your choice you need to reciprocate. Don’t forget our role in shaping the society.Through education you can manipulate the rules, the legislation, morality, ethics and even truth. But we are illiterates and we depend on the above to lead and value our life. Hence please consider our plight when you involve in such actions.At the end stages of our lives when we hang out together for our internal assessment, I may have less worries than you as the manipulations you did will weigh heavily on your negative side and make you regret. Therefore be conscious.",
            "date": "Answered January 7, 2018",
            "views": "82",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Meera Venkat",
                    "user_href": "/profile/Meera-Venkat-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emma",
                "href": "/profile/Emma-1393"
            },
            "answer_text": "It depends on what that educated somebody and me was talking about and how he behave with me an illiterate. But i will say please use your intelligence to help others illiterate from the third world countries so they can build a better life. ",
            "date": "Answered January 7, 2018",
            "views": "14",
            "upvotes": "0"
        }
    ]
}