{
    "title": "As a student teacher, so you agree that solving mathematics problems are difficult to teach in the primary school? Why? - Quora",
    "tags": [
        "Mathematics Education",
        "Teachers",
        "Teaching",
        "Students"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Stein",
                "href": "/profile/Bob-Stein-2"
            },
            "answer_text": "I’m not a student teacher. I’m answering because the question suggests a major developmental disconnect. Children under the age of about 8 years generally only have the brain development to do what most call arithmetic. This is in the range of knowledge and comprehension on Bloom’s Taxonomy. Application level is a brain development challenge and what they are working to achieve at this age. True math happens at the analysis, synthesis, and evaluation levels — usually starting at age 9–10 years and beyond. You can use their sentence structure to get a clue if the child is ready to start working on something that approaches true math. I would take a shot at teaching something mathlike if the child commonly uses complex sentences with subordinate clauses and appropriate pronoun references. Also, if they can make something that sounds like a reasoned argument using several related sentences organized in some appropriate order. You can often teach arithmetic and mathematical symbols to very young children if you use language teaching methods but true math is unlikely to be the province of a person limited to simple sentences or binary thought processes. ",
            "date": "Answered October 5, 2020",
            "views": "622",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Joyce",
                    "user_href": "/profile/David-Joyce-11"
                },
                {
                    "user_id": "Roger Williams, III",
                    "user_href": "/profile/Roger-Williams-III"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Hubel",
                "href": "/profile/George-Hubel"
            },
            "answer_text": "Let’s say I am a 10 year old. Aside from grades, and the approval of you and my parents, tell me why I should care about math. What is in it for me? Want to play a D & D game? Want to learn to cook with your mom (or dad)? Want to know how to win at blackjack (card counting)? I bet the last one will be really popular. But why not; it includes simple addition and counting. Sounds like a winner to me. Teaching abstraction is really hard. Teaching them to do something they want to do, even if it requires some math, much easier. Crack that code and you are in. If you figure how to do that, let me know. I would like to know the answer too. Look, there are kids in Brazil who never learned arithmetic, but somehow they sell stuff and know how to make the correct change. People learn what they are motivated to learn. ",
            "date": "Answered October 6, 2020",
            "views": "723",
            "upvotes": " Answer requested by Rosel Manza"
        },
        {
            "author_info": {
                "name": "Bruce Deitrick Price",
                "href": "/profile/Bruce-Deitrick-Price"
            },
            "answer_text": "I'm not a teacher, more a student of education. Mathematics has to be taught step-by-step, with mastery all along the way. If you don't do that, you render your math instruction null and void. Common Core Math is the killer virus in our schools. Its approaches do render the solving of math problem very difficult or impossible. The education establishment has a clear track record of undermining math. New Math in 1962, Reform Math circa 1985, and Common Core Math in the last 10 years—all seen carefully designed to be counterproductive. Children often don't master even elementary arithmetic. Children are told that this failure is not important as they can always rely on a calculator. The central technique in all of this fraudulent pedagogy if to talk about math, as opposed to learning to do math. The meaning of math, that's a buzzword. Mathland was one version of Reform Math. It famously asked the question, if math were a color, what would it be? That gives you some idea of the intellectual level that the Ed professors were content with. To defend your children against this sort of nonsense, you have to understand how the professors think. They are ideologues and don't care about academics the way you might hope. They care about social engineering, which means leveling everybody into a homogeneous group. Their approach basically constituted an assault on math as traditionally understood. ",
            "date": "Answered October 7, 2020",
            "views": "456",
            "upvotes": " Answer requested by Rosel Manza"
        },
        {
            "author_info": {
                "name": "Mike Giannatos",
                "href": "/profile/Mike-Giannatos"
            },
            "answer_text": "I personally find it difficult to approach children in primary school age. I'm used to teaching high school students. I don't know how to make children understand and how to come down to their level of knowledge. I guess I would be able to comply to primary school's needs eventually, but it would be a difficult endeavour, both for me and the children… ",
            "date": "Answered October 5, 2020",
            "views": "219",
            "upvotes": "0"
        }
    ]
}