{
    "title": "Can I still pass the year if I passed 3 quarters and failed one in high school (with all F’s)? - Quora",
    "tags": [
        "Grades (education)",
        "Grade Point Averages",
        "Failure",
        "High School Education",
        "Academic and Educational Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arrie Katch",
                "href": "/profile/Arrie-Katch"
            },
            "answer_text": "If you had a high A all three quarters then maybe. But then again I'm sure you'd barely scarpe by and maybe not even that. In my school if you fail a quarter and that brings your semester grade down to like a 60 or below, your gonna have to take that class again. I would highly recommend against failing all your classes as it not only hurts your GPA, college chances (yes they can rescind offers even if you already got accepted), scholarships and time. Now I'm kind of curious as to why/how you'd manage(d) to fail all your classes. If it is because of a chronic illnesses, a death of a close loved one, rehab, etc then I'm sure you can talk to your counselor and go over your situation with them. Let them know why you haven't done well and tell them that you take responsibility for it but would like to succeed. If your counselor is human with a beating kind heart they may work something out with you. If they are an automotan then I'm sorry but you'd be out of luck. Hope you can get through this situation all right. ",
            "date": "Answered December 10, 2019",
            "views": "111",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ilydavid",
                    "user_href": "/profile/Ilydavid"
                },
                {
                    "user_id": "Pammela NavarTarango",
                    "user_href": "/profile/Pammela-NavarTarango"
                },
                {
                    "user_id": "Steve Dexter",
                    "user_href": "/profile/Steve-Dexter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lee Kleir",
                "href": "/profile/Lee-Kleir"
            },
            "answer_text": "Go out of your way to get the 3 Fs off your record. If this was a medical or legal problem get official copies to save with your own copies. Believe me you do not want to explain this over and over for your lifetime. If needed move overseas and change your names. Get legal advice from a good attorney. Lee ",
            "date": "Answered May 20, 2020",
            "views": "13",
            "upvotes": " Answer requested by Tannaz Adib",
            "upvoters": [
                {
                    "user_id": "John TaySutuj",
                    "user_href": "/profile/John-TaySutuj"
                },
                {
                    "user_id": "Matija Milenkovic",
                    "user_href": "/profile/Matija-Milenkovic"
                },
                {
                    "user_id": "Giorgio Halovich",
                    "user_href": "/profile/Giorgio-Halovich"
                },
                {
                    "user_id": "Niki Dzi",
                    "user_href": "/profile/Niki-Dzi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Burt Andrews",
                "href": "/profile/Burt-Andrews"
            },
            "answer_text": "Probably not, especially if the failed class is one of the required core courses. You will have to retake the course, probably in summer school. This time, don’t dick around. Do the studying, the homework, and pass the tests. You are seeing what happens when you blow off a course. It’s time to grow up. ",
            "date": "Answered April 24, 2019",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daniel Carey",
                "href": "/profile/Daniel-Carey-21"
            },
            "answer_text": "Maybe, maybe not. It depends on how your school calculates the grades. If they use percentages and you had 70% minimal Cs for 3 quarters, and then earned a 0 for the last quarter… 3× 70 = 210 / 4 = 52.5 and you're screwed, basically. More to the point… WHY did you fail EVERYTHING that quarter? Senioritis? ",
            "date": "Answered April 17, 2020",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adrian Woodward",
                "href": "/profile/Adrian-Woodward-9"
            },
            "answer_text": "It depends on how credits are assigned. If your credits are set each semester then if you improve your grades, then yes. But if you continue to get F’s, then you may have to take summer school, and/or take remedial classes next year. ",
            "date": "Answered June 15, 2020",
            "views": "686",
            "upvotes": " Answer requested by Tucker Jones"
        },
        {
            "author_info": {
                "name": "David Schneider",
                "href": "/profile/David-Schneider-5"
            },
            "answer_text": "Why are you asking Quora. None of us knows the answer. Check your school. ",
            "date": "Answered May 23, 2020",
            "views": "833",
            "upvotes": " View 4 Upvoters "
        }
    ]
}