{
    "title": "Can an average intelligence person get a PhD? - Quora",
    "tags": [
        "Doctor of Philosophy Degrees",
        "Intelligence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin J Pitt",
                "href": "/profile/Martin-J-Pitt"
            },
            "answer_text": "It is possible, but may not always be a good thing. It depends where you are in the world, and the regulations and ethical standards. In a corrupt society, the child of an important person may gain entry to courses and be awarded qualifications despite lack of ability. People have been awarded PhDs for plagiarized theses, or those that have been written by someone else for money. (There are plenty of websites offering to do this.) PhDs at some institutions may be for lower standards than at others. An alternative is that in some cultures, credit is given for simply accumulating information of what others have said, with no criticism or original thought, and a PhD might be awarded on this basis. However, in the countries with which I have been involved, the standard is for original work, and demonstrating a critical appreciation of the foregoing work via the literature. It is also possible for a student to find themselves in a “gift” project. That is, the supervisor provides the equipment and idea and it is inevitable that a worthwhile discovery will be made, just by doing the work with no imagination or real contribution. If the student is poor, the professor (or other members of the research team) will usually write the papers which produce praise for the discovery and possibly media attention. It would then be somewhat embarrassing for the student to fail, so this becomes unlikely. It is possible, but for the institutions I know it is very unlikely that they would meet the entrance requirements in the first place. I also know of students who were significantly less able than average who have had a very unhappy time in attempting a PhD. The contrast with the obviously good ones is clear. ",
            "date": "Answered September 9, 2017",
            "views": "109",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Sless",
                    "user_href": "/profile/Jonathan-Sless"
                },
                {
                    "user_id": "Lady Asabea",
                    "user_href": "/profile/Lady-Asabea"
                },
                {
                    "user_id": "Alana Winner",
                    "user_href": "/profile/Alana-Winner-1"
                },
                {
                    "user_id": "Kaaushik Maity",
                    "user_href": "/profile/Kaaushik-Maity"
                },
                {
                    "user_id": "HK",
                    "user_href": "/profile/HK-149"
                },
                {
                    "user_id": "Tyron Nathan King",
                    "user_href": "/profile/Tyron-King"
                },
                {
                    "user_id": "Onaj Tamo",
                    "user_href": "/profile/Onaj-Tamo"
                },
                {
                    "user_id": "Ioan Gotcan",
                    "user_href": "/profile/Ioan-Gotcan"
                },
                {
                    "user_id": "Natalie Wong",
                    "user_href": "/profile/Natalie-Wong-103"
                },
                {
                    "user_id": "Sarah Kunish",
                    "user_href": "/profile/Sarah-Kunish"
                },
                {
                    "user_id": "Jabulani Jama",
                    "user_href": "/profile/Jabulani-Jama"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Slocombe",
                "href": "/profile/Tom-Slocombe"
            },
            "answer_text": "Although it's popular to say that earning a PhD  is mainly a matter of endurance and persistence, most of the PhDs I've met--and I've met hundreds--seemed to have above-average intelligence, and many seemed way above average. In a sense this is a trick question because it depends on your definition of intelligence, which is often murky and controversial. The answer also depends on which PhD programs you have in mind. Even mid-level PhD programs often require admission exam scores that are out of reach for most people of average intelligence and difficult for people of superior intelligence. Most faculty involved with PhD students want students of superior ability because ordinary students are not likely to do well producing a dissertation. I think it's unlikely that persons of average intelligence--to me this means people with an IQ of 95 to 105--would perform at the level expected of a PhD if they found a program that would admit them and award them the degree. I think someone of average intelligence would feel uncomfortable being surrounded by people of superior intellect.  I just googled average IQ of PhDs. As expected, the results of different sources varied, but the ones I skimmed implied an IQ of at least 120 is needed to expect to do well. When I was a doctoral student, I had a psychology prof who said the average IQ of PhDs was 141. (Note this is the average, not the minimum; so half would be lower than that.) I don't know where he got that, but I would not be surprised if it were true, based on my encounters with PhDs.   ",
            "date": "Answered February 14, 2016",
            "views": "191",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Hunter",
                    "user_href": "/profile/David-Hunter-69"
                },
                {
                    "user_id": "Julie Bond",
                    "user_href": "/profile/Julie-Bond-35"
                },
                {
                    "user_id": "Celso Araujo",
                    "user_href": "/profile/Celso-Araujo"
                },
                {
                    "user_id": "Jonathan Sless",
                    "user_href": "/profile/Jonathan-Sless"
                },
                {
                    "user_id": "Xiang Li",
                    "user_href": "/profile/Xiang-Li-538"
                },
                {
                    "user_id": "Tekla Babyak",
                    "user_href": "/profile/Tekla-Babyak"
                },
                {
                    "user_id": "Avi Halevy",
                    "user_href": "/profile/Avi-Halevy-1"
                },
                {
                    "user_id": "Der Tery",
                    "user_href": "/profile/Der-Tery"
                },
                {
                    "user_id": "Jérémy Borel",
                    "user_href": "/profile/Jérémy-Borel-1"
                },
                {
                    "user_id": "Kaaushik Maity",
                    "user_href": "/profile/Kaaushik-Maity"
                },
                {
                    "user_id": "Stefan Khoo",
                    "user_href": "/profile/Stefan-Khoo"
                },
                {
                    "user_id": "Ryan Baron",
                    "user_href": "/profile/Ryan-Baron-1"
                },
                {
                    "user_id": "Tyron Nathan King",
                    "user_href": "/profile/Tyron-King"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Mark-1170"
                },
                {
                    "user_id": "Gerald Ingram",
                    "user_href": "/profile/Gerald-Ingram"
                },
                {
                    "user_id": "Naveen Ramaswamy",
                    "user_href": "/profile/Naveen-Ramaswamy-3"
                },
                {
                    "user_id": "Onaj Tamo",
                    "user_href": "/profile/Onaj-Tamo"
                },
                {
                    "user_id": "Ioan Gotcan",
                    "user_href": "/profile/Ioan-Gotcan"
                },
                {
                    "user_id": "Eliezer Spiegel",
                    "user_href": "/profile/Eliezer-Spiegel"
                },
                {
                    "user_id": "Lionel Mew",
                    "user_href": "/profile/Lionel-Mew"
                },
                {
                    "user_id": "Sarah Kunish",
                    "user_href": "/profile/Sarah-Kunish"
                },
                {
                    "user_id": "Jim Klosowski",
                    "user_href": "/profile/Jim-Klosowski-1"
                },
                {
                    "user_id": "Konghua Lei",
                    "user_href": "/profile/Konghua-Lei"
                },
                {
                    "user_id": "Bin Jack",
                    "user_href": "/profile/Bin-Jack"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Danford",
                "href": "/profile/Dan-Danford"
            },
            "answer_text": "Yes, I think so. Earning a PhD is a process, and it requires persistence as much as intelligence. I was in a doctoral program and completed all the prep work, referred to as ABD (All But Dissertation). This involved completing coursework and passing an exam over research and writing techniques. The last phase involves devising and implementing a substantial research project, and defending that work before a committee of August faculty members. A committee chairperson should mentor the PhD candidate and - ideally - offer guidance in conducting and presenting the research. Of course, it is the candidate's work and responsibility to complete the research and write the dissertation. When completed, the committee decides if and when the work is satisfactory to earn the PhD designation. It is not easy, but the key for success is following the process and sticking with it until completion. I do have to tell you, though, that I abandoned my studies before finishing the program. I made a bad choice of committee chair and various other committee members left the institution or suddenly died. New committee members were not committed to my research, and I did not receive mentoring or guidance needed. It was a monumental decision but I finally quit. (My simple explanation is that I abandoned an abusive relationship.) However, it was my own issue with persistance that doomed the attempt. I simply wasn't willing to persist any longer. ",
            "date": "Answered September 11, 2020",
            "views": "253",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Philip Wik",
                    "user_href": "/profile/Philip-Wik-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mostafa Noah",
                "href": "/profile/Mostafa-Noah"
            },
            "answer_text": "I would like to start answering this by quoting some lines from Matthew Might's blog :  There's a ruinous misconception that a Ph.D. must be smart. This can't be true. A smart person would know better than to get a Ph.D. \"Smart\" qualities like brilliance and quick-thinking are irrelevant in Ph.D. school. Students that have made it through so far on brilliance and quick-thinking alone wash out of Ph.D. programs with nagging predictability. Let there be no doubt: brilliance and quick-thinking are valuable in other pursuits. But, they're neither sufficient nor necessary in science.  \"Perseverance, tenacity and cogency\" are the most influential traits to get a PhD, than just being \"an intelligent person\".[1]  So, my answer is: YES, definitely he can!  Footnotes[1] 3 qualities of successful Ph.D. students: Perseverance, tenacity and cogency",
            "date": "Answered February 8, 2016",
            "views": "97",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yeshaswini Melekote Palaksha",
                    "user_href": "/profile/Yeshaswini-Melekote-Palaksha"
                },
                {
                    "user_id": "Anurag Bose",
                    "user_href": "/profile/Anurag-Bose-11"
                },
                {
                    "user_id": "Adrian Popa",
                    "user_href": "/profile/Adrian-Popa-14"
                },
                {
                    "user_id": "Alana Winner",
                    "user_href": "/profile/Alana-Winner-1"
                },
                {
                    "user_id": "Kaaushik Maity",
                    "user_href": "/profile/Kaaushik-Maity"
                },
                {
                    "user_id": "Onaj Tamo",
                    "user_href": "/profile/Onaj-Tamo"
                },
                {
                    "user_id": "Rahul Narula",
                    "user_href": "/profile/Rahul-Narula-1"
                },
                {
                    "user_id": "Bin Jack",
                    "user_href": "/profile/Bin-Jack"
                },
                {
                    "user_id": "Deepta",
                    "user_href": "/profile/Deepta"
                }
            ]
        },
        {
            "author_info": {
                "name": "BC Liang",
                "href": "/profile/BC-Liang"
            },
            "answer_text": "Absolutely. The “average” person can do anything. I guess as noted here with the others, is how/what you define as average. Is it to persevere? To work harder? To have the ability to memorize more? To calculate faster? To be more extroverted? I even see the ‘average’ bitter answer that someone else/others are devious because they lack talent - but does that mean they are average? Some even suggest that IQ is the measure of ‘average’ - reporting numbers from a test. I leave you with an Einstein quote, “Everyone is a genius. But if you judge a fish by its ability to climb a tree, it will live its whole life believing that it is stupid.” YMMV.  Iron Mountain. Photo copyright of the author. ",
            "date": "Answered September 9, 2017",
            "views": "61",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Trevor White",
                    "user_href": "/profile/Trevor-White-68"
                },
                {
                    "user_id": "MUNA AlThani",
                    "user_href": "/profile/MUNA-AlThani-1"
                },
                {
                    "user_id": "Adrian Popa",
                    "user_href": "/profile/Adrian-Popa-14"
                },
                {
                    "user_id": "Kaaushik Maity",
                    "user_href": "/profile/Kaaushik-Maity"
                },
                {
                    "user_id": "Onaj Tamo",
                    "user_href": "/profile/Onaj-Tamo"
                },
                {
                    "user_id": "Tushar Patel",
                    "user_href": "/profile/Tushar-Patel-329"
                },
                {
                    "user_id": "Troy Mason",
                    "user_href": "/profile/Troy-Mason-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pete Anthony",
                "href": "/profile/Pete-Anthony-1"
            },
            "answer_text": "This is a tricky question since intelligence is a psychological construct and is thus, cannot be directly observed. It really all depends. Indeed, brilliance is a very important trait in doctoral students but it does not account for the whole story. I would say that a person with a double digit IQ (less than 100) probably would not be able to get a phd. The field is also an important consideration as getting a phd in physics would probably require a higher intellectual level than other disciplines. A persons interest, motivation, and perseverance also come a long way as well. Yes, I would imagine that intelligence is a large component but there is definitely more involved! ",
            "date": "Answered September 30, 2016",
            "views": "71",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adam NOVÁK",
                    "user_href": "/profile/Adam-NOVÁK"
                },
                {
                    "user_id": "Majid Hussain",
                    "user_href": "/profile/Majid-Hussain-74"
                },
                {
                    "user_id": "Kaaushik Maity",
                    "user_href": "/profile/Kaaushik-Maity"
                },
                {
                    "user_id": "James Ross",
                    "user_href": "/profile/James-Ross-267"
                },
                {
                    "user_id": "Onaj Tamo",
                    "user_href": "/profile/Onaj-Tamo"
                },
                {
                    "user_id": "Marco Rizzuto",
                    "user_href": "/profile/Marco-Rizzuto-5"
                },
                {
                    "user_id": "Myo Naing",
                    "user_href": "/profile/Myo-Naing-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gaby Lu",
                "href": "/profile/Gaby-Lu"
            },
            "answer_text": "You have all the chances. Be insistive and precise with your desired field of study - that will bring you success. Oh good God, I remember my application essay where I pointed out that I want to change the world. That's why I have a passion for international relations. 5 years have passed, I haven't chanded the world :) However, I've got a scholarship and graduated from my desired department. You know, it doesn't matter if you'd like to get PhD or if I wanted to change the world - it's all about HOW you describe your passion. Being a master of word is a gift from heavens. You should get a professional help Dissertation and Thesis Writing Services  and believe me, the whole faculty will be reading your essay just as kids read J. K. Rowling books - with pure emotions and admiration! Good luck with your essay and further studies! ",
            "date": "Answered March 2, 2016",
            "views": "72",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jenna-Maria Sartimo",
                    "user_href": "/profile/Jenna-Maria-Sartimo-1"
                },
                {
                    "user_id": "Onaj Tamo",
                    "user_href": "/profile/Onaj-Tamo"
                },
                {
                    "user_id": "Myo Naing",
                    "user_href": "/profile/Myo-Naing-1"
                },
                {
                    "user_id": "Bin Jack",
                    "user_href": "/profile/Bin-Jack"
                },
                {
                    "user_id": "Amaka Ony",
                    "user_href": "/profile/Amaka-Ony"
                },
                {
                    "user_id": "Leon Basin",
                    "user_href": "/profile/Leon-Basin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Grady Green",
                "href": "/profile/Grady-Green"
            },
            "answer_text": "What do you mean by average? According to the Stanford-Benet IQ scale, the 17th percentile 85 is average. The 68th percentile 115 is also average. Who believes that an 85 and a 115 have equal odds in an academic contest? My thoughts are that an 85 IQ would never achieve a PhD. A 100 IQ, almost never. A 115 IQ is not uncommon to achieve a PhD. Yet all are falsely called average in order to pander to the 33/35 percent over 84 IQ and under 100 IQ.. ",
            "date": "Answered September 12, 2020",
            "views": "152",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gautam Khanna",
                    "user_href": "/profile/Gautam-Khanna-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Denny Tanuwidjaya",
                "href": "/profile/Denny-Tanuwidjaya"
            },
            "answer_text": "Of course. Do not limit your efforts if you do want to limit your future. As long as you stay motivated and focus, almost anything is possible within your reach. Never give up even if you fail once, if Colonel Sanders gave up on his 1009 tries, there will be no KFC today. If Thomas Edison gave up on his 1000 tries, he will not be the one who invented the light bulb. Our brain is like muscles, the more you use them, the stronger it gets. It is the same as exercising, you cannot feel the strength on your first exercises but you can notice a difference if you keep at it for a period of time. ",
            "date": "Answered September 15, 2020",
            "views": "104",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lauren La Porte",
                    "user_href": "/profile/Lauren-La-Porte-1"
                },
                {
                    "user_id": "Gautam Khanna",
                    "user_href": "/profile/Gautam-Khanna-32"
                }
            ]
        }
    ]
}