{
    "title": "Can I do a Bachelor of Education degree online? - Quora",
    "tags": [
        "Online Universities",
        "Bachelor's Degree Advice",
        "Education and Career Advice",
        "Distance Learning",
        "Bachelor Degrees",
        "E-learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "T.L. Brink",
                "href": "/profile/T-L-Brink"
            },
            "answer_text": "Yes, you CAN. I have been teaching online for 23 years. Here are some questions you need to answer before you go that route. Is the university reputable? Most state universities and their spinoffs (e.g., Excelsior) have reputable online programs. For-profits do not. Some private, not-for-profits act too much like for-profits.Does your major fit online delivery? Sociology, history, business and English do. Bio, chem, math, engineering, nursing less so.Are you an online learner? This is actually a trick question because there are different kinds of online instruction (synchronous vs. asynchronous, interactive vs. MOOC, self-paced vs. lockstep). Does your learning style match the delivery style of the program?",
            "date": "Answered August 13, 2019",
            "views": "166",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sara Atef",
                    "user_href": "/profile/Sara-Atef-22"
                },
                {
                    "user_id": "Jordan Sharp",
                    "user_href": "/profile/Jordan-Sharp-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vijay Alreja",
                "href": "/profile/Vijay-Alreja"
            },
            "answer_text": "Thanks for A2A. Yes, there are many Universities which offer Online Undergraduate courses in many fields like Management, Humanities, Arts, Commerce etc. Interested candidates can enrol for the same & study as per their personal convenient time and upon successful completion of the course are awarded a Bachelor’s degree. However, this facility is not available for courses in the field of Health Sciences like MBBS, BDS, Nursing, Physiotherapy etc. Trust the above information meets your requirement. Best wishes. ",
            "date": "Answered July 18, 2019",
            "views": "212",
            "upvotes": " Answer requested by Nilesh Talaviya",
            "upvoters": [
                {
                    "user_id": "Philip Day",
                    "user_href": "/profile/Philip-Day-15"
                },
                {
                    "user_id": "Viola Yee",
                    "user_href": "/profile/Viola-Yee"
                },
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Allingham",
                "href": "/profile/Philip-Allingham-1"
            },
            "answer_text": "As a former administrator in the Canadian University system with a decade in the Office of Undergraduate Studies in Education, I would say, “Definitely NOT.” We have to go online temporarily because of Covid, but after vaccines are introduced Faculties of Education will return to largely in-person classes. ",
            "date": "Answered October 24, 2020",
            "views": "36",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jordan Sharp",
                    "user_href": "/profile/Jordan-Sharp-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hans Brinkhof",
                "href": "/profile/Hans-Brinkhof-1"
            },
            "answer_text": "I’m not sure if it’s the same over here as where you live, but over here (Belgium), I doubt it. Teaching is not the kind of job you want to put anybody on, without having been able to properly asses the capabilities. This not only by “can he answer questions right?”, but also: how does this person act in a group? Is this a confident person? Does (s)he need to look up everything before answering, or are we actually talking to somebody who knows ‘their stuff’? Not to mention the internships. Those are pretty hard to do online. ",
            "date": "Answered August 14, 2019",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Hemingway",
                "href": "/profile/David-Hemingway-1"
            },
            "answer_text": "I’ve answered questions about online degrees previously, and made the mistake of interpreting “online” as “distance”. I have completed degrees with the open university (open.ac.uk), who provide distance learning via the internet. Pay attention to the advise here and checkout the training provider before hand. ",
            "date": "Answered August 13, 2019",
            "views": "7",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maria Reyes",
                "href": "/profile/Maria-Reyes-140"
            },
            "answer_text": "DO NOT do this. Many of these programs are substandard unless offered by a real university. Many have a higher rate of student attrition and students get stuck in debt and no degree! Just go to the best university that will accept you. Get on work study or a part time job if you need help financing your education. It’s possible that you could qualify for a scholarship or fellowship if you need specific requirements. Just go the traditional route. ",
            "date": "Answered August 13, 2019",
            "views": "48",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Terri Grassby",
                "href": "/profile/Terri-Grassby"
            },
            "answer_text": "Yes there are a number of online universities. The one that I know the most about is the Open University, based in the UK. They provide courses entirely online (exams may need to be taken at a designated exam centre though) with proper assessment and support. They are well respected in the UK. ",
            "date": "Answered August 13, 2019",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Md Kaif",
                "href": "/profile/Md-Kaif-9"
            },
            "answer_text": "Hi, Yes. You can earn a bachelors degree online through govt SWAYAM classes. And correspondence is also a good option for u. All the best ",
            "date": "Answered July 24, 2019",
            "views": "14",
            "upvotes": " Answer requested by Nilesh Talaviya"
        }
    ]
}