{
    "title": "Can I ask my former teacher for a letter of recommendation for university? - Quora",
    "tags": [
        "Graduate School Admissions Recommendation Letters",
        "Recommendation Letters",
        "Graduate School Admissions"
    ],
    "response": [
        {
            "author_info": {
                "name": "María Caba-Carmona-Liranzo",
                "href": "/profile/María-Caba-Carmona-Liranzo"
            },
            "answer_text": "If course you can, but first, ask yourself what was the impression you made in that class? What kind of student were you? Would your teacher remember many specific details about you? Can the teacher recall examples to illustrate her recommendation? Some schools do not allow teachers/professors the freedom to say no to a request for a letter of recommendation. That means that the teacher might say yes to your request but write a somewhat negative letter. Other teachers can afford to be honest and tell you to find someone who knows you better to write a letter on your behalf. Either way, be considered with your teacher and provide her with a resume/CV and your essays if you have them. That way, your teacher will have the opportunity to know more about you, and maybe, just maybe, improve her opinion about you. If you feel you cannot trust a teacher it is better to find someone else to write the letter. Most teachers will not write a letter unless you sign away your rights to see the letter. ",
            "date": "Answered August 21, 2019",
            "views": "19",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Márthon Marcell",
                    "user_href": "/profile/Márthon-Marcell"
                },
                {
                    "user_id": "John Kamenetsky",
                    "user_href": "/profile/John-Kamenetsky-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kate Huddleston",
                "href": "/profile/Kate-Huddleston-1"
            },
            "answer_text": "Absolutely! I have written many Letters of Recommendation. There are a few things I would stress though: Ask them personally -as opposed to an e-mail. Teachers encounter many students and we always like putting a name with a face. We will remember where you sat in our class, how you contributed, but could see you in a grocery store and not recognize you at all. Make it personal!Give us PLENTY of time to write it. Like 2 or 3 weeks… Yes! Seriously. Don’t ask them a week before you need it. Be aware of what is going on in the semester too. If you know mid-terms or finals are coming up, we prepare for them as much as our students (and time afterwards grading). Plan Ahead!After you ask them, tell them you will e-mail ALL the pertinent information they will need to write your letter. Then, in your e-mail, do that and include a gentle reminder of when you need it and when and where it will be convenient for YOU to come and get it from them. If you want your teacher to mail your letter, I would provide a self stamped envelope at the time of asking. (if it gets down to the deadline and you haven’t heard from them, don’t be afraid to either send a reminder e-mail, or leave a friendly voicemail).Wahoo! Good Luck! ",
            "date": "Answered January 18, 2017",
            "views": "39",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Navdeep",
                    "user_href": "/profile/Navdeep-17"
                },
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted Lehmann",
                "href": "/profile/Ted-Lehmann-2"
            },
            "answer_text": "I asked a teacher for a letter of recommendation once. Here is the answer I received. “I’ll be happy to write you a letter of reference. Whether it will be a recommendation or not is up to me to decide.” At first I was taken aback, but the more I thought about this question, the more it meant to me. Here’s an explanation. You, as the person receiving the reference, are not entitled to read it. You should provide the sender with a stamped envelope addressed to the admissions office of the school you’re applying to. If the college has provided a form, you should include that, too. The writer will write the reference or fill out the form. A thoughtful reference letter might very well include some reservations about you that will actually help your application, but, if you read it, you might find it hurtful because you don’t understand why the letter isn’t a full-on rave. A good reference letter will highlight your strengths, while also pointing out some areas needing improvement. You will be able to help the person writing the reference by giving him or her a sheet highlighting your accomplishments at the school. Do not expect ever to see the letter. It’s an area where you have to trust the teacher to have your best interests at heart. Hope you’re accepted at a couple of colleges you’d like to attend. ",
            "date": "Answered August 16, 2018",
            "views": "53",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Innu Jalal",
                    "user_href": "/profile/Innu-Jalal"
                },
                {
                    "user_id": "John Kamenetsky",
                    "user_href": "/profile/John-Kamenetsky-1"
                },
                {
                    "user_id": "María Caba-Carmona-Liranzo",
                    "user_href": "/profile/María-Caba-Carmona-Liranzo"
                }
            ]
        }
    ]
}