{
    "title": "Can there be a significant change in the O level grade thresholds from the previous year? - Quora",
    "tags": [
        "GCE O Levels",
        "Grades (education)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Neil Barnett",
                "href": "/profile/Neil-Barnett-10"
            },
            "answer_text": "TL;DR: change, yes. Significant, no. Unless government interfere, again. There could be. But usually there isn't. There is one underlying assumption, that this year's cohort of candidates is not significantly better at the exam than last year's. Therefore there should be roughly the same number of 1s and 2s and so on. If the percentages are all lower or higher than last year's candidates achieved, then the grades may be moved around a bit to get closer to last year's distribution. Things that can alter this are: Government interference making the boards set a more difficult paper to favour the private schools.A badly-worded question that confuses a lot of candidates and goes on to confuse Daily Mail readers.A question that requires “application of knowledge”, that is, it needs thinking about.A particularly easy question that everyone can do.A sudden change in emphasis, like interpreting the BODMAS rules differently.The exam board not wanting to be the only ones facing criticism for making exams too easy. They are inspected by the other boards, representatives of the universities and the QCA, to keep marks consistent.Overall, exams are consistent year on year, more so in the hard sciences, where answers can be judged correct or incorrect; there are fewer shades of grey than in humanities or soft sciences. The government interference has been significant in the past few years, they have wanted to make exams harder, to really highlight the “high achievers”. This also (accidentally, I'm sure) enables the private schools to look good, because they have a more intensive teaching regime, lower pupil-teacher ratio, tutors, homework clubs, Saturday lessons and, allegedly, a habit of declaring as many pupils as possible as having a special need and thus getting 25% extra time. ",
            "date": "Answered August 16, 2018",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Scoins",
                "href": "/profile/David-Scoins"
            },
            "answer_text": "It is perfectly reasonable, from a Board’s point of view, to fix grade boundaries so that an appropriate proportion reach a particular grade. Markers are often asked to suggest A/B and E/F boundaries on completion of their marking. It can often take only one question to be misunderstood by many to make a subject’s grade boundaries move significantly in comparison to a previous year. Many will complain that declaring, say, the top 5% to have an A grade runs counter to declared objectives, but it does prevent grade creep. Once the A/B and E/F boundaries are chosen, the other boundaries can be defined, sometimes in accord with a formula. Some Boards will move the raw marks around (not the order, the marks) so as to fit previously defined patterns - which means that in maths, say, you might feel that marks are far harder to gain in one year than another, because the grade boundary looks exactly the same. Hence declaring a paper to be ‘hard’; hard to earn marks. ",
            "date": "Answered August 15, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shaheer Ziya",
                    "user_href": "/profile/Shaheer-Ziya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Williams",
                "href": "/profile/Rob-Williams-406"
            },
            "answer_text": "Every year, exam boards draw up a system to decide what grade everyone will get. A grade boundary is a minimum mark you would need to get that grade. These are only decided after all the exams have been marked. Grade boundaries are set for each exam, depending on how difficult it turned out to be for the candidates. This means students are not penalised with poor grades if their exam was especially hard. Senior examiners compare completed exam papers from this year with those from last year so they can maintain a similar standard. They then decide a minimum mark for each grade. Each student’s grade can then be worked out. Grade boundaries for A and E are set first, then the others slotted in at equal intervals. Here is more information on the 2019 O Level grade thresholds ",
            "date": "Answered September 3, 2019",
            "views": "149",
            "upvotes": " Answer requested by Katlin Watts",
            "upvoters": [
                {
                    "user_id": "Ali Azan",
                    "user_href": "/profile/Ali-Azan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muhammad Mussaub Mobeen",
                "href": "/profile/Muhammad-Mussaub-Mobeen"
            },
            "answer_text": "I believe yes. Mainly because they changed the syllabi and paper pattern for a lot of subjects and it is quite evident that whenever they did this in the past there was a drastic change in the thresholds. Hope it helps! ",
            "date": "Answered June 14, 2018",
            "views": "595",
            "upvotes": " View 1 Upvoter "
        }
    ]
}