{
    "title": "Can a high school failure still succeed in life? - Quora",
    "tags": [
        "Academic and Life Advice",
        "High School Advice",
        "Young Adults",
        "Teen Advice",
        "Failure",
        "The High School Experience",
        "Academic and Educational Advice",
        "Important Life Lessons",
        "Teenagers and Teenage Years",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rishi Ravindran",
                "href": "/profile/Rishi-Ravindran"
            },
            "answer_text": "Well, it depends on how much motivated you are to succeed. Here’s some inspiration. #1 Jim Carey  He grew up in a lower-income family with a father who struggled to keep jobs. They were so poor that he had to drop out of high school at the age of 15 and get a job as a janitor just to help support the family. #2 David Karp  Tumblr founder David Karp dropped out of high school at the age of 15 and now his New York startup is about to sell for $1.1 billion in cash to Yahoo. #3 Richard Branson, CEO of Virgin  Branson left school at the age of 16 and has spoken out against the university system on his blog. The billionaire is even richer this year after the recent sale of Virgin Media to Liberty Global and is ranked #272 on Forbes' World's Billionaires List. #4 Mike Hudack founded See what's next on Maker.tv in 2005  Hudack dropped out of high school and started working at a small internet security and privacy company in Connecticut at 16. He then moved to New York and worked as a consultant for Time Warner. In 2012, he left his position as CEO to become Facebook's product manager. #5 Casino magnate Kirk Kerkorian  Kerkorian dropped out of school in the 8th grade, but that didn't stop him from becoming one of the most important shapers in Las Vegas. The billionaire was once an ex-boxer and fighter pilot during World War II, but it was a Las Vegas land purchase in 1962 that led to his eventual fortune. #6 Quentin Tarantino  Tarantino attended Narbonne High School in Harbor City until he dropped out at the age of 15 and started working as an usher at an adult film theatre while taking acting classes. While working at the Video Archives in his early 20s, Tarantino wrote the scripts for True Romance (1993) and Natural Born Killers (1994), but it was his directorial debut in Reservoir Dogs (1992) in 1992 that he received wide critical acclaim. #7 Francois Pinault - French businessman  Pinault dropped out of high school in 1947 to work at his father's lumber mill, because his school mates made fun of his poor background. Today, as the majority shareholder of fashion conglomerate PPR, the billionaire businessman owns high-end fashion houses including Gucci, Stella McCartney, Alexander McQueen and Yves Saint Laurent. #8 Joe Lewis - British businessman  Lewis dropped out of high school at 15 to run his father's catering business Tavistock Banqueting and is now ranked as the eighth richest person in Britain, according to Forbes. The business man -- who works from his yacht most of the year -- owns a medical city in Lake Nona, near Orlando, which is now one of the fastest-growing communities in America. As the main investor in Tavistock Group, Lewis owns more than 150 companies, including London Premiership soccer team Tottenham Hotspur (Spurs), a stake in UK's largest pub operator, Mitchell's & Butlers plc, and approximately 135 restaurants and various resorts throughout the world. #8 George Foreman - boxing two-time World Heavyweight Champion  Foreman dropped out of high school at 15 and later moved to Pleasanton, California to train in boxing. Most of Foreman's fortune came after his boxing career as a spokesperson for Russell Hobbs Inc.'s fat-reducing grill called the George Foreman Grill, which has earned him $240 million. #9 Carl Henry Lindner, Jr  Founder of American Financial and CEO of the Cincinnati Reds, was worth $1.7 billion before he passed away. Lindner dropped out of school at age of 14 during the Great Depression to be a delivery boy for his family's dairy company, which would become United Dairy Farmers, the Midwest's chain of nearly 200 convenient stores. He eventually built a business empire and became part owner and CEO of the Cincinnati Reds baseball team in 1999. Source: 10 Wildly Successful People Who Dropped Out Of High School ",
            "date": "Updated September 4, 2016",
            "views": "36",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nintesha Mcguinn",
                    "user_href": "/profile/Nintesha-Mcguinn"
                },
                {
                    "user_id": "Estus Hibbard",
                    "user_href": "/profile/Estus-Hibbard"
                },
                {
                    "user_id": "Shreycey Jayde Dhungana",
                    "user_href": "/profile/Shreycey-Jayde-Dhungana"
                },
                {
                    "user_id": "Naresh Rajnul",
                    "user_href": "/profile/Naresh-Rajnul"
                },
                {
                    "user_id": "Preeti Pandey",
                    "user_href": "/profile/Preeti-Pandey-114"
                },
                {
                    "user_id": "David Smotritsky",
                    "user_href": "/profile/David-Smotritsky"
                },
                {
                    "user_id": "C.J. Heck",
                    "user_href": "/profile/C-J-Heck"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stan Hayward",
                "href": "/profile/Stan-Hayward-1"
            },
            "answer_text": "Yes As an 85 year old who lived in London during the war I, like most of my friends spent much of our schooldays in the air raid shelters during the day As with most schools at the time, teachers were new from college or elderly and brought back from retirement as the men and women who might have been teachers were in the military or on War work of some form There was no TV, and newspapers were four pages thick, and mainly war news. We did have radios that ran on accumulators (a battery like a car battery, that would run your four valve radio for several hours) These enabled you to get the radio news and some entertainment for a few hours a week We didn’t have homework from school as there were not enough teachers to mark it, and anyway, we were bombed most nights.Fuel was short, so we slept in our clothes. Transport was very erratic, so we walked most places. Food was rationed so we were always hungry On a good day most students would turn up to class, but after a big raid there might only be a few. On a bad day someone in the class or school will have been killed or injured in the raids There was no such idea of ‘having a dream’. When you finished school you were lucky to have a job at all, and if you were a boy you had to do National Service at 16 or 17, so most boys just had part time jobs In answer to the questionbut first to mention, we in the UK were the lucky ones. We didn’t have much of an education, but were much better off that those in Europe and most of the world outside of the USAWe survived without school certificates, diplomas, degrees, and qualifications as in the 1940–50’s most people in the world had little education beyond the basics of reading and writing, and whatever they picked up in their line of work The young men and women who went to war during their teens and early 20’s returned to take whatever jobs they could get. There is no evidence that totally lacking a college education for those of that generation had any impact at all on their success or failure in life If you learn to survive, you will - in most cases - succeed in achieving what you wantIf you think you are entitled to the right of pursuing your dreams, the chances are you will be disappointed ",
            "date": "Updated September 4, 2016",
            "views": "22",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "《Cօʍքʟɛȶɛʟʏ Wɨʟɖ》",
                    "user_href": "/profile/Cօʍքʟɛȶɛʟʏ-Wɨʟɖ"
                },
                {
                    "user_id": "Techapon Kampu",
                    "user_href": "/profile/Techapon-Kampu"
                },
                {
                    "user_id": "Jonathan Cole",
                    "user_href": "/profile/Jonathan-Cole-9"
                },
                {
                    "user_id": "Nancy Mohamad",
                    "user_href": "/profile/Nancy-Mohamad"
                },
                {
                    "user_id": "Thanh Nguyen Hoang",
                    "user_href": "/profile/Thanh-Nguyen-Hoang"
                },
                {
                    "user_id": "Lahsiv",
                    "user_href": "/profile/Lahsiv-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lukasz Laniecki",
                "href": "/profile/Lukasz-Laniecki"
            },
            "answer_text": "Fortunately, life isn’t about having the most impressive GPA. Neither is success in life. Gary Vaynerchuk was D and F student and by his own standards (and also in a conventional sense) he is massively successful.  Whoever told you that success in life is about having the most impressive GPA was wrong! Of course, people will look at your school performance and they will want to draw conclusions. That’s for sure. We’re so afraid that our children will not be able to manage on their own in this world that we want to make everything in our power to help them succeed. In school the only variable / the only measuring stick at our disposal are their grades. So we end up obsessing about grades, report cards and GPAs. But the fact that we all obsess about grades doesn’t translate into anything in the real world. Those who look at your GPA and tell you you’re a loser are themselves losers. Why? Because they quickly sum up your whole existence using some stupid card that, in reality, says very little about you. Those are the people who are not aware of the fact that what matters way more are your daily habits, your determination, and your work ethic in the years following the school years. If only it was this simple - swot for exams, get good grades and you’re all set for life. Makes me lough how many people still think that your success in life is all about being a good student. Besides, they think that success is one thing for all people. That we should all want the same things in life (well paying job, nice new car every three years, nice house, power, influence, etc.). This in itself is a losing proposition. Don’t let anybody tell you what success is in life. Define it for yourself. Don’t look at others and their definitions of ‘success’. Then and only then you will have a real shot at succeeding in your life. ",
            "date": "Answered November 10, 2016",
            "views": "19",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sajid Reza Karim",
                    "user_href": "/profile/Sajid-Reza-Karim"
                },
                {
                    "user_id": "Mohammed Zafar",
                    "user_href": "/profile/Mohammed-Zafar-1"
                },
                {
                    "user_id": "Eddie Nelson",
                    "user_href": "/profile/Eddie-Nelson-1"
                },
                {
                    "user_id": "Samuel Liu",
                    "user_href": "/profile/Samuel-Liu-7"
                },
                {
                    "user_id": "Vaibhav Aparimit",
                    "user_href": "/profile/Vaibhav-Aparimit"
                },
                {
                    "user_id": "Linda Pharoah",
                    "user_href": "/profile/Linda-Pharoah"
                },
                {
                    "user_id": "Robert Charles Lee",
                    "user_href": "/profile/Robert-Charles-Lee"
                },
                {
                    "user_id": "Fernel Salenga",
                    "user_href": "/profile/Fernel-Salenga"
                }
            ]
        },
        {
            "author_info": {
                "name": "Will Chou",
                "href": "/profile/Will-Chou-10"
            },
            "answer_text": "You absolutely can. Having studied so many successful people, it's clear in my eyes because I have uncovered so many who did not do well in school. But I can understand for someone who's new how it can be tough. I was in your same shoes before I started personal development years ago. Just so you have some concrete real life examples: these people had horrible grades, did not even go to high school and/or college, or spent years after school with crappy jobs and no prospects: Brian Tracy, John Paul DeJoria, Romanatwood, Gary Vaynerchuk, Tony Robbins, Zig Ziglar. Google \"billionaires who did not go to college\" and theres plenty more. But just BECAUSE you didn't go to school doesn't guarantee success of course. You have to use the other levers of success. What book do I recommend? I think Getting there is a great one (I did an interview with the author). It covers dozens of the most successful people on earth and their incredible humble beginnings. For further reading, I suggest The Power Within and every book by Napoleon Hill﻿ ",
            "date": "Answered September 3, 2016",
            "views": "787",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marshall E. Gass",
                "href": "/profile/Marshall-E-Gass"
            },
            "answer_text": "A High school Pass or Fail is not the end all of a life and career. In fact I remember very little of what I learned at High School. Of course, that’s fifty years ago. The real test comes when you go out into the world. Cloistered in a classroom, listening to a monotonous teacher was not all that great. In those days you got whipped on your arse, if you didn’t know the answers. Logically, how could I know the answers to something I did not know then? Real life is to earn a living, build a career, support a family, love everyone, study for a good career and keep going. High school did not teach me any of those things. Today they do- to some extent. In my first job back in 1967 I earned a handsome salary of $3.62 a month! Wow! the things I could do with with that huge salary. Of course, I was poor and untrained in anything at the time. Although I gained huge passmarks with distinctions etc. that was the only job I could get. Things changed dramatically over the years. Success is counted by the number of failures one has! So. Begin your life's journey from this moment. ",
            "date": "Answered August 31, 2016",
            "views": "704",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alondra Negritaloka Pardo",
                    "user_href": "/profile/Alondra-Negritaloka-Pardo"
                },
                {
                    "user_id": "Renee eyesleander",
                    "user_href": "/profile/Renee-eyesleander"
                },
                {
                    "user_id": "Shreycey Jayde Dhungana",
                    "user_href": "/profile/Shreycey-Jayde-Dhungana"
                },
                {
                    "user_id": "Daniella Cohen",
                    "user_href": "/profile/Daniella-Cohen-3"
                },
                {
                    "user_id": "Rodney Hanes",
                    "user_href": "/profile/Rodney-Hanes-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ingyin Khat Thwe",
                "href": "/profile/Ingyin-Khat-Thwe"
            },
            "answer_text": "i’ll answer it orderly . you , yourself asking this question indirectly means that you want to succeed but you are worried because of failure in high school .Everything, every choice that you made ‘’it all depends on you’’ & ‘’believe in yourself’’ . if you think positively and work twice harder than high school graduate . who knows ? you might be better than them in the future .i believe it all depends on the country or city that you live in . if you are from US or Europe countries , there are a lot of jobs available but if you are from the Asian side , it’s be more difficult but you can do it .you mustn't stop learning . failing high school doesn’t mean that you should stop reading books or volunteering the homeless or learn cooking or travel the world .you must have confidence in yourself .‘’failure is success’s mother’’ . you must get up from countless of failure so that one day you will be successful like you want .and finally never stop achieving your goals under any circumstances .",
            "date": "Answered August 31, 2016",
            "views": "728",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "《Cօʍքʟɛȶɛʟʏ Wɨʟɖ》",
                    "user_href": "/profile/Cօʍքʟɛȶɛʟʏ-Wɨʟɖ"
                },
                {
                    "user_id": "Omega Gaming",
                    "user_href": "/profile/Omega-Gaming-3"
                },
                {
                    "user_id": "Shreycey Jayde Dhungana",
                    "user_href": "/profile/Shreycey-Jayde-Dhungana"
                },
                {
                    "user_id": "Whitney Munn",
                    "user_href": "/profile/Whitney-Munn-1"
                },
                {
                    "user_id": "Conor Murphy",
                    "user_href": "/profile/Conor-Murphy-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Selwan",
                "href": "/profile/John-Selwan"
            },
            "answer_text": "Last week I was speaking to the wife of a Harvard graduate. She was telling that my bad grades weren’t important and that it doesn’t predict my future. I asked her why, she answered with a story. There was one of her school friend, called Richard who had a horrible behavior in class. He would get kicked out all the time. His grades were very bad and he didn’t even care. After school she never heard about him until a day where her husband went back from a Harvard alumni events. He told her that a certain Richard salute her. This is a great example. Someone had done it before you, many had. You can be the next Richard, you just have to believe and work. ",
            "date": "Answered August 31, 2016",
            "views": "852",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alondra Negritaloka Pardo",
                    "user_href": "/profile/Alondra-Negritaloka-Pardo"
                },
                {
                    "user_id": "Prasiddha Bhattarai",
                    "user_href": "/profile/Prasiddha-Bhattarai"
                },
                {
                    "user_id": "Sanjaya Guragain",
                    "user_href": "/profile/Sanjaya-Guragain"
                },
                {
                    "user_id": "Omega Gaming",
                    "user_href": "/profile/Omega-Gaming-3"
                },
                {
                    "user_id": "Christie DeBruce",
                    "user_href": "/profile/Christie-DeBruce-1"
                },
                {
                    "user_id": "Sebastian Tannæs",
                    "user_href": "/profile/Sebastian-Tannæs"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Hu",
                "href": "/profile/James-Hu-2"
            },
            "answer_text": "You can succeed in anything you put your mind and heart towards. Failures are part of life. What you do after the failure is very valuable. Many people give up too early. Some of those people use a past failure to identify their worth so they lose hope. They feel total lost and regret how they used their time. The trick is to shake off the bad grades by doing productive things moving into the future. Sort of like when you try something for the first time. You just pick yourself up and try again.  If college is the route you want to take, then enroll in a community college to take the prerequisite classes for the 4 year college you want to attend. ",
            "date": "Answered August 31, 2016",
            "views": "742",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Susan Scher",
                "href": "/profile/Susan-Scher"
            },
            "answer_text": "At your age, it is impossible for you to be a failure. You just haven’t put enough time into it yet. You screwed up. You see that now and you regret it. So, do something about it. Go to community college to bring your grades up and then transfer to a 4-year school if you want to. You don’t have to go to college. You could start a business if you want and have something you are passionate about. Community college would be a very good option for that because you can take classes in marketing and business. If you are going to be an entrepreneur, learn marketing! It is critical for that, and helpful for just about anything you want to pursue. So, stop worrying about what you didn’t do, learn from it, and move forward. ",
            "date": "Answered November 24, 2016",
            "views": "312",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alondra Negritaloka Pardo",
                    "user_href": "/profile/Alondra-Negritaloka-Pardo"
                },
                {
                    "user_id": "Laney Kem",
                    "user_href": "/profile/Laney-Kem"
                },
                {
                    "user_id": "Shreycey Jayde Dhungana",
                    "user_href": "/profile/Shreycey-Jayde-Dhungana"
                },
                {
                    "user_id": "Alkaf Yaacob",
                    "user_href": "/profile/Alkaf-Yaacob"
                },
                {
                    "user_id": "Marc Soueidi",
                    "user_href": "/profile/Marc-Soueidi"
                },
                {
                    "user_id": "Siljan Lærdal",
                    "user_href": "/profile/Siljan-Lærdal"
                },
                {
                    "user_id": "Jean-Marc",
                    "user_href": "/profile/Jean-Marc-13"
                },
                {
                    "user_id": "Benjamin Mathieu",
                    "user_href": "/profile/Benjamin-Mathieu-2"
                },
                {
                    "user_id": "Thomas Walker",
                    "user_href": "/profile/Thomas-Walker-71"
                },
                {
                    "user_id": "Karim Nader",
                    "user_href": "/profile/Karim-Nader-4"
                },
                {
                    "user_id": "Pierre Brn",
                    "user_href": "/profile/Pierre-Brn"
                },
                {
                    "user_id": "William Azar",
                    "user_href": "/profile/William-Azar-4"
                },
                {
                    "user_id": "AbdulGhani Said",
                    "user_href": "/profile/AbdulGhani-Said"
                },
                {
                    "user_id": "Zeina Nader",
                    "user_href": "/profile/Zeina-Nader-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John W Cohen",
                "href": "/profile/John-W-Cohen"
            },
            "answer_text": "Depends on what you learn from it. I know people who did poorly in high school and turned their lives around: One person joined the US Air Force after high school using his aptitude in foreign languages. After competing his military service, he attended a prestigious university based, in part, on the recommendation of a commanding officer. He did very well in the business world being a fluent Chinese speaker with an MBA degree added to his BA. Giving up doesn’t help… ",
            "date": "Answered August 31, 2016",
            "views": "379",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tim Wolski",
                "href": "/profile/Tim-Wolski-1"
            },
            "answer_text": "Yes. Colonel Sanders was a failure and was considering suicide to make life easier for his wife in his mid-60s. Instead he borrowed around $60 and bought up some chicken, which he cooked and sold door to door. Twenty years later, he was a billionaire. It is never too late to turn into a success but you can’t get there by continuing to do the same things that got you to where you are. To reach new destinations, you have to travel new roads. ",
            "date": "Answered September 2, 2016",
            "views": "358",
            "upvotes": "0"
        }
    ]
}