{
    "title": "Can a person who is illiterate still be 'intelligent'? - Quora",
    "tags": [
        "Illiteracy",
        "Intelligence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stan Hayward",
                "href": "/profile/Stan-Hayward-1"
            },
            "answer_text": "Technically yesAs you know, AI, (Artificial Intelligence) can augment human intelligence, and in combination with AI+ (AI + Illiteracy) it augments IlliteracyWith AI+ you can be illiterate about very many things beyond just literatureFor example you can be ilnumerate, ilcompurate, ilsexualate, etc. Many of the silly questions on Quora are asked by people who are ilquestionate, and are meant to be read by people who don’t understand the purpose of those who ask silly questions In fact, the Mensa Society has a test called DeMensa suited to people who have Faux-dementia, and gives a combined figure of your IQ and Illiteracy rating. If you are the person who asked this question, get someone who can read to explain it to you. If you don’t know anyone who can read, then ask someone to print out several copies of this answer and screw it up into paper balls for your cat to play with ",
            "date": "Answered May 13, 2020",
            "views": "744",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shivani Tripathy",
                    "user_href": "/profile/Shivani-Tripathy-1"
                },
                {
                    "user_id": "Vuthy Reach",
                    "user_href": "/profile/Vuthy-Reach-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sara Eberlin",
                "href": "/profile/Sara-Eberlin"
            },
            "answer_text": "If this question asking whether an illiterate person can still be of higher intelligence (as opposed to whether a person who failed to learn how to read and write can still be intelligent), then yes, of corse they can. Intellegence is defined as a “capacity for learning, reasoning, understanding, and similar forms of mental activity; aptitude in grasping truths, relationships, facts, meanings, etc.,” and literacy defined as “the ability to read or write.” Someone’s intellegence would not reflect their literacy skills if they never had the opportunity to learn how to read and write in the first place. If you never even had the chance to learn how to read, then it would hardly be fair for me to judge your level of intellegence based on whether you had the possibility of education or not. In this case, literacy is not reflection of intelligence. ",
            "date": "Updated October 1, 2016",
            "views": "25",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Scarlet Cavallo",
                    "user_href": "/profile/Scarlet-Cavallo"
                },
                {
                    "user_id": "Nathaniel Fontanilla",
                    "user_href": "/profile/Nathaniel-Fontanilla-2"
                },
                {
                    "user_id": "Cecil Hester",
                    "user_href": "/profile/Cecil-Hester-2"
                },
                {
                    "user_id": "Rebecca Barton",
                    "user_href": "/profile/Rebecca-Barton-4"
                },
                {
                    "user_id": "N Nigam",
                    "user_href": "/profile/N-Nigam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Khaliq Aziz",
                "href": "/profile/Khaliq-Aziz"
            },
            "answer_text": "Of course, the intelligence has some relation with literacy,because intelligence is the ability to understand things and to deal with new or difficult situations. the educated people have great ability to deal with problems and better awareness about the world they are living.Therefore the literacy greatly affects your intelligence ",
            "date": "Answered August 28, 2014",
            "views": "675",
            "upvotes": "0"
        }
    ]
}