{
    "title": "Can I stop going to school? - Quora",
    "tags": [
        "Schools",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ramasamy Palaniappan",
                "href": "/profile/Ramasamy-Palaniappan"
            },
            "answer_text": "Revisiting this now after 3 years. I hope you graduated from high school. You are right, most of us from India are especially good at math and computer programming - It will be best to use it to our advantage. When it comes to university/college education, I find that a lot has changed in the last 3 years. For one, there are plenty of MOOC portals (Coursera, EDX, Udemy, Udacity, LinkedIn Learning, Youtube, MIT Opencourseware, Open Yale Courses, Kahn Academy, etc.) and one can get a good quality education online. All one needs is the drive, an internet connection, and a laptop/computer. The only drawback for online learning could be if your degree needs some laboratory work or practical work that needs some kind of infrastructure - even this gap is starting to close. On the other hand, the school/university system is expensive, it is slow to adapt to the changing times. It is inefficient and it is a drag for anyone seeking to learn specific things. The traditional way of learning could soon be out if it does NOT adapt. On getting a job - There is a social stigma, even here in the USA - most companies still ask for a basic college degree, some companies even ask for a higher degree. Although a few industries - especially in software, are pretty open about this, if you are able to do what they want, they wouldn’t mind the absence of a college degree. Different things work for different people and there cannot be one universal way of learning for everyone. In the current situation with CoViD, everyone has opted for online learning. We have a plethora of resources online and it is up to the each individual to figure out what he/she is interested in and figuring out the best means to get that knowledge. Good luck with your journey. Hello there. Like yourself, I did my schooling and bachelors in Tamil Nadu and I used to feel the same way. You may not understand this now: Basic education will give you the required tools for your future. A college degree, assuming it was obtained by honest means, will give you the qualifications to do your job well in your field, thus providing means to live a good life and not just surviving. However, if you feel that you are learning nothing useful at school - your question then should be, ‘can one please recommend alternative ways to learn ?’ and NOT ‘can i stop going to school ?’ if you feel you are not learning anything. Try various methods: Ask your friends, parents, relatives who may know more on the subject. Youtube always has several good teachers who teach really well.Please talk to your teachers after class - let them know that you are unable to follow and you need extra help. I am sure, someone will be appreciative of the fact that you have acknowledged the fact that you don’t understand and are willing to learn.Don’t feel shy to ask questions. If you don’t ask questions, you may never understand.Never quit. Try to learn the concepts however tough they may be. Just memorizing will make it harder to study. Understanding concepts will definitely make it easier to learn.Your goal should never be towards scoring more marks, it should always be towards understanding subjects well. During my schooling days, memorizing was advocated. However, I found it easier to do so, after I understood the subjects. I am sure, you will too.If you have trouble concentrating, you may try meditation or invent techniques to help you concentrate. This is a tough one, keep trying till you are able to concentrate. Check the internet for more tips on this.Pay attention to how you study and identify suitable conditions (early mornings or late nights. Quiet place or with calm music or with parents / friends by your side or in a library) that make you study / learn better and stick to those conditions.Try explaining what you learnt to your parents to see if they understand what you learnt. This will help you remember what you learnt.Understanding your subjects will help you in identifying new strengths and interests.Btw, if you are part of a super rich and next in line to run a business - it will be helpful to complete school and get a degree in business. This will help you run your business wisely by avoiding costly errors and blindly following someone else’s decisions. You may skip school or college, if you are a super genius like Bill Gates / Mark Zuckerberg / Michael Jordan / LeBron James in any particular field. If not, it is a very bad idea to skip school. ",
            "date": "Updated August 14, 2020",
            "views": "25",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Williams",
                    "user_href": "/profile/Jonathan-Williams-919"
                },
                {
                    "user_id": "应锴 傅",
                    "user_href": "/profile/应锴-傅"
                },
                {
                    "user_id": "Sanjay Pal",
                    "user_href": "/profile/Sanjay-Pal-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ambrosia Shiner",
                "href": "/profile/Ambrosia-Shiner"
            },
            "answer_text": "Hi well I am probably not the most qualified person to tell you this I am still in high school too. I can understand why it would seem like school is just a waste of time especially when you are so close to getting out. The truth is that you may be right you may not even be learning anything important, but think of all the things you did learn you learned how to read and write and how to do mathematics and you probably know some science. When you were younger and learned those skils you probably felt as though those were useless skills like how you feel about what you are learning now, but you did it and now it helps you in life. School may teach a lot of useless things, but you never know what you may need in life. Also, school teaches life lessons such as responsibility, punctuality, and work ethics . If you drop out of high school think about the jobs you would be able to get (I know a lady who has a G.E.D and she doesnt have a job because no one will hire her) even at a fast food franchise they most likely won't hire you if you don't have a high school diploma. Even if you don't remember anything your teachers taught you, you will still know more about work and how to survive in the world around you if you finish school. Businesses will most likely consider you more qualified (if you finish school) than to someone who dropped out. Another thing to think about is the work force are you ready to go to work and be expected to pay bills and do other tasks. If I were you I would want to hang on to my youth and try to finish school. Hoped this helped but if you are undoubtedly going to quit school then I wish you the best of luck. ",
            "date": "Answered July 23, 2017",
            "views": "639",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Justin Smith",
                "href": "/profile/Justin-Smith-622"
            },
            "answer_text": "I honestly believe that life should have balance to it. You shouldn’t feel like you are working yourself to death, or boring yourself with school or work; but, you also shouldn’t just not take part in these experiences. Part of the reason that these deeds are important to stick to is that even if you feel the work is boring or the deed is mundane, the experiences that you are receiving are irreplaceable and you will be glad in the very short future that you were strong, and had conviction in your decisions. Most large Game Development companies require college experience of their workers so you may have trouble finding a job without college, especially with how much competition there is in that market right now. ….but y’know, you do you bruh. -Justin ",
            "date": "Answered July 23, 2017",
            "views": "737",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jason Rya",
                    "user_href": "/profile/Jason-Rya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Piyush Kumar",
                "href": "/profile/Piyush-Kumar-539"
            },
            "answer_text": "One should develop an attitude of questioning mind. When teacher speaks then you must not only listen but also ask questions in between. You can say, learning New things is all about curiosity and interest. And when you start questioning you become more curious and interested to know more. it will also eliminate monotonous feeling in the classroom. And last but not the least, after all its schools which have educated scientists, doctors, engineers ,verybody in society. (Note: one should also consider changing school, if he/she feels that the particular school is not providing quality education.) But, leaving school is not a solution. Education is must. Just develop a questioning mind and see the change. ",
            "date": "Answered July 23, 2017",
            "views": "511",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Gibbons",
                "href": "/profile/Richard-Gibbons-7"
            },
            "answer_text": "I'm not too sure about the legislation regarding education in your city. It would be best to see if legislation requires that level or a higher level of education. However, let's say that the law permits that, you still have to find a source of income to pay for basic nessecities like food, water, and a roof over your head. If you can find one job or more where the salary or salaries altogether is enough to satisfy those needs, then you will be fine. Look for employment opportunities that not only satisfy your basic needs but also satisfy you. If you are happy doing the work, then you don't need a whole lot to live decently. You can start looking for employment opportunities through family members and friends. You can also try LinkedIn which is great for letting potential employers know that your ready to work. ",
            "date": "Answered July 23, 2017",
            "views": "729",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Megha Shree",
                "href": "/profile/Megha-Shree-66"
            },
            "answer_text": "See as there is a rule that every child should be educated till the age of 14, you dont have another option. I understand that book and education is nothing, we should think outside the book, outside four walls, we should become brode minded. Yes you can get started up with ur wish lyk ‘what u want to become in future and start working for your goal’. But at least basic education is essential for competing this present and cŕùèĺ world. ",
            "date": "Answered July 23, 2017",
            "views": "402",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Simlindile Nombambela",
                "href": "/profile/Simlindile-Nombambela"
            },
            "answer_text": "We are thought to go to school at school we learn so many things like writing, hand writing, how to spell names and how to write your name. So school is important in every espect. Don't quit. ",
            "date": "Answered July 24, 2017",
            "views": "298",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Karthik Sundar",
                "href": "/profile/Karthik-Sundar-11"
            },
            "answer_text": "Schools curriculum are designed to teach you basic concepts. You can enhance your knowledge & career skills in your college. You are alreasy at your final year in school try to complete it, you may land in a college best suited for you. ",
            "date": "Answered July 23, 2017",
            "views": "154",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rafi",
                "href": "/profile/Rafi-4"
            },
            "answer_text": "In India most people study for getting a job or social respect. In reality it’s not about learning something. But if you study far enough you will have some chance to do something what could change the situation a bit. You stop studying now but it will stop you do something for change. ",
            "date": "Answered July 23, 2017",
            "views": "130",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jitender Singh",
                "href": "/profile/Jitender-Singh-8"
            },
            "answer_text": "Graduation is a must nowadays. So u must complete ur 12th n then do graduation frm any vocational college. It will make u mature in terms of taking decisions financially n in other aspects of life. And during ur graduation u will know other imp things about life. Like ur goal in life. If u are fluent in English then u must try flight steward/ Air hostess. Give interviews n if u love travelling then u will love this job. Good salary n travelling all over the world.Their are many things u can do when u hv ur mind working in right direction Be focussed, stay positive n stay healthy god bless ",
            "date": "Answered July 23, 2017",
            "views": "464",
            "upvotes": "0"
        }
    ]
}