{
    "title": "Can you find top MBA colleges in the Greater Noida? - Quora",
    "tags": [
        "Greater Noida",
        "Master of Business Administration Degrees"
    ],
    "response": [
        {
            "author_info": {
                "name": "Himanshi Jain",
                "href": "/profile/Himanshi-Jain-149"
            },
            "answer_text": "United Institute of Management , Greater Noida, deliberately considered and all around structured highlights give you the correct take off platform to set out on an exceptionally compensating profession. All things considered, it gives you a enviromnet- friendly grounds which is home to a few structurally striking structures. This is additionally the ideal setting where each need of yours is satisfied.  United Institute of Management campus has roomy, amphitheater styled and cooled study halls that give the most helpful climate to dynamic and centered learning. These classrooms have been intended to unite examination with activity and are expanded with incorporated broad media showing helps for talks and introductions.  The placements of the college is very great. A large number of the presumed organizations visit the grounds to offer arrangements to the students. A portion of the top organizations visiting the school incorporate Amazon, SAP Labs, IBM India, Deloitte, TCS, Wipro, Infosys, and numerous others. Right around 90-95% of students selecting arrangements get set inside the tech organizations. The position cell of the college is particularly dynamic and continue reaching and welcoming significant organizations to visit the grounds for offering situations. ",
            "date": "Updated January 22, 2020",
            "views": "637",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nupur Srivastava",
                    "user_href": "/profile/Nupur-Srivastava-57"
                },
                {
                    "user_id": "Rheaa Sharma",
                    "user_href": "/profile/Rheaa-Sharma-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Niketan Jha",
                "href": "/profile/Niketan-Jha"
            },
            "answer_text": "I am living in Greater Noida from past 7 Years, from my experience this are best colleges for MBA- Bimtech(Birla Institute of management) ,Plot No. 5, Knowledge Park IIGreater Noida (NCR), Uttar Pradesh - 201 306Galgotias Educational Institutions1, Knowledge Park, Phase IIGreater Noida201306G.L.Bajaj Institute of Technology & ManagementPlot No. 2, Knowledge Park III, Greater Noida, Distt. G.B.Nagar, U.P., India Pin-201306Greater Noida Institute of Technology, 15AKnowledge Park II, Greater Noida, Uttar Pradesh 201310Rest all colleges are pieces of shi***",
            "date": "Answered April 1, 2017",
            "views": "735",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Subhajit Mitra (শুভজিৎ)",
                "href": "/profile/Subhajit-Mitra-শুভজিৎ"
            },
            "answer_text": "There are ample number of B grade Bschools in greater noida knowledge park,who are claiming a rediculous ranking and package to lure you. But only hope is Bimtech Noida.You should try cmat from these year as it has been a trend from this year that Tier I MAT colleges only allow cmat/cat from these year. Be clever before investment. ",
            "date": "Answered February 15, 2018",
            "views": "402",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shivkant Yadav",
                    "user_href": "/profile/Shivkant-Yadav-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Kaushal",
                "href": "/profile/Abhishek-Kaushal-155"
            },
            "answer_text": "As Greater Noida is becoming hub of Education ,the students are getting lots of opportunities abt their education… If we say. Pure Management college in Noida/ greater Noida they are .., BIMTech Greater Noida Sivnadar IBI Greater Noida Jaipuria Noida & so on Above mentioned colleges has great track records but ROI wise BIMTECH & IBI is on top in this region. ",
            "date": "Answered December 13, 2019",
            "views": "216",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sagar Srivastava",
                "href": "/profile/Sagar-Srivastava-1"
            },
            "answer_text": "Nops ! Niggle ! None ! No ! There are several B schools in Greater Noida but not a single one which can be called as a “top college”. I assume by Top college, you are referring to the finest B Schools of India. ",
            "date": "Answered June 14, 2017",
            "views": "705",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Indrajit Debgupta",
                    "user_href": "/profile/Indrajit-Debgupta-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ranjay Malhotra",
                "href": "/profile/Ranjay-Malhotra"
            },
            "answer_text": "Below are some of the great options where we can get you seat directly u may reach us to get more details. SP JAIN MUMBAI JAMNALAL BAJAJ (JBIMS) SIBM PUNE MDI GURGAON FMS IMT GHAZIABAD KJ SOMAIYA WELINGKARS SYDENHAM SIMSREE ",
            "date": "Answered February 15, 2018",
            "views": "301",
            "upvotes": "0"
        }
    ]
}