{
    "title": "Can a school counselor talk to my child without permission? - Quora",
    "tags": [
        "School Counselor",
        "Counselors",
        "Counseling",
        "Children"
    ],
    "response": [
        {
            "author_info": {
                "name": "Claudia Bredow",
                "href": "/profile/Claudia-Bredow"
            },
            "answer_text": "When I was a high school counselor I had over 500 students on my caseload. If I had to ask permission every time I spoke to a student not much would get done. I don’t even have to tell parents I spoke with their child unless the child is threatening to harm themselves, others, or is being abused at which time I will call CPS. That being said, most of my interactions had to deal with scheduling, grades, college preparation and applications and testing. Be thankful that your school even has a counselor to help your student deal with the many stresses of school in general. Budgets for education have been severely cut and counselors are usually the first to go. With our current president I can only imagine the increase in bullying in our schools. ",
            "date": "Answered July 26, 2019",
            "views": "839",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jill Shamp",
                    "user_href": "/profile/Jill-Shamp"
                },
                {
                    "user_id": "Nancy Keithley",
                    "user_href": "/profile/Nancy-Keithley"
                },
                {
                    "user_id": "Sherry Millis",
                    "user_href": "/profile/Sherry-Millis"
                },
                {
                    "user_id": "Melissa Makan",
                    "user_href": "/profile/Melissa-Makan-1"
                },
                {
                    "user_id": "Gordon Leith",
                    "user_href": "/profile/Gordon-Leith-4"
                },
                {
                    "user_id": "Katie Whitson",
                    "user_href": "/profile/Katie-Whitson-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucille Embereyes",
                "href": "/profile/Lucille-Embereyes"
            },
            "answer_text": "Yes. Counselors are there for the students not for the parents. This is important. If you can guess why then you are part of the reason why school counselors can talk to kids without asking permission from parents or guardians. In addition to abuse situations, school counselors are what’s called “designated reporters” this means that in situation of sexual assault, discrimination (racial, religious, gender, sexual orientation or other) or bullying (this one is shaky ground even if your state/county has anti-bully initiatives, programs ad/or laws) by law they must report it to the appropriate authority to deal with it. ",
            "date": "Answered June 29, 2020",
            "views": "319",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jill Shamp",
                "href": "/profile/Jill-Shamp"
            },
            "answer_text": "Yes, the School Counselor is hired by the district for the students. Referrals to the counselor come from the principal, teachers, bus drivers, students themselves and parents. Be glad your district has School Counselors as most districts are too cheap to have them anymore. The School Counselor is there to help, not hurt. Relax, they've heard it before. ",
            "date": "Answered July 31, 2019",
            "views": "414",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sherry Millis",
                    "user_href": "/profile/Sherry-Millis"
                },
                {
                    "user_id": "Ann Jenkins",
                    "user_href": "/profile/Ann-Jenkins-60"
                },
                {
                    "user_id": "Melissa Makan",
                    "user_href": "/profile/Melissa-Makan-1"
                },
                {
                    "user_id": "Gordon Leith",
                    "user_href": "/profile/Gordon-Leith-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sherry Millis",
                "href": "/profile/Sherry-Millis"
            },
            "answer_text": "If the school counselor had to get parental permission before talking to each child, nothing would ever get done as it would be too time consuming! ",
            "date": "Answered February 26, 2020",
            "views": "268",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charlotte Leplae",
                "href": "/profile/Charlotte-Leplae"
            },
            "answer_text": "Yes. As they should. Because a lot of kids will talk more openly to a counselor then to their own parents ",
            "date": "Answered July 2, 2020",
            "views": "160",
            "upvotes": "0"
        }
    ]
}