{
    "title": "Can I graduate 8th grade with an F? - Quora",
    "tags": [
        "8th Grade",
        "Grades (education)",
        "Academic and Educational Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sue T Walker",
                "href": "/profile/Sue-T-Walker"
            },
            "answer_text": "Different countries, states, and districts have different laws regarding this policy. In the United States students must pass certain state tests as well as their course work at certain levels. Many districts have policies that state that you must have a passing grade in certain subjects in order to be promoted. You also have to have a certain amount of “seat time” (time actually in your seat and not absent) as well as have a certain amount of middle school, junior high, or high school credits (some courses count as high school credits during the 8th grade) in order to be promoted. You might want to consider taking a summer school course to replace that credit if it is keeping you from being promoted (and if your district offers that option). If the course is a prerequisite for getting into the next level class, you might have to repeat the course or grade. (For example you must pass 8th grade math before taking geometry at the 9th grade level in many districts.) There are a few districts that sometimes have a remedial course at the 9th grade level for those students who didn’t pass a certain course, but usually the counselor enrolls you in two similar courses such as 8th grade math and has you take geometry that same year so your academic life can become difficult in that one area.) I definitely suggest you look at the student handbook if it is online for your grade level. Type in the school district name and location to look up your school district online. You might also need to visit with your school counselor who can provide the correct response for your grade and district. Hopefully there is enough time during the current school year to bring up your grade. Your counselor can probably steer you towards some tutors to help you. Best wishes! I hope you pass! ",
            "date": "Answered April 21, 2019",
            "views": "723",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christopher Cimka",
                "href": "/profile/Christopher-Cimka"
            },
            "answer_text": "Whether you can graduate 8th Grade with an F depends on the school, district and country you are in, and whether this is F in every subject or just one (or two) F results. In most western countries, I think you can enter Grade 9 with an all F result… but in South America, two subjects with F will prevent you moving up. Obviously you did not “Graduate\", and many schools will recommend you repeat, but in most countries, your parents can insist you proceed to Grade 9 (where you will probably also get F results). ",
            "date": "Answered April 20, 2019",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sachith Vasireddy",
                "href": "/profile/Sachith-Vasireddy-2"
            },
            "answer_text": "It depends on your state and school district promotion and retention guidelines. Some districts can promote 8th graders to 9th grade with all Fs, and some districts have guidelines of not getting more than 2 consecutive failing grade. I hope this makes sense and helps. ",
            "date": "Answered June 3, 2020",
            "views": "135",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daniel Carey",
                "href": "/profile/Daniel-Carey-21"
            },
            "answer_text": "Varies by school, but junior high is “pass the grade” and one F will usually not hold you back. Starting in 9th, though, It's usually “pass the class,” meaning you have to retake any class you fail. ",
            "date": "Answered September 15, 2020",
            "views": "75",
            "upvotes": " Answer requested by Leah Noname"
        }
    ]
}