{
    "title": "Can we work part time while studying in full sail? - Quora",
    "tags": [
        "Full Sail University",
        "Part-Time Jobs",
        "Work"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Brown",
                "href": "/profile/Matt-Brown-5"
            },
            "answer_text": "Yes, it is possible. I went over 15 years ago. At the time a very few worked. You need to find a job that is very flexible with your schedule. We had classes during the day and labs at night. The school was open, one way or another, 24 hours a day. The schedule changed every semester. I did not work a steady gig. I worked when I could get anything. Working a steady part time job would not work out for me. You only get what you put in at Full Sail. You can sail through your classes and labs to get a piece of paper. You will be wasting your time and squandering a great opportunity. Or you bust your ass, take it very seriously, take every opportunity presented to you. Then you have a better chance of success then your fellow students. They are your competition in the real world. ",
            "date": "Answered August 31, 2016",
            "views": "555",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maximillian Hill",
                "href": "/profile/Maximillian-Hill-2"
            },
            "answer_text": "It depends. How stressful is the part time work? Is it related to your studies? Will it sap you of energy and hurt your studies? Does your boss know that your main priority is your studies? If your boss knows this, how does he or she feel about it? If you’re not working part time, how are you paying for your studies? Trying to do two things at the same time rarely ends well. ",
            "date": "Updated June 28, 2020",
            "views": "120",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nathaniel Luis",
                    "user_href": "/profile/Nathaniel-Luis-1"
                }
            ]
        }
    ]
}