{
    "title": "Can I be admitted into top-ranked universities like LUMS? - Quora",
    "tags": [
        "Lahore University of Management Sciences",
        "Grades (education)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Muhammad Zaman",
                "href": "/profile/Muhammad-Zaman-1"
            },
            "answer_text": "I disagree with Faizan, In most universities abroad grades are not the only criteria. In LUMS however grades are the only criteria based on which students are accepted (almost). The process is basically this. First you submit A/O level, HighSchool, or Metric/FSC scores. Then you give LCAT/SSE etc. Some combination of your scores in your LCAT/SSE and the other exams is used to give you a score. Then the top students of that are selected and given blind admissions. Top students are selected like this. Suppose SSE wants to take 1000 students this year. The top or so 500 are given admissions (with the expectation that 300+ will accept). Then 1000 people or so are called for interviews. Only after you are called for an interview is your personal statement read. Even so, your extra-curricular etc are all discarded. Only your personal statement is read. Beyond this point you have a 1/2 chance of getting in based on your interview. Also the scores you are given in LUMS are weighted based on the precived quality of the tests you give, i.e. If you gave O/A level then its 50% O/Alevel and 50% LCAT. If you gave HighSchool, its more like 13% HighScool and 77% LCAT, FSC is more like 30 something. There is one exception to this where grades are not the criteria. That is NOP (National Outreach Program). To qualify for NOP, you don't need grades you just need to be from a small town or something. But in order to get into LUMS as an NOP you still go though the same process. p.s. All this info is of atleast 2 years ago. ",
            "date": "Answered April 15, 2014",
            "views": "18",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bilal Zaidi",
                    "user_href": "/profile/Bilal-Zaidi-5"
                },
                {
                    "user_id": "Hassan Mujtaba Zaidi",
                    "user_href": "/profile/Hassan-Mujtaba-Zaidi"
                },
                {
                    "user_id": "Sana Farrukh",
                    "user_href": "/profile/Sana-Farrukh-2"
                },
                {
                    "user_id": "Muhammad Owais",
                    "user_href": "/profile/Muhammad-Owais-19"
                },
                {
                    "user_id": "Wahaj Ahmed",
                    "user_href": "/profile/Wahaj-Ahmed-1"
                },
                {
                    "user_id": "Hasnain Ali Pirzada",
                    "user_href": "/profile/Hasnain-Ali-Pirzada-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wahaj Ahmed",
                "href": "/profile/Wahaj-Ahmed-1"
            },
            "answer_text": "Most good universities in Pakistan give the highest priority to their own admission/aptitude tests. Followed by your A level / Fsc result and lastly to your O level / Matric result. As long as you havent done horrendously in your O levels and you are a straight A student in A levels. You can expect to get into LUMS/IBA/GIKI/NUST/FAST if you ace their aptitude test. ",
            "date": "Answered April 14, 2014",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Usman Haider",
                    "user_href": "/profile/Usman-Haider-5"
                },
                {
                    "user_id": "Maryam Mohd",
                    "user_href": "/profile/Maryam-Mohd-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Faizan Qureshi",
                "href": "/profile/Faizan-Qureshi-1"
            },
            "answer_text": "Grades are not just the only criteria for getting in. Your admission test scores, personal statements, recommendations that you have to send in; all count. So, gear up to do really great in the admission test, write a clear and effective personal statement and get recommendations from teacher who you know will say good words about you. In undergrad, many colleges (LUMS included) give importance to the extra curricula as well because it helps them create a diverse culture on campus. Do highlight these as well. ",
            "date": "Answered January 30, 2014",
            "views": "21",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shahzad Iqbal",
                    "user_href": "/profile/Shahzad-Iqbal"
                },
                {
                    "user_id": "Wahaj Ahmed",
                    "user_href": "/profile/Wahaj-Ahmed-1"
                },
                {
                    "user_id": "Affawn Ashraf",
                    "user_href": "/profile/Affawn-Ashraf"
                }
            ]
        }
    ]
}