{
    "title": "Can you fail in school but succeed in life? - Quora",
    "tags": [
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eva Gutierrez",
                "href": "/profile/Eva-Gutierrez-2"
            },
            "answer_text": " Picture via Instagram: School taught me how to flip a cup. Life taught me how to balance my relationships, what actions to take to make my aspirations come true and what I needed to make myself happy. Let’s flip it. You can succeed in school and fail in life. School doesn’t teach you emotional intelligence. Classes don’t teach you how to balance your career and relationships. Phys-ed didn’t teach you the difference between carbs and protein. When I graduate college I came face to face with the hard fact that I hadn’t learned anything. I didn’t know what my passion was. I had no clue how to make myself happy. I knew nothing about food and how to use it to fuel my body. You can succeed in life by deciding who you want to be and taking actionable steps to get there. Here’s an excerpt from my answer: What can I do to make my life a success? “Get out a pen and paper. Think to yourself, “Who is the person that I want to embody/change into?” Write down the top five qualities that they have that you want. Like this: The person I want to be is: An expert in their industryGenerousHardworkingA loving partner/significant other/spouse/etc.Great son/daughterNow create another list involving one action you can take today to embody these characteristics. Today I can: Read five articles on trending topics in my industryTip my barista or cab driver an extra few dollars, donate $5 to hurricane relief/charity of my choice, etc.Shut my phone off for two hours during work hours to maintain focusText my partner and tell them how much I appreciate them, bring them home dinner, do an errand for them, etc.Text my Mom and/or Dad and ask how their day is goingNotice that none of these actions are labor intensive or time consuming. Making this list didn’t take you an hour and it didn’t fry your brain. You can create this list everyday and change out the qualities that you want to embody.” To see the full answer, click here. Don’t think, “I am failing at school, how will I succeed in life?” Think instead, How do I focus on making sure that I am successful in my life?.  I went all in on my dreams of travel and just finished up backpacking Central America over the summer. ",
            "date": "Updated October 25, 2017",
            "views": "14",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akhilesh Soni",
                    "user_href": "/profile/Akhilesh-Soni-3"
                },
                {
                    "user_id": "Ali Maythem",
                    "user_href": "/profile/Ali-Maythem"
                },
                {
                    "user_id": "Kaylee Middlebrook",
                    "user_href": "/profile/Kaylee-Middlebrook"
                },
                {
                    "user_id": "Abarna Abi",
                    "user_href": "/profile/Abarna-Abi-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marlon Brandy",
                "href": "/profile/Marlon-Brandy"
            },
            "answer_text": "You have to be clear on what “school” is. School is a body of study the school board believes is valuable for your integration into your society. Different societies teach different things. These courses have nothing to do with “life”. They have everything to do with surviving in your society. Sure you can succeed in life if you don’t go to school. Humans are around 100,000 years old. Schools are probably a few thousand. Humans were successful long before schools and many societies, successful societies, exist today without the need for “school”. They do need to pass on techniques for survival, which is a form of school, but failure there often means death. Check out the San in Africa. They are considered the possible start of mankind and they don’t have schools. ",
            "date": "Answered September 11, 2017",
            "views": "4",
            "upvotes": " View 29 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aayush Singh Rajput",
                    "user_href": "/profile/Aayush-Singh-Rajput-12"
                },
                {
                    "user_id": "Alondra Negritaloka Pardo",
                    "user_href": "/profile/Alondra-Negritaloka-Pardo"
                },
                {
                    "user_id": "Kürşad Can Yılmaz",
                    "user_href": "/profile/Kürşad-Can-Yılmaz-1"
                },
                {
                    "user_id": "Nebu Abraham Thomas",
                    "user_href": "/profile/Nebu-Abraham-Thomas"
                },
                {
                    "user_id": "Lilia Wilson",
                    "user_href": "/profile/Lilia-Wilson-1"
                },
                {
                    "user_id": "Sarah Seton",
                    "user_href": "/profile/Sarah-Seton"
                },
                {
                    "user_id": "Victor Apeji",
                    "user_href": "/profile/Victor-Apeji"
                },
                {
                    "user_id": "Nick Southern",
                    "user_href": "/profile/Nick-Southern"
                },
                {
                    "user_id": "Mauricio Quiroga",
                    "user_href": "/profile/Mauricio-Quiroga"
                },
                {
                    "user_id": "Subodh Nainital",
                    "user_href": "/profile/Subodh-Nainital"
                },
                {
                    "user_id": "Claudia Holguin",
                    "user_href": "/profile/Claudia-Holguin"
                },
                {
                    "user_id": "Shrutika Kalgutkar",
                    "user_href": "/profile/Shrutika-Kalgutkar"
                },
                {
                    "user_id": "Nina G. Vega",
                    "user_href": "/profile/Nina-G-Vega"
                },
                {
                    "user_id": "Guilherme Marques",
                    "user_href": "/profile/Guilherme-Marques-18"
                },
                {
                    "user_id": "Vikas Gupta",
                    "user_href": "/profile/Vikas-Gupta-14"
                },
                {
                    "user_id": "Clifford Dicarlo",
                    "user_href": "/profile/Clifford-Dicarlo"
                },
                {
                    "user_id": "Nicola Brooke",
                    "user_href": "/profile/Nicola-Brooke-6"
                },
                {
                    "user_id": "Ankit Maindola",
                    "user_href": "/profile/Ankit-Maindola"
                },
                {
                    "user_id": "Nisreen Al-Basha",
                    "user_href": "/profile/Nisreen-Al-Basha"
                },
                {
                    "user_id": "Sara Kilgore",
                    "user_href": "/profile/Sara-Kilgore-2"
                },
                {
                    "user_id": "Ben Billengren",
                    "user_href": "/profile/Ben-Billengren"
                },
                {
                    "user_id": "Michael Gross",
                    "user_href": "/profile/Michael-Gross-76"
                },
                {
                    "user_id": "Kiran Khandelwal",
                    "user_href": "/profile/Kiran-Khandelwal"
                },
                {
                    "user_id": "Jas Li",
                    "user_href": "/profile/Jas-Li-2"
                },
                {
                    "user_id": "Rupert Smith",
                    "user_href": "/profile/Rupert-Smith-8"
                },
                {
                    "user_id": "Rajendera Singh Khurana",
                    "user_href": "/profile/Rajendera-Singh-Khurana"
                },
                {
                    "user_id": "Bui Ngoc Vinh",
                    "user_href": "/profile/Bui-Ngoc-Vinh-1"
                },
                {
                    "user_id": "Zeeshan A Zakaria",
                    "user_href": "/profile/Zeeshan-A-Zakaria"
                },
                {
                    "user_id": "Justin Savatdy",
                    "user_href": "/profile/Justin-Savatdy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ari del Rosario",
                "href": "/profile/Ari-del-Rosario-2"
            },
            "answer_text": "YES but you will increasingly find that a metric people will assess you or your company by are your academic materials. When creating a website of your company, the officer’s name and achievements are posted there including usually their degrees - and the schools involved. Potentials customers look at this for reference. Let’s say you backed out of Harvard for the a third tier university. And this customer and all his advisers were from Harvard…opportunity lost So be careful, it is definitely more the exception than the rule ",
            "date": "Answered September 12, 2017",
            "views": "386",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mildred Schlipenheimer",
                "href": "/profile/Mildred-Schlipenheimer"
            },
            "answer_text": "I had a difficult time with school. I would fall asleep. I had absolutely no interest in learning what the teachers were trying to teach. I felt that school was, a little strange. It made no sense to me, getting up so early in the morning, hurrying to get dressed, walking up a large hill to get on a bus full of rough kids. Spending the whole day having a teacher attempt to ram a certain currriculum into my brain. If I spent time pursuing knowledge I prefered to learn, I seemed to do well. I really think we have a long way to go as humans, getting it right. We really lead awful lives for the most part. John Lennon said it best in his song “Working Class Hero”. I do not believe success cannot be measured in dollars. ",
            "date": "Answered September 11, 2017",
            "views": "356",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alondra Negritaloka Pardo",
                    "user_href": "/profile/Alondra-Negritaloka-Pardo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Natalie Kammerer",
                "href": "/profile/Natalie-Kammerer-1"
            },
            "answer_text": "Absolutely! but…be cautious.To succeed in life you need perseverance, determination, resilience over failures, the ability to prioritize and order your day, the ability to get along with lots of different kinds of people, and the math to manage your money! These can be practiced in school.So it’s not the subject matter so much, as the ability to master yourself! Best! ",
            "date": "Answered September 11, 2017",
            "views": "429",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alondra Negritaloka Pardo",
                    "user_href": "/profile/Alondra-Negritaloka-Pardo"
                },
                {
                    "user_id": "Rhea Kaur",
                    "user_href": "/profile/Rhea-Kaur-10"
                },
                {
                    "user_id": "Lea Theresa Lavilla",
                    "user_href": "/profile/Lea-Theresa-Lavilla"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pat Lee",
                "href": "/profile/Pat-Lee-72"
            },
            "answer_text": "As a landlord, I had this single mom tenant, age about 27 with 2 teen kids. She’s very smart about various rental loopholes. I was puzzled how someone her age knew all these? I evicted her for many reasons. She left a mountain of trash; among them were a pile of paper work. I think I found my answer. Her ex is a jailbird and got his advance education on how to commit more crime and pass this knowledge to her. In college, it tough me the right way and the wrong way to do things. I started my first professional job. Let me label right/wrong in black and white color. In 2 weeks of my first job, I learned this world is all gray in color, only different shades of gray. I am a father. You cannot go to a college to learn how to be a father. I am an investor. Again, no college will teach you that. ",
            "date": "Answered September 26, 2017",
            "views": "411",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "RD Bryant",
                "href": "/profile/RD-Bryant"
            },
            "answer_text": "Yes, you can fail school and still be successful but it is much harder. It is best to get an education and and have a skill to make life easier.If you already have a skill and its one that is needed in the area that you live then you might be ok.But understand skills can change and life needs change daily. ",
            "date": "Answered September 17, 2017",
            "views": "149",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Preet Rajshekhar",
                "href": "/profile/Preet-Rajshekhar"
            },
            "answer_text": "ABSOLUTELY. Institutionalized education, full of structure and rigidity, is not for everyone. Everyone has a differently learning style, there are different types of intelligence. Once you identify your strengths, be it athletic or writing based or numbers based, you can hone this skill. ",
            "date": "Answered September 11, 2017",
            "views": "311",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wallace Godwin",
                    "user_href": "/profile/Wallace-Godwin"
                },
                {
                    "user_id": "Alondra Negritaloka Pardo",
                    "user_href": "/profile/Alondra-Negritaloka-Pardo"
                },
                {
                    "user_id": "Cameron Sanders",
                    "user_href": "/profile/Cameron-Sanders-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patrick Loftus",
                "href": "/profile/Patrick-Loftus-10"
            },
            "answer_text": "Yes, if you change. The things that make you good at school make you good at life, generally speaking. Putting in effort, being consistent etc. Some learn these skills later in life (myself included). That doesn't mean you should blow off school. It is excellent practice. ",
            "date": "Answered September 11, 2017",
            "views": "130",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suman Korpal",
                "href": "/profile/Suman-Korpal"
            },
            "answer_text": "Yes I did. Just find a good big company and become cleaner or porter .Work hard and win the trust of managers and hopefully you will be promoted .This will open opportunities to new positions or More money.But you must save hard and avoid material comforts like cars,fancy clothes etc.After 20 to 30 years you will be well off. ",
            "date": "Answered September 11, 2017",
            "views": "208",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Russell Torres",
                "href": "/profile/Russell-Torres-3"
            },
            "answer_text": "Absolutely yes some of the most genius people on the planet had a different rate of learning and therefore appeared incompetent in regular school but when they were left to develop and reach the next level of intelligence that far surpassed many others. ",
            "date": "Answered September 11, 2017",
            "views": "156",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alondra Negritaloka Pardo",
                    "user_href": "/profile/Alondra-Negritaloka-Pardo"
                },
                {
                    "user_id": "Ludwig C. Pfingsten",
                    "user_href": "/profile/Ludwig-C-Pfingsten"
                }
            ]
        }
    ]
}