{
    "title": "Can I study abroad after a distance education BBA at Sikkim University? - Quora",
    "tags": [
        "Studying Abroad"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kara Schell",
                "href": "/profile/Kara-Schell"
            },
            "answer_text": "It depends on what you're wanting to study now. There are thousands of programs around the world that cater to whatever you're wanting to study, which is what is so amazing about education. I recommend that you start narrowing the scope of what you're wanting to study so you have a solid game plan in mind when you begin your college search. Be sure to look at www.SchooLinks.com when you are trying to find colleges to study at. You can easily search with keywords, such as the location where you're wanting to study or a program that you're interested in applying for. ",
            "date": "Answered August 24, 2015",
            "views": "52",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Avi",
                    "user_href": "/profile/Avi-71"
                },
                {
                    "user_id": "Amit Sharma",
                    "user_href": "/profile/Amit-Sharma-1236"
                }
            ]
        },
        {
            "author_info": {
                "name": "Janardan Goswami",
                "href": "/profile/Janardan-Goswami"
            },
            "answer_text": "well friend , There is no difference between distance and regular in our education System. except some courses in which u have some practical papers. So you can Study Abroad if u have the capability And eligibility . Just work hard . All the best……… THANK YOU ",
            "date": "Answered September 21, 2018",
            "views": "2",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shiff William",
                    "user_href": "/profile/Shiff-William"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harshit Pittie",
                "href": "/profile/Harshit-Pittie"
            },
            "answer_text": "Work hard buddy, appear for the exams that can land you up in the universities you want to go in.  A degree is more than what you require to be in the top university of your field if you have the capability.  Peace. ",
            "date": "Answered August 23, 2015",
            "views": "25",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Amit Sharma",
                    "user_href": "/profile/Amit-Sharma-1236"
                }
            ]
        }
    ]
}