{
    "title": "Can I learn programming without going to class? - Quora",
    "tags": [
        "Beginning Computer Programming Advice",
        "Learning New Things",
        "Learning to Program",
        "Programming Languages",
        "Computer Programming"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shalu",
                "href": "/profile/Shalu-133"
            },
            "answer_text": "Yes, you can learn programming without going to class. Here I will tell you some tips. You can follow these to learn programming. Choosing a Language You can start learning with any programming language. So, you can start by asking yourself what you want to achieve by learning the programming language. This will help you decide what kind of programming you should try. Read some basic tutorials for different languages. If you’re still not sure which language you should start learning, read some tutorials for some different languages. If a language makes a little more sense than others, try it to see if it clicks. Grasp the basics for long term benefit As fundamentally as they may show up from the start, programming basics constantly need to start things out: the better you understand them, the simpler it is to adapt further developed ideas. If your fundamentals are clear, then you can learn languages quickly. Code by hand PC screens become more slender, hard drives are lighter. Programming languages all the more dominant. However, coding-by-hand still stays one of the best strategies to figure out how to program. Be it on a whiteboard or note pad, coding-by-hand requires further alert, exactness, and plan behind each line of code. Creating Your First Program One of the first programs writes for any language “Hello World” program. This is the first and simple program you need to try. The program teaches programmers the syntax for creating a basic, working program for the first time, as well as how to handle the displayed output. By changing the text, you can handle the basic data by the program. Check the syntax The syntax is the way in which language is written so that the compiler or interpreter understands it. Each language has a unique syntax, although some elements can be shared in multiple languages. Learning syntax is essential for learning how to program in a language, and what people often think when thinking about computer programming. Experiment with changes Make changes to your example programs and then test the results. By experimenting, you can learn what works and what is not quick by reading a book or guide. Don’t be afraid to break your program. Learning to fix errors is a key part of any development process. Start debugging When you’re programming, you’re always going to fall into bugs. These are errors in the program and can be shown practically anywhere. Bugs in the program can be harmless, or there may be major errors that prevent the program from compiling or running. Reducing and correcting these errors is a major process in the software development cycle, so get used to it quickly. When you experiment with changing basic programs, you are going to come up with things that don’t work. As a programmer, you have the most valuable skills to find out how to take a different approach. Comment all of your code Almost all programming languages have a “comment” function. It allows you to include text that is not processed by an interpreter or compiler. This allows you to leave short, but clear, human-language interpretations to leave the code. This will help you to remember what your code is actually working. Practice regularly Mastering a programming language takes time above all else. Even a simple language like Python, which can take only a day or two to understand the basic syntax, takes a lot of time to really become efficient. Like any other skill, practice is the key to becoming more efficient. Try to spend at least a few time each day in coding, even if it’s only for an hour between work and dinner. Ask for help There are a lot of programming communities dedicated to specific languages or topics. Finding and participating in the community can do wonders for your learning. These communities are generally seen as a place of collaboration and discussion and not simply Q&A. You will gain access to a variety of samples and tools that can help you in your learning process. Reading other programmers code can inspire you and help you understand concepts that you haven’t mastered yet. Just don’t read the example code and run it too Reading the test code is not enough to see how it works. To make an actual understanding, you need to run the code and tinker with it. With the increase of comments and instructions, the test code is bundled to be effectively edited by the reader; However, in reality, it is quite difficult to represent without preparation. Persing is not equal to the compensation and attempting to write the code yourself, or if nothing else is running, will adequately encourage the learning process. Take breaks when debugging While bug removal, there is no guarantee that you will fix the problem. To avoid this, it is best to move away from the bug for a few hours and come back with a new approach. Not only is this a guaranteed way to solve the problem, but you can also save yourself from hours of headache. Evaluate some online courses If you need more power on your learning plan. You can go for online courses or online classes. In any case, different online classes show the same programming language, and it can be very difficult to understand which is exactly what’s worth your time and cash. Read more…. to learn programming. ",
            "date": "Answered November 4, 2019",
            "views": "2",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gajanan Godmale",
                    "user_href": "/profile/Gajanan-Godmale-1"
                },
                {
                    "user_id": "Aravind Reddy",
                    "user_href": "/profile/Aravind-Reddy-353"
                },
                {
                    "user_id": "Harper Cunningham",
                    "user_href": "/profile/Harper-Cunningham-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Kenneth Eng",
                "href": "/profile/Richard-Kenneth-Eng"
            },
            "answer_text": "Absolutely. Here’s my advice: I strongly recommend a good teaching language. Many of the common recommendations (Python, JavaScript, C, Swift, etc.) are industrial languages that were never designed, nor intended, for instructional purposes. They all carry a lot of baggage that can distract a beginner who should be focussed on learning the basic programming concepts. The best teaching language, in my opinion, is Smalltalk. It was designed by Alan Kay and his team at Xerox PARC for teaching programming to children. The language is supremely simple. Its syntax can fit on a post card!  And yet, Smalltalk is unbelievably powerful. Read Why Pharo Might be the Future of Software Development. After you’ve learned Smalltalk programming, picking up subsequent languages like Java, Python and JavaScript is a breeze. That’s because you now have a solid foundation. Here are some great resources: a nice, gentle tutorial — Learn Smalltalk with Prof Stefthe most actively developed Smalltalk — Welcome to Pharo!a free book — Updated Pharo by Examplea Getting Started guide for Pharo —Pharo Quick Starta MOOC (massive open online course) —Live Object Programming in Pharosome great videos — Smalltalk 4 Youa book that I like (not based on Pharo) — Smalltalk by Exampleanother book that I like (not based on Pharo) — Computer Programming using GNU Smalltalksome additional resources — ResourcesThis book (not free) is my favourite for learning how to use Smalltalk for object-oriented programming: Smalltalk, Objects, and Design, by Chamond Liu. I myself have published a whole bunch of Smalltalk tutorials. The latest ones are: Learn How To ProgramTeapot: Web Programming Made EasyHow to use the Pharo DebuggerGood luck. ",
            "date": "Answered January 18, 2018",
            "views": "121",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "Travis Dadzie",
                    "user_href": "/profile/Travis-Dadzie-1"
                },
                {
                    "user_id": "Sankalp Khankal",
                    "user_href": "/profile/Sankalp-Khankal"
                },
                {
                    "user_id": "Mak",
                    "user_href": "/profile/Mak-298"
                },
                {
                    "user_id": "Aleka Mondlane",
                    "user_href": "/profile/Aleka-Mondlane"
                },
                {
                    "user_id": "Muhammad Shais",
                    "user_href": "/profile/Muhammad-Shais"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Masala-Papad"
                },
                {
                    "user_id": "Ashley R",
                    "user_href": "/profile/Ashley-R-4"
                },
                {
                    "user_id": "Abutana Badshah",
                    "user_href": "/profile/Abutana-Badshah"
                },
                {
                    "user_id": "Kevin Timothy",
                    "user_href": "/profile/Kevin-Timothy-3"
                },
                {
                    "user_id": "Kartik Kashyap",
                    "user_href": "/profile/Kartik-Kashyap-33"
                },
                {
                    "user_id": "Teodor Laci",
                    "user_href": "/profile/Teodor-Laci-1"
                },
                {
                    "user_id": "Ankit Yadav",
                    "user_href": "/profile/Ankit-Yadav-1427"
                },
                {
                    "user_id": "Barth David",
                    "user_href": "/profile/Barth-David-2"
                },
                {
                    "user_id": "Ron Davis",
                    "user_href": "/profile/Ron-Davis-48"
                },
                {
                    "user_id": "Will Owas",
                    "user_href": "/profile/Will-Owas"
                },
                {
                    "user_id": "ENIYACHANDRAMOULI G",
                    "user_href": "/profile/ENIYACHANDRAMOULI-G"
                },
                {
                    "user_id": "JAN CIRINO",
                    "user_href": "/profile/JAN-CIRINO"
                },
                {
                    "user_id": "BAVImania",
                    "user_href": "/profile/BAVImania"
                },
                {
                    "user_id": "Horacio Moran",
                    "user_href": "/profile/Horacio-Moran"
                },
                {
                    "user_id": "I Cyril",
                    "user_href": "/profile/I-Cyril"
                },
                {
                    "user_id": "Lakshay Singhal",
                    "user_href": "/profile/Lakshay-Singhal-16"
                },
                {
                    "user_id": "Omar Gallegos",
                    "user_href": "/profile/Omar-Gallegos-1"
                },
                {
                    "user_id": "Angel Matt",
                    "user_href": "/profile/Angel-Matt-2"
                },
                {
                    "user_id": "Mubasher Alvi",
                    "user_href": "/profile/Mubasher-Alvi"
                },
                {
                    "user_id": "Mary Krupka",
                    "user_href": "/profile/Mary-Krupka"
                },
                {
                    "user_id": "Rajesh Morankar",
                    "user_href": "/profile/Rajesh-Morankar"
                },
                {
                    "user_id": "Patrick Dekker",
                    "user_href": "/profile/Patrick-Dekker-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geetha Darsha",
                "href": "/profile/Geetha-Darsha"
            },
            "answer_text": " You can learn programming from the online Courses other than school. Python has become popular in data science and scientific computing. IT's used at companies like Google and Yahoo! Python's syntax looks very similar to Ruby, so if you learn one language it's pretty easy to pick up the other. So i recommend you t learn python programming from the Online Courses. I can also recommend you to learn Python programming from the Online Courses. The Best Python Online Courses are #1 Python for Everybody Specialization by University of Michigan #2 Complete Python Bootcamp: Go from zero to hero in Python 3 In course one, you will learn all basic for Python and you will also learn how to write a program in computer by using Python. Instructor will teach you about advanced Python 3 programming.In course two, instructor will teach you the core data structure in Python and you will also learn how to use Python in build data structures like tuples, dictionaries, lists.You will learn how to access the web data by using Python in the third course. You can access the data and can also read the data by using the APIs. You will learn how to work with the data formats like JSON, HTML in the Python.In course four, they will teach you all basics for data based design for storing the data and also you will learn the basics of SQL (Structured Query Language).In course five, Charles will teach you by using Python how to build retrieving, visualizing data and processing.",
            "date": "Answered July 8, 2019",
            "views": "277",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chandu Krish",
                    "user_href": "/profile/Chandu-Krish-1"
                },
                {
                    "user_id": "Chandra Vathi",
                    "user_href": "/profile/Chandra-Vathi-12"
                },
                {
                    "user_id": "Chandra Mathi",
                    "user_href": "/profile/Chandra-Mathi-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Silva",
                "href": "/profile/Mike-Silva-91"
            },
            "answer_text": "Most certainly. To give you some context I started coding (very simply, like we all do!) when I was around 8–9ish. Back then, I started out on an Intel 286, with a classic DOS prompt. The most I ended up doing was BASIC. With some time under my belt - many hours of Prince of Persia, and several 5.25″ floppies… I advanced to Pascal. Fast forward to the present - the barrier to start learning to code has been reduced a HUGE deal. You can straight away start learning Javascript -Learn JavaScript Online | Code School (https://www.codeschool.com/learn/javascript) which is pretty much the lingua franca of the modern web. I’d suggest spending sometime picking up the basics; get yourself a good book (read through Amazon reviews) and really make an effort. Once you’ve spent some time, try a different language say Ruby - Learn Ruby & Ruby On Rails Online | Code School Rinse and repeat - this time, I’m throwing you in the deep end - Some basic ANSI/GNU “C” - Learn C - Free Interactive C Tutorial Then progress on to C++14/17 - Beginning Modern C++ (C++11/C++14) | Udemy You also want to learn some Python, Go (Go Lang), Rust, Elixir… …and guess what, if you’ve come this far - you’ve got a wonderful 20+ years ahead to dive in deeply into these languages - where you’ll certainly have favourites, and then broaden your horizons into other verticals such as virtualisation, DevOps, app development, AI/Machine Learning, and the list goes on. Oh you also MUST pick up an Arduino and learn some basic microcontroller “Ninjut-su”. Thinking at the ‘register’ level, especially in ASM (Assembly), will ultimately determine the sort of developer/engineer you’ll become as well as give you an insight that others may struggle for years to acquire. Last but certainly not the least - pick up Linux. If there’s one key bit of advice I could impart to every newbie, 9–5 cubical code maestro, or Comp Sci student — Make Linux your sole OS for at least a year. I’d actually even take it to the next level - do not run X11/gnome/KDE. Just live in a pure shell (or tmux ideally!)… Another must have skill is `git`, which is a MUST in today’s space; working with Github/Bitbucket should become second nature, without using a ‘fancy GUI’ - just from the command line. You might ask yourself, what about University degrees such as Comp Sci - well, you have to also _study_ the science of Computing as well, theory such as SOLID, CAP etc etc the list goes on. This is what makes top-end Engineers standout from the rest really; but it doesn’t mean that those who may struggle cannot grow with pure-elbow grease and “failing” a lot. Do it for 20+ years… Try some of these and you’ll be on your way to becoming a pro in no time. ",
            "date": "Answered January 18, 2018",
            "views": "63",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charles Bauer",
                    "user_href": "/profile/Charles-Bauer-16"
                },
                {
                    "user_id": "Richard Muia",
                    "user_href": "/profile/Richard-Muia"
                },
                {
                    "user_id": "Betzaida Santiago",
                    "user_href": "/profile/Betzaida-Santiago"
                },
                {
                    "user_id": "Ankit Yadav",
                    "user_href": "/profile/Ankit-Yadav-1427"
                },
                {
                    "user_id": "Will Owas",
                    "user_href": "/profile/Will-Owas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Bland",
                "href": "/profile/Andrew-Bland-6"
            },
            "answer_text": "Sure, you could. However, you should consider the pros and cons of not receiving a formal education. Pros: learn at your own paceSet your own goalsCreative freedom on projects you use to learnIt's (relatively) free!Cons: Lack of (or very basic) understanding of complex data structures and algorithmsPossibly larger learning curve, depending on level of commitmentIf you plan to make a career out of it, you have to compete with people formally educated and incredibly well versed in underlying requirements for the jobMost employers demand a B.S in Computer Science or equivalentSelf teaching could take up to triple the amount of time required to learn, depending on (you guessed it) level of commitmentNow then, I'm not trying to discourage or dissuade you from picking up programming, I actually would encourage it as it helps to sharpen your logical and problem solving skills. However, if you want to make a successful career out of it, you should go to school and get a degree ",
            "date": "Answered August 25, 2017",
            "views": "18",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sara Bowman",
                    "user_href": "/profile/Sara-Bowman-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carlo Mazzini",
                "href": "/profile/Carlo-Mazzini"
            },
            "answer_text": "Yes and No. It depends how you look at it. Can you do it without going to school, having a presential teacher, and all alone in your room? YES. It can be done. That’s how I learned, and that’s how I still do it. Can you do it without any external reference, book, website, online course, or similar resource? NO. You will ALWAYS have teachers. You will ALWAYS learn from someone. The fact that you never get to meet them doesn’t change the fact. So, whether we like it or not, there’s always SOMEONE teaching us. Many things have change since I learned how to program. Many people still suggest to start with a “student friendly language” like Python. I strongly disagree. Not about Python, but at starting with the programming language. If you have no knowledge of programming whatsoever, your best starting point is Karel the Robot (google it). It’s simple as a kid’s game, but excellent to explain what programming is about. Once you learn the concepts, you can jump into a programming language. Learn the trade before the tool. Karel the Robot is so good, Stanford University uses it to teach new students. Once you understand what programming is about, you can jump to learn a language. There’s where Python is great. But it’s not your only choice. Good luck. ",
            "date": "Answered January 23, 2018",
            "views": "26",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Travis Dadzie",
                    "user_href": "/profile/Travis-Dadzie-1"
                },
                {
                    "user_id": "Aeri Cah",
                    "user_href": "/profile/Aeri-Cah"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lakhdeep Singh",
                "href": "/profile/Lakhdeep-Singh-10"
            },
            "answer_text": "You don’t need to go to school or attend any Bootcamp or do some really expensive course to learn programming. All you need is a will to learn, a laptop and a stable internet connection. When you can learn programming from worlds best teacher directly teaching you from worlds Best Universities, why would you go somewhere else. They are tons of courses available to learn programming taught by teachers from Harvard, Standford, Princeton etc. Just Google and you will get so many courses for free. and you can also learn from youtube, so many people have made courses for free for anyone who is interested in learning. So if you are starting with Programming : Then i suggest you start with this : Introduction to Programming, Harvard CS50 taught by David Malan CS50 Lectures 2019 - YouTube , THIS IS THE BEST COURSE TO START WITH PROGRAMMING taught by this amazing, enthusiastic and thoughtful DAVID MALAN.  ",
            "date": "Answered June 26, 2020",
            "views": "168",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ron Kothari",
                    "user_href": "/profile/Ron-Kothari-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bryan Williams",
                "href": "/profile/Bryan-Williams-223"
            },
            "answer_text": "To be honest, every professional programmer who has also had formal education and training will admit that the vast majority of skills they actually use in their careers were self-taught, like below. Formal training doesn’t hurt, but it’s really not where you will acquire the most useful skills. All of these are extremely helpful: Books, Web sites, code examples, discussion boards. But it’s most helpful to just do it. Grab some sample code, sit down with a free IDE, and just start typing it out, modifying it, trace it line-by-line, and try extending it, especially to do something it was not meant to do in the first place. For example, Guess the Number game is a very common and relatively easy game to write. Grab some free sample code for this game, and try changing it: Extend the range, including negative numbersChange it to only allow even or odd numbersChange it to Guess the LetterKeep a temporary (session) high scoreKeep a permanent high scoreStart small and don’t try setting outrageous goals, like “I want to create the world’s greatest MMORPG.” Start with something very small and something that may appear to be simple. Chances are, there is a lot more to a very small program than you are aware. ",
            "date": "Answered August 5, 2018",
            "views": "363",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tim Mensch",
                    "user_href": "/profile/Tim-Mensch"
                },
                {
                    "user_id": "Paul Nichols",
                    "user_href": "/profile/Paul-Nichols-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sudhanshu Tamhankar",
                "href": "/profile/Sudhanshu-Tamhankar"
            },
            "answer_text": "Programming today is pretty easy to start by yourself without a lot of academic input from formal education. The journey from being a non-programmer to a programmer in pretty easy. In terms of material, all you need is an average computer (does not have to be top of the line, just anything that's not 5 years outdated will do) and an internet connection. There is however the personal input of time and effort, like there is in learning a new language or sport. Some motivation also helps. The 10000 hour rule applies : if you want to be a really really good programmer, then spend 10000 hours programming. But like all other hobbies or interests, it has to start with the difficult first step, and the effort to make it into something joyful. For me, things are joyful when I see them as serving some purpose while doing them. For example I feel working out in the gym is tedious and boring. But ask me to play some active game instead, and I am all for it. Making it fun can be easily achieved by starting with making a simple game or coupling programming tasks with writing Raspberry pi apps that do something. The key is not to get bogged down by the plethora of languages in learning to program. Most languages are either functional or declarative. Just choose declarative languages for starters (like C, Java, C++, Python etc) and run with it. ",
            "date": "Answered July 5, 2019",
            "views": "961",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chelsea Robertson",
                    "user_href": "/profile/Chelsea-Robertson-42"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanwal Yousaf",
                "href": "/profile/Sanwal-Yousaf"
            },
            "answer_text": "Depends on what you mean by classes. Do you mean just physical classes or online lectures? If you are completely new to the field, I find that just reading and practice will only take you so far. A good online course can ease your entry into the field and might help get acquainted with concepts before you start reading books on it. With that said, when i started with programming about 4 years ago, i started with python. I used Coursera's Intro to programming with Python taught by Charles Severance of university of Michigan. It's now taught as a speciality of 5 courses. You can apply for financial aid for each individual course and you can take them for free. Programming for Everybody (Getting Started with Python) | Coursera Once you are through with aleast the first course, I would suggest using Automate the boring stuff which is a free book online to get good amount of practice: Automate the Boring Stuff with Python This would take you about 3 months in all. If you start tomorrow, then by the end of March you would have some sort of grip on major programming concepts. Once you have some control over these concepts, switching languages just becomes a matter of semantics. ",
            "date": "Answered December 31, 2018",
            "views": "467",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott M Gardner",
                "href": "/profile/Scott-M-Gardner"
            },
            "answer_text": "Yes. Provided you have access to a computer and books and Internet. Access to programmers who are willing to help you also helps.  Learning anything require a few elements (outside of what you have to bring to the party). The first is some information on the subject you wish to learn. Ideally organized into structured lessons, but that is not an absolute requirement. The second is a way to apply what you are learning so you internalize the information and be sure you really understand it.  The formula is simple: read about a concept, then practice it until you can think in that concept. If you run into a roadblock, that is where having real people available really helps. A different point of view often is all you need to get past a block.  Learning this way may not be as effective as school, but is certainly possible. ",
            "date": "Answered November 16, 2015",
            "views": "439",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pato Gichini",
                "href": "/profile/Pato-Gichini"
            },
            "answer_text": "I would say that is how most of the people learn. I can’t categorize myself as a true bad ass programmer but I know my way around programming. I can comfortably do C, C++ and Scala I have on a few occasions used C#, PHP, JavaScript (am being forced to do this by circumstances) I can comfortably do a bunch of 4G languages like SQL and things like PL/SQL which is a procedural extension for SQL. I also know my fair share of web dev way around HTML, CSS and BOOTSTRAP All this stuff I taught myself. It has taken me a very long time and though I can barely remember the kind of logic I used on some of them, all it took was Google. I initially started with paper and pen until I could afford my first laptop. I am more of a devOPS and don’t code much and my skills aren’t probably that great but I know it can be done. It’s possible to become a code ninja without ever stepping into a class. It takes mad discipline and a lot of logical thinking but it is very possible. All the best if you’re planning to start the journey :-) ",
            "date": "Answered January 18, 2018",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ron Kothari",
                "href": "/profile/Ron-Kothari-1"
            },
            "answer_text": " This is one of the best courses to learn the basics of programming. They have problem sets too so you can solve them after every lecture and they grade those too. The best part, It’s free!!!!, and David Malan is the best guy to teach this. Udemy. There are many courses on this website/application for around 500rs(10$). Many different programming languages, Machine Learning, AI , cyber security , web development. So many different topics for next to nothing. One of the many benefits of internet. Headfirst Books I don’t know how much these costs but these books are really one of the best out there. They are interactive, full of codes for you to solve and easy to understand. I highly recommend these books ahead of other books. Telusko This is the name of a YouTube channel. Again a good place to learn the basics of programming and well it’s free so why not. It mostly covers the basics of programming, you variables, algorithms, data structures and everything and the guy teaches you all these things while using an IDE. For his latest videos(Python programming) he has added question after almost every video. These are the different sources I have been using since last 4 months to learn programming. ",
            "date": "Answered June 26, 2020",
            "views": "138",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tyler Schroeder",
                "href": "/profile/Tyler-Schroeder-11"
            },
            "answer_text": "Honestly, there are probably more places on the internet to learn programming than there are schools that teach it. A good overall place to start would be codecademy.com, which has in depth tutorials on several languages. Javascript would probably be a good one to start with there, as they go over a ton of basic concepts that can be applied into tons of other languages, like conditionals, loops, and objects. If you want to learn a specific language, google it! There are loads of people that have written good, lengthly tutorials on almost every language you can think of. If you want something more formal that gets into some more advanced topics, check out the programming courses on OCW. These are full on digital MIT classes that you can do at your own pace, on your own time. They range across multiple languages and from absolute beginner stuff to almost cutting-edge topics. Have fun!  ",
            "date": "Answered March 10, 2016",
            "views": "379",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Johan Bergens",
                    "user_href": "/profile/Johan-Bergens"
                },
                {
                    "user_id": "Calvin Goh",
                    "user_href": "/profile/Calvin-Goh-16"
                },
                {
                    "user_id": "Josh Holtom",
                    "user_href": "/profile/Josh-Holtom"
                },
                {
                    "user_id": "Aaron Shbeeb",
                    "user_href": "/profile/Aaron-Shbeeb"
                },
                {
                    "user_id": "Zhang Bin",
                    "user_href": "/profile/Zhang-Bin-33"
                },
                {
                    "user_id": "Abhijit Talukdar",
                    "user_href": "/profile/Abhijit-Talukdar-4"
                },
                {
                    "user_id": "Jacky Zhao",
                    "user_href": "/profile/Jacky-Zhao-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amarsh Anand",
                "href": "/profile/Amarsh-Anand-1"
            },
            "answer_text": "Absolutely!!! I taught myself how to program in BASIC by simply typing sample programs from the manual of Casio PB 700 ( Details) in 1992. I was 14 then. Things have only gotten easier since then in terms of the amount of available resources.About going to classes, I have two degrees in computer science, and in neither of them, I was being taught a programming language actively. We were given assignments, followed by discussing the theory behind the solution, and were being left to figure out the coding part on our own.What helped me the most is to be clear on WHAT do you want to build. HOW then follows easily. As Jobs said, Stay Hungry, Stay Foolish .... and ask many many many questions. The entire stackoverflow ( Stack Overflow ) community will help you out. Good Luck :) ",
            "date": "Answered February 24, 2015",
            "views": "512",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akira Miyakoda",
                "href": "/profile/Akira-Miyakoda"
            },
            "answer_text": "I'm keen to answer YES because I'm a self-taught programmer, but feel like mentioning some risk of teaching yourself. I recommend you to follow some textbooks with an established reputation and have a good tutor if you can in order to prevent wasting time. Please let me tell my personal experience. I began programming at an early age by copying BASIC programs from some magazines. I think it was almost only way for a small-town boy in 80's like me to learn how to program. It was really fun, but I couldn't acquire any systematic knowledge even after a decade. I had to learn how to program again after I began to work as a programmer. IMO, acquiring snippets of knowledge from various websites is almost the same as I did in 80's. ",
            "date": "Answered February 24, 2015",
            "views": "15",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Watson",
                    "user_href": "/profile/Richard-Watson-16"
                },
                {
                    "user_id": "Hua Suxian",
                    "user_href": "/profile/Hua-Suxian"
                },
                {
                    "user_id": "Egal Doyows",
                    "user_href": "/profile/Egal-Doyows"
                }
            ]
        },
        {
            "author_info": {
                "name": "João Henrique Viana Oliveira",
                "href": "/profile/João-Henrique-Viana-Oliveira"
            },
            "answer_text": "Of course yes. I still have almost 4 years of high school, and I’m on my way on creating enterprise applications. I’ve learned everything from reading internet tutorials (the vast majority of videos I’ve found are crap, and the good ones, where the guy actually teaches something and isn’t an indian* in a crowded bus recording with a potato, are too slow) and creating programs, and so can you. Of course being in a class will have the benefice of a degree, what will make companies think more on hiring you then they would think of me. I say that I can do some task, but I have no more than applications that can be copied from someone to prove that. You, on the other hand, will have a solid proof that you can do this task. *I have no problem with indians, except for that the english they speak is unintelligible for me, considering that I’m not a native english speaker. ",
            "date": "Answered March 17, 2019",
            "views": "674",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gaurav Shetty",
                "href": "/profile/Gaurav-Shetty-17"
            },
            "answer_text": "The best part about programming is that you don't need a school to learn it or a degree to practice it. The best resources to learn a particular language basics and basic implementation are Youtube tutorial videos.  thenewboston is my favourite Youtube channel. All basics are covered with interactive practical examples of various concepts. Also, Bucky Roberts, the presenter, is a fun narrator. Codecademy is another amazing free source to learn basics of programming. You can implement snippets of code on their console itself without downloading a separate IDE for the same.  Once you have mastered the basics, then it is time to execute a small personal project of your own. It could be anything which could help you in day-to-day life. Build your own structure, try to code your own code. For the rest, you have StackOverflow. It is the best resource for any coder, whether a master or a rookie. You Google well for any particular piece of code, for an error you're trying to debug. Almost all of your hurdles were faced by someone else and have been solved too. ",
            "date": "Answered March 10, 2016",
            "views": "265",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ron Tal",
                "href": "/profile/Ron-Tal"
            },
            "answer_text": "Yes. And you should. Nobody really learns programming by going to class. The only way to learn programming is by crunching out code and solving problems (whether they are toy problems such as in-place reversal of a linked list in C++, or real problems that you envision). What you get by going to class is hopefully, access to a good teacher who will introduce you to the abstract concepts, as well as guide you through learning how to reason about complex problems that programmers need to be good at solving. Much of it can be self taught, of course, and a class taught by a bad teacher would often require you to study everything on your own. The risk of being a self taught programmer is that you were never exposed yourself to the abstract reasoning, mathematical thinking aspects of computing. Can you teach yourself algorithms? Yes :) Do you have the patience and self discipline to do all of that on your own? Therein lies the challenge. ",
            "date": "Answered June 3, 2015",
            "views": "11",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Balajee",
                "href": "/profile/Balajee-8"
            },
            "answer_text": "The best way to learn programming is by programming. This is the only way you will learn programming. Practice, Practice and Practice. Writing a program is easy. But the most difficult part is debugging.      Most people who start doing programming leave programming because lack of debugging skill. While doing programming the programmer need to learn debugging also. This will help the programming to master programming and do programming consistently.       If you are really serious about programming and if you need a help for an industry person to start then I can help you. ",
            "date": "Answered June 13, 2015",
            "views": "81",
            "upvotes": " View 36 Upvoters",
            "upvoters": [
                {
                    "user_id": "Indrajit Talukdar",
                    "user_href": "/profile/Indrajit-Talukdar-1"
                },
                {
                    "user_id": "KH Gaming",
                    "user_href": "/profile/KH-Gaming-6"
                },
                {
                    "user_id": "Lucky Luke",
                    "user_href": "/profile/Lucky-Luke-142"
                },
                {
                    "user_id": "Aman Kumar",
                    "user_href": "/profile/Aman-Kumar-4224"
                },
                {
                    "user_id": "SUBHRAJYOTI HAZRA",
                    "user_href": "/profile/SUBHRAJYOTI-HAZRA-1"
                },
                {
                    "user_id": "Geslie Claude",
                    "user_href": "/profile/Geslie-Claude"
                },
                {
                    "user_id": "Tridib Dowarah",
                    "user_href": "/profile/Tridib-Dowarah-3"
                },
                {
                    "user_id": "Adnan Howlader",
                    "user_href": "/profile/Adnan-Howlader-1"
                },
                {
                    "user_id": "Ali Ebrahimi",
                    "user_href": "/profile/Ali-Ebrahimi-25"
                },
                {
                    "user_id": "Krithika Kartik",
                    "user_href": "/profile/Krithika-Kartik"
                },
                {
                    "user_id": "Sambhu R",
                    "user_href": "/profile/Sambhu-R"
                },
                {
                    "user_id": "Seshadri Kesavan",
                    "user_href": "/profile/Seshadri-Kesavan"
                },
                {
                    "user_id": "Khalifa Tahir",
                    "user_href": "/profile/Khalifa-Tahir"
                },
                {
                    "user_id": "Vishal Pant",
                    "user_href": "/profile/Vishal-Pant-3"
                },
                {
                    "user_id": "Gurpreet Grewal",
                    "user_href": "/profile/Gurpreet-Grewal-8"
                },
                {
                    "user_id": "Pawan Yadav",
                    "user_href": "/profile/Pawan-Yadav-81"
                },
                {
                    "user_id": "Sunil Vathar",
                    "user_href": "/profile/Sunil-Vathar"
                },
                {
                    "user_id": "Ponni Ponni",
                    "user_href": "/profile/Ponni-Ponni-1"
                },
                {
                    "user_id": "Anjali Mahesh",
                    "user_href": "/profile/Anjali-Mahesh"
                },
                {
                    "user_id": "Gayathri Ganesan",
                    "user_href": "/profile/Gayathri-Ganesan-16"
                },
                {
                    "user_id": "Vaibhav Swami",
                    "user_href": "/profile/Vaibhav-Swami-2"
                },
                {
                    "user_id": "Bhagat Negi",
                    "user_href": "/profile/Bhagat-Negi"
                },
                {
                    "user_id": "Malvika Bhardwaj",
                    "user_href": "/profile/Malvika-Bhardwaj-3"
                },
                {
                    "user_id": "Abinaya Abinaya",
                    "user_href": "/profile/Abinaya-Abinaya-7"
                },
                {
                    "user_id": "Cherry Naresh",
                    "user_href": "/profile/Cherry-Naresh"
                },
                {
                    "user_id": "Syam Pradeep Reddy",
                    "user_href": "/profile/Syam-Pradeep-Reddy"
                },
                {
                    "user_id": "Ajinkya Jumbad",
                    "user_href": "/profile/Ajinkya-Jumbad"
                },
                {
                    "user_id": "Hemanth Kumar",
                    "user_href": "/profile/Hemanth-Kumar-317"
                },
                {
                    "user_id": "Shubham Saroha",
                    "user_href": "/profile/Shubham-Saroha-3"
                },
                {
                    "user_id": "Nithya Jeevanantham",
                    "user_href": "/profile/Nithya-Jeevanantham-1"
                },
                {
                    "user_id": "Kavya Puranik",
                    "user_href": "/profile/Kavya-Puranik"
                },
                {
                    "user_id": "Harkirat Singh",
                    "user_href": "/profile/Harkirat-Singh-20"
                },
                {
                    "user_id": "Sandeep Mishra",
                    "user_href": "/profile/Sandeep-Mishra-13"
                },
                {
                    "user_id": "Pankaj Barnwal",
                    "user_href": "/profile/Pankaj-Barnwal"
                },
                {
                    "user_id": "Ashish Gupta",
                    "user_href": "/profile/Ashish-Gupta-1432"
                },
                {
                    "user_id": "Vivek Panchal",
                    "user_href": "/profile/Vivek-Panchal-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Graffeo",
                "href": "/profile/Charles-Graffeo"
            },
            "answer_text": "Yes just look at all the tutorials online. Honestly I never really could pay attention in class. I always went home and learned it on my own then went back to the professor to talk about issues I was having. I’ve been programming professionally and have developed many applications for companies that made millions off my work. So don’t sweat going to class for it. I’ve met a few programmers who don’t have degrees that are a lot better than programmers who have degrees. The only thing I’ll say is a degree might get you into the door faster. Honestly you could always say you have a degree companies never check lol ",
            "date": "Answered July 19, 2019",
            "views": "188",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adam Staples",
                "href": "/profile/Adam-Staples-3"
            },
            "answer_text": "You can get pretty far on your own, however sooner or later you will need someone else to help you advance.  This could be a college course, a course paid for by your company to help you advance to a new position, or just a friend/mentor who is willing to help you get farther.   The internet is good at getting you started, and real-world developers and professors are good at giving you the advanced knowledge that you need to make a career out of programming.  Especially when it comes to learning the algorithms and design patterns that will help you make clean, solid programs that are easy to maintain. Here are some great places to get you started:Learn to code (Codecademy courses in python, javascript and web dev)Computer programming (Khan Academy programming course)CodeAvengers (CodeAvengers web programming courses) ",
            "date": "Answered March 6, 2015",
            "views": "487",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harry Parker",
                "href": "/profile/Harry-Parker"
            },
            "answer_text": "“The best things in life are free,” so the saying goes. That is mostly true for programming, at least. However, what’s best for me is not best for you, as we are at different places in our lives and aiming for different things. Many books can be had for free at your library. Also, many older edition books are available for free online. Take a look at the Quora questions related to your question. I particularly like many of the answers to, What's the best book and language to learn computer programming? I particularly like Brian Yoder ‘s answer. When trying to choose between which of the many free books you’ve found to study, my suggestion is to go to Amazon -- not to buy from them, but to read the book reviews. Online tutorials and references are also free, and “Google is your friend.” (Just skip over the ads.) However, often learning on your own can be frustrating. You may get stuck and need some live feedback on how you’re doing. For that you need programming friends. If you don’t know any, search for a computer club in your area. ",
            "date": "Answered December 31, 2018",
            "views": "13",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Brian Yoder",
                    "user_href": "/profile/Brian-Yoder"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kristine Bredemeier",
                "href": "/profile/Kristine-Bredemeier"
            },
            "answer_text": "Build. I’m glad you are not interesed in taking classes, because I don’t think that is best way to learn how to program. Building and working on projects is the best way to learn how to program. I just started learning how to program about a year ago, and attended Holberton School in SF. We are a project based school, and I’ve found that building projects is a super effective way to learn how to code. You have to work in multiple layers of the stack, and you end up with something to add to your portfolio. ",
            "date": "Answered October 14, 2016",
            "views": "165",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bernhard Støcker",
                "href": "/profile/Bernhard-Støcker"
            },
            "answer_text": "Yes, you can. The internet is your friend. Choose a language and visit it's webside. You will find usually a getting started tutorial and installation guides to setup your computer.  Usually a follow up question is which programming language. You may have already some ideas what you want to code. Choose a language fitting to these tasks. Always keep in mind: Programming languages are tools. Don't use a saw when you want to put a nail into wood.  If you just want to learn how, choose the language you want. ",
            "date": "Answered February 24, 2015",
            "views": "547",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alex Kashko",
                "href": "/profile/Alex-Kashko"
            },
            "answer_text": "Yes. Start with an online beginners tutorial for a simple language like python ( others may have views on the simplest language going) Then go to Project Euler and start working through the problems. After that pick a project and see it through. BY then you know about coding so start looking at things like algorithms, clean code, principles not techniques ",
            "date": "Answered March 17, 2019",
            "views": "89",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rohit Kumar",
                "href": "/profile/Rohit-Kumar-7604"
            },
            "answer_text": "Yes it is definitely possible if you are determined enough. In this world of internet who needs a tutor to reach programming. One can only help you with some tips and tricks but you will have to use your own understanding to answer a programming question. There are several online portals and websites that help you to learn different topics and you can analyse your progress with online tests on websites like Hackerrank, Soon etc ",
            "date": "Answered January 18, 2018",
            "views": "624",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sagar Devkota",
                "href": "/profile/Sagar-Devkota-5"
            },
            "answer_text": "Yes, you could learn programming by yourself. There are hundreds of free resources available online. Courses available online are categorized as “for absolute beginner with no programming background” and “For beginners” you could choose as you are. Learning Programming is all about the time invested in learning and practicing. Keep Learning, Never give up, and Always be regular. Practicing more is the most. ",
            "date": "Answered January 18, 2018",
            "views": "17",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yubraj Tamang",
                    "user_href": "/profile/Yubraj-Tamang-3"
                },
                {
                    "user_id": "Innocent Somtoo",
                    "user_href": "/profile/Innocent-Somtoo"
                },
                {
                    "user_id": "Barth David",
                    "user_href": "/profile/Barth-David-2"
                },
                {
                    "user_id": "Saroj Bhattarai",
                    "user_href": "/profile/Saroj-Bhattarai-27"
                },
                {
                    "user_id": "Chris Prakoso",
                    "user_href": "/profile/Chris-Prakoso"
                }
            ]
        },
        {
            "author_info": {
                "name": "Khethan Reddy",
                "href": "/profile/Khethan-Reddy"
            },
            "answer_text": "Yes . U can refer standard textbooks and install the respective software in your PC/laptop, practice side by side .If you have any doubts on topics refer to YouTube or wiki. Tutorials point is offering free videos. Edx is a free course Code academy is an effective practice ground . ",
            "date": "Answered June 14, 2018",
            "views": "162",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anagha Bhagat",
                    "user_href": "/profile/Anagha-Bhagat"
                },
                {
                    "user_id": "Piyush Mathur",
                    "user_href": "/profile/Piyush-Mathur-17"
                },
                {
                    "user_id": "Buddha Nag",
                    "user_href": "/profile/Buddha-Nag"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jawadhassan Soomro",
                "href": "/profile/Jawadhassan-Soomro"
            },
            "answer_text": "Yes, So many people have learned programming without attending any institution ever. But remember don’t isolate yourself from everyone but join some online community, user group. Last but not the least have some mentor. Keeping yourself on right track is one of the biggest challenge of self learning. ",
            "date": "Answered January 19, 2018",
            "views": "464",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ankit Yadav",
                    "user_href": "/profile/Ankit-Yadav-1427"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pubali Bhaduri",
                "href": "/profile/Pubali-Bhaduri"
            },
            "answer_text": "Yes, very much POSSIBLE.IT is actually better if you do it of your own. Please follow my post on the same topic,i have tried to help as much possible. Pubali Bhaduri's answer to How should you start learning programming? ",
            "date": "Answered January 24, 2018",
            "views": "13",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saikat Mukherjee",
                    "user_href": "/profile/Saikat-Mukherjee-21"
                },
                {
                    "user_id": "Eye-K Amaechi",
                    "user_href": "/profile/Eye-K-Amaechi"
                },
                {
                    "user_id": "Abhishek Roy",
                    "user_href": "/profile/Abhishek-Roy-104"
                },
                {
                    "user_id": "Mary Krupka",
                    "user_href": "/profile/Mary-Krupka"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miles Fidelman",
                "href": "/profile/Miles-Fidelman"
            },
            "answer_text": "Start with something you know - be it finance, music, writing, auto mechanics, whatever. Learn the software tools common in your field - spreadsheets, Matlab, R, audio editors, word processors, content management systems, auto diagnostic systems, … If they’re open source, or you can find popular open source equivalents, study the code (look for architecture presentations on Slideshare, read the developer’s documentation). Learn to extend the tools - write Excel macros in vBasic, learn to write SQL and suck in data from databases, build a blog with Wordpress then write a new theme and a plug-in, etc. Contribute to the open source effort. Learn the language(s) used in the tool(s) in the process. (And buy the books written by the folks who developed those tools.) Then start learning how to write new code from scratch in the same language - study good practices (tools, structure, build chains & packaging, testing, documentation). Wash, rinse, repeat with a language that uses a different programming paradigm. Somewhere along the way, take a few introductory courses on EdX. ",
            "date": "Answered October 4, 2016",
            "views": "987",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Muflah Ul Furqan",
                    "user_href": "/profile/Muflah-Ul-Furqan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akash Jain",
                "href": "/profile/Akash-Jain-78"
            },
            "answer_text": "The best way to learn programming without taking classes is to learn it from various books. Start from basic understanding of data structures and go slowly to dynamic programming.  The more you code, more you understand. More you understand , more you remember.  Programming is an art and to be perfect at it, you must devote your self. Do a  lot code and debug, get your code reviewed. Debug debug and debug. ",
            "date": "Answered June 19, 2015",
            "views": "513",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Seshadri Kesavan",
                    "user_href": "/profile/Seshadri-Kesavan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robbert Vermeulen",
                "href": "/profile/Robbert-Vermeulen-1"
            },
            "answer_text": "Yes for sure, I learned all my programming skills (PHP, Javascript, Solidity) via the web and books. There a tons of Youtube channels (like the for example thenewboston) with free tutorials that explain everything step by step. The best way to lean in my opinion is following tutorials, to learn the basics, then start a project to apply it, then use websites like Stackoverflow to ask for help. ",
            "date": "Answered January 18, 2018",
            "views": "481",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tim Vermeulen",
                    "user_href": "/profile/Tim-Vermeulen-13"
                },
                {
                    "user_id": "Jessy Bélair",
                    "user_href": "/profile/Jessy-Bélair"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rishikesh Desai",
                "href": "/profile/Rishikesh-Desai-3"
            },
            "answer_text": "I’ve answered a question similar to this a while ago and I remember recommending SoloLearn. I’ll quote my answer below so you can read through it. “Okay, for me, the by far EASIEST method to learning basic or expert coding languages would be an app called SoloLearn. It’s available on the Google Play store and on the App Store. It is the best method to easily adopt any language. It has a bunch of different choices and has a simple way to learn them slowly. Also, on your profile page on the app, it shows your proficiency in each language and a bunch of other stats! Coming from someone who (eventually) wants to go and get a job at Google, this is a great step to learn coding languages in my opinion! Good luck and have fun on your journey!” Hope this helps, let me know if you learn anything or need anything else ;) ",
            "date": "Answered December 31, 2018",
            "views": "1",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohmad Yakub",
                "href": "/profile/Mohmad-Yakub"
            },
            "answer_text": "Please check the following post which describes a non-boring way to learn/improve coding skills. https://www.quora.com/How-do-I-make-my-coding-better/answer/Healthy-Panda Learn important tactics/approach for programming and you can become a confident programmer ",
            "date": "Answered July 6, 2019",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Silvi Jose",
                "href": "/profile/Silvi-Jose-2"
            },
            "answer_text": "Learning ‘everything’ about any subject is virtually impossible, as the subject continues to develop over time. If you want to get started, there are many resources available such as Udemy, Coursera, Khan Academy etc. If you need more, you can check online. ",
            "date": "Answered June 26, 2020",
            "views": "47",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashish Chacko",
                    "user_href": "/profile/Ashish-Chacko-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhilhanan Jeyaram",
                "href": "/profile/Bhilhanan-Jeyaram"
            },
            "answer_text": "Yes. But stay away from Object Oriented Programming. You can't do that without class ",
            "date": "Answered February 24, 2015",
            "views": "223",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vijay Singhh",
                    "user_href": "/profile/Vijay-Singhh"
                },
                {
                    "user_id": "Akshay Anand",
                    "user_href": "/profile/Akshay-Anand-10"
                },
                {
                    "user_id": "Alexander Tchitchigin",
                    "user_href": "/profile/Alexander-Tchitchigin"
                },
                {
                    "user_id": "Marisa Kirisame",
                    "user_href": "/profile/Marisa-Kirisame-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Max Chee",
                "href": "/profile/Max-Chee-1"
            },
            "answer_text": "Learn to code - Code Academy, the best place to start IMO Learn to Code by Doing - Code School - Same, basic Learn - Same, basic Hour of Code https://www.khanacademy.org - some more advance programming is available here Stack Overflow  - In the end, you should end up here.   ",
            "date": "Answered March 10, 2016",
            "views": "161",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aaron Shbeeb",
                    "user_href": "/profile/Aaron-Shbeeb"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenana Reda",
                "href": "/profile/Kenana-Reda"
            },
            "answer_text": "well, you can follow some youtube channels or enroll in Udemy courses and train with every course example and do the assignments, after you learn programming principles, you can select which programming you would like to learn. ",
            "date": "Answered August 5, 2018",
            "views": "118",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arek Areknawo",
                "href": "/profile/Arek-Areknawo"
            },
            "answer_text": "Naturally the answer is just to practice as much as you can. This not only apply to learning programming fundamentals but also for coming programmer career. For resources, it depends on programming language and later on aspect of programming that you're interested in e.g. AI, games, websites etc. There's great number of free and paid learning materials online. I myself learned how to code, just as the question implies, from mostly-free resources. The most recommended websites IMHO for my ( Javascript ) and other programming languages are Learn to code - for free | Codecademy and SoloLearn: Learn to Code. If you like more advanced text tutorials, TutorialsPoint - Parallax Scrolling, Java Cryptography, YAML, Python Data Science, Java i18n, GitLab, TestRail, VersionOne, DBUtils, Common CLI, Seaborn, Ansible, LOLCODE, Current Affairs 2018, Apache Commons Collections is your way to go even for some advanced stuff. Then, for specific issues, StackOverflow - Stack Overflow - Where Developers Learn, Share, & Build Careers might be useful. If you would change your mind later and decide to invest a tiny amount for this particular purpose, I would recommend my old friend whom I can thanks for me knowing how to code today, books series - “Head First!”. ",
            "date": "Answered December 31, 2018",
            "views": "194",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Benjamin Lassmann",
                "href": "/profile/Benjamin-Lassmann"
            },
            "answer_text": "Step 1: Get Visual Studio and start learning C# while making your first Windows programs easily. Step 2: Get Unity3D and use your C# to script cool games. There are many tutorials about these things. Google, google and more google! ",
            "date": "Answered July 9, 2019",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Doshi",
                "href": "/profile/Jay-Doshi-13"
            },
            "answer_text": "Definitely one can learn coding without a class with the help of the right source or material for it .There are several books for C++ by Robert lafore , Sumita Arora etc or many websites that can help you make your learning journey much more easy .You can try websites like www.codersmaze.com , tutorials point or YouTube videos .Hope this helps ! ",
            "date": "Answered February 24, 2015",
            "views": "455",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Egal Doyows",
                    "user_href": "/profile/Egal-Doyows"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Tchitchigin",
                "href": "/profile/Alexander-Tchitchigin"
            },
            "answer_text": "I'm sure you can.I've learnt programming via reading books and writing programs. Even without Internet. I had to learn how things work inside out.But now I'd recommend to start from courses on Udacity or Coursera. ",
            "date": "Answered June 3, 2015",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marisa Kirisame",
                "href": "/profile/Marisa-Kirisame-3"
            },
            "answer_text": "No. Every programmer, even the first programmer in the world, is taught by someone else, so apparently you can't. ",
            "date": "Answered February 24, 2015",
            "views": "66",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Patchouli-Knowledge-3"
                },
                {
                    "user_id": "Yi Lu",
                    "user_href": "/profile/Yi-Lu-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shelly Kaur",
                "href": "/profile/Shelly-Kaur-6"
            },
            "answer_text": "If you are beginner then you should start from BASIC C Language and recommended book for that is “LET US C” or you can follow this tutorial: C Tutorial. If you have already know the basics then you can start by downloading any of your choice language environment and then by following the tutorials, You can easily learn that. Javatpoint is also a great source for this, It has tutorial for almost every topic. Tutorials - Javatpoint ",
            "date": "Answered June 15, 2018",
            "views": "145",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paula T. Curry",
                "href": "/profile/Paula-T-Curry"
            },
            "answer_text": "If you can’t attend proper classes, then the best and the only way to learn programming is to read books or online tutorials and PRACTICE whatever you learn. Write the program for each and every concept you learn. ",
            "date": "Answered October 3, 2016",
            "views": "349",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marius Filip",
                "href": "/profile/Marius-Filip-1"
            },
            "answer_text": "By choosing a good book and/or tutorial and by following it. Then by using the language as much as possible: to go programming challenges or mini-projects. ",
            "date": "Answered July 6, 2019",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ayush Satecsh",
                "href": "/profile/Ayush-Satecsh"
            },
            "answer_text": "You dont need to learn programing at school. You can learn programing from many sites like Udemy, Udacity, Coursera and Youtube. Learning at school is also good as you can ask your doubts at the spot. ",
            "date": "Answered June 26, 2020",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kubo Horos",
                "href": "/profile/Kubo-Horos"
            },
            "answer_text": "There are multiple ways. For example, some companies are offering a free apps which you can download and where you can learn some basics or even more advanced programming skills. ",
            "date": "Answered June 26, 2020",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dmitri Kozlov",
                "href": "/profile/Dmitri-Kozlov-2"
            },
            "answer_text": "writing lots of own code, running code examples, going through online tutorials, reading lots of books, and asking questions on quora. ",
            "date": "Answered May 7, 2019",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohak Talwar",
                "href": "/profile/Mohak-Talwar"
            },
            "answer_text": "Well i would suggest you to read Mohak Talwar's answer to What are some of the best ways to learn programming? . I have written almost everything you need to know I hope it helps you ",
            "date": "Answered June 18, 2015",
            "views": "184",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shuvro Sarkar",
                "href": "/profile/Shuvro-Sarkar-12"
            },
            "answer_text": "You can learn all about programming from online platform. Like:  Online Courses - Learn Anything, On Your Schedule | UdemyUdemy is an online learning and teaching marketplace with over 100,000 courses and 24 million students. Learn programming, marketing, data science and more.http://udemy.com ",
            "date": "Answered June 26, 2020",
            "views": "403",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Bauers",
                "href": "/profile/Michael-Bauers"
            },
            "answer_text": " OR BeginnersGuide - Python Wiki ",
            "date": "Answered July 6, 2019",
            "views": "7",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Atul Mishra",
                "href": "/profile/Atul-Mishra-67"
            },
            "answer_text": "Internet really helps.video tutorials from youtube by expert provides you with good knowledge. ",
            "date": "Answered June 19, 2015",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Al Klein",
                "href": "/profile/Al-Klein"
            },
            "answer_text": "CS courses would work. See https://www.edx.org/course/introduction-computer-science-harvardx-cs50x or https://teachyourselfcs.com/ for examples.. ",
            "date": "Answered December 31, 2018",
            "views": "154",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rajeet John",
                "href": "/profile/Rajeet-John"
            },
            "answer_text": "read a book ",
            "date": "Answered July 11, 2019",
            "views": "8",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Asefa Getu",
                "href": "/profile/Asefa-Getu-1"
            },
            "answer_text": "Yes i can ",
            "date": "Answered May 24, 2020",
            "views": "139",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prerna Sharma",
                "href": "/profile/Prerna-Sharma-404"
            },
            "answer_text": "Yes definitely ",
            "date": "Answered January 18, 2018",
            "views": "557",
            "upvotes": "0"
        }
    ]
}