{
    "title": "Can Google Classroom replace traditional classrooms? - Quora",
    "tags": [
        "Google Classroom",
        "Classrooms",
        "Educational Technology",
        "Google",
        "E-learning",
        "Teaching",
        "Schools",
        "Google (company)",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin Lorenz Montojo",
                "href": "/profile/Martin-Lorenz-Montojo-1"
            },
            "answer_text": "Online cannot replace face-to-face sessions in the skill-based learning areas (Music, Art, PE, Agri-Fisheries, Home Economics, Entrepreneurship, Industrial Arts), however with content-based learning areas (Values Education, English, Foreign Language, Math, Science, History) it can but requires a different set of skills for teacher and not all countries can do it. It requires a different set of skills for teachers because it requires us to think more creatively. You can compare it this way, we compare it to an NBA player with tons of achievements like maybe Lebron James (I don’t know if he’s good, I’m not an NBA fan), even if he excels in the Basketball Court, you cannot just assume that he will easily beat you in NBA 2k19, because he needs a different set of skills to be just as good in a virtual world. Just like teachers, teaching online requires different set of skills, requires a lot more creativity, etc. It is also not doable in all countries because in some countries most learners don’t have a computer, much less an access to an internet connection ",
            "date": "Answered March 24, 2020",
            "views": "87",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ajay Dahiya",
                    "user_href": "/profile/Ajay-Dahiya-66"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shailesh Kumar Singh",
                "href": "/profile/Shailesh-Kumar-Singh-151"
            },
            "answer_text": "Yes, incoming future if corona problem will not go away then definitely google classroom will replace traditional classrooms. Google Classroom provides the same feeling that you are in the classroom teaching, giving classwork or homework, checking and giving feedback to students work. Problem with google classroom is that you cant do face to face teaching, for this you can use meet, skype or Zoom. Using both apps you can have your virtual classroom anywhere and you can teach any number of students. Even in normal days, it's also very useful, suppose you are absent from your school and want to send some teaching material to your students so that other substitute teachers can easily manage your class and make your class time more productive. Just post that day work on google classroom and inform substitute teacher regarding this. This way students will be engaged in your class even you are not in the class. ",
            "date": "Answered May 14, 2020",
            "views": "49",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ajay Dahiya",
                    "user_href": "/profile/Ajay-Dahiya-66"
                }
            ]
        },
        {
            "author_info": {
                "name": "Santus Andor",
                "href": "/profile/Santus-Andor"
            },
            "answer_text": "As for now, looking at the capabilities and on the other hand the limitations of google classroom, I am not sure if it can for now. But in the future, I will say maybe. Google class room is capable of the following:: • Files sharing • Announcements • Create assignments • Grade assignments • Allow for interaction in a paperless manner. Limitations of Google Classroom • Difficult account management. Google Classroom doesn't allow access from multiple domains. ... • limited integration options. ... • No automated updates. ... • Difficult learner sharing. ... • Editing problems. ... • No automated quizzes and tests. ... • Impersonal. • The last time I checked, assignments don’t show up in students’ Google calendars. Etc. All these may need to be fixed before we start talking about replacing my opinion. [1] • Footnotes[1] How to Use Google Classroom 2020 - Tutorial for Beginners -",
            "date": "Answered May 25, 2020",
            "views": "75",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ajay Dahiya",
                    "user_href": "/profile/Ajay-Dahiya-66"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arun Soni",
                "href": "/profile/Arun-Soni-76"
            },
            "answer_text": "No,I have been in various Google Classroom groups. With help of this tool we can only share contents of class,materials related to it. Yeah but it helps to gain information about a particular topic. It can go hand in hand with teaching in traditional classrooms. ",
            "date": "Answered April 22, 2020",
            "views": "30",
            "upvotes": " Answer requested by Ajay Dahiya",
            "upvoters": [
                {
                    "user_id": "Parul Arora",
                    "user_href": "/profile/Parul-Arora-81"
                },
                {
                    "user_id": "Neetu Singh",
                    "user_href": "/profile/Neetu-Singh-1902"
                },
                {
                    "user_id": "Vibha",
                    "user_href": "/profile/Vibha-110"
                },
                {
                    "user_id": "Ajay Dahiya",
                    "user_href": "/profile/Ajay-Dahiya-66"
                }
            ]
        },
        {
            "author_info": {
                "name": "Niharika",
                "href": "/profile/Niharika-339"
            },
            "answer_text": "No, google classrooms can not replace traditional classrooms. Active learning and participation are huge benefits of traditional education. During class, students can participate in real-time with teachers and classmates. This creates additional learning opportunities beyond the course content. Students can ask questions and get clarification on things they are uncertain of. Thanks ",
            "date": "Answered May 30, 2020",
            "views": "56",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yuliana Kladova",
                    "user_href": "/profile/Yuliana-Kladova"
                }
            ]
        },
        {
            "author_info": {
                "name": "S.Z Qurashi",
                "href": "/profile/S-Z-Qurashi"
            },
            "answer_text": "It is very good teaching tool .I also used with tremendous result. It is one of the best product of Google. It is user friendly as well but the traditional classroom have their own precious value which Google classroom cant replace. ",
            "date": "Answered April 26, 2020",
            "views": "27",
            "upvotes": " Answer requested by Ajay Dahiya"
        },
        {
            "author_info": {
                "name": "Hillary Sibille",
                "href": "/profile/Hillary-Sibille"
            },
            "answer_text": "Google Classroom is a place for announcements, assignments, student work turned in, a sort of chat feature, and a gradebook for teachers. There is nothing there that replicates class discussion, student interaction, and teaching lessons. Not at all the same thing. ",
            "date": "Answered April 21, 2020",
            "views": "66",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Tejus Bisht",
                "href": "/profile/Tejus-Bisht-1"
            },
            "answer_text": "No it can only help. ",
            "date": "Answered May 14, 2020",
            "views": "18",
            "upvotes": " Answer requested by Ajay Dahiya"
        },
        {
            "author_info": {
                "name": "Paramita Banerjee",
                "href": "/profile/Paramita-Banerjee-66"
            },
            "answer_text": "Both are different platforms and methods. So observe it differently. It's a new experience. Enjoy ",
            "date": "Answered April 18, 2020",
            "views": "15",
            "upvotes": " Answer requested by Ajay Dahiya"
        },
        {
            "author_info": {
                "name": "Douglas R Stocks Jr",
                "href": "/profile/Douglas-R-Stocks-Jr"
            },
            "answer_text": "No. ",
            "date": "Answered March 24, 2020",
            "views": "47",
            "upvotes": "0"
        }
    ]
}