{
    "title": "Can my son join the USMC Reserve while doing 4 years of college, and then become an active duty officer? - Quora",
    "tags": [
        "U.S. Marine Corps",
        "U.S. Army",
        "United States Armed Forces",
        "Military"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rik Andino",
                "href": "/profile/Rik-Andino"
            },
            "answer_text": "A2AYes, but there are many conditions, and as usual life doesn't always pan out like we plan. First of all, you son can most definitely join the USMC Reserve and continue his studies in college. As long as he is able to attend his unit's drill weekends, and is able to do the 2 weeks-a-year of required drill, he should be fine. If his unit is ever activated for a deployment he may have to postpone his studies for several months, but he can always resume college after he returns. As long as your son is able to cope with the distractions of being a College Student (especially a successful one) and Reserve Military Service Member (again a successful one), there shouldn't be any issues. Now once your son graduates and receives his diploma he may eligible to apply to become a USMC Officer. It is quite common for Enlisted Marines to get degrees and some of them to apply for a position as a Commissioned Officer. However the caveat is that a position is never guaranteed. You must first ask for permission from your reserve unit, remember he signed a contract with them for 6 years, they may be disinclined to acquiesce to his request to be relieved of his obligations to pursue a commission. (In simple English; they may say no to cutting him loose to become an officer). If they say no, he'll have to wait to finish his contract before he can apply to OCS. If you are granted permission to apply for Officer Candidate School, you must be aware that an application is not a guaranteed position. Your son must compete with other Enlisted Marines who are applying for the same positions. Positions are limited so only the best will get selected. There are only 3 OCS Classes every year (Winter, Summer, and Fall) and most of the spots will be filled by civilians candidates and ROTC members. The spots that are allocated to Enlisted-going-to-Officer are few and are only given to the best of the bunch. Your son must be aware that his service record and his academic record will be review against other Marines. This is where being a prior-service applicant can hurt you the most. If you don't have a stellar record with excellent grades, or if you have any discrepancies or even a minor disciplinary record it may cost you the opportunity. Also if you are not at the top of your class as a Marine, meaning you don't have a great rifle score, and excellent fitness score, good fit-reps, personal awards, etc... you may lose out to those who are genuinely better than you. However, knowing all this if you son is able to excel in the USMC Reserves and if he also excels in his studies at college, there should be few obstacles barring him from transitioning from enlisted to officer. However if your son isn't an over-achiever he may be better off joining the ROTC or simply waiting a few year until after he finishes college to apply for Officer Candidate School. I wish your son good luck, there are many paths, should the way that is best for you. ",
            "date": "Answered May 11, 2017",
            "views": "3",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Max Ding",
                    "user_href": "/profile/Max-Ding-7"
                },
                {
                    "user_id": "James Clark",
                    "user_href": "/profile/James-Clark-253"
                },
                {
                    "user_id": "Kyle Wehrenberg",
                    "user_href": "/profile/Kyle-Wehrenberg-1"
                },
                {
                    "user_id": "Gerd Hoffmann",
                    "user_href": "/profile/Gerd-Hoffmann-2"
                },
                {
                    "user_id": "Paul Cortez",
                    "user_href": "/profile/Paul-Cortez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kyle Wehrenberg",
                "href": "/profile/Kyle-Wehrenberg-1"
            },
            "answer_text": "Yes, But the reserves or being a prior (someone who has been enlisted and then turns to the dark side and becomes an officer) is not a sure way to become an officer. In fact the reserves can be a detriment since the “best” way to become an officer is through the PLC program (best is subjective, two 6 week trips to Quantico vs one 10 week) which can cut into your Annual Training which doesn’t endear you to your unit. Additionally you’re not going to learn a lot of skills that benefit you as an officer before you become an NCO and even then those skills leaned as a jr. enlisted are only in a very small area in the broad base of knowledge an officer needs to know. Additionally ROTC candidates will have to attend OCS, the only ones that get out of it are Academy kids and even they are screened lightly at Bulldog. A bigger question is does he want to be a Marine. ",
            "date": "Answered May 11, 2017",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rik Andino",
                    "user_href": "/profile/Rik-Andino"
                },
                {
                    "user_id": "Will Bentley",
                    "user_href": "/profile/Will-Bentley-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Evans",
                "href": "/profile/James-Evans-186"
            },
            "answer_text": "Absolutely. The Marine Corps has a program called PLC (Platoon Leaders Class). Your son can be in college as a Marine Reserve enlisted man, and simultaneously be in the PLC program. The details of PLC used to be that a candidate would do two summers at Marine Corps Base, Quantico, VA (Sophomore, and Junior year summers). Then, after college graduation, the PLC candidate would go through a 6 month officers candidate program, and then receive a commission as a 2ndLt. A candidate’s enlisted reserve time would count as time in service for pay and retirement. You can go on-line and check the details, but I think it’s pretty much the same today as in my day. Semper Fi, Jim ",
            "date": "Answered May 11, 2017",
            "views": "890",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jack Hallows",
                    "user_href": "/profile/Jack-Hallows"
                },
                {
                    "user_id": "Chak Mark",
                    "user_href": "/profile/Chak-Mark"
                },
                {
                    "user_id": "John Arias",
                    "user_href": "/profile/John-Arias-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kye Colby",
                "href": "/profile/Kye-Colby"
            },
            "answer_text": "Yes, that is exactly what I did. The risks have been pointed out in the other answers: possible deployment with reserve unit delaying college; possibly not being allowed to leave the reserve unit (unlikely since the Marine Corps will still retain him, just in another capacity), and possibly not getting selected or approved to attend officer training. He can apply for PLC during college, go to OCS in the summers, then commission when he graduates or go to OCS after graduation, then commission. He will still have to attend monthly reservist duties this whole time (except while at OCS), so it is a bit busy. I am very glad I did it this way, I've learned a lot and have had some great experiences. ",
            "date": "Answered May 13, 2017",
            "views": "574",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alberic Mahawan",
                    "user_href": "/profile/Alberic-Mahawan"
                },
                {
                    "user_id": "Damian M Earl Ll",
                    "user_href": "/profile/Damian-M-Earl-Ll"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Cortez",
                "href": "/profile/Paul-Cortez"
            },
            "answer_text": "Yes. But what would be even better would be for him to join college ROTC (Reserve Officer’s Training Corps) on their scholarship program. That way the military pays for his education in exchange for 6 years of active duty as an officer. He will technically be part of the Reserves as an ROTC cadet, and will not have to go through both enlisted boot camp and Officer Candidates School (unless he is some sort of masochist and wants to go through both). ",
            "date": "Answered May 11, 2017",
            "views": "650",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rik Andino",
                    "user_href": "/profile/Rik-Andino"
                },
                {
                    "user_id": "Luke Gratkowski",
                    "user_href": "/profile/Luke-Gratkowski"
                },
                {
                    "user_id": "Dhanraj Stutzer",
                    "user_href": "/profile/Dhanraj-Stutzer"
                },
                {
                    "user_id": "Aladeen Wadiya",
                    "user_href": "/profile/Aladeen-Wadiya-1"
                }
            ]
        }
    ]
}