{
    "title": "Can I study organic chemistry of class 12 without studying organic chemistry in class 11? - Quora",
    "tags": [
        "Class 12th in India",
        "Organic Chemistry",
        "Studying",
        "Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lucky Upadhayay",
                "href": "/profile/Lucky-Upadhayay-9"
            },
            "answer_text": "Yes, but it will be difficult. However, if you are studying only for the CBSE board, congratulations. Class 12th organic is more than enough in itself for CBSE Board exams. Here's what you need to do: Don't skip a single line from NCERT. You have memorize every logic and basically everything.Make sure you have good muscle memory of writing equations. Will give to confidence.Refer to a good book like U Like or Previous years' examination papers to check your progress.However, it goes without saying that if you're going for JEE/NEET, then you're in real trouble. All the best! Thanks for reading :) ",
            "date": "Answered October 30, 2020",
            "views": "330",
            "upvotes": " View Sharers ",
            "upvoters": [
                {
                    "user_id": "Ritambhar Mohanty",
                    "user_href": "/profile/Ritambhar-Mohanty"
                },
                {
                    "user_id": "Archisman Das",
                    "user_href": "/profile/Archisman-Das-25"
                },
                {
                    "user_id": "Debayan Giri",
                    "user_href": "/profile/Debayan-Giri-1"
                },
                {
                    "user_id": "Ashis Giri",
                    "user_href": "/profile/Ashis-Giri-4"
                },
                {
                    "user_id": "Sambit Sahoo",
                    "user_href": "/profile/Sambit-Sahoo-109"
                }
            ]
        },
        {
            "author_info": {
                "name": "Purna Chandra Sahu",
                "href": "/profile/Purna-Chandra-Sahu-42"
            },
            "answer_text": "I have answered similar questions earlier. These may help you. Links are given below. Purna Chandra Sahu's answer to How should I study organic chemistry for the class 12 boards if I haven't touched it in class 11? Purna Chandra Sahu's answer to I learned IUPAC naming in class 11th but now in 12th, I have forgotten most of it. Do I have to learn it again in order to understand class 12 organics? ",
            "date": "Answered October 28, 2020",
            "views": "18",
            "upvotes": " View 5 Upvoters "
        },
        {
            "author_info": {
                "name": "Aditya Bute",
                "href": "/profile/Aditya-Bute"
            },
            "answer_text": "If you are preparing for competitive exams then you should cover your 11th backlogs before starting organic, but if you are preparing for boards only then you can start however some concepts of 11th will be involved. ALL THE BEST ",
            "date": "Answered October 24, 2020",
            "views": "32",
            "upvotes": " Answer requested by Apoorv Singhal"
        }
    ]
}