{
    "title": "Can an active duty soldier go to college fulltime? - Quora",
    "tags": [
        "Soldiers",
        "Military Personnel",
        "The College and University Experience",
        "Military"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Oakley",
                "href": "/profile/Mark-Oakley-3"
            },
            "answer_text": "It is possible, but not probable. Outside of the programs listed by others here, if you are asking if you can serve in your normal Active Duty capacity and go to school full-time, then the answer is not very likely. Full-time for an undergraduate is considered 12 hours per semester. That would be a pretty heavy course load to carry in your off-duty time. Some do it, but it takes a lot of time management, etc. I have carried 12 hours over the last three semesters for my masters degree while serving full-time. The good part of my school is that each course is 8 weeks long. This has allowed me to take 6 hours per each 8 week session and be full-time as a graduate student. Has it been hectic? Absolutely. That is a lot of work to have on top of a full-time job and a family. Would I do it again? Nope. That was insane and I am sure I could have learned a little more had I concentrated on one course at a time. Will I have my MBA this May. Yup. ",
            "date": "Answered March 7, 2018",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tyler Perry",
                    "user_href": "/profile/Tyler-Perry-266"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chad Peterson",
                "href": "/profile/Chad-Peterson-4"
            },
            "answer_text": "There is something called the college option, which you can try to get during your reenlistment window. I don't know a whole lot about it because my company doesn't like us to get too involved in anything which takes a large amount of focus away from the company mission. For Officers/Warrant Officers, there is a degree completion program. Basically, if you get accepted (via application) for either OCS/WOCS, you can take advantage of the degree completion program which puts you in school as a full-time student in exchange for two years additional military service per year spent as a student (maximum of two years).  I'm personally pursuing this option once I finish my software year. I will be on campus for my junior and senior years of college in exchange for a 4 year extension to my service contract. As I go to an expensive college, this is a good deal for me, but your results may vary. Ask a recruiter in your preferred branch for more details.  ",
            "date": "Answered April 2, 2016",
            "views": "18",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tyler Perry",
                    "user_href": "/profile/Tyler-Perry-266"
                },
                {
                    "user_id": "Guyatridas Kerr",
                    "user_href": "/profile/Guyatridas-Kerr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Benjamin Norwood",
                "href": "/profile/Benjamin-Norwood-1"
            },
            "answer_text": "Yes! Great question!  An active duty soldier has two great options to return to college full time, one is the Green to Gold Option, which results in an enlisted active duty soldier submitting a packet and being selected. They will then become a college student full time, and upon graduation, become a comissioned second lieutenant.  The second option is the IPAP program, or Interservice Physicians Assistants Program. This is a more specific program where a soldier will submit a packet and return to college for the sole purpose of becoming a Physicians Assistant. Upon graduation they will become a comissioned officer within the medical field. Both of these options are fantastic for advancing a career, but will extend a contract determinate to the length of the schooling required. After all, the army needs to get a return on its investment. Since you said Soldier, I assume you mean Army specifically, as the service members of other branches have different names. If you liked this answer, please UPVOTE it and follow me! It motivates me to try harder! Thank you!  ",
            "date": "Answered April 2, 2016",
            "views": "4",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Annika Peacock",
                    "user_href": "/profile/Annika-Peacock"
                },
                {
                    "user_id": "Chris Avila",
                    "user_href": "/profile/Chris-Avila-26"
                },
                {
                    "user_id": "Joel Disla",
                    "user_href": "/profile/Joel-Disla-1"
                },
                {
                    "user_id": "Tina Walker",
                    "user_href": "/profile/Tina-Walker-4"
                },
                {
                    "user_id": "Malakhi Perry",
                    "user_href": "/profile/Malakhi-Perry"
                },
                {
                    "user_id": "Lauren Colpitts",
                    "user_href": "/profile/Lauren-Colpitts-2"
                },
                {
                    "user_id": "Av",
                    "user_href": "/profile/Av-264"
                },
                {
                    "user_id": "Joshua Roberson",
                    "user_href": "/profile/Joshua-Roberson-3"
                },
                {
                    "user_id": "Ilene Torres",
                    "user_href": "/profile/Ilene-Torres"
                },
                {
                    "user_id": "Germán Reyes",
                    "user_href": "/profile/Germán-Reyes"
                },
                {
                    "user_id": "Guyatridas Kerr",
                    "user_href": "/profile/Guyatridas-Kerr"
                },
                {
                    "user_id": "Reeshaan Jaya Naidu",
                    "user_href": "/profile/Reeshaan-Jaya-Naidu"
                },
                {
                    "user_id": "Devin Clary",
                    "user_href": "/profile/Devin-Clary"
                },
                {
                    "user_id": "Taylor Noelle Parrella",
                    "user_href": "/profile/Taylor-Noelle-Parrella"
                },
                {
                    "user_id": "Stanford Rogers",
                    "user_href": "/profile/Stanford-Rogers"
                },
                {
                    "user_id": "Ali Muminoglu",
                    "user_href": "/profile/Ali-Muminoglu"
                },
                {
                    "user_id": "Luke Gratkowski",
                    "user_href": "/profile/Luke-Gratkowski"
                },
                {
                    "user_id": "Sylvester Ogletree",
                    "user_href": "/profile/Sylvester-Ogletree"
                },
                {
                    "user_id": "Jasper Johnson",
                    "user_href": "/profile/Jasper-Johnson-2"
                },
                {
                    "user_id": "Robyn Affentranger",
                    "user_href": "/profile/Robyn-Affentranger"
                },
                {
                    "user_id": "James Knight",
                    "user_href": "/profile/James-Knight-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leigh Cole",
                "href": "/profile/Leigh-Cole-4"
            },
            "answer_text": "My first question back is why are you enlisting? There is a reason of course they call it service. You are there to serve your country and in doing so, you will travel, learn discipline and responsibility. As you progress through the ranks, you will be given additional responsibilities. You will learn things they don’t teach in college. I plainly see the difference in the veteran students in my college as compared to non-veteran students. Usually, they do much better. They are more mature, they take their studies seriously, and they can set goals and make it happen. But who knows? Maybe you will end up in a commissioning program or something, but only time will tell. If you are considering joining, good for you. Go for it. When you separate, retire, or transfer to the reserves, you will have a GI Bill to help you and you will most likely make more of your college time. ",
            "date": "Answered September 20, 2020",
            "views": "80",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Debbi Thornton",
                "href": "/profile/Debbi-Thornton"
            },
            "answer_text": "My husband earned his batchelors and masters while full time active duty. It was not easy and took a lot of discipline and determination. He worked night shift and took esrly morning classes or late evening classes, many times having to split them up. Other timexhe worked dsy shift and took evening courses. Be Prepafed to work hard and miss a lot of social gatherings. Weekends were spent at the library or writing papers and studying. He Went to school full time , had a full time job and a young family. It can be done. He and several others he worked with had the drive and determination to make it work. I am very proud of him. ",
            "date": "Answered September 20, 2020",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Murali Daran",
                "href": "/profile/Murali-Daran-4"
            },
            "answer_text": "Yes. There are lot of programs which help soldiers pursue higher education on full time basis ",
            "date": "Answered April 3, 2016",
            "views": "260",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tyler Perry",
                    "user_href": "/profile/Tyler-Perry-266"
                }
            ]
        }
    ]
}