{
    "title": "Can a Mason 'quit' Masonry? What happens if he does? - Quora",
    "tags": [
        "Masonry",
        "Freemasonry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Axel Hogwood",
                "href": "/profile/Axel-Hogwood"
            },
            "answer_text": "I’ve answered very similar to this question before and will merge if I find the old, but: Yes. The idea that you can never quit is one of the many false myths that go around. NOTE: This answer is generalized. The exact terminology and process may vary slightly from place to place. One can request a 'demit' from his Lodge by writing a simple letter to the Lodge Secretary. Someone with a demit will always still be a Mason and in most jurisdictions maintains a few Masonic rights out of courtesy even if he never re-affiliates himself with a Lodge. A demit is a formal (friendly) cessation of affiliation with a particular Lodge. As long as the requester is in good standing (doesn't have any debts to the Lodge, isn't facing Masonic charges, isn't facing civil/criminal charges), a demit certificate will be given the man stating he is an unaffiliated Mason who was in good standing at the time he ceased his Lodge affiliation. An unaffiliated Mason is STILL a Mason. In most jurisdictions he is allowed to visit Lodges (the number of times he is allowed to visit is usually limited, however). The purpose of this is to allow someone to quit one Lodge and join another. Someone owing debts to the Lodge, facing Masonic or civil/criminal charges would not be granted a demit because they are not in 'good standing' and would not be allowed to take their problems to another Lodge. Rather than request a demit, many just stop paying their dues. Procedures vary by jurisdiction, but in most cases this means they will be suspended for a period of time before being dropped from the rolls. It important to understand that a portion of the dues paid by an individual to his Lodge go to the Grand Lodge as a per-capita tax to support business expenditures etc. The Lodge has to pay Grand Lodge even if the individual didn't pay the Lodge. Again, procedures vary, but one dropped from the rolls for non-payment of dues usually must formally petition a Lodge and pay the back dues owed from prior to his being dropped before he will be allowed to rejoin. Someone who has been dropped from the rolls for non-payment of dues is NOT a Mason and is afforded no Masonic courtesy, rights, or privileges. This is the WRONG way to quit. A third way to quit the fraternity is to request by a letter to the Grand Secretary that your name be removed from the rolls. If you want to COMPLETELY quit Freemasonry for whatever reason, this is the most formal and honorable way to do it. We won't think any less of you as a man (unlike if you failed to pay your dues), but we will understand that for your own reasons, you no longer want to associate yourself as a Mason. We're good with that. It happens. Freemasonry isn't for everybody. We wish you the best in whatever else your life may hold for you. If you wish, or if it is demanded/desired by some entity in your life (government, significant other, religious entity, etc.), you can also formally denounce/renounce your previous membership (including your oaths and obligations) by writing a formal letter/declaration to that effect and having it published as a PUBLIC NOTICE in a suitable public register (such as your local newspaper). This is your choice and for this act alone, we won't fault you. We'll miss you and will be saddened that it came to this, but again, it's your choice. The only time we're going to get upset is if/when you leave us for whatever reason and then choose to slander/libel us. But even then, for most cases, we are charged to let it go. We will not enter into argument with those who may ridicule Freemasonry. An example of a formal request for DEMIT: I, Brother John J. Doe, Master Mason Residing at: 357 Ashlar Road, Bretherton, NK 13579 Send Fraternal Greetings! To the Worshipful Master, Wardens, and Brethren of Antiquity Lodge #1; Under the jurisdiction of the Grand Lodge of Ancient Free and Accepted Masons of South Kackalackee; Meeting at: The Antiquity Masonic Center, 1200 Acacia Drive, Pleasantville, SK 33333 - Whereas: I have moved my residence from the territorial Grand Lodge jurisdiction of South Kackalackee to that of North Kackalackee; and - Whereas: I am a Mason in good-standing, owing no dues or other debts to the Lodge; and - Whereas: I declare, on my honor, I know of no Masonic, civil, or criminal charges or indictments that may be pending against me; and - Understanding: This action will make me an unaffiliated Mason until such time I am accepted a member of a regular Masonic Lodge; and - Understanding: As an unaffiliated Mason, I will enjoy no Masonic rights or privileges except those extended by courtesy. I hereby Request of the Worshipful Master, Wardens and Brethren of Antiquity Lodge #1: a formal demit from the same as well as a Certificate of Good Standing that I may deposit my demit and petition for affiliation with a Lodge of my choosing under the jurisdiction of the Grand Lodge in whose territory I now reside. Sincerely & Fraternally, Bro. John J. Doe ",
            "date": "Answered May 21, 2019",
            "views": "21",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "P. Sidney Parker",
                    "user_href": "/profile/P-Sidney-Parker"
                },
                {
                    "user_id": "Chris A Hills",
                    "user_href": "/profile/Chris-A-Hills"
                },
                {
                    "user_id": "Doug Freyburger",
                    "user_href": "/profile/Doug-Freyburger"
                },
                {
                    "user_id": "Rinesh Hegde",
                    "user_href": "/profile/Rinesh-Hegde"
                },
                {
                    "user_id": "Gibby Brook",
                    "user_href": "/profile/Gibby-Brook-1"
                },
                {
                    "user_id": "Daniel Hood",
                    "user_href": "/profile/Daniel-Hood-27"
                },
                {
                    "user_id": "Elia Mbugi",
                    "user_href": "/profile/Elia-Mbugi"
                },
                {
                    "user_id": "Abdullah M",
                    "user_href": "/profile/Abdullah-M-59"
                },
                {
                    "user_id": "John Thwaites",
                    "user_href": "/profile/John-Thwaites-3"
                },
                {
                    "user_id": "Jeff Hatcher",
                    "user_href": "/profile/Jeff-Hatcher-1"
                },
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Wilson",
                "href": "/profile/Brian-Wilson-456"
            },
            "answer_text": "Well, in a sense yes and in a sense no. In the official book they send you in California for F&AM when you first join it says “Members are not permitted to resign from the fraternity, once a mason always a mason.” Also, since you are taking an oath to God on the Volume of Sacred Law it can be considered eternally binding. So, in the sense of no longer being a mason, the answer is technically no. However, if you are a member of a lodge you no longer want to be affiliated with, maybe you are not compatible or something, you can demit from that lodge and have your membership withdrawn. You can also be suspended for non-payment of dues or unmasonic conduct. However, even though you are no longer a lodge member, technically you are still considered a mason. (you can even join multiple lodges and rites, and resign from lodges) This is how my jurisdiction considers it anyway. It’s really just a matter of beliefs and semantics. Technically, if you go through the degrees and decide it’s not for you and stop going, nobody is going to do anything if you no longer call yourself a mason. In fact, at my lodge I have seen just that happen many times where people will join for a couple years and leave. This was especially true when movies like National Treasure were popular and some thought they were going to be let in on some kind of exciting secrets and things like the movies, and when they made it through the degrees they found it boring and stopped coming back. One lodge brother told me he considered masonry the crossroads of the esoteric community where people join, find out about other esoteric groups through their research in masonry, join those, then stop going to masonry. I don’t agree with his observation, but it just shows how some people have stopped going to masonry anymore and it was no big deal. It does, however, show what type of man you are. If you make a promise to God and others, are you the type that keeps it or breaks it? The obligations in masonry are very serious promises made to God and your lodge brothers, and breaking them so fast after receiving them may not cause anyone to call you on it, but you will always know in your heart that you did it. After all, they say a man is only as good as his word. So, if this would bother you, you may want to research masonry as much as you can before joining so you can see what it is really all about and if you are comfortable making such serious promises. ",
            "date": "Answered June 25, 2020",
            "views": "97",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Palmer",
                "href": "/profile/William-Palmer-13"
            },
            "answer_text": "A Mason can resign from his / a Lodge anytime he wishes, and if he resign in ‘good standing’ - ie: owes no dues or outstanding monies to his Lodge, may at any time rejoin. I have done just that - at a time I moved away from my City to another, to start a new business and it was 4years before I felt it was the right time, and joined again. No pressure was ever put on me to rejoin, I was contacted by several Masons in my new City, who respected my decision - work & family 1st and then Masonry if you have time. I have now been back for 23 years. ",
            "date": "Answered June 1, 2019",
            "views": "74",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brendan Hickey",
                    "user_href": "/profile/Brendan-Hickey-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hiram Mason",
                "href": "/profile/Hiram-Mason"
            },
            "answer_text": "My answer is pretty much the same as the others listed, but with a couple of caveats and addendums. I brother can request a “demit” from his current Lodge. If granted a demit, he is still a Master Mason in good standing, he simply no longer belongs to that particular Lodge and can petition to join another Lodge in the future. As others have said, one can stop paying dues and, thus, be suspended until the arrears are paid. However, if a brother cannot afford dues for some reason, he isn't simply given the boot. He may request a “remit” of dues, meaning he is exempt for paying, for a given time period, usually a year. A brother in good standing can reapply for a remit on a yearly basis, given the reason is true and just. A Master Mason may also be suspended for a violation of Masonic Law, which I have seen happen. Depending on the severity of the violation, the length of suspense may vary, up to and including indefinite suspension. Regardless of how or why a Master Mason may choose to leave, in my jurisdiction at least, he is still expected to adhere to his oathes, into as not revealing secrets to the outside world. ",
            "date": "Answered May 25, 2019",
            "views": "231",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Tucker",
                "href": "/profile/Kevin-Tucker-62"
            },
            "answer_text": "It is going to depend on your jurisdiction. Many allow a Freemason to simply resign from the fraternity. This is done at the Grand Lodge level. At that point, you are no longer a Freemason and if you change your mind it takes an act of the Grand Lodge for you to get back in. It would be unlikely that you would be granted re-admission though. As has already been stated, you can demit but it just makes you an unaffiliated Mason. You can just quit paying dues and stop going. After a time you would just be removed from the roster and no longer a member. I advise against this though as it puts a financial drain on the lodge for a couple of years but nothing happens to you. The best and most honorable way is a demit or resignation. ",
            "date": "Answered June 26, 2020",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Timothy L Thorman",
                "href": "/profile/Timothy-L-Thorman"
            },
            "answer_text": "One can withdraw (or demit) from a lodge by giving notice of the same. When he stops paying dues, he is no longer regarded as a member of a lodge. He is an unaffiliated Mason, and he is taken off the lodge’s rolls. There is no penalty except for the loss of fellowship he would enjoy if he continued his membership. If he just stops paying dues without notice, he is suspended from membership and cannot attend without paying a fine and recommencing his dues. Dues are paid annually so the suspension would occur after a full year without payment. ",
            "date": "Answered May 19, 2019",
            "views": "192",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeff Hatcher",
                    "user_href": "/profile/Jeff-Hatcher-1"
                },
                {
                    "user_id": "Abdullah M",
                    "user_href": "/profile/Abdullah-M-59"
                },
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Martin",
                "href": "/profile/Mike-Martin-117"
            },
            "answer_text": "Yes a Mason can quit on 2 different levels. He can just write to his Lodge Secretary and resign from his Lodge only and become \"unattached\" meaning that he can join a new Lodge pretty much at will OR he can write to the Grand Secretary and resign from Freemasonry as a whole. ",
            "date": "Answered May 20, 2019",
            "views": "95",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Thwaites",
                    "user_href": "/profile/John-Thwaites-3"
                },
                {
                    "user_id": "Axel Hogwood",
                    "user_href": "/profile/Axel-Hogwood"
                },
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Craney",
                "href": "/profile/Jim-Craney"
            },
            "answer_text": "A Mason may quit in two ways. First, just stop paying your Lodge Dues and stop attending. You won’t be forced to attend, however, if you decide to rejoin, you will have to pay back dues before being allowed to return The better way would jut to notify the secretary of your desire to resign. He will give you a certificate of clearance if you are up to date with your dues si should you change your mind you will be welcomed back no bother. . ",
            "date": "Answered May 23, 2019",
            "views": "97",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Katsia Makeyeva",
                    "user_href": "/profile/Katsia-Makeyeva-1"
                },
                {
                    "user_id": "John Thwaites",
                    "user_href": "/profile/John-Thwaites-3"
                },
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Stankow",
                "href": "/profile/David-Stankow"
            },
            "answer_text": "I'd like to think that a Mason can just quit participating and if he doesn't keep up with his dues, is suspended but not “out.” In a few cases he immediately begins to write “exposes” to make money or to ingratiate himself with whatever extremist sect into has sucked him in, or both. Most simply fade away. ",
            "date": "Answered May 24, 2019",
            "views": "59",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Grundy",
                "href": "/profile/Scott-Grundy-4"
            },
            "answer_text": "A Freemason can simply resign, by letter, email, or just standing up in a Lodge and saying “I resign”. Or he can be excluded for not paying his membership dues or for committing something that results in his being excluded. Once someone “quits” they have quit, thats it, nothing else happens. Any Freemason can apply to rejoin his own, or a different Lodge, ",
            "date": "Answered May 19, 2019",
            "views": "91",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris A Hills",
                "href": "/profile/Chris-A-Hills"
            },
            "answer_text": "No. You can’t At least not under Regular Freemasonary. The Oaths are for life.  So once you are a Freemason you are one for life but….. like many Freemasons who for many reasons decided not to contrinue as a member of a lodge the simpley stop going to a Lodge. Then you simpley become an “un attached” Freemason. It is worth noting that you shoud stop attending in good order. That is paid up on dues etc resign fromthe lodge in the appropreate way. Usually write/email the Secretary and say I am leaving/not coming back next season etc. They might (should) ask why but they can’t stop you. Then you simpley become an “un attached” Freemason. That is a Freemason who is not a member of any Lodge. Leaving in good order means that in 5, 10, 30 50 years time you could join a lodge again if you wished. You should also note that in Freemasonary there are only 3 Degrees (Mark and RA argue 4) All the rest are Side orders which many don’t bother with and usually take a specific parth that interests them. As you can see below there are lots of route after Master Mason. Some require a progression through other orders first. Some require you have attained a particular rank of been a Master MAson for over 5 years etc. Things like 33rd Degre are meaingless to most Freemasons (unless they are in the one specific side order where it is relevant). Also Note Freemasonary is NOT religious. It welcoms all Faiths and indeed members of all faiths including Druids, Wiccan’s, Hindu’s Moslems, Sihks and Cathiolics are Freemasons. That said on the chart below for the side orders with a Red Cross require a Trinitarian Christian faith the rest don’t  ",
            "date": "Answered June 25, 2020",
            "views": "142",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Walker-Smith",
                    "user_href": "/profile/Robert-Walker-Smith-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amarjit Marwaha",
                "href": "/profile/Amarjit-Marwaha"
            },
            "answer_text": "You do not have to join, and if you have joined you can leave anytime. People who join do their homework and the person who will propose and another who will second you, will try and find out why you want to join. Mostly likely if they are not happy with you they are not likely to put forward your name. ",
            "date": "Answered June 25, 2020",
            "views": "35",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Walker-Smith",
                    "user_href": "/profile/Robert-Walker-Smith-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cliff Jacobs",
                "href": "/profile/Cliff-Jacobs-2"
            },
            "answer_text": "Membership in the Masonic order is voluntary and one can leave the fraternity at anytime. It is open to men 21 years old or older. Some states allow membership at the age of 18. You do have to be an individual of good reputation and free. Free meaning, in this sense, not incarcerated. There are no penalties for leaving the fraternity. ",
            "date": "Answered June 25, 2020",
            "views": "85",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Walker-Smith",
                    "user_href": "/profile/Robert-Walker-Smith-1"
                },
                {
                    "user_id": "Raoul Pennerup",
                    "user_href": "/profile/Raoul-Pennerup"
                },
                {
                    "user_id": "Dick Van Meter",
                    "user_href": "/profile/Dick-Van-Meter-2"
                },
                {
                    "user_id": "Bryan Robertson",
                    "user_href": "/profile/Bryan-Robertson-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Mccormick",
                "href": "/profile/Gary-Mccormick-29"
            },
            "answer_text": "Yes, it’s called a demit. There is really nothing that happens. Depending on the circumstances, a committee may be formed to ascertain why and try to get the Brother to change his mind. ",
            "date": "Answered May 21, 2019",
            "views": "47",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hubert Neeson",
                "href": "/profile/Hubert-Neeson"
            },
            "answer_text": "Simple answer is once a Freemason always a Freemason, but only in respect to the obligation of not divulging anything to do with the secrets of the Craft. If you find that it is not for you you can request a resignation from your Lodge, as long as you have no outstanding debts to that Lodge. Once that is provided you no longer need to attend. ",
            "date": "Answered June 26, 2020",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Clare Kuehn",
                "href": "/profile/Clare-Kuehn"
            },
            "answer_text": "Up to a point he can. One is interviewed here. This is a hard-line Catholic channel, but there is lots of information in the video.  ",
            "date": "Answered June 25, 2020",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Laundi",
                "href": "/profile/Robert-Laundi"
            },
            "answer_text": "i dont know what happens but modern masonry is more perverted in doctrines to the initiation of satanism and luciferian false doctrines. imo ",
            "date": "Answered June 26, 2020",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Edward Dorsey",
                "href": "/profile/Edward-Dorsey-5"
            },
            "answer_text": "I’m not sure. But, can you drive? Maybe you can escape that way. Maybe. Maybe this will answer your question. Dead Kennedys' FrankenChrist ",
            "date": "Answered June 26, 2020",
            "views": "29",
            "upvotes": "0"
        }
    ]
}