{
    "title": "Could a USMC reserve end up being a scout sniper and turn to active duty for it? - Quora",
    "tags": [
        "Snipers",
        "U.S. Marine Corps",
        "United States Armed Forces"
    ],
    "response": [
        {
            "author_info": {
                "name": "Azriel Peskowitz",
                "href": "/profile/Azriel-Peskowitz"
            },
            "answer_text": "Every infantry battalion in the Marine Corps, including all 8 reserve infantry battalions, have a STA Platoon. Having never been in the platoon, but knowing several members from the two reserve infantry battalions I was in during my enlisted days, I can say that about half of the platoon were “HOGS”, meaning they had passed the USMC Scout Sniper course, and wore the 7.62 bullet to prove it. One caveat was my infantry time was back when they were 8541s, not 0317s, so it may be mildly outdated. for the first question:1) Can you be a Scout sniper in the reserves? YES You need to :a) Be an infantryman in one of the infantry battalions. It helps to join the reserves living with 50 miles of one of their companys. b)To get into the platoon, even in the reserves, generally means that the leadership in the platoon selected you, typically PRIOR to completing a dick in the dirt indoc. Which means try to be very good at general infantry skills, and generally be a stand out Marine. Its better to try when you are just a few years in, because in the reserves, especially in the GWOT days, the platoons tended to be sergeant and staff sergeant heavy, and would prefer LCpls as their new blood. c)Volunteer for, attend, and do well in an ass pain inducing indoc run by the platoon. d)Spend a while in the platoon getting good at the craft. This is generally 1–2 years after the reserve unit fought for the funding and timing to get you a school seat. This is so the unit doesn’t waste the slot on someone who is likely to fail out. e) Attend and graduate a school with one of the highest wash out rates in the Marine Corps. I don’t know what the actual T/O for a STA (sniper) Platoon is, but they typically had 15 to 20 in both the battalions I was with, and half were graduates of the school. Two advantages of staying reserves as a 0317. First, you generally stay in the platoon until you are a staff sergeant, and some times well into that rank, even if you are not the platoon sergeant. The second is that once you are an 0369 and absolutely have to leave, the reserve infantry company you move to to be a platoon sergeant etc, will generally have alot of Marines looking up to you. There is ALOT of cachet from coming from the STA platoon to most young grunts. Question 2: Can you turn to active duty for it? MAYBENo more or less than anyone else. If you are a “HOG”, just like anyone else, you need to go to a recruiter and work with them to component change to the active component. If, as with about 20% of the people who I have seen try this (none of them snipers), you are accepted, and sign a new active contract, you will head to an active duty unit. Assuming it is a contract for a slot in the 03 field (i.e. so that you don’t, like most people I saw augment to the active component, lat(erally) move). Will you be a sniper there? Depends on if the unit needs you. But likely, if you are school trained and a sergeant or below, you will go to the platoon. The big difference is that you will be expected to go to the supporting establishment (recruiting, DI, schools etc) as a senior NCO, and once you pick up SSgt, you almost certainly will find yourself back in a line platoon, permanently. ",
            "date": "Answered December 10, 2018",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Gentile",
                    "user_href": "/profile/David-Gentile-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Labrador",
                "href": "/profile/Paul-Labrador"
            },
            "answer_text": "Yes, there are Scout Snipers in the Reserves. The issue with going active duty is whether Corps has a slot for you in active duty. ",
            "date": "Answered December 4, 2018",
            "views": "404",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Will Bentley",
                    "user_href": "/profile/Will-Bentley-11"
                },
                {
                    "user_id": "Aditya Chhabra",
                    "user_href": "/profile/Aditya-Chhabra-45"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shannon Ison",
                "href": "/profile/Shannon-Ison-3"
            },
            "answer_text": "Yes. ",
            "date": "Answered September 5, 2019",
            "views": "110",
            "upvotes": "0"
        }
    ]
}