{
    "title": "Did alchemy contribute anything valuable to science? - Quora",
    "tags": [
        "Alchemy",
        "History of Science",
        "Magic (supernatural)",
        "Middle Ages (era)",
        "Metallurgy",
        "Scientific Research",
        "Materials Science and Engineering"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alan B Jones",
                "href": "/profile/Alan-B-Jones"
            },
            "answer_text": "It could be suggested that aspects of alchemical practice led to a way of thinking that gave birth to scientific method… In the same way astrology may been seen as the mother of astronomy… It is likely that early observations in these areas led to less and less magical thinking and more and more empiricism. Remember that many of the people we hail as scientific thinkers, were ‘natural philosophers’ so the demarkation between ‘science’ and ‘magic’ may not have been that clear. John Dee, the mathematician and translator or Euclid’s geometry, was a practicing occultist, astrologer and sought to connect with angelic entities. Issac Newton was interested in and explored Alchemy Carl Linnaeus was what would be called today, a crypto-zoologist and wrote on numerous mythical creatures. To be fair whist he did write about the Satyr, the Pheonix and Manticore, he also worked to ‘debunk’ hoaxes. William Crookes was a spiritualist, but to be fair so were a great number of 19th and early 20th Century scientists. (for example Alfred Russel Wallace, Oliver Lodge, Charles Richet, Pierre Curie) The point … Well before science there was ‘magic’ and it was ‘magic’ that inspired questions about the nature of the Universe. As science started to offer not only answers but ways of questioning ideas and creating formalised experiments, the magical side of things was replaced by empiricism. An interest in those topics outside the remit of reductionist and/or scientific method continued (and does continue) but eventually falling into the realm of metaphysics, philosophy and (perhaps) psychology. We need to consider the ‘researches’ of The Magi in the context of their cultures and appreciate that they created a foundation for questioning and exploration. Alan /|\\ ",
            "date": "Answered January 12, 2018",
            "views": "574",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Danilo Pia",
                    "user_href": "/profile/Danilo-Pia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Singer",
                "href": "/profile/Bob-Singer-2"
            },
            "answer_text": "While it provided a reasonable approach to the idea of chemistry, it was as flawed as its surviving kin in Asian Medicine and Homeopathy. The idea that similarity of characteristics (taking rhino horn can improve your erectile function or taking small amounts of a poison can make you immune to the poison) provides a basis for science was wrong then, and continues to be wrong today. At least alchemy has disappeared. The others continue on. ",
            "date": "Answered April 3, 2015",
            "views": "599",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sanjukta Mondal",
                "href": "/profile/Sanjukta-Mondal"
            },
            "answer_text": "Alchemy can be considered as the forefather of modern medicine and chemistry.The alchemists set the foundation to studying different elements even though they could discover or recognise a only a few, they provided ideas on how to setup laboratories.Yes there were myths regarding fabricating philosopher's stone,conversion of basic metals to noble ones and preparation of elixirs etc leaving that apart it had significant influence in development of modern science. ",
            "date": "Answered April 4, 2015",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sudeep Kumar G",
                    "user_href": "/profile/Sudeep-Kumar-G"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cesar A. K. Grossmann",
                "href": "/profile/Cesar-A-K-Grossmann"
            },
            "answer_text": "Alchemy, not. But the alchemists made several discoveries: the very chemical elements (well, some of them), part of the laws of chemistry, etc. What alchemists got right ",
            "date": "Answered April 3, 2015",
            "views": "678",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Kes",
                    "user_href": "/profile/John-Kes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malcolm Sargeant",
                "href": "/profile/Malcolm-Sargeant"
            },
            "answer_text": "Alchemical research gave birth to the scientific method. ",
            "date": "Answered April 2, 2015",
            "views": "443",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Kes",
                    "user_href": "/profile/John-Kes"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Templar",
                "href": "/profile/John-Templar"
            },
            "answer_text": " It was invaluable. Read the writings of Sir Isaac Newton Isaac Newton - Wikipedia ",
            "date": "Answered January 15, 2018",
            "views": "221",
            "upvotes": "0"
        }
    ]
}