{
    "title": "Do all of my teachers probably know my IEP? - Quora",
    "tags": [
        "Individualized Educational Program (IEPs)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Roberts",
                "href": "/profile/Mark-Roberts-36"
            },
            "answer_text": "Yes and no, because some fall through the cracks. In my experience all of your regular teachers certainly have read your Individual Education Plan, assuming that everyone is paying attention. However it is very easy for your IEP to slip through the cracks; let me give you some examples. I shall start with a literal quote: “For some unknown reason, despite telling him about it five times, he still didn’t hand it in.” This was a second-semester teacher. The “unknown reason” was clearly laid out in the IEP, but he had not seen it, because he was not the teacher for the first semester. Oops, not his fault, the system failed. Choir master, band leader, replacement teacher, teacher in charge of chosen sport, soccer coach, new teacher, ring-in teacher, extracurricular teacher, instrumental instructor, school nurse, teacher in charge of your group on an expedition, teacher in charge of detention... Probably none of these have read your IEP, because it’s a stretch to expect that they would have been told about it. ",
            "date": "Answered February 21, 2018",
            "views": "238",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Colin Dear",
                    "user_href": "/profile/Colin-Dear-2"
                },
                {
                    "user_id": "Syd Rodriguez",
                    "user_href": "/profile/Syd-Rodriguez"
                },
                {
                    "user_id": "LaVonne Davis-Schenck",
                    "user_href": "/profile/LaVonne-Davis-Schenck"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Wayne",
                "href": "/profile/Jim-Wayne-6"
            },
            "answer_text": "If they teach you, they had better know the provisions of your IEP, because they are legally obligated to follow them. Failure to do so might result in dismissal for non-performance of duty. Under FERPA, they may discuss your IEP only with you, your parents or guardians, and other members of the staff who are involved in your education, such as other teachers you have, nurses or counselors. If the IEP itself demands that variations in the school rules or routines be followed, they may briefly explain to the students, in general terms, why the student is being treated differently if it leads to changes in the class routine, for example, “X needs extra time to get to her next class,” or “Y needs this machine so he can read his textbook.” (This was the situation when I retired in 2005. Please correct me if the situation has changed.) ",
            "date": "Updated February 24, 2018",
            "views": "210",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Egide Schumacher",
                    "user_href": "/profile/John-Egide-Schumacher"
                },
                {
                    "user_id": "Matthew Gordon",
                    "user_href": "/profile/Matthew-Gordon-7"
                },
                {
                    "user_id": "Coleen Dolan Griffith",
                    "user_href": "/profile/Coleen-Dolan-Griffith"
                },
                {
                    "user_id": "Syd Rodriguez",
                    "user_href": "/profile/Syd-Rodriguez"
                },
                {
                    "user_id": "LaVonne Davis-Schenck",
                    "user_href": "/profile/LaVonne-Davis-Schenck"
                },
                {
                    "user_id": "Susana Xavier Mota",
                    "user_href": "/profile/Susana-Xavier-Mota"
                },
                {
                    "user_id": "Dan Robrish",
                    "user_href": "/profile/Dan-Robrish"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lee Atkin",
                "href": "/profile/Lee-Atkin"
            },
            "answer_text": "Yes we do. We need to know what your specific needs are and plan lessons or tests accordingly. If you need more time for a test, we need to know so we can give that to you. If you need to be allowed to type all your homework, we need to know so you aren’t forced to hand-write your work. If you need your work printed larger, we need to know that. If your instructions need to be listed, we need to know that oral instructions do not work as well for you. If you need fewer homework assignments or questions, we need to know so that we are prepared with the correct amount of homework for you. Any teacher of your that does not now your IEP cannot provide the adjustments or modification needed for you to excel and succeed. ",
            "date": "Answered February 21, 2018",
            "views": "73",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexandra Hébert",
                    "user_href": "/profile/Alexandra-Hébert"
                },
                {
                    "user_id": "Syd Rodriguez",
                    "user_href": "/profile/Syd-Rodriguez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Presburger",
                "href": "/profile/Daniel-Presburger-1"
            },
            "answer_text": "Maybe. The school is required to advise your teachers that you have an IEP, and the teachers are required to respect your accommodations. I have over 200 students. I have over 30 with IEP and 504 plans. I do not know them all. I can’t remember them all. I’ve told me students they can always write IEP or 504 on their work if they are using an accommodation. They can hold their work until after class and talk to me about it in Private, so I take their accommodation into consideration and they can retain their anonymity. In the end, it is up to the student to insure that their accommodations are met. It is certainly not an ideal situation, but when a teacher has 230 students… ",
            "date": "Answered March 9, 2018",
            "views": "101",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard P. Morrall",
                "href": "/profile/Richard-P-Morrall"
            },
            "answer_text": "If any of the accommodations in the IEP apply to their class, they had better know. That is the administration's responsibility. How can a teacher be expected to make accomodations if he hasn't been told what they are? (I can just see some money hungry attorney claiming that not being told doesn't matter!). In fact, any teacher affected should have been at the IEP meeting, or, at least, been invited and provided release time to attend the meeting. (I have seen meetings held during a teacher's class time and then a complaint by administration that the teacher hadn't attnded.) If the accomodation does not affect that teacher's class, he most likely doesn't know and doesn't want to know. Teachers have enough things to remember without being told nformation they do not need. An example would be a Physical Education accomodation. I don't do push ups in my English class; I don't need to be told about this at all. Teachers are professionals. Any teacher violating a student's information in an IEP is acting unethically. Of course, much of this information is readily apparent to other who share a classroom. Sitting close to the chalk board, using a laptop for tests, having a large print or Braille book, being given extra time to get from class to class, being in a wheelchair — all of these are known to others in school. ",
            "date": "Answered February 26, 2018",
            "views": "115",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jim Silsby",
                    "user_href": "/profile/Jim-Silsby"
                },
                {
                    "user_id": "Syd Rodriguez",
                    "user_href": "/profile/Syd-Rodriguez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zelda Cummings",
                "href": "/profile/Zelda-Cummings"
            },
            "answer_text": "Maybe not. They won’t necessarily know the specifics unless they are responsible to track your skills in that area. The IEPs are long and contain a lot of information that doesn’t relate to each teacher. It also confidential information that really you don’t want everyone to know about. (This also depends on how much you/your parents want to share. I have worked at some schools where hardly anyone sees an IEP and I worked at schools where the IEP is left on a desk for anyone to find.) ",
            "date": "Answered March 9, 2018",
            "views": "52",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Syd Rodriguez",
                    "user_href": "/profile/Syd-Rodriguez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Soma Kaplan",
                "href": "/profile/Soma-Kaplan"
            },
            "answer_text": "Yes, of course they do. By law each one of your teachers should have a copy of your IEP, know your disability, and know what accommodations they need to make in order for you to access the curriculum. Teachers should be aware of your goals and assist you in advocating for yourself by asking you about your progress on big projects, and enabling you to ask for extensions and revision opportunities. ",
            "date": "Answered February 21, 2018",
            "views": "64",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Syd Rodriguez",
                    "user_href": "/profile/Syd-Rodriguez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Nerad",
                "href": "/profile/Alexander-Nerad"
            },
            "answer_text": "Yes It is standard practice for special education teachers to share ieps with all of a student's teachers. Because ieps are long we usually give teachers what is called an IEP at a glance which shows a shortened iep. ",
            "date": "Answered February 21, 2018",
            "views": "58",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Syd Rodriguez",
                    "user_href": "/profile/Syd-Rodriguez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patsi Robison",
                "href": "/profile/Patsi-Robison"
            },
            "answer_text": "Your IEP or Individual Education plan should be shared with all your teachers by your special ed teacher. It should be reviewed with your team at least anually. ",
            "date": "Answered February 21, 2018",
            "views": "47",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Syd Rodriguez",
                    "user_href": "/profile/Syd-Rodriguez"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Staub",
                "href": "/profile/William-Staub"
            },
            "answer_text": "Yes. They know it so they can design the kind of work you can do and help you learn as much as possible. ",
            "date": "Answered February 21, 2018",
            "views": "2",
            "upvotes": "0"
        }
    ]
}