{
    "title": "Do CA toppers went to coaching classes? - Quora",
    "tags": [
        "Coaching Classes",
        "Toppers",
        "CA Final Exam",
        "Chartered Accountants (CA)",
        "Coaching"
    ],
    "response": [
        {
            "author_info": {
                "name": "Advait Sharma",
                "href": "/profile/Advait-Sharma-30"
            },
            "answer_text": "I can only speak about the toppers I've known personally or seen in classes. The one's I know personally took classes of practical subjects and certain theory subjects while self studying some theory subjects. Eti agarwal AIR 1 and her rank holder friend Harsh who now is a faculty for law , took classes for practical as well as theory subjects. It depends and in my opinion, theoretical subjects can be prepared self, in the end it's all about retention. Now since the institute has upgraded it's material really well, some of the students I know are preparing subjects like direct taxation and indirect taxation themselves referring ICAI modules. Your teacher has 10% role in your result, it's all what you do and how you do that matters. Classes can only provide you a material you'll refer and guidance. Your practice and revision of the subject only can get you through. ",
            "date": "Answered April 11, 2019",
            "views": "324",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Deepak Sharma",
                    "user_href": "/profile/Deepak-Sharma-9080"
                },
                {
                    "user_id": "Ankush Chirimar",
                    "user_href": "/profile/Ankush-Chirimar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Govind Mishra",
                "href": "/profile/Govind-Mishra-195"
            },
            "answer_text": "Offcourse all ca student's takes classes many few study by themselves.. If you're focused and your concentration power high and have ability to study yourself at home then yu don't need classes.. But all CA students takes classes. ",
            "date": "Answered April 14, 2019",
            "views": "152",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ankush Chirimar",
                    "user_href": "/profile/Ankush-Chirimar"
                }
            ]
        }
    ]
}