{
    "title": "Do ged scores matter? - Quora",
    "tags": [
        "GED"
    ],
    "response": [
        {
            "author_info": {
                "name": "Latagia Copeland-Tyronce",
                "href": "/profile/Latagia-Copeland-Tyronce"
            },
            "answer_text": "Great question... It depends on what you plan on doing after getting your GED. If you are planning on going into the military or straight into the workforce than probably not. If you plan on going to trade school, likewise, probably not. However, if you plan on continuing your education and pursuing an undergraduate degree at a college or university, especially private institutions, than yes, your GED score matters. I know that my GED score directly impacted my college acceptance (note: I attended a private Catholic college). At my college, policy dictated that if a perspective student had a GED score which was below the college's minimum score requirement then that person would have to take extra courses and/or submit SAT/ACT exams before they were allowed to be admitted into their program. That said, some undergraduate institutions don't have minimum GED score requirements. Moreover, once someone has gotten through undergrad the GED scores don't matter anymore. I hope that answers your question:) ",
            "date": "Answered September 22, 2018",
            "views": "702",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brian Keith Mino",
                    "user_href": "/profile/Brian-Keith-Mino"
                },
                {
                    "user_id": "Mark Shainblum",
                    "user_href": "/profile/Mark-Shainblum-1"
                },
                {
                    "user_id": "Valerie Cooper",
                    "user_href": "/profile/Valerie-Cooper"
                },
                {
                    "user_id": "Peter Gorner",
                    "user_href": "/profile/Peter-Gorner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Burd",
                "href": "/profile/Tony-Burd"
            },
            "answer_text": "If you are referring to your scores as far as an employer seeing them,most will never even try to get your scores. If you have proof of your GED and were able to obtain your GED thats really all they are looking for because being able to obtain your GED and having your GED shows that you have the basic knowledge required to get your GED and that you put forth that effort to obtain it....of course this is just my opinion. ",
            "date": "Answered May 6, 2018",
            "views": "236",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brian Keith Mino",
                    "user_href": "/profile/Brian-Keith-Mino"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith Kirkendoll",
                "href": "/profile/Keith-Kirkendoll"
            },
            "answer_text": "Mine hasn't effected me at all that I know of . I've worked my way up the ladder in my job. My military life. I joined the army 5 days after turning 17. I was made a squad leader in basic training. A platoon leader in Advance individual training as a combat engineer. Soldier of the month 2 times. So i belive that with what they have to learn now is much harder than when I was 16. ",
            "date": "Answered May 2, 2018",
            "views": "118",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                }
            ]
        }
    ]
}