{
    "title": "Do I need to practice the Ten Year Series for O levels? How many question papers do I need to practice? - Quora",
    "tags": [
        "GCE O Levels"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jaya Krampf",
                "href": "/profile/Jaya-Krampf"
            },
            "answer_text": "I wouldn't lie, it's good practice. Honestly depends what you're going for, and how good you are. If you're decent at the subject and confident of getting a high score, I suggest doing prelim papers that your teacher had given you or any challenging, unorthodox questions, just so you get your brain stimulated and your bases covered. If you're struggling at the subject, I suggest taking the time to understand the parts you don't instead of blindly jumping into the questions. Half the battle of exams isn't blindly memorizing and regurgitating, it's understanding. This is a powerful tool, that's basically your Rosetta Stone to recalling any and every piece of knowledge that O levels would require of you. Take the time to do topical TYS or some of the older papers to gauge your understanding as a test. If you're average/on your last days before the exam, spend time doing the latest paper that you haven't done. Usually the O level paper for your year would follow some sort of trend from recent years, with the level of difficulty not deviating too much. Just above all, make sure not to get too carried away ;) after all, you need that important 8 hours of sleep! Tonda Gossa~ ",
            "date": "Answered May 7, 2017",
            "views": "740",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hoodson Zhao",
                    "user_href": "/profile/Hoodson-Zhao"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muhammad Ali",
                "href": "/profile/Muhammad-Ali-381"
            },
            "answer_text": "Examiner tips down below! Look, it does not matter how many papers you practice, it depends on how much of a grasp you have on those papers, the execution matters! But here’s what you can do. Ten years will suffice and may seem easy but if you do past papers, do every available variant for each paper! This is key, often what they do is, reshuffle answers between variants so look out for them. Also, the goal for ten years should be this, do enough papers that you start feeling confident about it, every new question starts seeming familiar to you. But let me remind every one of you. Those who claim that questions are added out of syllabus, there is no such thing as this. This is a false, baseless and bogus claim. What they do is reinterpret, reshuffle and replace the overall question but its requirements are derived from the syllabus only. ",
            "date": "Answered November 19, 2017",
            "views": "453",
            "upvotes": "0"
        }
    ]
}