{
    "title": "Do I have to go to repeat 8th grade if I fail math (8th grade)? - Quora",
    "tags": [
        "8th Grade",
        "Grades (education)",
        "Mathematics Education",
        "Academic and Educational Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Nichols",
                "href": "/profile/Robert-Nichols-34"
            },
            "answer_text": "Do I have to go to repeat 8th grade if I fail math (8th grade)? In every US based education system I have been in, no you would not fail 8th grade, you would move on to 9th grade. You might get flagged and put into a math class other than the standard 9th grade math (at most US schools this would be Algebra 1). In my current district, 8th graders who are flagged as being behind in math, (but not classified as qualifying for special education mathematics), are put into “Intensified Algebra”. This is an Algebra class that is two periods long. One period is credited as a math credit but the second period is credited as an elective. But each district in the US has its own set of rules, it would be best to check with a counselor or administrator in your own district. ",
            "date": "Answered April 27, 2020",
            "views": "122",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sarah Knitter",
                    "user_href": "/profile/Sarah-Knitter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Gregg",
                "href": "/profile/Andrew-Gregg-14"
            },
            "answer_text": "Greetings, Relax! American public schools routinely practice social promotion, and middle school students are never held back regardless of how many classes they fail unless parents insist. That never happens. Make every effort to improve your math skills for high school success. Sincerely, AJG. ",
            "date": "Answered April 27, 2020",
            "views": "52",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sophia Fajardo",
                    "user_href": "/profile/Sophia-Fajardo-4"
                },
                {
                    "user_id": "Sarah Knitter",
                    "user_href": "/profile/Sarah-Knitter"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Thomas",
                "href": "/profile/David-Thomas-805"
            },
            "answer_text": "I do not know what the policy is in your school and in your district, but here in [redacted], Utah, you would not repeat eighth grade, but you would repeat your math course. Better yet, see what happens if you seek help from your teacher, put in a lot of effort, and pass the class? You can do this. No class is so difficult that a student should fail it if they put the effort in to passing it. ",
            "date": "Answered April 27, 2020",
            "views": "80",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sarah Knitter",
                    "user_href": "/profile/Sarah-Knitter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Umar Hassan",
                "href": "/profile/Umar-Hassan-15"
            },
            "answer_text": "I don’t know the policy of your school but likely not. However, you need to remediate those math skills. Math literacy is required in every walk of life. Find a tutor. ",
            "date": "Answered April 27, 2020",
            "views": "26",
            "upvotes": " Answer requested by Symone Andrews"
        },
        {
            "author_info": {
                "name": "Alex Sadovsky",
                "href": "/profile/Alex-Sadovsky"
            },
            "answer_text": "This is a question for your school counselor, who knows the policies in your educational system and your complete academic situation. ",
            "date": "Answered April 27, 2020",
            "views": "12",
            "upvotes": " Answer requested by Symone Andrews"
        }
    ]
}