{
    "title": "Do movies change people's perception of reality? - Quora",
    "tags": [
        "Perception",
        "Reality",
        "Movies",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Kim",
                "href": "/profile/James-Kim-123"
            },
            "answer_text": "Absolutely. You think you know what an explosion sounds like because you’ve watched a Michael Bay film, you think you have an idea of what a gun shot sounds like indoors because you’ve watched John Wick. Your main character shoots a round into the gas tank of a car and it explodes into a fiery ball. You have preconceived ideas of how a certain ethnic group behaves because you’ve seen way too many TV shows and etc… I was such a product of this warped reality because since I was a child I’ve watched so many movies and deemed movie physics and information as facts… By the way, a gun shot indoors is piercing. It’s very loud and ear protection is necessary unless you want hearing loss. I’m sure it’s the same for explosions, nothing like you hear in the movies.  ",
            "date": "Answered June 21, 2017",
            "views": "691",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fraser Best",
                    "user_href": "/profile/Fraser-Best"
                },
                {
                    "user_id": "Alexander Karl Peter Wedberg",
                    "user_href": "/profile/Alexander-Karl-Peter-Wedberg"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dina ElAdly",
                "href": "/profile/Dina-ElAdly-1"
            },
            "answer_text": "Change perception? It creates the whole perception. When you were a kid, movies made adults seem to you like they can handle their lives and know what they are doing right? You believed in fairytales and thought that one day you'll have your own fairytale? You thought that mafias are cool? (I still think they are though) I think movies start building our perception of \"life\" since we were kids. I can't even state how much i believed in love as a kid because of all the movies, this was before i start dealing with the real world... Movies show extremes, the best and worst sides of the world. but most of the time with a happy ending, and most of the time, the good wins. Movies upgrade everyone's expectations of everything; of love, friendship, career and lifestyle. It might even make you dissatisfied with your life because it shows you that life can be a lot better and more fun. You won't always remember that it's just a movie, and that reality is different ",
            "date": "Answered June 22, 2017",
            "views": "678",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pranusha Choudhary",
                    "user_href": "/profile/Pranusha-Choudhary"
                },
                {
                    "user_id": "Laura Sierra",
                    "user_href": "/profile/Laura-Sierra-9"
                },
                {
                    "user_id": "Khalil Ƥrodigy",
                    "user_href": "/profile/Khalil-Ƥrodigy"
                },
                {
                    "user_id": "Wessam Ahmed",
                    "user_href": "/profile/Wessam-Ahmed-4"
                },
                {
                    "user_id": "Alexander Karl Peter Wedberg",
                    "user_href": "/profile/Alexander-Karl-Peter-Wedberg"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Osi",
                "href": "/profile/Daniel-Osi"
            },
            "answer_text": "I think so, but there are so many kinds of movies. Some movies try to be hyper-realistic, some others tend to be hyper-idealistic while some create fantasy worlds. Others fall somewhere in between. Movies are an art form and should be seen as such. When a movie tries to imitate reality, or is reality, it shouldn’t be called a movie anymore. It should probably be called a documentary. ",
            "date": "Answered June 21, 2017",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ray Jaja",
                    "user_href": "/profile/Ray-Jaja"
                },
                {
                    "user_id": "Alexander Karl Peter Wedberg",
                    "user_href": "/profile/Alexander-Karl-Peter-Wedberg"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lavish Jain",
                "href": "/profile/Lavish-Jain-32"
            },
            "answer_text": "Yes, I think they do to a extent. The youth based movies , the love flicks have a impact on young people perception towards reality. Examples of such movies are dil chahta hai, wake up sid , YJHD , zindagi na milegi dobara , 3 idiots , DDLJ, 2 states , rock on , vicky donor , ishqzaade etc. ",
            "date": "Answered June 21, 2017",
            "views": "249",
            "upvotes": "0"
        }
    ]
}