{
    "title": "Do people from public schools go to Ivy League schools? - Quora",
    "tags": [
        "University of Pennsylvania",
        "Ivy League Undergraduate Admissions",
        "The Ivy League"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael E. Cohen",
                "href": "/profile/Michael-E-Cohen"
            },
            "answer_text": "Yes, they do. I went to the Univ. of Pennsylvania, an ivy league school. And I came from a public high school in Philadelphia. There were many of my classmates at Central H.S. in Phila., who also went to the UPenn. I knew students who had gone to private (mainly prep) schools as well as public schools. The high school I went to was a select high school, with modestly high admission standards. But it was still a public high school. I haven’t seen detailed stats on admissions from private and prep schools at Penn and the other Ivy League universities. It wouldn’t surprise me if there was a fairly even balance in public and private school admissions. Especially with all the financial aid awarded. ",
            "date": "Updated November 28, 2019",
            "views": "4",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matt De Maio",
                    "user_href": "/profile/Matt-De-Maio"
                },
                {
                    "user_id": "Denayia Miniex",
                    "user_href": "/profile/Denayia-Miniex"
                },
                {
                    "user_id": "Prathit Shukla",
                    "user_href": "/profile/Prathit-Shukla"
                },
                {
                    "user_id": "Bobby Mitra",
                    "user_href": "/profile/Bobby-Mitra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Brown",
                "href": "/profile/Robert-Brown-218"
            },
            "answer_text": "Do people from public schools go to Ivy League schools? Yes. A number of our children’s friends from their poor, inner city high school went to Ivies, including Harvard, Cornell and Columbia where they did very well. A couple of the laggards went to MIT. One of those laggards got a Ph.D. in polymer science from MIT, but the other had to settle for an MIT masters degree and a position as a senior software development engineer at Apple. ",
            "date": "Answered February 18, 2020",
            "views": "479",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nathan Zhao",
                "href": "/profile/Nathan-Zhao-3"
            },
            "answer_text": "Yes, but they are the minority on a relative scale. Even if 50% of students admitted are from public schools, the proportion of students who go to public schools is much greater than the proportion attending private schools. This source says 10% of all students in PK-12 are in private schools (CAPE | Private School Facts). That said, this doesn’t mean that going to a private school means that you have a 5-fold greater chance of getting into an Ivy League school. ",
            "date": "Answered August 12, 2017",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kiseki Hirakawa",
                    "user_href": "/profile/平川-奇跡-Kiseki-Hirakawa"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stuart White",
                "href": "/profile/Stuart-White-27"
            },
            "answer_text": "Yes, about half of the students in Ivy League Schools come from public high schools. But according to this article Top US Private Schools with the Most Graduates Getting Into Ivy League Universities 94 out the top 100 feeder schools into Ivy League college are private. So it would appear that some private schools are better positioned to send graduates to the Ivies than public high schools. ",
            "date": "Answered May 11, 2017",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rick Table",
                "href": "/profile/Rick-Table"
            },
            "answer_text": "Yes, however 90% of American students attend a public school, but only make up about half of Ivy League students. Harvard and Princeton have the highest percentage of private students at upwards of 55%. ",
            "date": "Answered August 12, 2017",
            "views": "767",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Harry Hsia",
                    "user_href": "/profile/Harry-Hsia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Peters",
                "href": "/profile/Ben-Peters-13"
            },
            "answer_text": "Yes I did, from a public school of 100 / class in a town of 2,600 people without a McDonald’s. It’s do-able. :) ",
            "date": "Answered May 10, 2017",
            "views": "654",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Schwartz",
                "href": "/profile/Justin-Schwartz-3"
            },
            "answer_text": "I did. ",
            "date": "Answered February 16, 2020",
            "views": "204",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                }
            ]
        }
    ]
}