{
    "title": "Do schools in Japan teach English? - Quora",
    "tags": [
        "Teaching English as a Foreign Language (TEFL)",
        "English as a Second Language (ESL)",
        "Teaching",
        "Japan",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Whitemore",
                "href": "/profile/Dan-Whitemore"
            },
            "answer_text": "They have English teachers and an English language curriculum but not only do most students graduate from 6 years of an “English education” without the ability to use English for anything practical, many of the Japanese English teachers are so deficient in the language that it goes beyond comical and into the realm of scandalous. From this year the JHS English classes are supposed to be taught entirely in English. The problem is that very many Japanese English teachers cannot do this. They could not even order a meal in a restaurant in an English speaking country. I have stood through classes which did not even involve any speaking, listening, reading or writing in English, whatsoever. I have stood there and watched a 50 year old teacher having her grammar and spelling corrected by 12 year olds, it`s not even funny anymore. I can’t wait to see that particular teacher teach entirely in a language she can barely speak or understand. She won’t, and she`ll get away with it. About a decade ago the government told elementary school teachers they had to teach English on their own, they just refused to do it and I don’t blame them. No doubt the JHS teachers will wriggle out of teaching entirely in English. The students often have their heads filled with a ton of useless vocabulary, grammar that’s not appropriate for low level learners of English, and disturbing / upsetting textbook content about euthanizing zoo animals and little girls dying of radiation sickness. Add to this a “survival of the fittest” educational model which bolsters strong students and abandons weak ones, (as opposed to encouraging weak students and leaving the strong ones to take care of themselves.) and you have a recipe for defeatism. Not only can many teachers not communicate in English, they don’t appear to have been trained to teach. 3 or 4 out of 25 teachers I have worked with I would classify as good teachers, mostly because they are mavericks who don’t toe the line. These are the teachers who know how to get kids talking, make lessons fun and take the intimidating edge off the English language. They also know how to use a foreign assistant language teacher effectively. I am an ALT myself and can tell you that ALTs can be the best thing about English education in Japan, but this depends very much on how much creative input they are given, how much they care about what they are doing and , frankly, how mature and mentally healthy they are. I`ll be honest and say that I am a veteran ALT primarily because I am an educational reject in my own country and only secondarily because I enjoy the job. This is not always the case but it often is. The ALT industry has been a real asylum for me and other learning disabled individuals lucky enough to be Anglophone. Other long time ALTs have told me they have no idea what they`d do if they couldn`t be ALTs, it`s all they know and besides which they become virtually institutionalized by the formality, structure and routine of Japanese school life. Many ALTs are pretty young, didn`t come to Japan to teach (which I can sympathize with) and won`t be here this time next year. Another thing often overlooked is that working as an outsider in a Japanese workplace is tough, working with kids is tough and teaching is really tough. However, when things get tough too many people go straight for losing their shit rather than asking for support or being diplomatic. My experience of other ALTs has honestly been mostly negative. It is common for ALTs to just vanish without saying a word to anyone, someone usually gets the boot from the board of education at the end of the year for something they were told a million times not to do, but went ahead and did anyway. I have seen 40 something internet trolls yelling abusively at their HR managers in training seminars for not speaking loudly enough, or just starting arguments during what are supposed to be discussions throwing their weight around like playground bullies. If other westerners think these people are rude, imagine how their Japanese colleagues feel about them. Among the other problems with some ALTs is that many of them come from a very entitled standpoint. The whole world is for them and everything in Japan should be the way it is in their country. Being brutally honest is considered a virtue as well as rejecting the norms and traditions of a country that is not theirs, simply because they do not comport with what they are accustomed to. Some of them, I`m sorry to report, are predators. But to be fair, some Japanese teaching staff could also be described as such. So my answer to this question would have to be…….yes and no. ",
            "date": "Answered January 10, 2020",
            "views": "113",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Wheatley",
                "href": "/profile/ウィトリ-ジョン-John-Wheatley"
            },
            "answer_text": "Japanese schools don’t teach English, in the same way that English schools don’t teach French. That means the subject is on the curriculum, but the material taught is substantially different from the living language itself. The quality of English education in Japanese schools varies a lot. The better private schools and international schools tend to produce really good quality English-speaking alumni, but the vast majority don’t have that luxury. They rely on Japanese-written textbooks taught by Japanese teachers with dubious English credentials themselves, and the occasional presence of a hapless, freshly-minted graduate called an ‘ALT’ (Assistant Language Teacher) from the UK, the USA, Ireland or the Commonwealth.  Spot the ALT! Hint: it’s the one with the upside-down (and probably homemade) Union Jack. #altstruggles The result is that many schools teach English like a dead language, the way you might learn Latin or Ancient Greek. Features of this way of teaching include: minimal language creation, i.e. composing your own thoughts in speech or writingmisuse of ‘katakana eigo’, known to us as Japanglish, as an infallible pronunciation guide. This produces atrocious sentences, like the following:Hero pureezu tsu meechu[1]Ai habu ei pen[2]Sank yuu beri macchi[3]otherwise zero focus on pronunciationminimal conversation practice; if present, consists of memorising set responses rather than improvisingspending a long time memorising relatively short vocabulary liststreating grammar like a system of equations, and focusing on grammar jargon (e.g. identifying preterite vs subjunctive) rather than grammar usagecramming for standardised testsWhen a victim of this teaching style is faced with a real live English speaker, the shock is comparable to that of you or I being confronted with a walking talking Roman: the Latin you might’ve studied in school is woefully inadequate for the task of actually communicating.  “Oy, quid intuemini?” Admittedly the presence of ALTs should reduce this shock factor somewhat, but for various reasons the effect of ALTs on the big picture of English education in Japan has been underwhelming. There are systemic factors at work. Chief among these is the A in ALT: Assistant. The Japanese government has very cunningly managed to steal thousands of bright young graduates from across the western world at a bargain price, only to waste all that youthful talent and energy by denying the teachers any creative input in lesson design. Instead they have to simply follow the textbook, and follow the wonky curriculum it’s designed for, and follow the Japanese English teachers who plod along teaching the same system that’s been failing for decades. Note: I haven’t worked as an ALT, but did spend a couple of months in rural Japan where I volunteered at local schools encouraging students to learn English and consider studying abroad. This was the first time most of these students had met a foreigner who could speak fairly fluent Japanese, so I got lots of questions, and I met and befriended quite a few ALTs along the way. To quantify a student’s level of language aptitude, there are two major sets of standardised tests that Japanese students take, called Eiken (英検) and Kanken (漢検). The second one is a test of kanji knowledge, while the first one tests English knowledge. Students with high scores on Eiken tend to have good written English, and decent spoken English; it’s used as a guide for Japanese companies looking to hire Japanese graduates with English language aptitude. Both these tests have a scoring system similar to the JLPT (Japanese Language Proficiency Test), where Level 1 is the highest. However, few people actually achieve Level 1, because it’s apparently super hard, i.e. requires an awful lot of cramming of specialised vocabulary. As a result, there’s ‘Level pre-1’, and ‘Level pre-2’ tests, which bridge the cavernous gap between levels 3, 2, and 1. As I understand it, Level pre-2 is considered ok, Level 2 is good, and anything above that looks impressive on an applicant’s CV. I hope you found this overview of Japanese English interesting, and I’m sure that others who’ve spent time in Japanese schools as students or ALTs will be able to supplement and correct my impressions with their own experiences. Footnotes[1] http://Hello, pleased to meet you[2] http://I have a pen[3] http://Thank you very much",
            "date": "Answered January 9, 2020",
            "views": "65",
            "upvotes": " View 219 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cher Cher",
                    "user_href": "/profile/Cher-Cher-24"
                },
                {
                    "user_id": "A.J.",
                    "user_href": "/profile/A-J-2865"
                },
                {
                    "user_id": "Laura Mason",
                    "user_href": "/profile/Laura-Mason-238"
                },
                {
                    "user_id": "Abby de Visser",
                    "user_href": "/profile/Abby-de-Visser"
                },
                {
                    "user_id": "Xavier Rodriguez",
                    "user_href": "/profile/Xavier-Rodriguez-65"
                },
                {
                    "user_id": "Vanessa Pontes",
                    "user_href": "/profile/Vanessa-Pontes-3"
                },
                {
                    "user_id": "Kira Cantu",
                    "user_href": "/profile/Kira-Cantu-2"
                },
                {
                    "user_id": "Cora Morgan",
                    "user_href": "/profile/Cora-Morgan-7"
                },
                {
                    "user_id": "Daruma Twin",
                    "user_href": "/profile/Daruma-Twin-1"
                },
                {
                    "user_id": "Rea Lacroix",
                    "user_href": "/profile/Rea-Lacroix"
                },
                {
                    "user_id": "Will Huang",
                    "user_href": "/profile/Will-Huang-19"
                },
                {
                    "user_id": "Zeibura S. Kathau",
                    "user_href": "/profile/Zeibura-S-Kathau"
                },
                {
                    "user_id": "Elender Góis Gallas",
                    "user_href": "/profile/Elender-Góis-Gallas-エレンデ-ガラス"
                },
                {
                    "user_id": "Steve Tsai",
                    "user_href": "/profile/Steve-Tsai-16"
                },
                {
                    "user_id": "Izabella Danielska",
                    "user_href": "/profile/Izabella-Danielska"
                },
                {
                    "user_id": "Millicent Li",
                    "user_href": "/profile/Millicent-Li-1"
                },
                {
                    "user_id": "Mohit",
                    "user_href": "/profile/Mohit-932"
                },
                {
                    "user_id": "Justin Yoshida",
                    "user_href": "/profile/Justin-Yoshida"
                },
                {
                    "user_id": "Michael Negussie",
                    "user_href": "/profile/Michael-Negussie-1"
                },
                {
                    "user_id": "Andrew Heller",
                    "user_href": "/profile/Andrew-Heller-23"
                },
                {
                    "user_id": "Marcy Osedo",
                    "user_href": "/profile/Marcy-Osedo"
                },
                {
                    "user_id": "Ina Ehmen",
                    "user_href": "/profile/Ina-Ehmen"
                },
                {
                    "user_id": "Miguel Melo",
                    "user_href": "/profile/Miguel-Melo-24"
                },
                {
                    "user_id": "Finn Yeung",
                    "user_href": "/profile/Finn-Yeung-2"
                },
                {
                    "user_id": "Phan Minh Chau",
                    "user_href": "/profile/Phan-Minh-Chau"
                },
                {
                    "user_id": "Arianna Bertoldo",
                    "user_href": "/profile/Arianna-Bertoldo"
                },
                {
                    "user_id": "Raja Sikandar",
                    "user_href": "/profile/Raja-Sikandar-11"
                },
                {
                    "user_id": "Izzie Jacobsen",
                    "user_href": "/profile/Izzie-Jacobsen"
                },
                {
                    "user_id": "Maya Schlüter-MacLean",
                    "user_href": "/profile/Maya-Schlüter-MacLean"
                },
                {
                    "user_id": "Joseph Xue",
                    "user_href": "/profile/Joseph-Xue-2"
                },
                {
                    "user_id": "Pippi M. R. Groving",
                    "user_href": "/profile/Pippi-M-R-Groving"
                },
                {
                    "user_id": "Michella Devina",
                    "user_href": "/profile/Michella-Devina"
                },
                {
                    "user_id": "Ze Chen",
                    "user_href": "/profile/Ze-Chen-15"
                },
                {
                    "user_id": "Federico Federighi",
                    "user_href": "/profile/Federico-Federighi"
                },
                {
                    "user_id": "Thomas van der Valk",
                    "user_href": "/profile/Thomas-van-der-Valk"
                },
                {
                    "user_id": "Arya Narendra",
                    "user_href": "/profile/Arya-Narendra"
                },
                {
                    "user_id": "Juliet Powell",
                    "user_href": "/profile/Juliet-Powell-1"
                },
                {
                    "user_id": "Jaime Cruz",
                    "user_href": "/profile/Jaime-Cruz-21"
                },
                {
                    "user_id": "Rose Wilder",
                    "user_href": "/profile/Rose-Wilder-6"
                },
                {
                    "user_id": "Sayha Mam",
                    "user_href": "/profile/Sayha-Mam-1"
                },
                {
                    "user_id": "Eugene Worford",
                    "user_href": "/profile/Eugene-Worford"
                },
                {
                    "user_id": "Ashanti Peterson",
                    "user_href": "/profile/Ashanti-Peterson"
                },
                {
                    "user_id": "Amelia-Louise Luscombe",
                    "user_href": "/profile/Amelia-Louise-Luscombe"
                },
                {
                    "user_id": "Sugat Borthakur",
                    "user_href": "/profile/Sugat-Borthakur-2"
                },
                {
                    "user_id": "Parker Knudson",
                    "user_href": "/profile/Parker-Knudson-1"
                },
                {
                    "user_id": "Alice Gatto",
                    "user_href": "/profile/Alice-Gatto"
                },
                {
                    "user_id": "Steve Mcnamara",
                    "user_href": "/profile/Steve-Mcnamara-2"
                },
                {
                    "user_id": "Carmen O'Hare",
                    "user_href": "/profile/Carmen-OHare"
                },
                {
                    "user_id": "Aniekan Thomas",
                    "user_href": "/profile/Aniekan-Thomas"
                },
                {
                    "user_id": "Zachary Tay",
                    "user_href": "/profile/Zachary-Tay-5"
                },
                {
                    "user_id": "Tiffany Cheng",
                    "user_href": "/profile/Tiffany-Cheng-31"
                },
                {
                    "user_id": "Naomi Van den Berghe",
                    "user_href": "/profile/Naomi-Van-den-Berghe"
                },
                {
                    "user_id": "Joe Roberts",
                    "user_href": "/profile/Joe-Roberts-41"
                },
                {
                    "user_id": "Neil Desai",
                    "user_href": "/profile/Neil-Desai-11"
                },
                {
                    "user_id": "Jasper Ko",
                    "user_href": "/profile/Jasper-Ko"
                },
                {
                    "user_id": "Ahmad Syahid",
                    "user_href": "/profile/Ahmad-Syahid-1"
                },
                {
                    "user_id": "Julia Moore",
                    "user_href": "/profile/Julia-Moore-216"
                },
                {
                    "user_id": "Jade Spide",
                    "user_href": "/profile/Jade-Spide"
                },
                {
                    "user_id": "Nikita Johnson",
                    "user_href": "/profile/Nikita-Johnson-51"
                },
                {
                    "user_id": "Jasper Thomas",
                    "user_href": "/profile/Jasper-Thomas-13"
                },
                {
                    "user_id": "Matthew Cowell",
                    "user_href": "/profile/Matthew-Cowell-4"
                },
                {
                    "user_id": "Isabel Travis",
                    "user_href": "/profile/Isabel-Travis-1"
                },
                {
                    "user_id": "Giuseppe Longo",
                    "user_href": "/profile/Giuseppe-Longo"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sid-1379"
                },
                {
                    "user_id": "Jacinda Chen",
                    "user_href": "/profile/Jacinda-Chen"
                },
                {
                    "user_id": "Vadim Yakovlevich",
                    "user_href": "/profile/Vadim-Yakovlevich"
                },
                {
                    "user_id": "Simran Kaur",
                    "user_href": "/profile/Simran-Kaur-4807"
                },
                {
                    "user_id": "Sima Sokolov",
                    "user_href": "/profile/Sima-Sokolov-1"
                },
                {
                    "user_id": "Nina Cihelka",
                    "user_href": "/profile/Nina-Cihelka"
                },
                {
                    "user_id": "Sebastian Medina",
                    "user_href": "/profile/Sebastian-Medina-15"
                },
                {
                    "user_id": "Rohen Giralt",
                    "user_href": "/profile/Rohen-Giralt"
                },
                {
                    "user_id": "Jaime Arequipeno",
                    "user_href": "/profile/Jaime-Arequipeno"
                },
                {
                    "user_id": "Jack Mounser",
                    "user_href": "/profile/Jack-Mounser"
                },
                {
                    "user_id": "Ketaki Kumar",
                    "user_href": "/profile/Ketaki-Kumar-3"
                },
                {
                    "user_id": "Lance Isaac",
                    "user_href": "/profile/Lance-Isaac-1"
                },
                {
                    "user_id": "Dalton Miller",
                    "user_href": "/profile/Dalton-Miller-3"
                },
                {
                    "user_id": "Rogelio Adlawan Jr.",
                    "user_href": "/profile/Rogelio-Adlawan-Jr"
                },
                {
                    "user_id": "Michał W. Solański",
                    "user_href": "/profile/Michał-W-Solański"
                },
                {
                    "user_id": "Adrian Lee",
                    "user_href": "/profile/Adrian-Lee-208"
                },
                {
                    "user_id": "Pasha Aulia Muhammad",
                    "user_href": "/profile/Pasha-Aulia-Muhammad"
                },
                {
                    "user_id": "Manuel Condor",
                    "user_href": "/profile/Manuel-Condor-1"
                },
                {
                    "user_id": "Kirby Cho",
                    "user_href": "/profile/Kirby-Cho-2"
                },
                {
                    "user_id": "Sajai Paul",
                    "user_href": "/profile/Sajai-Paul"
                },
                {
                    "user_id": "Steve Sharp",
                    "user_href": "/profile/Steve-Sharp-29"
                },
                {
                    "user_id": "Robin Schroeder",
                    "user_href": "/profile/Robin-Schroeder-5"
                },
                {
                    "user_id": "Sophia Li",
                    "user_href": "/profile/Sophia-Li-146"
                },
                {
                    "user_id": "Luís Saraiva",
                    "user_href": "/profile/Luís-Saraiva-5"
                },
                {
                    "user_id": "Emma Uren",
                    "user_href": "/profile/Emma-Uren-1"
                },
                {
                    "user_id": "Addy Rogers",
                    "user_href": "/profile/Addy-Rogers-1"
                },
                {
                    "user_id": "Kate King",
                    "user_href": "/profile/Kate-King-90"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Wright",
                "href": "/profile/Steve-Wright-12"
            },
            "answer_text": "I’m guessing this is a trick question. I mean, if you teach English grammar and vocabulary, sprinkle it all with a bit of trivia about roos, Peter Pan and cowboys, add a smattering of gestures, food and fashion, and then give the students a chance to express themselves using these words and ideas, then you’re teaching English, right? Or maybe not. If you demand that your students imagine that they wake up in a foreign country tomorrow with no money, no friends, and a burning desire to get home, then ask them to think of what language tools they would need, collect those ideas and then have them parrot back “My name is XXXX. I’m from Japan. Please help me. I want to go back to Japan.” Then work some more with this idea of what other useful phrases would you need (My phone number is 123–456–7890, etc., etc.) and continue with what the students think they want to learn, then you’d be teaching English, right? Maybe. Definitely maybe. Once a HS student wants to go on to higher learning, measuring how well s/he has mastered this English grammar and vocabulary is a good start in evaluating which university track s/he could handle (honors, professional, white collar, technical specialist, general education and liberal arts), and separating HS students into upper, middle, and lower academic tracks is a good idea for society. These evaluations would all include multiple choice questions and listening comprehension tests with intentional twists, a al St. Ives. (“As I was going to St. Ives, I met a man with 7 wives…”) Deeply, seriously dubious. Ask any qualified teacher in Japan, and s/he will tell you that all Japanese public schools teach math, science, social studies, music, art, calligraphy, home ec, morals, PE, English and kokugo (国語). It’s insightful that “Japanese” class is not called “Japanese” in Japan, but rather “the national (国) language (語)”. Any involved explanation of this would take hours, but the basic idea is that college entrance tests approach the 5 main subjects (math, science, social studies, English, and kokugo) as proprietary bodies of knowledge. We can agree that sine divided by cosine equals tangent, force equals mass times acceleration, and transatlantic navigation in the late 15th and early 16th century made an incalculable difference in world history. But Japanese test takers must answer English and kokugo questions as if the Japanese Ministry of Education (etc., abbreviated MEXT) had the final answers. Is the English word “making” a participle or a gerund? Is “Zen zen daijoubu?” intelligible Japanese? Do the Moomin cartoon characters come from Poland, Finland, Canada or Korea? How you answer these questions can make the difference between whether you become Prime Minister or dig ditches, quite literally. (The Moomin question actually appeared 2 years ago.) We’ve known the “guidance” of L’Académie française for over 350 years. At less than 80 years old, MEXT doesn’t show any signs of lessening its grip on English education in Japan. They decide what books you carry to and from school, what and how your teachers will teach in elementary school (ages 9 to 12), what grammar and vocabulary will appear on at least 8 tests each year during jr high and HS (ages 12 to 18), what answers on entrance tests will get you into which university, and so, by extension, whether your spouse will have to work in order for you to survive. If you agree with that what MEXT calls “English” is actually “English,” then Japanese schools teach only English. But if you suspect, as many do, that “Yes” is not necessarily preferrable to “Yes, I do,” or “Yes, I am,” or other longer answers that all begin “Yes…” then what MEXT does to “English” in Japan is deeply, seriously dubious. ",
            "date": "Answered January 10, 2020",
            "views": "184",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexandra Gulko",
                    "user_href": "/profile/Alexandra-Gulko"
                },
                {
                    "user_id": "Ben Smith (スミス ベン)",
                    "user_href": "/profile/Ben-Smith-スミス-ベン"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robyn Rishe",
                "href": "/profile/Robyn-Rishe-1"
            },
            "answer_text": "I worked in one of the US branches of a major Japanese company for many years. I worked in the office. I am purposely being cryptic here about identifying the company or what industry we were in. Suffice it to say, the company had a lot of blue collar field workers. Periodically a new manager would be transferred to our location, sometimes from one of the other US branches, sometimes directly from Japan. All those coming from Japan had studied English there for years. Some were quite communicative when they got here. Others were hopelessly inadequate. I believe their reading comprehension of English was high, but they could barely speak it, and barely understand anyone speaking it to them. One in particular was way above the norm. He understood everything said to him, and could hold up his end of the conversation equally well. He was never at a loss for words. He could even joke around in English, a test of fluency if there ever was one. The only problem was, he didn’t know where to draw the line between correctly idiomatic and unacceptably crude. Particularly since he dealt with the field staff a lot, he was exposed to a level of English that way crossed the line - and he soaked it up like a sponge. Those of us in the office sometimes had to coach him a bit, for his own good. Otherwise, he’d be cussing a blue streak without understanding that you just don’t do that in certain settings. This person came up the ranks in our office to where he was eventually the top manager at that location, I’m sure partly due to his command of English. And yet he did have that one flaw. Whether it ever got him into trouble, I don’t know, but those of us working under him did sometimes talk about it behind his back . ",
            "date": "Answered August 13, 2020",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Albert Groeneveld",
                "href": "/profile/Albert-Groeneveld-2"
            },
            "answer_text": "My daughter goes to junior high school. She has every week 1 hours English lesson.Although the quality is not high and the subjects for her age are not compared with maybe other countries, there is a significant improvement compared with other years before. Also the university entry requires a certain level of English before you can apply for the university entry examination. ",
            "date": "Answered January 9, 2020",
            "views": "58",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lesa Parker",
                    "user_href": "/profile/Lesa-Parker-4"
                }
            ]
        }
    ]
}