{
    "title": "Do teachers know that students study from YouTube? - Quora",
    "tags": [
        "Teachers",
        "Teaching"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elizabeth Knight",
                "href": "/profile/Elizabeth-Knight-4"
            },
            "answer_text": "Yes, definitely, and we even encourage it. The fact is, we want students to learn. Whatever tool they can use to accomplish that is welcomed. I have students who ask me at the beginning of each unit, “Are there any YouTube videos on this we can study?” I can usually answer that I have already put the links on their class page. I had a student last semester who would send me links every time she found a video relevant to what we were discussing. Sometimes the videos were ones I had seen, but other times they were not, and I added them to my list of videos to share. I had another student who downloaded all the videos he could while he was at school so that he could watch them at home. He would also share them with any students who wanted them. Many of my students do not have internet outside of school. Of the ones who have internet only on their phones, most are not on unlimited plans, and they aren't going to use precious data on school related videos. Having access to them offline or at school makes a difference. My students keep asking me when I am going to make YouTube videos. I tell them that my odd sense of humor is probably best left to the classroom, and there are plenty of people making better videos than I could. I will leave that to them. If students are willing to watch videos to learn, more power to them! ",
            "date": "Answered June 12, 2017",
            "views": "173",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jon Radel",
                    "user_href": "/profile/Jon-Radel"
                },
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                },
                {
                    "user_id": "Noel Walker",
                    "user_href": "/profile/Noel-Walker-18"
                },
                {
                    "user_id": "Amy E. Brown",
                    "user_href": "/profile/Amy-E-Brown-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Goffin",
                "href": "/profile/Paul-Goffin"
            },
            "answer_text": "We certainly hope they do. We show them relevant videos in lessons, we email them links to relevant videos, we put links on the school websites and VLEs. Sadly though, very few actually seem to look at them. Perhaps because as soon as they go on YouTube, they find their favourite pop stars, a play through of a stage of a game they’re having trouble with and some cat videos? ",
            "date": "Answered June 11, 2017",
            "views": "55",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elizabeth Knight",
                    "user_href": "/profile/Elizabeth-Knight-4"
                },
                {
                    "user_id": "Taylor Hall",
                    "user_href": "/profile/Taylor-Hall-19"
                },
                {
                    "user_id": "Michael Jørgensen",
                    "user_href": "/profile/Michael-Jørgensen-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Reyto",
                "href": "/profile/Martin-Reyto"
            },
            "answer_text": "Definitely. Why, when I taught a popular course called “Stupid Shit Done by Pets,” practically the whole supplemental reference list consisted of links to YouTube videos. Another student favourite was “Is Aliens Exists?” The course title was inspired by (ok, stolen verbatim from) a Quora question by someone who obviously didn’t do the prerequisite YouTube research. ",
            "date": "Answered June 11, 2017",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "LaVonne Davis-Schenck",
                "href": "/profile/LaVonne-Davis-Schenck"
            },
            "answer_text": "My school actively encourages studying through Youtube. There are many ways to help people learn things. Youtube doesn’t lose its patience or get offended if you switch to a different video. Any honest effort that helps a student learm is a good thing. ",
            "date": "Answered June 11, 2017",
            "views": "77",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jonathan Polley",
                "href": "/profile/Jonathan-Polley"
            },
            "answer_text": "Yes, There is lots of good content on Youtube (I put some on there myself, I also put it on my own website so that it can be easily categorised and students can follow a logical learning pathway) However, there is also lots of bad content. Sometimes it is difficult for a student to distinguish the bad from the good, plus it is very easy to become distracted on Youtube. ",
            "date": "Answered June 15, 2017",
            "views": "79",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Taylor Hall",
                "href": "/profile/Taylor-Hall-19"
            },
            "answer_text": "I sent Youtube study videos to my students before their math exam. I filmed myself teaching some of them. Yes, we know students study from Youtube. We wish they studied from it more! ",
            "date": "Answered June 11, 2017",
            "views": "88",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mathew Lodge",
                    "user_href": "/profile/Mathew-Lodge"
                },
                {
                    "user_id": "Elizabeth Knight",
                    "user_href": "/profile/Elizabeth-Knight-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jacke Rose",
                "href": "/profile/Jacke-Rose"
            },
            "answer_text": "And we also recommend Khan Academy for certain topics. The advantage of computer learning is that the learner can hit repeat for any number of times until understanding is created. We all get to learn at our own speed. However, nothing totally replaces a live teacher from whom you can get specific answers to your questions. ",
            "date": "Answered June 12, 2017",
            "views": "16",
            "upvotes": "0"
        }
    ]
}