{
    "title": "Do teachers think of students that submit their assignments early differently than they think of students that submit their assignments on time? - Quora",
    "tags": [
        "Academic Assignments",
        "Homework",
        "Teachers",
        "Teaching",
        "Students"
    ],
    "response": [
        {
            "author_info": {
                "name": "Damon Resnick",
                "href": "/profile/Damon-Resnick"
            },
            "answer_text": "Sure, most teachers probably do. There are few reaons someone might submit an assignment early. They are very organized and plan ahead.They are a very busy person and want to get ahead so they can move on to something else.They are bored and have nothing better to do.They don't really take it seriously and hurriedly finish it and submit it to get it over and done with.Now two of these reasons are good, one is neutral, and the last is bad. None of these is really bad however. Now someone may also have a combination of these reasons. So my guess is that for the most part teachers think better of students that submit assignments early, but reserve judgement a bit because the reasons may not be all the best. My personal opinion as a professor and teaching assistant has always been that it is better to start assignments early and even if you finish them early to then wait and go back and make sure the assignment is good before turning it in. This could mean finishing an assignment several days before it is due, then spending a bit of time every day making sure it is done right and they why you want it. Sometimes it is good to even make major changes because you did something wrong or you had a much better idea of how to do it. So when I see an early assignment it means to me that the student probably did not really put anything extra into the assignment. They probably took it seriously but not appreciate the assignment for why it was really assigned. To me, early means the student wanted to get it done and out of the way and didn't want to put extra work into it. This is fine, but it is not the best. If you are looking for advise I would say that you start early, finish the assignment when you can, and then turn it in on time. However if you want to make extra points with the instructor just ask them what they think. Tell them you like to start assignments early and you sometimes finish them early. Would they be ok with you turning it in early. ",
            "date": "Answered April 8, 2019",
            "views": "683",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Martin Reyto",
                "href": "/profile/Martin-Reyto"
            },
            "answer_text": "From a teacher’s point of view, it’s just a point of convenience. It’s easier to collect all the assignments at the same time, on the due date. But it’s not a huge deal. When I got one early, I just kept it in a file folder until I had the whole stack, and then I graded them all together. Doing it that way gave me a better picture of how the whole class was doing. When I was a student, I submitted stuff early when I knew I wouldn’t be able to submit on the due date because of a necessary absence. Then I submitted it with an explanation. It was never a problem. The rest of the time, I preferred to hold on to the assignments until it was time. With essays, I used the time to rethink and revise, or at least liked to keep the possibility open. There were probably times when I submitted early just to get the thing off my mind. ",
            "date": "Answered April 8, 2019",
            "views": "272",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joseph Kunkel",
                "href": "/profile/Joseph-Kunkel-1"
            },
            "answer_text": "I never appreciated students passing in assignments early. I always had enough to do that asking me to deal with an assignment I did not expect from the whole class until later was a bother. If it was a physical paper I would possibly lose it before the bulk of that assignment came in and I had a folder for it prepared. Similarly if it was a digital assignment that needed my care with the file on my computer. It is almost as bad as handing in the assignment late. I would also think that the early submission had not dealt with the question thoroughly enough. What student has the luxury of passing in an assignment early? Promptly on time is best. Marginally late is OK. Way late is bad. Early … what do I do with it? ",
            "date": "Answered April 8, 2019",
            "views": "293",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Evelyn Metzger",
                    "user_href": "/profile/Evelyn-Metzger-1"
                },
                {
                    "user_id": "Jeff Verkouille",
                    "user_href": "/profile/Jeff-Verkouille"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Auerbach",
                "href": "/profile/Ron-Auerbach-2"
            },
            "answer_text": "Some teachers may have different feelings. For example, the belief that the one who turned it in ahead of time is more organized. Or this person is rushing it by not double-checking or using the remaining time to make it even better. We also have teachers out there who view those students who turn things in early vs those who do it on time as being exactly the same. Personally, I don’t look at students differently. As long as they’re turning the assignment in by the deadline, it’s their choice exactly when they want to do it. ",
            "date": "Answered March 23, 2020",
            "views": "160",
            "upvotes": "0"
        }
    ]
}