{
    "title": "Do you remember who your first childhood friend was? - Quora",
    "tags": [
        "Childhood Friendships",
        "Childhood",
        "Friendship"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rehan Kane",
                "href": "/profile/Rehan-Kane"
            },
            "answer_text": "Yes we were friends for many years! Our parents knew each other from Pakistan (I think) and he and I spent time in the same neighbourhood in a town in Oxfordshire. We were best friends and he was only a year younger than me. I don't remember the early days of our friendship but we always had a great time playing and enjoying. We went to each other's houses and we had common family friendship groups so often when we went to someone else's house he would be there. I moved away to the North West when I was four or five. I didn't worry much as we would keep meeting again. When we grew a little older we met and enjoyed a lot. We both had a love for planes and our dream jobs were to become pilots flying with each other (innocence of childhood). We would often pretend to fly planes with routes and made innovative and creative ideas for problems if we were on Ames in real life. Before meeting I got so excited seeing that guy. He was my best friend from as far as I can remember and his company was the best. He came to my birthday parties, had fun with me and I remember there was an older kid who was also our friend. We dug a hole in the garden to booby trap her ;P. Of course that failed as the hole was too shallow and we were caught xD. Me, him and his brothers made a friendship handshake and always said “We are best friends for ever!” When I turned around eight we both moved away. We always kept touch with facetime (yes I know I was stupid enough to like Apple at the time). He ended up in Doha and my dad got jobs in different places so we came along wherever we went. At one point I ended up in Abu Dhabi. He met us (finally!) and it was great. We said daft things, played with each other, made stupid videos, hiked up Jebel Hafeet together and so much more! I then met him in Doha a few months later before leaving Abu Dhabi. We had a routine of playing 'planes'. We hardly played on electronics with each other (just a couple of times) as his father always encouraged us to play without them. At the time I couldn't understand why and I was annoyed but now I realize he was right and I thank him for limiting electronic use between us! For a few months we kept talking to each other on facetime. He often played stupid pranks on me and me being innocent and naïve then always fell for them :P. Our talks got less and less to the point we never talked at all. I always thought about him and always asked my mum when will he come to England again. She of course most of the times didn't have the answer. I was the type of guy to keep friendships and was a very sincere friend (I still am). In Ramadan 2016 I got a chance to see him in Birmingham when he was visiting UK. I was so happy! We talked forever and I was overjoyed. We talked about our memories. Writing this now I remember that was the same restaurant we met in when years ago we got scolded by the staff by running around :P. After that I told him to keep in touch. He left for Qatar and never did. In 2017 I heard he was coming for Eid and I was excited. However they were going to come to visit us but cancelled the plan because they were busy having fun at their friends' house. I asked my mum when will we see them. She just told me these words which I will never forget (in rough wording). “Beta (son) I know you are a very faithful and sincere friend however not everyone is like that. Some people just move on in life. When you meet someone then meet them nicely but don't ask them why didn't they keep in touch or why did you forget us. We just have to move on.” I then moved on. I accepted the fact that people come and go and I never bothered speaking to him. You are probably asking yourself what I feel about him right now… I remember him a lot. Of course he was my first friend. We spent a lot of our time together. I often wonder how he is and if he still remembers me or not. Sometimes I feel the urge and try and contact him however I resist it and I don't. I never contacted him. In a way I feel a slight resentment towards him because we lost contact and it felt like he didn't remember me. However I don't want to be angry at him without knowing his side of the story at the same time. I don't plan on talking to him right now but I would love to meet him if given the chance and I will follow my mum's advice. If we get to meet I will just meet him nicely. If he doesn't stay in touch I wouldn't do anything. Now we are in our teenage years and are probably busy in our own lives. I learnt that people come and go. Not everyone stays forever. Not everyone takes the same efforts to keep a friendship. I kind of lost other friendships in this way too. Not to the same extent. I also remember them and feel a little resentment but I don't think anyone should be blamed. Everyone has their own lives and are busy (me included). I was a content person as a child with a good friendship group. However now I'm usually in my own company in everything I do if I'm not with family. I go out alone, eat out alone and explore alone. I'm not sad of being lonely. I just feel used to it now that it doesn't bother me although Alhamdulillah I still have a couple of great friends (who sadly live far away). So I don't get to see them that often but we do tie up! I really wish him well and I hope he is happy wherever he is. ",
            "date": "Answered October 18, 2018",
            "views": "22",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nazia Abdul",
                    "user_href": "/profile/Nazia-Abdul"
                },
                {
                    "user_id": "Fatima Yaqoob",
                    "user_href": "/profile/Fatima-Yaqoob-4"
                },
                {
                    "user_id": "Aleena Akhtar",
                    "user_href": "/profile/Aleena-Akhtar"
                },
                {
                    "user_id": "Suprativ Sinha (ଶୁପ୍ରତିଭ ସିଂହ)",
                    "user_href": "/profile/Suprativ-Sinha-ଶୁପ୍ରତିଭ-ସିଂହ"
                },
                {
                    "user_id": "Sayed Seemab Zehra",
                    "user_href": "/profile/Sayed-Seemab-Zehra"
                },
                {
                    "user_id": "Abdullah Khan",
                    "user_href": "/profile/Abdullah-Khan-1200"
                },
                {
                    "user_id": "Hina Khan",
                    "user_href": "/profile/Hina-Khan-540"
                },
                {
                    "user_id": "Azzan Ullah",
                    "user_href": "/profile/Azzan-Ullah"
                },
                {
                    "user_id": "Arfa Khan",
                    "user_href": "/profile/Arfa-Khan-24"
                },
                {
                    "user_id": "Autumn Hardy",
                    "user_href": "/profile/Autumn-Hardy-10"
                },
                {
                    "user_id": "Ārtatrāṇa Paṭnāik (ଆର୍ତ୍ତତ୍ରାଣ ପଟ୍ଟନାୟକ)",
                    "user_href": "/profile/Ārtatrāṇa-Paṭnāik-ଆର୍ତ୍ତତ୍ରାଣ-ପଟ୍ଟନାୟକ"
                },
                {
                    "user_id": "Maryam Popal",
                    "user_href": "/profile/Maryam-Popal-3"
                },
                {
                    "user_id": "Aradhna Singh",
                    "user_href": "/profile/Aradhna-Singh-11"
                },
                {
                    "user_id": "Nazia Ghilzai",
                    "user_href": "/profile/Nazia-Ghilzai"
                },
                {
                    "user_id": "Rayyan Ali",
                    "user_href": "/profile/Rayyan-Ali-18"
                },
                {
                    "user_id": "Qumber Ali Tariq",
                    "user_href": "/profile/Qumber-Ali-Tariq-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Debjyoti Saren",
                "href": "/profile/Debjyoti-Saren"
            },
            "answer_text": "Dear Neil, From the day we began kindergarten to our high school graduation, you were always by my side. From the moment we met at the bottom of the slide on our first day of school, I knew we were destined to be best friends. Most of my childhood memories were with you. We played the same sports in grade school, and had the same hobbies. We would always find a way to hang out as much as possible. If we weren’t hanging out, you could find us on our house phones talking away for hours. The older we got, the more we became different people. Our interests changed, our styles evolved, and we both chose completely different high schools. Even throughout the changes life brought to each of us, we were still the best of friends. My favourite part about having you in my life for so many years is that I never needed to explain something to you. You knew everything that had happened in my life and I knew everything that had happened in yours. We had watched each other grow and battle different challenges. Whenever I mention a topic, you knew exactly what I’m talking about. I love how we never needed reassurance of our friendship. We may not constantly talk, but I knew you’re always my #1. I was your biggest fan, and I knew you’re mine too. We loved to see each other succeed, but we were still there as a shoulder to cry on when something failed. The beauty of our friendship was that I was never scared to tell you how I was feeling. Although our lives had carried us in two separate paths, I know you were just a phone call away. And of course, it would always have been that way. I couldn’t wait to continue to watch each other at every stage of life. You were my best friend, but you were also in many ways my soul mate. Thank you for being there through it all. It could have continued like this, only if hadn’t boarded the MH370 Yours brofully, your “CHILDHOOD BEST FRIEND” ",
            "date": "Answered October 13, 2018",
            "views": "618",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mahnoor Khan",
                    "user_href": "/profile/Mahnoor-Khan-123"
                },
                {
                    "user_id": "Joydeep Saha",
                    "user_href": "/profile/Joydeep-Saha-14"
                },
                {
                    "user_id": "Sita Khairwar",
                    "user_href": "/profile/Sita-Khairwar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maithili Patange",
                "href": "/profile/Maithili-Patange"
            },
            "answer_text": "Lumos… Yes I do remember her and we are still friends. But then its not the same. She was in the same colony I was. Her house was exact infront of my house we were just seperated by a banyan tree. We could see each other if we came outside our front doors. We were inseparable. And the plus point? We were of same age. So we would discuss studies, play, talk and roam around together. She was always there for me. I was always there for her. We both used to stay at each others house the whole day until our moms would call for us. But then we grew up. I don't know why but she started to act kinda weird. Like, she would suddenly stop talking to me and would talk to me after three four days. I didn't ask her even once that what was wrong with her. She even sometimes used to compare marks. Her family was also a bit orthodox. They wanted a boy but they got both girls. Her dad was not a social man. He used to stay very aloof. Her mother was sweet. One day my mom told me that her mom was suffering from depression because of this whole ‘we want a boy thing’. And thats why maybe my friend got a complex. She bacame very shy. I mean she was an introvert already, but now she started to stay in her house, she stopped talking to people, she would get conscious while passing infront of boys. I felt bad for her. So I just decided to talk to her. But I guess that was my mistake. She took me wrong and said that she knows it and that its not a big deal. She didn't talk to me for a week after that I was angry at first but I thought about it when my mom made me understand. So she as usual talked to me after a week or something. I was not angry on her. But then she would never share her problems with me even if I asked. I stopped eventually. We got into different cities after that for studies. We used to talk only when we came to our place for holidays. And its the same now also. But yes she's still my friend and we still talk. Its just that she's not the same anymore. Nox… ",
            "date": "Updated October 15, 2018",
            "views": "746",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditya Mishra",
                    "user_href": "/profile/Aditya-Mishra-528"
                },
                {
                    "user_id": "Melbin Alexander",
                    "user_href": "/profile/Melbin-Alexander"
                },
                {
                    "user_id": "Abhishek Jagtap",
                    "user_href": "/profile/Abhishek-Jagtap-36"
                },
                {
                    "user_id": "Koushal Sharma",
                    "user_href": "/profile/Koushal-Sharma-11"
                },
                {
                    "user_id": "Faisal Pathan",
                    "user_href": "/profile/Faisal-Pathan-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Asad Zuberi",
                "href": "/profile/Asad-Zuberi-1"
            },
            "answer_text": "His name was Rishabh. I clearly remember this incident in school. Baby Asad was taught by parents, “People who help other people are the best kind of people.” I still have a faint memory of it. It was my second or third day of school and my school had a marble slide in the middle of the playground. I was walking around, giving silly looks to ones who were crying because I always enjoyed going to school, my mom has told me that I never cried while going to school. I would rather cry after coming back because I loved to be around children. A girl used to call me just half an hour after coming home. Her mom used to call us basically on our landline because she used to cry and miss me. Huh. Such a player I was. That's another story. Coming back to it. I was walking around when I saw this slide. This slide had stairs to climb on and three slides in different directions with variable shapes, one straight and two other were curled. I climbed up and slid down. Wooo. Fun. It would look so cool if I climb up not using stairs but from the slide side, I thought to myself. But children wouldn't stop sliding. So I waited and waited. Rishabh got it. He climbed from the stairs side, and stopped children from sliding so that I can climb up. “Aa jaa,” (Come on) he said. That's when I got my first friend. People who make me look cool are good people. I still follow this rule. ",
            "date": "Answered October 14, 2018",
            "views": "9",
            "upvotes": " View 496 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kriti Joshii",
                    "user_href": "/profile/Kriti-Joshii"
                },
                {
                    "user_id": "Bhavani Samudrala",
                    "user_href": "/profile/Bhavani-Samudrala"
                },
                {
                    "user_id": "Aroma Thakur",
                    "user_href": "/profile/Aroma-Thakur-1"
                },
                {
                    "user_id": "Lincy Mathews",
                    "user_href": "/profile/Lincy-Mathews-1"
                },
                {
                    "user_id": "Jyoshna Patnaik",
                    "user_href": "/profile/Jyoshna-Patnaik-1"
                },
                {
                    "user_id": "Krushna Mohapatra",
                    "user_href": "/profile/Krushna-Mohapatra-13"
                },
                {
                    "user_id": "Shreya Hembrom",
                    "user_href": "/profile/Shreya-Hembrom-1"
                },
                {
                    "user_id": "Parth Bhardwaj",
                    "user_href": "/profile/Parth-Bhardwaj-37"
                },
                {
                    "user_id": "Piyushi Doshi",
                    "user_href": "/profile/Piyushi-Doshi"
                },
                {
                    "user_id": "Ritik Nayak",
                    "user_href": "/profile/Ritik-Nayak-2"
                },
                {
                    "user_id": "Shantanu Singh",
                    "user_href": "/profile/Shantanu-Singh-311"
                },
                {
                    "user_id": "Shreyasi Patil",
                    "user_href": "/profile/Shreyasi-Patil-2"
                },
                {
                    "user_id": "Ahqlaam Essack-Bhayat",
                    "user_href": "/profile/Ahqlaam-Essack-Bhayat"
                },
                {
                    "user_id": "Jess",
                    "user_href": "/profile/Jess-1330"
                },
                {
                    "user_id": "Shalini Singh",
                    "user_href": "/profile/Shalini-Singh-794"
                },
                {
                    "user_id": "Sushma Nandankar",
                    "user_href": "/profile/Sushma-Nandankar-1"
                },
                {
                    "user_id": "Sakshi Semwal",
                    "user_href": "/profile/Sakshi-Semwal"
                },
                {
                    "user_id": "Rishabh Tiwari",
                    "user_href": "/profile/Rishabh-Tiwari-29"
                },
                {
                    "user_id": "Aparajita",
                    "user_href": "/profile/Aparajita-13"
                },
                {
                    "user_id": "Anamika Mishra",
                    "user_href": "/profile/Anamika-Mishra-42"
                },
                {
                    "user_id": "Nitya Shrivastav",
                    "user_href": "/profile/Nitya-Shrivastav-2"
                },
                {
                    "user_id": "Surav Mondal",
                    "user_href": "/profile/Surav-Mondal"
                },
                {
                    "user_id": "Krishna KrishnaPrasad",
                    "user_href": "/profile/Krishna-KrishnaPrasad"
                },
                {
                    "user_id": "Destiny Walker",
                    "user_href": "/profile/Destiny-Walker-41"
                },
                {
                    "user_id": "Sanket Chilka",
                    "user_href": "/profile/Sanket-Chilka"
                },
                {
                    "user_id": "S M Dowla",
                    "user_href": "/profile/S-M-Dowla"
                },
                {
                    "user_id": "Parimal Saraf",
                    "user_href": "/profile/Parimal-Saraf-1"
                },
                {
                    "user_id": "Ishita Saxena",
                    "user_href": "/profile/Ishita-Saxena-26"
                },
                {
                    "user_id": "Divyanshi",
                    "user_href": "/profile/Divyanshi-14"
                },
                {
                    "user_id": "Srividya Vojhala",
                    "user_href": "/profile/Srividya-Vojhala"
                },
                {
                    "user_id": "Susrika Majety",
                    "user_href": "/profile/Susrika-Majety"
                },
                {
                    "user_id": "Meghna Chawla",
                    "user_href": "/profile/Meghna-Chawla-5"
                },
                {
                    "user_id": "Diksha Sanoriya",
                    "user_href": "/profile/Diksha-Sanoriya"
                },
                {
                    "user_id": "Sai",
                    "user_href": "/profile/Sai-756"
                },
                {
                    "user_id": "Suman Rodrigues",
                    "user_href": "/profile/Suman-Rodrigues"
                },
                {
                    "user_id": "Gunjan Gupta",
                    "user_href": "/profile/Gunjan-Gupta-207"
                },
                {
                    "user_id": "Shravya Vairavanathan",
                    "user_href": "/profile/Shravya-Vairavanathan"
                },
                {
                    "user_id": "Shivani Patel",
                    "user_href": "/profile/Shivani-Patel-367"
                },
                {
                    "user_id": "Kunal",
                    "user_href": "/profile/Kunal-225"
                },
                {
                    "user_id": "Reeth Mishra",
                    "user_href": "/profile/Reeth-Mishra"
                },
                {
                    "user_id": "Divya",
                    "user_href": "/profile/Divya-86"
                },
                {
                    "user_id": "Rithika Nethi",
                    "user_href": "/profile/Rithika-Nethi"
                },
                {
                    "user_id": "Gaurang Kedia",
                    "user_href": "/profile/Gaurang-Kedia-1"
                },
                {
                    "user_id": "Meena Sree",
                    "user_href": "/profile/Meena-Sree-7"
                },
                {
                    "user_id": "Aditi Prasad",
                    "user_href": "/profile/Aditi-Prasad-59"
                },
                {
                    "user_id": "Chetana Mistry",
                    "user_href": "/profile/Chetana-Mistry"
                },
                {
                    "user_id": "Lipi Srivastava",
                    "user_href": "/profile/Lipi-Srivastava"
                },
                {
                    "user_id": "Sourabh Prajapat",
                    "user_href": "/profile/Sourabh-Prajapat"
                },
                {
                    "user_id": "PandiAnandhi J",
                    "user_href": "/profile/PandiAnandhi-J"
                },
                {
                    "user_id": "Shubhangi Jha",
                    "user_href": "/profile/Shubhangi-Jha-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Albina Griniute",
                "href": "/profile/Albina-Griniute"
            },
            "answer_text": "My family lived in an apartment on the 8th floor. My best friend and her family lived directly above us, on the 9th. She and I were classmates, and our sisters, who are 3 years younger, were best friends and classmates too. Before becoming classmates, we were kindergarten-mates. When we were 3, my best friend and I were left unsupervised in a room at home for a little while, and in that short time we managed to give each other super chic pixie haircuts. Fast forward a few years. I never liked to play with dolls as a kid and prefered to “invent” stuff using various things lying around in my dad’s garage. At some point I mentioned to my best friend that I didn’t know how to play with dolls. One evening she knocked on my door. I opened it, and there she was, holding her most beautiful doll in a red polka dot dress. Here, this is yours now, she said, giving me the doll, so you can learn how to play with dolls. I never did. At around 12 we discovered the art of baking and used to bake a cake together at least once a week. Then, to make it more interesting, we started putting various little things in the dough, like silver rings or other small pieces of jewelry, to be found when eating the cake. A sort of culinary treasure hunting. It never occured to us that it was a choking hazard. Thankfully, nobody choked on our little “surprises”, probably because we ate most of the cakes ourselves. We used to visit each other climbing the fire escape ladder that was going through our balconies rather than using the door like normal people. One time, my friend accidentally dropped a big and heavy box through the fire escape door, right on top of my head, and almost cracked my skull. Yeah, we spent our whole childhood together. Later she went to live abroad and we drifted apart, but our sisters both still live in the same city and are close friends. ",
            "date": "Answered October 14, 2018",
            "views": "567",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeff Reed",
                    "user_href": "/profile/Jeff-Reed-148"
                },
                {
                    "user_id": "Donna DeLisle",
                    "user_href": "/profile/Donna-DeLisle"
                },
                {
                    "user_id": "Greg Read",
                    "user_href": "/profile/Greg-Read-4"
                },
                {
                    "user_id": "Anders Kouru",
                    "user_href": "/profile/Anders-Kouru"
                },
                {
                    "user_id": "Paul Barends",
                    "user_href": "/profile/Paul-Barends"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reshikaa Sekhar",
                "href": "/profile/Reshikaa-Sekhar"
            },
            "answer_text": "I do very much ! Twenty one years down the lane back in my kindergarten days there was this cute, chubby and innocent girl seated two seats away from mine. I wonder, how the whole scenario is etched in my mind.I did make a lot of friends there after but I hardly remember from where did I start with them. Back to the story ! This girl was fidgeting with her pencil box and took out two colour pencils. All the while, I was curiously looking at her. She turned towards me and handed over one of her colour pencil. Happily I received it and we exchanged smiles. There it started ! There wasn’t any end to it. A few days later our parents happened to be good friends too.The best part was we resided in the same street back then. As we grew older, during our teen days, it so happened that people commented that we look alike more like twins.There have been situations where my class teachers have confused between the two of us. We don’t converse every single day, we hardly meet once in few months but still she is irreplaceable. This is us on my birthday this year !  ",
            "date": "Answered October 23, 2018",
            "views": "532",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nakul Sethuram",
                    "user_href": "/profile/Nakul-Sethuram"
                },
                {
                    "user_id": "Rajagopalan Jagadeesan (ராஜகோபாலன்)",
                    "user_href": "/profile/Rajagopalan-Jagadeesan-ராஜகோபாலன்"
                },
                {
                    "user_id": "Sankar Udaiyar",
                    "user_href": "/profile/Sankar-Udaiyar"
                },
                {
                    "user_id": "Abdul Samad",
                    "user_href": "/profile/Abdul-Samad-1555"
                },
                {
                    "user_id": "Vishal Kaul",
                    "user_href": "/profile/Vishal-Kaul-25"
                },
                {
                    "user_id": "Deepak Tiwari",
                    "user_href": "/profile/Deepak-Tiwari-763"
                },
                {
                    "user_id": "Tanuj Maharwal",
                    "user_href": "/profile/Tanuj-Maharwal"
                },
                {
                    "user_id": "P Santhosh Kumar",
                    "user_href": "/profile/P-Santhosh-Kumar-3"
                },
                {
                    "user_id": "Dinesh Jain",
                    "user_href": "/profile/Dinesh-Jain-477"
                },
                {
                    "user_id": "Jayasudha Palanivel",
                    "user_href": "/profile/Jayasudha-Palanivel"
                },
                {
                    "user_id": "Dhilip Kumar",
                    "user_href": "/profile/Dhilip-Kumar-166"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarthak Chatterjee",
                "href": "/profile/Sarthak-Chatterjee"
            },
            "answer_text": "Naveen Juneja. We were in the same class since kindergarten days. He was the best in class - topped in academics, good hold over English language ( those days we used to give more importance to peers who had a good command over the British language) and had good writing skills. Those kids who knew how to convert silica to gold types. There's a catch though. He was the best in class; no doubt about that but in reality we did not so much share a relationship which you can call as “friends”. He was my friend, but I didn't exist in front of him. I was a total introvert. And I don't know if it happens with others but back then I used to imagine a part of my life in my mind like it exists. Like it happened in reality. those scenarios which you wonder off but never actually put in execution - asking your crush out, befriending the best student in class - the works. I was good in my class but not Naveen. He was the best. This one sided friendship went on for about a decade i guess. He used to be the reference point for me to be perfect which I thought I could never be; that is why this yearn for recognition in front of him I guess My infatuation broke when I beat him up in a English essay writing completion in class 7th. I came first. That was the first time I ever said I believe in myself in front of the mirror and believed it for that matter. I could still not beat the best but at least make them perspire when in the ring against them. That is all it took back then. ",
            "date": "Answered October 15, 2018",
            "views": "552",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "WorkKey",
                    "user_href": "/profile/WorkKey"
                },
                {
                    "user_id": "Gun Nidhi Dalmia",
                    "user_href": "/profile/Gun-Nidhi-Dalmia"
                },
                {
                    "user_id": "Sita Khairwar",
                    "user_href": "/profile/Sita-Khairwar-1"
                },
                {
                    "user_id": "Niti Jain",
                    "user_href": "/profile/Niti-Jain-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kaiden Steichen",
                "href": "/profile/Kaiden-Steichen"
            },
            "answer_text": "Preschool was rough. I was that one kid who everyone avoided. I still never found out why. I wasn’t bratty or pushy, I was just shy. So my first friend was probably this girl named Lily. She was cool back then. We played on a soccer team together, we would always play tag during recess and get in trouble but we didn’t care, and we would do swing competitions to see who could swing the highest. One time this girl named Camryn joined us on the swings and we all didn’t have our jackets on because it was 65 degrees out. We got yelled at by the teachers on duty because we didn’t have our jackets on. But seriously it was 65 degrees out and it felt like 70. So we had to go back in and grab our jackets from our cubbies. Yeah, we had some fun times back then. Now Lily is this super popular girl and doesn’t even care to even acknowledge me anymore. How the tables have turned. ",
            "date": "Answered June 8, 2020",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sita Khairwar",
                "href": "/profile/Sita-Khairwar-1"
            },
            "answer_text": "Yes he was my KG friend Swami.I remember him because he was one boy who was with me when nobody wanted to be my friend in KG class. Actually I belong to a middle class little educated family. I am the eldest child of my parents. My parents had to leave their village home and shift in semi city place due to my father's service. My parents are so simple and not able to face outside people .they don't know how to communicate with people .I am also a simple person . Before joining to school I had learned all things KG subjects course with the help of my parents. My parents studied only 5 or 6 th grade. When I entered in class on first day ,no one wanted to talk with me. I wanted to become their friend but they were staring at me very strange manner. I felt very low, don't know what's the problem with them.But there was a boy don't know why but he saw me and held my hand and said “sit here with him\".I was amazed how selfless he was.Now we were become the best friend. I used to play with him,to study and to have fun . No body wanted my friend may be I was not fit in their type of person because I look too dark among them.Swami also had dark skin tone like me. I don't know where is he living now days but still he is in my heart. Miss you Swami ",
            "date": "Answered October 15, 2018",
            "views": "486",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "S. Mitra",
                    "user_href": "/profile/S-Mitra-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anmol Jain",
                "href": "/profile/Anmol-Jain-81"
            },
            "answer_text": "A cute little girl with short hairs although I don't even like it now, Geek from the face but devil full of pranks, A well-dressed beauty may be the only one who looks like a doll in school uniform. The girl who hates her lunch so exchanged it from mine, Even the water bottle too because mine was pink  These all can make it to a good love at first sight childhood romance web series but not in my case because I didn't even know what's her last name was, where she stays or anything like that and if don't know things like that all of your social media skills ditch you a big time well, no issues she is there in memories and search list of mine. Yes, she the one who loves dairy milk a lot and I think we were friends because of that as my father hold's agency of it. Anyways you might be wondering about her name so let's call her “Cadbury”…… ",
            "date": "Answered October 28, 2018",
            "views": "198",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Saurabh Anad",
                    "user_href": "/profile/Saurabh-Anad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhinav Upendra",
                "href": "/profile/Abhinav-Upendra"
            },
            "answer_text": "Yeah, I still remember her. Well I only have a fragile memory of the childhood “her” . It was easy back in pre kindergarten when I have the first memory of her. She was the daughter of my mom’s best friend and a relative. Well I had to move to another stater that year (2003) due to some issues and hadn't seen her until last year. I didn't talk to her, which I regret later. ",
            "date": "Answered October 14, 2018",
            "views": "336",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sri Harish",
                    "user_href": "/profile/Sri-Harish-42"
                },
                {
                    "user_id": "Razia Hassan",
                    "user_href": "/profile/Razia-Hassan-9"
                },
                {
                    "user_id": "Ani Rudh",
                    "user_href": "/profile/Ani-Rudh-44"
                },
                {
                    "user_id": "Arunima",
                    "user_href": "/profile/Arunima-42"
                },
                {
                    "user_id": "Amith Adoor",
                    "user_href": "/profile/Amith-Adoor-1"
                },
                {
                    "user_id": "Sanu Sinha",
                    "user_href": "/profile/Sanu-Sinha-12"
                },
                {
                    "user_id": "Hoomam Gove",
                    "user_href": "/profile/Hoomam-Gove"
                },
                {
                    "user_id": "Harshit Madan",
                    "user_href": "/profile/Harshit-Madan-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prabhu Kalyan",
                "href": "/profile/Prabhu-Kalyan-6"
            },
            "answer_text": "Yes his name is Sameer and Bhupendra.As my father is a teacher and staying far away from our home town . sameer father is jamindar and he has a lot land in his village. My father has good fame in locallity so his father give a house for free of cost and convince my father to teach there children . He has three daughter and one son they study in that school where my dad is a teacher . I suppose to called him nani(sister). People called us as trimurty we study,roam,play,swim,travel.13 Years of friendship and still counting….may be life long it will continue. THANK YOU ",
            "date": "Answered October 15, 2018",
            "views": "145",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ridhi Chaudhary",
                    "user_href": "/profile/Ridhi-Chaudhary-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Durcan",
                "href": "/profile/Michael-Durcan-1"
            },
            "answer_text": "I hadn’t thought about my first childhood friend for many years until I recently found out about his premature death. My recollections of our childhood adventures are recounted here: Musings on Hearing of the Death of a Childhood Friend. ",
            "date": "Answered September 18, 2019",
            "views": "93",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elsa Kristian",
                    "user_href": "/profile/Elsa-Kristian"
                },
                {
                    "user_id": "Karen Carmichael",
                    "user_href": "/profile/Karen-Carmichael-7"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Kat-Said-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Darsha Sorokhaibam",
                "href": "/profile/Darsha-Sorokhaibam"
            },
            "answer_text": "As far as I can recall , it was/is a boy , Ayush. Dad’s colleague’s son. Back in Siliguri I guess, where he used to come over or I used to go over to his house. Now I think his dad is posted in Allahbad or some place . Not the same friends as we were before because we hardly met after I guess the first grade. Ah, sweet. ",
            "date": "Answered October 14, 2018",
            "views": "140",
            "upvotes": "0"
        }
    ]
}