{
    "title": "Do you remember any of your elementary school teachers? What is your earliest memory? - Quora",
    "tags": [
        "Childhood Memories",
        "Childhood",
        "Memories",
        "Memory (information storage)",
        "Human Memory",
        "Teachers",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michele Shipley Klika",
                "href": "/profile/Michele-Shipley-Klika"
            },
            "answer_text": "I remember the entire collection of my elementary school teachers, first through fourth grades (1968–1971), even my gym teacher, Mr. Morningstar, (what a great name for this fine teacher) and my art teacher, Miss Sarles. Earliest memories of them are a swirl of impressions. I definitely do not remember such things as the first day of class or specific things that they said but I have not lost the sound of their voices. As far as I know, all of my elementary teachers are still living, except for Mrs. Robertson. She died a bit more than a decade ago at the age of 79. My first-grade teacher was Mrs. Hall, the wife of a pastor. She was not so tall and was a little on the plump side. Her hair was dark, not quite shoulder-length, coiffed in a mild bouffant style. She was maybe around 30 years old. She was always smiling and cheerful. She taught us to read and write. What a huge impact our first-grade teachers have on us because they teach us to read. I only got in trouble once by Mrs. Hall, that I remember … for talking. She made Marsha M. and me, the two guilty parties, stay in during recess as a punishment. We spent that time coloring. The incarceration turned out to be more of a reward than a punishment, but I was more careful after that not to be disruptive during a lesson. Mrs. Hall was the teacher my twin sister and I played the twins-fool-the-teacher trick on. Michele Shipley Klika's answer to Have you ever switched places with your identical twin? If I remember correctly, Mrs. Hall took a leave from teaching after our year because she was pregnant. Perhaps that was the reason for her roundness. In any case, she was a excellent person to have as a first-grade teacher and she will always have a warm place in my heart.  Photo of Grade 1 school photo owned by Michele Shipley Klika My second-grade teacher was the wonderful Mrs. Smith, also the wife of a pastor. She was not tall, quite slim, with very short dark hair and dark-framed, dark-rimmed glasses. She was exceptionally kind and caring. I loved her calm and steady voice and quiet, but strong way of dealing with problems. She was my hero. When she moved away to Cuyahoga Falls, Ohio, after the end of that school year, I made sure I got her address. We exchanged letters for many years but we eventually stopped corresponding and I lost track of her. What a shame. I have tried finding her while putting this post together and have come up empty.  Photo of Grade 2 class photo owned by Michele Shipley Klika Mrs. Robertson was my third-grade teacher and the oldest of all the elementary school teachers I had. She was around 42 years old and peppy. The biggest memory I have from that year is Mrs. Robertson standing in front of the classroom with her voice that was distinctive, and explaining something to us. She used to put her index finger up to emphasize what she was saying. She had dark hair, styled in a typical fashion of the day for a woman born in the late 1920s, and dark-rimmed glasses. Tragedy befell her home a few years after my year spent in her class. Her husband, a bus driver, did not see a student crossing in front of the bus and accidentally ran over and killed the pupil. My parents used to comment that the Robertsons never got over that misfortune. Mrs. Robertson belonged to my mom’s homemaker club so I often got to see my former teacher whenever I went to a meeting with my mom. Mrs. Robertson remained the same essentially in her looks in all that time, even with going blind in her twilight years. After reading her obituary, View Louise Robertson's Obituary on fredericknewspost.com and share memories I learned that she was widowed in 1950 and that Mr. Robertson was her second husband. What sobering information.  Photo of Grade 3 class photo owned by Michele Shipley Klika My fourth grade teacher was Miss Morgan. From her looks, I thought she could have played the role of fictional sleuth Nancy Drew (from the Nancy Drew Mystery series by Caroline Keene,) whom I idolized at that time, In my mind, Miss Morgan fit the description of Nancy because she was slim, with sky blue eyes and auburn hair that was shoulder length and curled up on the ends. I thought she was so pretty. My best memory of her is the time she agreed to let me read the story of Harriet Tubman to the class by reading a chapter a day for several weeks. I was a great admirer of this lovely young woman, who was the only daughter of the owners of a local radio station. She got engaged that year I was in her class to a Mr. Payne and moved to Horsehead, New York, after their summer wedding. She and I also exchanged letters for many years. Somewhere along the way, she and Mr. Payne moved back to her parents’ hometown. My sister ran into her one time a few years back while visiting at my parents’ church. My twinny inadvertently blurted out when she saw our former teacher, “You’re short.” She had seemed tall when she was our teacher.  Photo of Grade 4 class photo owned by Michele Shipley Klika Not everyone remembers all their elementary school teachers. I think I remember mine because I had good teachers who truly cared about each and every student. My teachers impacted me very positively. I will always have fond memories of them. ",
            "date": "Answered July 2, 2019",
            "views": "699",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adriaan de Lange",
                    "user_href": "/profile/Adriaan-de-Lange-3"
                },
                {
                    "user_id": "Sue Smith",
                    "user_href": "/profile/Sue-Smith-724"
                },
                {
                    "user_id": "Muhammad Chavez Assad Patriot",
                    "user_href": "/profile/Muhammad-Chavez-Assad-Patriot"
                },
                {
                    "user_id": "Raja Sekhar Telagathoty",
                    "user_href": "/profile/Raja-Sekhar-Telagathoty-1"
                },
                {
                    "user_id": "David Graham",
                    "user_href": "/profile/David-Graham-149"
                },
                {
                    "user_id": "Dasha Alkina",
                    "user_href": "/profile/Dasha-Alkina"
                },
                {
                    "user_id": "Elsa Kristian",
                    "user_href": "/profile/Elsa-Kristian"
                },
                {
                    "user_id": "Pattie Huggins Deitrick",
                    "user_href": "/profile/Pattie-Huggins-Deitrick"
                },
                {
                    "user_id": "Adrian Salm",
                    "user_href": "/profile/Adrian-Salm"
                },
                {
                    "user_id": "Myrddin Emrys",
                    "user_href": "/profile/Myrddin-Emrys-2"
                },
                {
                    "user_id": "Bruce Dyer",
                    "user_href": "/profile/Bruce-Dyer-3"
                },
                {
                    "user_id": "Karen Carmichael",
                    "user_href": "/profile/Karen-Carmichael-7"
                },
                {
                    "user_id": "Robin Harville",
                    "user_href": "/profile/Robin-Harville"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Kenechi Okoli",
                    "user_href": "/profile/Kenechi-Okoli"
                },
                {
                    "user_id": "Anne Mazo",
                    "user_href": "/profile/Anne-Mazo-1"
                },
                {
                    "user_id": "Tom Clemans",
                    "user_href": "/profile/Tom-Clemans"
                },
                {
                    "user_id": "Anne Benzow",
                    "user_href": "/profile/Anne-Benzow"
                },
                {
                    "user_id": "Godwin Goziem Jireh",
                    "user_href": "/profile/Godwin-Goziem-Jireh"
                },
                {
                    "user_id": "Donovan Minckler",
                    "user_href": "/profile/Donovan-Minckler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Ahmed",
                "href": "/profile/Jay-Ahmed-47"
            },
            "answer_text": " When I was a Kindergartener, I wanted to be in Mrs. Ferguson’s class more than anything. Everyone was so cheerful that I had to see what the fuss was about. I peeked into the classroom gleaming at all of the happy kids. At the moment, it looked surreal that a classroom full of first graders could have so much fun. I remember during nap time I could hear the kids in Mrs. Ferguson’s class. I would dream of what they were doing. Cutting paper with scissors with glue on their fingers while they put something together, and yelling obscenities at each other. A year goes by and I’m finally in her class. I walk up those steps to Mrs. Ferguson’s classroom, swung my backpack around my chair, and sat down with a smile that went ear-to-ear. She walks in late that morning in her spring attire, I remember red roses attached to green stems on her black dress. She carried with her a briefcase full of graded papers. Her chin was tucked into her shoulder hiding sad eye’s walking to her desk to check attendance. I sat in the back of the classroom and observed her every move. Mrs. Ferguson hits the lights, goes over to her desk, and pulls out a giant red heart made out of poster paper. It reached from her neck down to her thighs. She starts speaking to the class. “There are going to be moments in all of your lives when something happens inside of here” Mrs. Ferguson said, holding the red heart to her hip, tapping her heart with her heart with her right hand. “And when this happens throughout AN ENTIRE LIFESPAN” She spoke with her hands. Her speaking with her hands carried into one swift motion of looking over, and tearing a teeny-tiny piece of poster paper from the top part of the red heart. The poster paper falls slowly to the floor. “You pick yourself back up and move on with your life, enjoying the company of family and friends just like you do now” She looks around the classroom with motionless smile. “And one day it happens to you again, you think “I remember this”’ then you GO AND HUG THE PERSON CLOSEST TO YOU, so that your heart and theirs will fall together” She looks up at the red heart and tears yet another small piece from the bottom. It too, falls to the floor. “The pieces fall, but the memory will stay. You want to PROTECT YOURSELVES from harm, and keep from harms way, so it will never happen to you again” She said, holding the partially torn heart behind her back, looking over the class with big spooky eyes. “Then it happens AGAIN, but this time it’s worse because you PROTECTED IT with EVERYTHING IN YOUR POWER, and still…” She rips another piece off twice the size of the other two pieces. Even slower, the third and biggest piece falls to the floor. “Then you GO AND HUG THE PERSON CLOSEST TO YOU, so that your heart and theirs will fall together” She wraps her arms around herself, closes her eyes, and pauses for a second. “AND THEN….” She said, humming the syllables in which the words are spoken. (this is a happy sound) She holds the heart behind her back, and she looks around the classroom with big spooky eyes. “You hope this is the last time EVER, this happens to you.” Then she holds the big red heart up and tears an even bigger piece off. Seconds pass before it hits the ground. “… you get really mad, or cry, or stay in your room, or just want to be alone” She said. “Then you GO AND HUG THE PERSON CLOSEST TO YOU, so that your heart and theirs will fall together” She wraps her arms around herself. She holds the big red heart back in the air, looks at it, then looks back at us. “Boy O’boy, you cannot bear for another piece to fall” She said, shaking her head. “SO YOU PROTECT IT! WITH ALL OF YOUR POWER!” She stomps on the floor with assertion. “Ohh nooo! An even bigger piece. And another one. And another one!” She said ripping pieces one by one. “Then you GO AND HUG THE PERSON CLOSEST TO YOU, so that your heart and theirs will fall together” She wraps her arms around herself. She holds a torn piece of poster paper up to the class the size of her palm. “And this is what you will be left with” She turned the lights back on and starts the class. None of us truly knew what she meant until we grew up. That’s what made the experience so meaningful. Mrs. Ferguson’s class was incredibly fun, and the rest of the year was beyond what I had ever imagined. ",
            "date": "Answered August 5, 2019",
            "views": "309",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sue Smith",
                    "user_href": "/profile/Sue-Smith-724"
                },
                {
                    "user_id": "Laurel Johnson",
                    "user_href": "/profile/Laurel-Johnson-57"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Ussery",
                "href": "/profile/Steven-Ussery"
            },
            "answer_text": "I remember very clearly my first grade teacher, Sister Mary Joe Juanita, at Mount Carmel Catholic Elementary School on Guam Island from 1960. My father was then on active duty in U.S. Navy and he was a newly promoted Chief Petty Officer in charge of the Base Enlisted Men’s Mess hall. That was 60 years ago, and yet I remember it like it was yesterday. I am currently 66 years old. My father is still alive and well at age 93. He is one of the last of the World War II veterans. I am a U.S. Navy veteran from the Vietnam War era. ",
            "date": "Answered April 10, 2020",
            "views": "112",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Masil George",
                    "user_href": "/profile/Masil-George-1"
                },
                {
                    "user_id": "Sue Smith",
                    "user_href": "/profile/Sue-Smith-724"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sadie Fahey",
                "href": "/profile/Sadie-Fahey-1"
            },
            "answer_text": "I can still list my primary school teachers in order and tell you pretty much everything about them that I deemed important at the time (I.e Mr Smithers liked cartoon ties, owned a Nintendo 64 and was a WW2 history buff (but if you irritated him your extension work was inevitably to divide 10 digit integers by their 2 or 3 digit factors…) and Mrs Wales would yell at you if you called her Miss Wales, keep you in at break if you mentioned that she looked like a pregnant whale and send you to the headmaster’s office if you repeatedly addressed her as Miss Snail). My earliest memories are mostly from playschool (age 3–4) but I can also still remember a weird segment of a holiday our family took over the Easter break before my 3rd birthday (early May). It's not a particularly good memory though as I got lost in a water park… my family was lucky enough to have started me in swimming lessons before that. ",
            "date": "Answered May 29, 2019",
            "views": "152",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sue Smith",
                    "user_href": "/profile/Sue-Smith-724"
                },
                {
                    "user_id": "Michele Shipley Klika",
                    "user_href": "/profile/Michele-Shipley-Klika"
                },
                {
                    "user_id": "Elizabeth Quatro",
                    "user_href": "/profile/Elizabeth-Quatro"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Bentley-Baker",
                "href": "/profile/Dan-Bentley-Baker"
            },
            "answer_text": "Mrs. Kirkpatrick and her husband ran a musical kindergarten and I was a happy member of the rhythm band. This was because my oldest brother had been a violin prodigy and my parents didn't yet know I would never be. Mrs. Weldwood whipped me almost daily in the first grade because she thought my severe failure to perform the most basic arithmetic was defiance or contempt for her stentorian pedagogy. It would take decades for the diagnosis of dyscalculia, a branch of dyslexia, to become a thing. But first memory? Here's where the subject of memory gets subtle, and unreliable. We left New Orleans and stopped in Hattiesburg, Mississippi, where the house next door burned down one winter night. My nurse maid wrapped me in a blanket and we all stood outside watching the blaze, while my dad did his duty with the garden hose. An old B&W photograph shows me, age 11 months, still in the blanket and in the nanny's arms, posing in front of the charred remains, the next day. Except I don't know if I remember the fire and dad's heroic spritzing, remember enjoying the warmth of the neighbors' house on fire in that cold night, remember feeling like it was all a kind of very special bonfire party, or if I remember the photograph and the story my mother told any time that tattered old Brownie shot was trotted out. Memory is very slippery. False memory is always close. The nurse maid's name was Hattie. Hmm. That's a clue. Other sources of information puts my father in Salt Lake City that December, on a sales trip with an advertising firm, in the hospital with a case of pneumonia. My brother, who was 8 years old, says it was Silacaga, Alabama. This business of memory and imagination needs to be thoroughly talked out, folks. Have you ever had a ‘memory ‘ that turned out to be a dream? What if you had to take the stand and swear on a bible that your testimony would be the ‘truth and nothing but the truth”? Not only that, but what if my dyscalculia was the result of Mrs. Weldwood using an 18 inch wooden ruler on me when I was in fact refusing to perform at the blackboard? ‘These violent delights have violent consequences.” ",
            "date": "Answered April 10, 2020",
            "views": "77",
            "upvotes": " Answer requested by Sue Smith",
            "upvoters": [
                {
                    "user_id": "Sue Smith",
                    "user_href": "/profile/Sue-Smith-724"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yingzi Li",
                "href": "/profile/Yingzi-Li-7"
            },
            "answer_text": "Yes, I do remember my Grade two teacher who taught us Chinese more than 40 years ago. My elementary school was named “Tai Ping Road Elementary School” (太平路小学) which was an excellent community school in my hometown Qingdao. I couldn’t remember her first name, and I only remember her last name was Zhang. I had a clear memory for the first day of my school in Grade two when she wrote on the blackboard “我爱北京天安门“ - I love TianAnMen square in Beijing. This was the first time that I saw people writing a Chinese word stroke by stroke. I just felt that it seemed impossible for me to know how to write them down by myself since it was so so hard. My father taught me English since I was two, unfortunately, he never instructed me how to write Chinese words. I remember Ms.Zhang used a white chalk to draw these seven words in a meticulous way on the blackboard and also wrote down their Chinese PinYin - “Wo ai bei jing tian an men” along with the words. Then she turned back and taught us how to pronounce them. She divided each Chinese pinyin (such as wo, ai, bei, etc) into separate syllables and pronounced them to us like “Wo e wo”, “bo ei bei”, “ji ying jing”…. She also pointed out the consonants and vowels in each of these words. She used Chinese four intonations to articulate each character, tone one, tone two, tone three and tone four. For example,  Through her teaching, she laid a solid foundation for my learning of Chinese language features, such as Chinese alphabet, Chinese pronunciation rules, Chinese grammar and more in my elementary studies, and it also helped me a lot in my English writing. Her teaching of the usage of various rhetorical means such as metaphor, personification, parallel, exaggeration, etc improved my writing effects in clarity and vividness. I also learned from Chinese ancient poems and prose from her such as Pipa xing (琵琶行) by Li Bai (李白). I will never forget the famous sentences inside, qiān hū wàn huàn shǐ chū lái 千 呼 万 唤 始 出 来 yóu bào pí pá bàn zhē miàn 犹 抱 琵 琶 半 遮 面 which means you just come out after my thousands of times of calling and asking, and when you come out, the lute you carry covers half of your face - describing that a beautiful girl feels too shy to come out. I followed her in Chinese learning until I graduated from elementary school, and that is why she left a deep impression in my mind. I greatly appreciated her hard work and contributions to my Chinese language learning. I don’t know whether she is still living in this world. I would like to send my sincerest “hello” to her at this moment. Thank you, my dear teacher Ms. Zhang. Thanks for reading. ",
            "date": "Answered April 10, 2020",
            "views": "74",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sue Smith",
                    "user_href": "/profile/Sue-Smith-724"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barbara Villiers",
                "href": "/profile/Barbara-Villiers"
            },
            "answer_text": "I can name, and still remember all of my elementary school teachers. Although with some of them, I’d have to do some thinking before I could come up with more specific memories. Anyhow, just to share of the more interesting things I can remember: I had the same teacher for first grade and fourth grade, only she went from being Mrs. Olsen to Mrs. Chatters. (she got divorced, and re-married)I had two different teachers named Mrs. Brewer during third grade. The first Mrs. Brewer went on maternity leave about halfway through the year, and second Mrs. Brewer happened to be a relative…..although I don’t remember exactly how they were related.",
            "date": "Answered July 3, 2019",
            "views": "83",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sue Smith",
                    "user_href": "/profile/Sue-Smith-724"
                },
                {
                    "user_id": "Michele Shipley Klika",
                    "user_href": "/profile/Michele-Shipley-Klika"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Farris",
                "href": "/profile/Steven-Farris"
            },
            "answer_text": "I’m over 60 years old, and I remember *every one* of my elementary school teachers like it was yesterday from Kindergarten through grade 6 (which are the grades my elementary school covered). I am not in touch with any of them, so i would not know if they are still with us. I do know my fourth grade teacher was killed in an auto accident many years ago. ",
            "date": "Answered May 2, 2019",
            "views": "52",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sue Smith",
                    "user_href": "/profile/Sue-Smith-724"
                },
                {
                    "user_id": "Michele Shipley Klika",
                    "user_href": "/profile/Michele-Shipley-Klika"
                },
                {
                    "user_id": "Nan Waldman",
                    "user_href": "/profile/Nan-Waldman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tammy McKracken",
                "href": "/profile/Tammy-McKracken"
            },
            "answer_text": "Oh yes, I remember every single teacher. My earliest memory, all the way back to kindergarten, is one of me sitting on a wooden bench waiting my turn to turn the date over on our classroom calendar. My legs were swinging back and forth because I could not touch the floor— I was a very tiny child until 9th grade. When it was my turn I hopped down and carefully removed the apple covering the date. I am thinking it must have been September. I have many other memories of my elementary school days; most of them are positive—with a few not so good ones. ",
            "date": "Answered May 20, 2019",
            "views": "59",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sue Smith",
                    "user_href": "/profile/Sue-Smith-724"
                },
                {
                    "user_id": "Michele Shipley Klika",
                    "user_href": "/profile/Michele-Shipley-Klika"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carlyle Franklin",
                "href": "/profile/Carlyle-Franklin"
            },
            "answer_text": "'Miss' Wilson, grade 1, (no Kindergarten! Primary school in Brandon Manitoba.I was a 6 year old farm boy! 'Miss' Wilson was our teacher! At that time women teachers were supposed to be unmarried spinsters, for whatever reason? I don't know, But I remember; one time I got the strap on my hands because Miss Wilson said I told a lie! And I didn't know at that time, what a 'lie' was! So, for the last eighty-five years; I hate that Miss Wilson! And I think that she was 'shacked up' with some guy! And she was lying, and breaking the Law! ",
            "date": "Answered May 2, 2019",
            "views": "70",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michele Shipley Klika",
                    "user_href": "/profile/Michele-Shipley-Klika"
                },
                {
                    "user_id": "Rosemary Smith",
                    "user_href": "/profile/Rosemary-Smith-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Bye",
                "href": "/profile/Thomas-Bye-1"
            },
            "answer_text": "I remember them all from pre-school in 1954 all the way through 8th grade in 1964. I even remember all the names of the dogs in my 1950’s neighborhood. I’m 69. I made contact with my 5th grade band instructor who is 94 and told him what a positive influence he had on my life. I also had him for band through 9th grade. ",
            "date": "Answered May 9, 2019",
            "views": "58",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sue Smith",
                    "user_href": "/profile/Sue-Smith-724"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hiew Thien Choi",
                "href": "/profile/Hiew-Thien-Choi"
            },
            "answer_text": "I do, some of them, in varying degrees. I am not sure about my earliest memory. I remembered something about chasing birds from rice field but I don’t know how old was I then and I don’t know where it occurred. I could be as young as 2 or as old as 4. ",
            "date": "Answered April 10, 2020",
            "views": "31",
            "upvotes": " Answer requested by Sue Smith",
            "upvoters": [
                {
                    "user_id": "Sue Smith",
                    "user_href": "/profile/Sue-Smith-724"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cherie Cone",
                "href": "/profile/Cherie-Cone"
            },
            "answer_text": "My earliest memory is when my parents were on either side of me, carrying me along by my arms as they ran into the Gulf of Mexico while we were on vacation in Texas. I can still hear in my head all three of us laughing the whole time. I was probably under 2 years old at the time. I remember the names of all 6 of my elementary school teachers. ",
            "date": "Answered April 10, 2020",
            "views": "50",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sue Smith",
                    "user_href": "/profile/Sue-Smith-724"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marta Garay",
                "href": "/profile/Marta-Garay-1"
            },
            "answer_text": "I remember Sister Madeline at St Peters Elementary School in Belleville NJ. She was my figurehead grade teacher. What I remember most was that had a twin sister who was also a nun. Sister Madeline would get mad at us and turn a bright red. She had a temper, and the red on her face I can’t ever forget. ",
            "date": "Answered April 10, 2020",
            "views": "95",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sue Smith",
                    "user_href": "/profile/Sue-Smith-724"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ross Johnson",
                "href": "/profile/Ross-Johnson-81"
            },
            "answer_text": "I remember specific events in kindergarten, but I do not remember the teacher. From every grade after that I can remember most of the teachers and some particular lessons. ",
            "date": "Answered April 10, 2020",
            "views": "14",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Pamela Blackwell-Nwonye",
                "href": "/profile/Pamela-Blackwell-Nwonye"
            },
            "answer_text": "My favorites are Mrs. Kibbee (1st grade) and Mrs. Conklin (6th grade), they were open minded. Mrs. Newkirk (3rd grade) neutral Mrs. Bryant (5th grade) “iffy” Mrs. Thornburg (4th) negative Mrs. Bartley (2nd) “Satan’s twin sister” ",
            "date": "Answered July 9, 2019",
            "views": "37",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Richard Tedstone",
                "href": "/profile/Richard-Tedstone"
            },
            "answer_text": "My earliest memory was running up Grange Road (Halesowen, UK) and finding a vey busy road: I knew I was out of my depth - BIG TIME! I can’t describe the feeling: it was a mixture of awe and surprise. What could I do now? I was still thinking when my Mum caught me up! I can’t describe it The nearest I can come to expressing it in words is bit like being a teenager and thinking ‘FUCK ME . . . WHAT do I do now!’ It was an unpleasant feeling. what I would call BIG FRIGHT nowadays. At that point my Mum got hold of me. I think I was pleased or certainly relieved. And of course I didn’t know that 4 letter word at the time either. I would have been under 18 months! I was so relieved at my rescue! Oh yes! ",
            "date": "Answered May 20, 2019",
            "views": "83",
            "upvotes": " Answer requested by Elizabeth Quatro"
        },
        {
            "author_info": {
                "name": "Matt Kroessig",
                "href": "/profile/Matt-Kroessig"
            },
            "answer_text": "Some of them. Like 5th grade I rember him being nice. ",
            "date": "Answered May 2, 2019",
            "views": "9",
            "upvotes": " Answer requested by Sue Smith"
        },
        {
            "author_info": {
                "name": "Pat Duran",
                "href": "/profile/Pat-Duran"
            },
            "answer_text": "Yes, from 1st - 6 th grade. ",
            "date": "Answered June 2, 2019",
            "views": "9",
            "upvotes": "0"
        }
    ]
}