{
    "title": "Do you have to work in prison? - Quora",
    "tags": [
        "Prisoners",
        "Prisons and Prison Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin Hewett",
                "href": "/profile/Kevin-Hewett"
            },
            "answer_text": "Yes. Most jail inmates qualify to work in the jail as trustees, as mentioned by Mike Fox, and in Federal Prison, every man is assigned a job and receives a monthly wage for the doing of that job. The nature of the work assignments vary widely and so does the pay. In the federal system (BOP), you can make anywhere between $5.25 and $300 a month--depending on the nature of the work you provide. At FCI Bastrop, in the late 90s, my own work assignment was sweeping up the cigarette butts on our tennis courts. I had to \"work\" for about 20 minutes a day, though the position required me to be on the rec yard about five hours each day. I was paid the $5.25 per month. This money was credited onto my books. However, I had a friend who worked in the UNICOR (http://www.unicor.gov/index.aspx) plant at the same location and he put in a regular 40 hour week making bulletproof vests for federal law enforcement officers, and he got almost $300 a month. Nice gig; it makes the time go by faster. Officially, every man in the BOP has a work assignment. However, certain guys are laid up on medical issues or are just hospitalized. I seem to have understood that there is some kind of exemption for these cases.  A \"trustee\" in a county jail is not paid in cash, but he gets extra food and other perks which make working there worthwhile. In the 90s, Judge Rodriguez in San Diego County's South Bay Court was handing out one day per pound for people caught smuggling weed at the San Ysidro Ports of Entry. Once you got to the jail, though, you found out that as a trustee, you could get \"half time\", that is to say 2 days credit for every 1 day in the jail--as long as you were working. Sign me up! This was a pretty fair system. I got caught with 82 pounds and was out of there in 41 days. Really clean. At Federal Prison Camp Bastrop, near Austin, Texas, there were \"town drivers\", prison inmates who each morning took a pickup into town to buy supplies at various stores such as Costco or Home Depot. They would go as a two inmate pair, in prison \"tans\", our uniform, on their own, and were expected to return in a timely manner. This was a very responsible position. These guys made over $200 a month.  That doesn't sound like a lot of money, but remember that in jail or prison, everything else is taken care of, 100 percent. And, the maximum amount you can spend in the prison commissary was $150 per month. Believe me, that bought you plenty of stuff. Mainly Blue Bell ice cream pints, one every weekday when \"store\" was open. Many guys could afford to send over $100 each month to their families \"on the outs\", to try and help. Even illegal immigrants, imprisoned on entry violations, could send money home to their families in pueblos where a hundred bucks was a heck of a lot of money! At George Bailey detention facility in San Diego County's jail system, we trustees (in 6B house) had to work six (6) days per week, regardless of holidays. Because I can read good, I got on in the kitchen as the \"diet man\", preparing disciplinary, religious or medical diet trays for people with health problems. In the BOP, however, we got weekends off and every federal holiday.  Unfortunately, the prison commissary was also closed on those days off. No Blue Bell! ",
            "date": "Updated June 17, 2015",
            "views": "109",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dylan Curtis",
                    "user_href": "/profile/Dylan-Curtis-52"
                },
                {
                    "user_id": "Andy Trump",
                    "user_href": "/profile/Andy-Trump-1"
                },
                {
                    "user_id": "Rory Alexander Farrell Madden",
                    "user_href": "/profile/Rory-Alexander-Farrell-Madden"
                },
                {
                    "user_id": "Drew Harris",
                    "user_href": "/profile/Drew-Harris-35"
                },
                {
                    "user_id": "Jason Black",
                    "user_href": "/profile/Jason-Black-258"
                },
                {
                    "user_id": "Halima El-Moslimany",
                    "user_href": "/profile/Halima-El-Moslimany"
                },
                {
                    "user_id": "Gregor Kikelj",
                    "user_href": "/profile/Gregor-Kikelj"
                },
                {
                    "user_id": "Abhinaya Viswanathan",
                    "user_href": "/profile/Abhinaya-Viswanathan"
                },
                {
                    "user_id": "Frank Cannon",
                    "user_href": "/profile/Frank-Cannon-1"
                },
                {
                    "user_id": "Levi Wilder",
                    "user_href": "/profile/Levi-Wilder"
                },
                {
                    "user_id": "Peter Hawkins",
                    "user_href": "/profile/Peter-Hawkins-2"
                },
                {
                    "user_id": "Jonathan Tsai",
                    "user_href": "/profile/Jonathan-Tsai"
                },
                {
                    "user_id": "Britt Smith",
                    "user_href": "/profile/Britt-Smith"
                },
                {
                    "user_id": "Krithik Rao",
                    "user_href": "/profile/Krithik-Rao"
                },
                {
                    "user_id": "Steven Kearns",
                    "user_href": "/profile/Steven-Kearns-1"
                },
                {
                    "user_id": "Mike Fox",
                    "user_href": "/profile/Mike-Fox-91"
                },
                {
                    "user_id": "Philip Newton",
                    "user_href": "/profile/Philip-Newton"
                },
                {
                    "user_id": "Michael Yong",
                    "user_href": "/profile/Michael-Yong"
                },
                {
                    "user_id": "Michael Chan",
                    "user_href": "/profile/Michael-Chan-78"
                },
                {
                    "user_id": "Diarmaid Mac Aonghusa",
                    "user_href": "/profile/Diarmaid-Mac-Aonghusa"
                },
                {
                    "user_id": "Tarun Tyagi",
                    "user_href": "/profile/Tarun-Tyagi"
                },
                {
                    "user_id": "Diana Tan (陈丽梅)",
                    "user_href": "/profile/Diana-Tan-陈丽梅"
                },
                {
                    "user_id": "John Harris",
                    "user_href": "/profile/John-Harris-52"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                },
                {
                    "user_id": "Joan Hoffman",
                    "user_href": "/profile/Joan-Hoffman-1"
                },
                {
                    "user_id": "Amanda Tendler",
                    "user_href": "/profile/Amanda-Tendler"
                },
                {
                    "user_id": "Sharon Hawkins",
                    "user_href": "/profile/Sharon-Hawkins-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Jellema",
                "href": "/profile/James-Jellema-1"
            },
            "answer_text": "Legitimately HAVE to? No. When you have a lot of free time, not to mention a (usually) long list of the way things won't work, along with seemingly unparalleled ingenuity, (when it comes to subverting the law and/or rules), an avenue will present itself. (It isn't like your in a hurry.) The bop $5.25 paycheck is legit. They use “grades”, 4 I think (in 23 years I've only had one job. Only because of a specific financial perk. I paid someone to do the actual work.) 5.25 being at the bottom. (that's a monthly wage, FYI) more you work, higher the grade. Though jobs have $ caps, the bop's industry is UNICOR. No idea what the acronym stands for, never cared enough to inquire) I've heard of recycling, military equipment, one place did something for hummers. (the truck) which is usually the highest paying job on a compound, in $ and “clock burn” which is almost as important as the loot. Commissary spending limit was $ 320 a month. I would normally spend $100 a month at the store. But, I had no “habits” I wasn't strung out. The majority of my income came from gambling.. Though it's a typical “habit” of some. ",
            "date": "Answered December 9, 2017",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joy Morrison",
                "href": "/profile/Joy-Morrison-5"
            },
            "answer_text": "Yes you have to work in prison unless you are disabled. I worked in the kitchen 3–4 hours a day , maybe 3 days a week .You had to live in the honor housing unit to work in the kitchen. I liked it in that housing unit because it wasn't as loud and rowdy as the others. If you got in any kind of trouble you were moved and lost your job. I also had snow removal. It sucked . Nothing like pushing a 5 gallon square bucket across all the baskeball courts and down all the walkways emptying it every few steps as you go. It snowed alot that winter.And I was the only person on that job. I was paid $8.50 a month, because I had my diploma. People without a diploma or GED were paid $7.50 per month. Once you got moved to the pre releases housing unit you could no longer work. You were in classes almost all day 5 days a week preparing you for home. Slowed the days down but it was a good feeling your time was coming to an end. ",
            "date": "Answered November 6, 2017",
            "views": "3",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andy Trump",
                    "user_href": "/profile/Andy-Trump-1"
                },
                {
                    "user_id": "Rory Alexander Farrell Madden",
                    "user_href": "/profile/Rory-Alexander-Farrell-Madden"
                },
                {
                    "user_id": "Patricia Jones",
                    "user_href": "/profile/Patricia-Jones-33"
                },
                {
                    "user_id": "Susan Vaughan",
                    "user_href": "/profile/Susan-Vaughan-10"
                },
                {
                    "user_id": "Michael Buhl",
                    "user_href": "/profile/Michael-Buhl"
                },
                {
                    "user_id": "Pat Hatch",
                    "user_href": "/profile/Pat-Hatch-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Will Crump",
                "href": "/profile/Will-Crump-4"
            },
            "answer_text": "No, you don’t HAVE TO work, but be prepared to spend your time in solitary confinement or in a sanctions unit where you don’t get the luxury items off commissary, a television, or even visits. Also, expect to spend your entire sentence and not get out a day early because on sanction status, I doubt you’ll be earning any kind of sentence reduction credits. You’re not compliant with facility rules, so there go the behavior credits. You’re not working a job or program, so there go your program credits. ",
            "date": "Answered September 3, 2018",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brandon Jackson",
                    "user_href": "/profile/Brandon-Jackson-420"
                },
                {
                    "user_id": "Andy Trump",
                    "user_href": "/profile/Andy-Trump-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Garrison",
                "href": "/profile/Larry-Garrison-4"
            },
            "answer_text": "While I was at FCC Butner, everyone had to work, unless medically unable to work. You could refuse to work 3 times, each time you sent to hole, suffered loss of good time, in some cases were sent to the Medium 2 (the Deuce). But after getting out of the hole the 3rd time you didn’t have to work. Most new fish worked in Food Service. They also had Unicor where we made the khaki uni’s for the Armed Forces and other prisons. Made not so bad coin. I worked in Food Service as a napkin folder and line server. I even got a raise !! ",
            "date": "Answered December 25, 2017",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andy Trump",
                    "user_href": "/profile/Andy-Trump-1"
                },
                {
                    "user_id": "Caskell Cook",
                    "user_href": "/profile/Caskell-Cook"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Fox",
                "href": "/profile/Mike-Fox-91"
            },
            "answer_text": "Most maximum security facilities have opportunities for their prisoners to shorten sentence if possible by working as what is usually called a \"Trustee\" or Jail Assistant.  This isn't necessarily a disciplinary option for the Warden to use at his disposal even if it is used that way anyway, and furthermore, its seen more of a privilege for reasons explained above. ",
            "date": "Answered May 28, 2015",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andy Trump",
                    "user_href": "/profile/Andy-Trump-1"
                },
                {
                    "user_id": "Gregor Kikelj",
                    "user_href": "/profile/Gregor-Kikelj"
                },
                {
                    "user_id": "Kevin Hewett",
                    "user_href": "/profile/Kevin-Hewett"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Haze",
                "href": "/profile/Robert-Haze-3"
            },
            "answer_text": "Pending jurisdiction yes ",
            "date": "Answered September 26, 2018",
            "views": "62",
            "upvotes": "0"
        }
    ]
}