{
    "title": "Do you have to graduate high school to go to college? - Quora",
    "tags": [
        "High School to University Transition",
        "High School Education",
        "The High School Experience",
        "The College and University Experience",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Martindale",
                "href": "/profile/William-Martindale"
            },
            "answer_text": "I have a friend who dropped out of high school to go to college. It started when he took a chemistry class in 8th grade and thought it was cool. He chose to his high school because they said they'd let him skip straight to AP Chemistry. When he got there, the school tried to back out, but after a few months of fighting, he took the General Chemistry final, passed it, and was allowed into AP Chemistry. The next year, he realised the school didn't offer any higher level science classes, besides AP Bio, which he really didn't want to take, so he applied for Stanford Online High School and got in. There, he took AP Physics C with both the Mechanics and E&M portion. At his physical high school, he took AP Calc BC. The next year, he realised that he'd run out of high-school level math and science classes, but didn't have enough credits to graduate. He'd already transferred in too many outside credits, so that wouldn't help. At this point he applied to college. While he argued with his high school about letting him graduate, his application got accepted. In fact, they even let him skip a year’s worth of Common Core classes. The school still wouldn't let him graduate, but he convinced the principal to let him talk to some higher ups. They said no. At this point, he left. He started college last fall, and is doing fine. ",
            "date": "Answered December 23, 2016",
            "views": "943",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Laura Bratcher Page",
                    "user_href": "/profile/Laura-Bratcher-Page"
                },
                {
                    "user_id": "Garrett Borawski",
                    "user_href": "/profile/Garrett-Borawski"
                },
                {
                    "user_id": "Vik Murty",
                    "user_href": "/profile/Vik-Murty"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerald Cole",
                "href": "/profile/Jerald-Cole-1"
            },
            "answer_text": "My high school ran out of classes for me to take. Even though I had just turned 17, I spoke with the boy’s vice principal (this was in Southern California) and he agreed that I didn’t have to take any more high school classes as long as I started college. So, my freshman year in college started in the winter of what would have been my last semester of high school. Side note, more than nine years later, just before I completed my SM in Chemical Engineering at MIT I received a package in the mail. My high school had finally decided to give me a diploma and certificate of graduation. ",
            "date": "Answered December 23, 2016",
            "views": "586",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Catherine Oates",
                "href": "/profile/Catherine-Oates-1"
            },
            "answer_text": "Depending on where you are, there are different rules. In the US there are a lot of alternatives to graduating from high school—GED certificate, other equivalencies, adult coursework, community college programs. ",
            "date": "Answered December 23, 2016",
            "views": "352",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Esther Littlefield",
                    "user_href": "/profile/Esther-Littlefield-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Borkowski",
                "href": "/profile/Tom-Borkowski-1"
            },
            "answer_text": "Assuming you mean: Can I drop out of high school and go to college without a high school certificate? Yes, but with extreme difficulty. ",
            "date": "Answered December 23, 2016",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jut Katani",
                "href": "/profile/Jut-Katani"
            },
            "answer_text": "Yes sir, in almost all countries that are not corrupt. In Pakistan you can get a medical degree without going to medical school. I am not making it up. One of their commentators on his program said so, that they have medical schools in their homes ! ",
            "date": "Answered December 23, 2016",
            "views": "182",
            "upvotes": "0"
        }
    ]
}