{
    "title": "Does a parent need a degree in education to homeschool their child? - Quora",
    "tags": [
        "Homeschooling",
        "Parents",
        "Children",
        "Parenting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elliot Rigby",
                "href": "/profile/Elliot-Rigby"
            },
            "answer_text": "My father agrees with this, which is why he doesn’t bother hiding his disdain that my older sister and I are homeschooling our kids. Granted, she is going through an online charter school, and I am unschooling but my kids aren’t quite school-age yet. Having a degree doesn’t mean you actually learned and know what you studied, while not having a degree doesn’t mean you haven’t learned and can understand things that you haven’t studied in a school setting. For example, the entire premise of unschooling is that you don’t need a set curriculum to learn things. It’s an interest-led learning where the child uses their natural curiosity to find out answers. In this way, they’ll develop a love of learning itself, and not be turned off to it by years of school beating into them what the school thinks is best for them to learn. I experienced this myself when I earned by Associate’s degree. I had to take a bunch of classes in things that I have no memory of what I supposedly learned. People can say “well-rounded education” all they want, but because I was completely uninterested in the subject material, I didn’t learn a damn thing despite passing classes with flying colors. I now have an Associate’s Degree in Web Development. Now I can make awesome websites and am perfectly qualified for all these companies looking for techs, right? Wrong. See, they want me to know a whole lot of different languages in order to make one website, or one app. Meanwhile, my degree only touched on the very basics of a few languages that it thought were important. Meaning, while I can create a very basic website after quite some effort, my degree didn’t actually prepare me for what it professed to teach. I’ve actually been self-teaching in order to learn what is actually needed for a job in web development or beyond. I am not saying that a degree in Education is worthless. I am saying that not all degrees are created equal; that not all learners are created equal; that you can’t guarantee a capable teacher just by virtue of an Education degree and you can’t guarantee an incapable teacher just by virtue of a lack of an Education degree. It’s what you put into it, and how much you’re willing to learn on your own, that counts. ",
            "date": "Answered May 5, 2017",
            "views": "90",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Psam Ordener",
                    "user_href": "/profile/Psam-Ordener"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vennessa Robertson",
                "href": "/profile/Vennessa-Robertson"
            },
            "answer_text": "( long answer but qualified) As other answers have stated it depends on the state you live in. Some states require a 2 year degree. Some states require a 4 year degree. Some states simply require intent to homeschool notifying the district within two weeks of the year your child would be attending filed with the district, starting with the year the child would be attending kindergarten. Parents have the right to do just about whatever they want to do for parents have the right to do just about whatever they want to do for their children as long as it doesn't cause them harm. That includes educating them in the manner that they see fit. There are a lot of Education pedagogy I personally do not believe in or think are appropriate, but that is a discussion for another day. In many cases Parents without a degree in education are just as fit, if not more so, to homeschool then parents with a degree in education because the American education system is a lumbering dinosaur designed to treat children as products that have to be fit in a very specific box and produced for the public so they can go on to fit careers that we have waiting for them. It is designed to fit a niche that already exists not designed to create children that will change the world. And I am and I am qualified to have this opinion because I have a degree in education and I thought and the public school sector for several years before retiring due to a traumatic brain injury. In any rate I do believe the decision to home-school in any rate I do believe the decision to home-school is not one to take lightly it should not be done on the whim and it is something that the parent needs to understand is not an easy thing to do. It requires research and planning and lots of hard work every single day. You are not parking your kids in front of Sesame Street with a coloring book and a pile flash cards and telling them “have at” well you can sit on your phone watching Netflix and Facebook. Homeschooling is a full-time job and then some. If that is your definition of homeschooling you're doing it wrong put your children back in the public education system they will do less harm to your children. And I work just as hard if not harder being a homeschooling mom then I ever did working as a teacher in a classroom. Oddly your question is very appropriate because in Colorado the moment you decide to co-op without the protection of an actual licensed and recognized CoOp over seeing you the state can decide you are trying to become a charter school and require every parent that is teaching children that is not their children or children they have legal guardianship of to have a teaching license or cease and desist. However if a friend of mine however if a friend of mine and their children happened to be in my house quietly coloring or working on worksheets well I happen to be teaching history or English or something I'm very good at and her children just happen to learn something well there's nothing that anyone legally can do about that. And if my children happen to learn something as they are quietly coloring or doodling on scratch paper well someone smarter than me in math happens to be teaching their own children at my kitchen table well there's nothing that legally can be done about that. *Wink, wink* As far as as far as getting into college which seems to be the big concern for homeschool families, my recommendation would be to focus on homeschool projects multi-genre project comma community service projects, extracurricular projects which the school district you live in legally have to let you join (if you talk to them and give them your intention that you would like to join or participate in because you pay taxes in the area you have to legally be allowed to participate); sign up to take ACT and explain to the testing center that you are home-schooled The Homeschool movement is now huge and the percentage of children that are home-schooled is getting quite large colleges actually love home-schooled students because they are well-rounded, they are excellent self-motivated students, they generally understand how to budget time how to set up their own projects and they generally don't go through that weird freshman freak out. That high school students do when they are given a bit of freedom for the first time. If anyone's curious to see if anyone's curious to see how I do it I keep a Blog on my website. http://www.vrobertsononline.com ",
            "date": "Answered May 5, 2017",
            "views": "134",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kitty Juniper",
                "href": "/profile/Kitty-Juniper"
            },
            "answer_text": "No, and requiring it would be daft - like requiring a degree in economics to do the weekly groceries. If you've got a decent textbook and you understand what it's saying, you can help your child understand it too. If you don't understand, you need to find someone who does, or a better textbook. Of course, that applies for academics - there's a lot of other stuff to teach too. Nutrition and cooking you teach by having your child with you when you shop and when you cook, and talking about your decisions. Sport is easy to outsource - swimming lessons, gymnastics lessons, team sports. Music lessons ditto. Look at a five year old child. Their parents have already taught them the important stuff - how to walk and talk, climb and run, say please and thank you. They've taught them to read and write, left from right, and wrong from right. The child can count to a hundred by ones, twos, maybe fives and tens. They have a fund of general knowledge - what country they live in, their own name, address, and phone number, the routes to the places they visit routinely, the personalities of their friends and extended family, how to share and play together. They can eat with cutlery, and they know which foods are culturally appropriate for their breakfast, their lunch and their dinner. They can dress and undress and toilet themselves, and tell the difference between day time clothes and pyjamas. The things a child knows before they start school just go on and on, and if they haven't spent their whole life in day care then probably their parent taught them all that stuff. S/he didn't have a textbook for most of it, either. So why wouldn't a parent be able to go on teaching their child, at least through to their early teens? Needing a degree in classroom discipline to do what you've been doing for the last five years without a degree seems daft, frankly. ",
            "date": "Answered May 5, 2017",
            "views": "127",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sharon Marks",
                    "user_href": "/profile/Sharon-Marks-11"
                },
                {
                    "user_id": "Psam Ordener",
                    "user_href": "/profile/Psam-Ordener"
                },
                {
                    "user_id": "Ben Pottinger",
                    "user_href": "/profile/Ben-Pottinger-1"
                },
                {
                    "user_id": "Amy Faith TenBrink",
                    "user_href": "/profile/Amy-Faith-TenBrink"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rosemary Ward Laberee",
                "href": "/profile/Rosemary-Ward-Laberee"
            },
            "answer_text": "No. One of the principal advantages of being a home educator is the fact that you have not been swimming in this process-oriented, test-centric soup. Home education removes the middle men - it eliminates all of the extra processes which the school needs but which the learners do not need. A degree in education could be a distinct disadvantage to the self-directed learning family. What is needed is freedom to explore interests, patient and engaged parents, a well-preserved sense of curiosity, good sleep, good nutrition, good exercise out of doors, and good friends. This is the magic sauce for the child who is learning and growing without attending school. I taught multiple children how to read using the same $20 book. All became very competent readers by age 4. All continue to be voracious readers…many years later. All used the book in a slightly different way; I simply adapted to their preferences as we went along, 15 minutes a day…that is all.  When your self-directed learner is older and is studying a specific topic or discipline (higher math, sciences, computer science) you will want to find experts in these fields to help. Your goal is complete mastery of the subject and for this you will need an expert who might also be a teacher but not necessarily(!) Education is not as complicated as schools —the world of testing and diagnoses—-wants you to believe. Your goal is to keep it simple, because it is.  ",
            "date": "Answered December 6, 2019",
            "views": "496",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ngan Tran",
                    "user_href": "/profile/Ngan-Tran-86"
                },
                {
                    "user_id": "Lyric Thomas",
                    "user_href": "/profile/Lyric-Thomas-4"
                },
                {
                    "user_id": "Matt Laine",
                    "user_href": "/profile/Matt-Laine-7"
                },
                {
                    "user_id": "B Sheridan",
                    "user_href": "/profile/B-Sheridan-1"
                },
                {
                    "user_id": "Max Renshaw",
                    "user_href": "/profile/Max-Renshaw-1"
                },
                {
                    "user_id": "Sharon Marks",
                    "user_href": "/profile/Sharon-Marks-11"
                },
                {
                    "user_id": "Esse Hernández",
                    "user_href": "/profile/Esse-Hernández"
                },
                {
                    "user_id": "Lalthansangi Rozara",
                    "user_href": "/profile/Lalthansangi-Rozara"
                },
                {
                    "user_id": "Sara Kholiman",
                    "user_href": "/profile/Sara-Kholiman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Johansen",
                "href": "/profile/Paul-Johansen-2"
            },
            "answer_text": "Good question. Some close relatives of mine home schooled both their kids and they went on to do very well in life. One is a highly successful programmer who went on to sell some of his code for a fortune. The other, his sister was a really good nurse and now a mother of two she assists her husband who runs a software business. They have their own home. So no, I would say you don’t need an educational degree, although of course it would not do any harm, but you do need a caring attitude, discipline, dedication to purpose and a sound knowledge of what you are teaching. Most parents who home school are very determined to do a much better job of teaching their kids than the system they pulled them out of. ",
            "date": "Answered May 5, 2017",
            "views": "78",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Beth Carrera",
                    "user_href": "/profile/Beth-Carrera"
                },
                {
                    "user_id": "Amy Faith TenBrink",
                    "user_href": "/profile/Amy-Faith-TenBrink"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sara Matthews",
                "href": "/profile/Sara-Matthews-5"
            },
            "answer_text": "Homeschooling laws vary from state to state but in my state no- a parent does not need a degree in education and I'd guess that to be the same in other states. Not all teachers have a degree in education. They have taken education courses but as often their degree is in their subject field. In my state homeschooling children are visited every other year by a state- certified teacher who assesses what's been taught and mastered. ",
            "date": "Answered May 5, 2017",
            "views": "81",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sharon Marks",
                    "user_href": "/profile/Sharon-Marks-11"
                },
                {
                    "user_id": "Nicole Devault",
                    "user_href": "/profile/Nicole-Devault"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Woodworth",
                "href": "/profile/Daniel-Woodworth-2"
            },
            "answer_text": "Absolutely not! A parent who set out to homeschool might find an education degree to be a useful background, but it is emphatically not necessary—a homeschooling parent might also find a history, English, physics, or math degree equally useful. To a large extent education degrees are targeted toward the unique challenges of communal education. Although those are to an extent shared with homeschooling, home education really brings its own set of challenges. What’s needed to be a successful educator is a willingness to be an active participant who thinks through those challenges. As a matter of fact, a teacher in a communal setting doesn’t even need a college degree to be a good teacher (although it can be helpful as a way to standardize what each teacher knows). A homeschooling parent, for whom the education degree is only tangentially applicable, needs it even less. As a personal example, my mother dropped out of college part of the way through her degree in English. Of my siblings old enough to graduate high school, one is low-functioning autistic (which comes with its own set of achievements, but they’re harder to understand), but the other three graduated with honors from the second-most selective university in Texas with degrees in engineering, computer science, and geology—clearly in this case an education degree was not necessary ",
            "date": "Answered May 10, 2017",
            "views": "48",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Beth Carrera",
                    "user_href": "/profile/Beth-Carrera"
                },
                {
                    "user_id": "Sharon Marks",
                    "user_href": "/profile/Sharon-Marks-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicole Devault",
                "href": "/profile/Nicole-Devault"
            },
            "answer_text": "Depends on the laws of your state or country. My state requires the parent doing the schooling have at least a bachelors degree. It does not have to be in education, but the thought was if the parent has a decent, well-rounded education, they should be able to provide the same to their children. I also believe the kids have the take an assessment every year to be sure they are progressing within their age group. ",
            "date": "Answered May 5, 2017",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alice Kyi",
                "href": "/profile/Alice-Kyi"
            },
            "answer_text": "It's not necessary. But they must have parental abilities to homeschool their children. They must live systematically so that their children respect them. Degree isn't the connection between parent and their child. ",
            "date": "Answered May 5, 2017",
            "views": "60",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shelli King",
                    "user_href": "/profile/Shelli-King"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aria Kae Broeka",
                "href": "/profile/Aria-Kae-Broeka"
            },
            "answer_text": "Generally speaking, to teach your own children you do not need a degree, no. In my state there are almost no regulations on home schooling period. ",
            "date": "Answered May 5, 2017",
            "views": "4",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Leslie Hammer",
                    "user_href": "/profile/Leslie-Hammer-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hunter Vines",
                "href": "/profile/Hunter-Vines-1"
            },
            "answer_text": "No they have the right to teach there kids anything they want, but it will effect there kids going to collage. ",
            "date": "Answered May 5, 2017",
            "views": "50",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shelli King",
                    "user_href": "/profile/Shelli-King"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cindy Smith",
                "href": "/profile/Cindy-Smith-622"
            },
            "answer_text": "No. Some states require a high school diploma or GED. With all the curricula options we have, a high school diploma or GED is sufficient. ",
            "date": "Answered April 18, 2020",
            "views": "16",
            "upvotes": "0"
        }
    ]
}