{
    "title": "Does anyone fail in IIT or NIT? - Quora",
    "tags": [
        "New Indian Institutes of Technology (New IITs)",
        "Failure",
        "National Institutes of Technology (NITs)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pankaj Kumar",
                "href": "/profile/Pankaj-Kumar-19"
            },
            "answer_text": "I'll talk for IIT Madras. Failing in a particular subject: Yes, people do fail. That again is of two types:- Due to low marks- Due to shortage of attendance (here it's 85% minimum) In the first case you are allowed to take exam once more, if you fail again you have to repeat the course when it's offered again. In the second case you simply have to repeat the course all over again. Failing in the entire program:There is no such things as failing in B.tech technically. It's a credit based system. You have to earn a particular number of credits to get the degree. You can take at maximum 2 extra year over the normal duration of the program to earn them. i.e. 6 years for B.Tech and 7 years for Dual Degree.If you fail to do so by then, you are out. Also, slightly off the topic but interesting to note that in IITs 4 years for B.tech is normal duration of the program and not minimum. One can get his/her degree in less than 8 semesters if he/she successfully earns the required number of credits. ",
            "date": "Answered July 24, 2014",
            "views": "25",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mahesh Jethalia",
                    "user_href": "/profile/महेश-जेथलिया-Mahesh-Jethalia"
                },
                {
                    "user_id": "Ashutosh Pradhan",
                    "user_href": "/profile/Ashutosh-Pradhan-48"
                },
                {
                    "user_id": "Anwesha Bhattacharya",
                    "user_href": "/profile/Anwesha-Bhattacharya-28"
                },
                {
                    "user_id": "Steve Jobs",
                    "user_href": "/profile/Steve-Jobs-507"
                },
                {
                    "user_id": "Guru Prasad Das",
                    "user_href": "/profile/Guru-Prasad-Das-2"
                },
                {
                    "user_id": "Jagdish Gediya",
                    "user_href": "/profile/Jagdish-Gediya"
                }
            ]
        }
    ]
}