{
    "title": "Does a college brand name matter? - Quora",
    "tags": [
        "Talking Book - The Bhagavad Gita",
        "Names and Naming",
        "Brands and Branding",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jaya Surya",
                "href": "/profile/Jaya-Surya-13"
            },
            "answer_text": "I’m of an opinion that there’s more beyond the “Brand”, coming to pursuing good quality education and career. I’m definitely one of those students who aimed and got into top brands, and had a decent education there. But, ever since i got into the business of guiding students for Master’s education abroad, my opinion has slightly changed. The Craze for Branded Universities- Most of the students aiming for a great master’s education want to get into one of those “Branded” universities everyone is talking about. I’m not just talking about the Harvards and Stanfords of US but even the next tier of Universities such as University of California, LA or SD or North Carolina, Chapel Hill or TAMU, college station etc.. Remember, even these universities have a huge number of applicants from all around the world, especially from the Subcontinent, China, Korea etc.. . Getting into such Universities of course takes a great profile with good GPAs, GREs etc.. An added hurdle is the sheer amount of competition the applicants face. For example, even after guiding multiple students over the years, for us it’s still quite hard to tell if a student with a great profile can get into CS program of North Carolina, Chapel Hill or not. It really depends on how competitive the Pool of applicants is. Moving Beyond… What I can safely claim is that there are Universities which are almost on an equal footing as the “Popular” ones in terms of quality of education, but have somehow missed the limelight. To be honest, a few reasons for them not being that popular could be High tuition fees, Location, limited intake etc.. However, one secret advantage these Universities enjoy is the “Relatively low volume of applicants”. This very situation can increase one’s chances of admit into a great graduate course. Note that some courses in such universities might be ranked higher than the popular ones. Also, one’s chance of getting on campus jobs or Assistantship increases owing to less number of students in the program, which in turn decrease your expenses. Branded V/S Not-Branded- For many students, the “Craze for Brand” is not just the driving factor to aim for such universities, but the opportunities that are created in terms of Job. I cannot deny that. Graduating from a “Maryland, college park” or “Columbia” definitely turns heads. The competition is crushing though. On the other hand, graduating from a good Master’s course offered by these Not-branded Universities can also positively impact one’s resume, because employers usually look not only at the “brands” but also the content in an applicant. In my opinion, if you are looking for an enriching education experience, do not limit yourself by just applying for brands. You should also give a shot to the other set of Universities. QS rankings for some Popular Universities- University of California, Los Angeles – 35 University of Illinois, Urbana Champagne - 75 University of North Carolina, Chapel Hill- 90 University of Southern California- 129 Texas A&M, College Station – 189 University of Illinois, Chicago- 231 UMass, Amherst- 305 Northeastern University- 344 Stony Brook University, SUNY – 359 University of Texas, Dallas – 501-510 University of Cincinnati – 561-570 QS Rankings of some “Not so popular” Universities Northwestern University 31 Rice University 85 Boston University 98 Case Western Reserve 167 Vanderbilt 200 Dartmouth College- 207 Georgetown University- 226 University of Notre Dame- 241 Tufts University 253 LeHigh University 551-560 Drexel University 561-571 College of William and Mary – 600+ Of course some might not agree with the Universities in the “Not so Popular” list, but we have observed fewer students applying to them (from India). I also tried to include popular universities from different “Tiers” keeping all sorts of profiles in mind. ",
            "date": "Answered October 22, 2019",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maki Ogura",
                    "user_href": "/profile/Maki-Ogura"
                },
                {
                    "user_id": "Chandra Sandeep Yalamarthi",
                    "user_href": "/profile/Chandra-Sandeep-Yalamarthi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Apoorv Ashutosh",
                "href": "/profile/Apoorv-Ashutosh"
            },
            "answer_text": "Yes, it does. If you let it. Its really simple, really cool to say it doesn't matter at all. But it does, trust me. I am at a 3rd tier college in West Bengal. And the difference is not in your attitude, or whatever abstract term people use. Its in a much more real difference, a difference in the quality of education, and a difference in the opportunities present, that then causes a negative outlook amongst students. You realize immediately that most of the teachers don't have much of an idea about the stuff they're teaching. Those who do are difficult to find. Even the HODs and the senior teachers are often absolutely clueless about the stuff they teach. When I joined my college, and saw an incompetent nincompoop parading about as an HOD, simply because he is one. Whether he knows his subject doesn't matter. There is no scope for R&D in most such colleges. How can there be? The day-to-day functions are barely completed in such a place. How do you even expect a functioning R&D cell here. I was recently offered an internship at a start-up. I went to my HOD for an NOC, so I could complete my work there. He tells me, \"Whats the point of a student interning at a company? Don't your parents give you enough money already? Attend your classes, thats more important.\" Never mind the fact that I would be gone in my semester vacations, and wouldn't miss a class. Never mind that classes are barely held in the college. I then spoke to another teacher, who advised me to complete the internship, and then return with a medical certificate, just in case I missed any classes. This is just an example of what happens. There will be many more such problems. Naturally, you cannot broaden your horizons, or think beyond getting a basic job. Plus, there's the famous non-IITian stigma. Recruiters don't take you seriously. Your neighbours are more ashamed of you than your parents are. All of it takes its toll. The question is, what will you do about it? While I might seem rather pessimistic so far, I can tell you something else. It is at this place, that I have met some fantastic students. Who didn't give a damn where they were. Sayan Chowdhury, Ratnadeep Debnath, Kushal Das, Prithviraj Mukherjee and Soham Ghoshalare just some people from my college who I can name. They didn't let the college stop them, and are some of the most respected professionals in their fields today. This is just a small sampling. Even among my own friends, Souradeep De and Avik Ghosh are some people who haven't let the college's bad name stop them from crafting out a reputation from themselves. And how can I forget User, this guy is named in just about every major company's security hall of fame. And he's at BIT Mesra's extension centre, not even doing a B.Tech, but an BCA. Maybe speak to one of them someday. At times, you might not be able to help getting into a poor college. Thats understandable. Stuff happens. Yes, the college brand will matter, but its not everything. You can always step out of its shadow. At the end of the day, its only you that matters, no one, and nothing else comes close. All the best!! ",
            "date": "Answered February 17, 2014",
            "views": "92",
            "upvotes": " View 52 Upvoters",
            "upvoters": [
                {
                    "user_id": "Malsawmzuala Chhangte",
                    "user_href": "/profile/Malsawmzuala-Chhangte-2"
                },
                {
                    "user_id": "Rachel Smith",
                    "user_href": "/profile/Rachel-Smith-2780"
                },
                {
                    "user_id": "Elaine Rose",
                    "user_href": "/profile/Elaine-Rose-39"
                },
                {
                    "user_id": "Vivian Marne",
                    "user_href": "/profile/Vivian-Marne"
                },
                {
                    "user_id": "Ranjeet",
                    "user_href": "/profile/Ranjeet-94"
                },
                {
                    "user_id": "Alex Mann",
                    "user_href": "/profile/Alex-Mann-121"
                },
                {
                    "user_id": "Aashutosh Gawali",
                    "user_href": "/profile/Aashutosh-Gawali"
                },
                {
                    "user_id": "Aditi Yedake",
                    "user_href": "/profile/Aditi-Yedake"
                },
                {
                    "user_id": "Reyaan Hasaan",
                    "user_href": "/profile/Reyaan-Hasaan-1"
                },
                {
                    "user_id": "Ankita Bhatt",
                    "user_href": "/profile/Ankita-Bhatt-62"
                },
                {
                    "user_id": "Olivia Reilly",
                    "user_href": "/profile/Olivia-Reilly-21"
                },
                {
                    "user_id": "Soubhick Saha",
                    "user_href": "/profile/Soubhick-Saha"
                },
                {
                    "user_id": "Rajat Bansal",
                    "user_href": "/profile/Rajat-Bansal-35"
                },
                {
                    "user_id": "Sankalp Sachdev",
                    "user_href": "/profile/Sankalp-Sachdev-1"
                },
                {
                    "user_id": "Rahul",
                    "user_href": "/profile/Rahul-3210"
                },
                {
                    "user_id": "Sahil Kumar",
                    "user_href": "/profile/Sahil-Kumar-902"
                },
                {
                    "user_id": "JAY SHANKAR",
                    "user_href": "/profile/JAY-SHANKAR-86"
                },
                {
                    "user_id": "Abhishek Chauhan",
                    "user_href": "/profile/Abhishek-Chauhan-600"
                },
                {
                    "user_id": "Vivian Le",
                    "user_href": "/profile/Vivian-Le-15"
                },
                {
                    "user_id": "Whatsup",
                    "user_href": "/profile/Whatsup-22"
                },
                {
                    "user_id": "Yashika Mutreja",
                    "user_href": "/profile/Yashika-Mutreja"
                },
                {
                    "user_id": "Ronak Baghmar",
                    "user_href": "/profile/Ronak-Baghmar-1"
                },
                {
                    "user_id": "Shivani Pawar",
                    "user_href": "/profile/Shivani-Pawar-3"
                },
                {
                    "user_id": "Aman Sharma",
                    "user_href": "/profile/Aman-Sharma-705"
                },
                {
                    "user_id": "Naveen Joshi",
                    "user_href": "/profile/Naveen-Joshi-19"
                },
                {
                    "user_id": "Rahul Kumar",
                    "user_href": "/profile/Rahul-Kumar-13895"
                },
                {
                    "user_id": "Apoorv Ashutosh",
                    "user_href": "/profile/Apoorv-Ashutosh"
                },
                {
                    "user_id": "Pratik Puppal",
                    "user_href": "/profile/Pratik-Puppal"
                },
                {
                    "user_id": "Rohit Shinde",
                    "user_href": "/profile/Rohit-Shinde-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashwin A.K",
                "href": "/profile/Ashwin-A-K"
            },
            "answer_text": "It does. The reason is quite simple, it is proof of your discipline and smartness. Average people don’t get into the top universities, its those who slug it out on a consistent basis that make it in. And to survive on such campuses, you’re really going to have to up your game or risk being tossed aside onto the pavement. Its survival of the fittest, and this game played at the college trains them to survive the next challenge, getting a job. Not just any job, but the most drooled over jobs that ensures a comfy and luxurious life. The people who hire want a hard working individual who knows what he’s doing. If you hail from a prestigious college, that itself is proof of you meeting the above two conditions. Brand matters. Would you choose to buy a Nike shoe, or some local shoe? What if they were priced at the same rate? The answer is obvious even if they were priced differently. Why? Because Nike has a reputation of always delivering, both quality and style. That reputation is upheld by the bloodbath that goes on in their campuses, that produces such prized contenders, which the companies view as valuable assets. You can whine about how its not fair, but thats how it is. Its survival of the fittest, and the college you study at, will either lift your status up into the stars, or pull it down into the gutter. Choose wisely.  Photo by Joshua Chua on Unsplash ",
            "date": "Updated October 13, 2019",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rinkal Ranjan",
                    "user_href": "/profile/Rinkal-Ranjan"
                },
                {
                    "user_id": "Aditya Bavaskar",
                    "user_href": "/profile/Aditya-Bavaskar-4"
                },
                {
                    "user_id": "Subrahmanyam Balabhadrapatruni",
                    "user_href": "/profile/Subrahmanyam-Balabhadrapatruni"
                },
                {
                    "user_id": "Jacklien Lakra",
                    "user_href": "/profile/Jacklien-Lakra"
                },
                {
                    "user_id": "Anik Dey Shaon",
                    "user_href": "/profile/Anik-Dey-Shaon"
                },
                {
                    "user_id": "Seshadri Anantharaman",
                    "user_href": "/profile/Seshadri-Anantharaman"
                },
                {
                    "user_id": "Vivian Marne",
                    "user_href": "/profile/Vivian-Marne"
                },
                {
                    "user_id": "Tingting Li",
                    "user_href": "/profile/Tingting-Li-55"
                },
                {
                    "user_id": "Ranjeet",
                    "user_href": "/profile/Ranjeet-94"
                },
                {
                    "user_id": "Rallabandi Mahesh",
                    "user_href": "/profile/Rallabandi-Mahesh"
                },
                {
                    "user_id": "Mehmood Ali",
                    "user_href": "/profile/Mehmood-Ali-21"
                },
                {
                    "user_id": "Mrunal Lalwani",
                    "user_href": "/profile/Mrunal-Lalwani"
                },
                {
                    "user_id": "Aditi Yedake",
                    "user_href": "/profile/Aditi-Yedake"
                },
                {
                    "user_id": "Trung Phạm",
                    "user_href": "/profile/Trung-Phạm-18"
                },
                {
                    "user_id": "Random Name",
                    "user_href": "/profile/Random-Name-446"
                },
                {
                    "user_id": "Madhukar Bs",
                    "user_href": "/profile/Madhukar-Bs-1"
                },
                {
                    "user_id": "Tejas Ak",
                    "user_href": "/profile/Tejas-Ak"
                },
                {
                    "user_id": "Shubham Verma",
                    "user_href": "/profile/Shubham-Verma-631"
                },
                {
                    "user_id": "Sabita Brahma",
                    "user_href": "/profile/Sabita-Brahma-3"
                },
                {
                    "user_id": "Abhishek Das",
                    "user_href": "/profile/Abhishek-Das-962"
                },
                {
                    "user_id": "Maneesha Venigalla",
                    "user_href": "/profile/Maneesha-Venigalla"
                },
                {
                    "user_id": "Aarti Jarwani",
                    "user_href": "/profile/Aarti-Jarwani"
                },
                {
                    "user_id": "Rc Rudransh",
                    "user_href": "/profile/Rc-Rudransh"
                },
                {
                    "user_id": "Olivia Reilly",
                    "user_href": "/profile/Olivia-Reilly-21"
                },
                {
                    "user_id": "Mohit",
                    "user_href": "/profile/Mohit-1039"
                },
                {
                    "user_id": "Chunay Chaudhari",
                    "user_href": "/profile/Chunay-Chaudhari"
                },
                {
                    "user_id": "Shreyansh Singh",
                    "user_href": "/profile/Shreyansh-Singh-29"
                },
                {
                    "user_id": "Thiha Aung",
                    "user_href": "/profile/Thiha-Aung-49"
                },
                {
                    "user_id": "Mrinmoy Biswas",
                    "user_href": "/profile/Mrinmoy-Biswas-25"
                },
                {
                    "user_id": "Divyansh Bhatnagar",
                    "user_href": "/profile/Divyansh-Bhatnagar-37"
                },
                {
                    "user_id": "Roshin Rajesh",
                    "user_href": "/profile/Roshin-Rajesh"
                },
                {
                    "user_id": "JAY SHANKAR",
                    "user_href": "/profile/JAY-SHANKAR-86"
                },
                {
                    "user_id": "Nitumoni",
                    "user_href": "/profile/Nitumoni"
                },
                {
                    "user_id": "Shraddha Tripathi",
                    "user_href": "/profile/Shraddha-Tripathi-8"
                },
                {
                    "user_id": "Renit Anthony",
                    "user_href": "/profile/Renit-Anthony-1"
                },
                {
                    "user_id": "Whatsup",
                    "user_href": "/profile/Whatsup-22"
                },
                {
                    "user_id": "Mudrit kashyap",
                    "user_href": "/profile/Mudrit-kashyap"
                },
                {
                    "user_id": "Yashika Mutreja",
                    "user_href": "/profile/Yashika-Mutreja"
                },
                {
                    "user_id": "Rajavel KS",
                    "user_href": "/profile/Rajavel-KS"
                },
                {
                    "user_id": "Akashh Paul",
                    "user_href": "/profile/Akashh-Paul"
                },
                {
                    "user_id": "Dashmeet Kaur",
                    "user_href": "/profile/Dashmeet-Kaur-4"
                },
                {
                    "user_id": "Sharath Kumar",
                    "user_href": "/profile/Sharath-Kumar-442"
                },
                {
                    "user_id": "Darshan Patawari",
                    "user_href": "/profile/Darshan-Patawari-1"
                },
                {
                    "user_id": "Shivam Sharma",
                    "user_href": "/profile/Shivam-Sharma-103"
                },
                {
                    "user_id": "Soumya Meher",
                    "user_href": "/profile/Soumya-Meher"
                },
                {
                    "user_id": "Shailendra Singh",
                    "user_href": "/profile/Shailendra-Singh-18"
                },
                {
                    "user_id": "Ronak Baghmar",
                    "user_href": "/profile/Ronak-Baghmar-1"
                },
                {
                    "user_id": "Abhishek Sharma",
                    "user_href": "/profile/Abhishek-Sharma-1158"
                },
                {
                    "user_id": "Soumyajit Ganguly",
                    "user_href": "/profile/Soumyajit-Ganguly-2"
                },
                {
                    "user_id": "Priti Kairam",
                    "user_href": "/profile/Priti-Kairam"
                },
                {
                    "user_id": "Shreyas Pandey",
                    "user_href": "/profile/Shreyas-Pandey"
                },
                {
                    "user_id": "Tanvi N",
                    "user_href": "/profile/Tanvi-N-6"
                },
                {
                    "user_id": "Manoj Kumar",
                    "user_href": "/profile/Manoj-Kumar-23"
                },
                {
                    "user_id": "Gourab Mitra",
                    "user_href": "/profile/Gourab-Mitra"
                },
                {
                    "user_id": "Nihit Munakala",
                    "user_href": "/profile/Nihit-Munakala"
                },
                {
                    "user_id": "Karthik Vickraman",
                    "user_href": "/profile/Karthik-Vickraman"
                },
                {
                    "user_id": "Anjishnu Kumar",
                    "user_href": "/profile/Anjishnu-Kumar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly Boyce",
                "href": "/profile/Kelly-Boyce"
            },
            "answer_text": "Generally, as long as a school is legitimate/reputable (i.e. not a diploma mill), then the 'name' of the school will be unimportant to most employers, and only a small factor to those employers who actually do consider what school you went to. Employers mostly just care that you have your degree. The name of your school matters the most in terms of getting accepted into a competitive graduate program. The question \"Does the name of my school really matter?\" is relevant mostly to high school students. To them I would say, go to the school that is the best value. You are far better off graduating from a state school with no debt than taking out loans to attend a private university. If you are in a position where you have a full-ride at a prestigious school, then you are one of the lucky ones. The biggest difference truly in what school you attend is the quality of your experience there. This means that, in terms of personal growth, it is ideal to pick the school that is the best fit for you, and oftentimes it is the more prestigious schools that offer the best environments for growth. However, it is still best to make a wise financial decision. In terms of \"Will I get a job?\", however, any decent school will do. ",
            "date": "Answered August 2, 2013",
            "views": "39",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kartikay Sharma",
                    "user_href": "/profile/Kartikay-Sharma-67"
                },
                {
                    "user_id": "Asmita Saha (আস্মিতা সাহা)",
                    "user_href": "/profile/Asmita-Saha-আস্মিতা-সাহা"
                },
                {
                    "user_id": "Sagnik Acharjee",
                    "user_href": "/profile/Sagnik-Acharjee-1"
                },
                {
                    "user_id": "Anik Dey Shaon",
                    "user_href": "/profile/Anik-Dey-Shaon"
                },
                {
                    "user_id": "Ashutosh Agrawal",
                    "user_href": "/profile/Ashutosh-Agrawal-165"
                },
                {
                    "user_id": "Sarim Ahmed",
                    "user_href": "/profile/Sarim-Ahmed-3"
                },
                {
                    "user_id": "Arnab Mondal",
                    "user_href": "/profile/Arnab-Mondal-282"
                },
                {
                    "user_id": "Aarti Jarwani",
                    "user_href": "/profile/Aarti-Jarwani"
                },
                {
                    "user_id": "Olivia Reilly",
                    "user_href": "/profile/Olivia-Reilly-21"
                },
                {
                    "user_id": "Ayan Sadhukhan",
                    "user_href": "/profile/Ayan-Sadhukhan-2"
                },
                {
                    "user_id": "Iggi Thomas",
                    "user_href": "/profile/Iggi-Thomas"
                },
                {
                    "user_id": "Sam Drogo",
                    "user_href": "/profile/Sam-Drogo-3"
                },
                {
                    "user_id": "Srishal Sk",
                    "user_href": "/profile/Srishal-Sk"
                },
                {
                    "user_id": "Ankur Shukla",
                    "user_href": "/profile/Ankur-Shukla-25"
                },
                {
                    "user_id": "Ronak Baghmar",
                    "user_href": "/profile/Ronak-Baghmar-1"
                },
                {
                    "user_id": "Subhadeep Mitra",
                    "user_href": "/profile/Subhadeep-Mitra-5"
                },
                {
                    "user_id": "Yashika Mutreja",
                    "user_href": "/profile/Yashika-Mutreja"
                },
                {
                    "user_id": "Khushi Jain",
                    "user_href": "/profile/Khushi-Jain-155"
                },
                {
                    "user_id": "Sneha Sangwan",
                    "user_href": "/profile/Sneha-Sangwan"
                },
                {
                    "user_id": "Shubhashis Dey",
                    "user_href": "/profile/Shubhashis-Dey"
                },
                {
                    "user_id": "Ananya",
                    "user_href": "/profile/Ananya-16"
                },
                {
                    "user_id": "RuneSilver",
                    "user_href": "/profile/RuneSilver-1"
                },
                {
                    "user_id": "Riddhi Athreya",
                    "user_href": "/profile/Riddhi-Athreya"
                },
                {
                    "user_id": "Vyshali Dilip Kamath",
                    "user_href": "/profile/Vyshali-Dilip-Kamath"
                },
                {
                    "user_id": "Paul Souvik",
                    "user_href": "/profile/Paul-Souvik-1"
                },
                {
                    "user_id": "Abhishek Upadhyay",
                    "user_href": "/profile/Abhishek-Upadhyay-127"
                },
                {
                    "user_id": "ALIVELU ORIGANTI",
                    "user_href": "/profile/ALIVELU-ORIGANTI"
                },
                {
                    "user_id": "Gurman Mishra",
                    "user_href": "/profile/Gurman-Mishra"
                },
                {
                    "user_id": "Ashutosh Jha",
                    "user_href": "/profile/Ashutosh-Jha-66"
                },
                {
                    "user_id": "Shubham Sahamate",
                    "user_href": "/profile/Shubham-Sahamate-1"
                },
                {
                    "user_id": "Siddharth Mathur",
                    "user_href": "/profile/Siddharth-Mathur-22"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Zeeshan-19"
                },
                {
                    "user_id": "Arjun Dutta",
                    "user_href": "/profile/Arjun-Dutta-12"
                },
                {
                    "user_id": "Skr",
                    "user_href": "/profile/Skr-12"
                },
                {
                    "user_id": "Rahul Kumar",
                    "user_href": "/profile/Rahul-Kumar-377"
                },
                {
                    "user_id": "Soumyajit Ganguly",
                    "user_href": "/profile/Soumyajit-Ganguly-2"
                },
                {
                    "user_id": "Priti Kairam",
                    "user_href": "/profile/Priti-Kairam"
                },
                {
                    "user_id": "Daniel Wolf",
                    "user_href": "/profile/Daniel-Wolf-3"
                },
                {
                    "user_id": "Megha Sharma",
                    "user_href": "/profile/Megha-Sharma-99"
                },
                {
                    "user_id": "Amit Sharma",
                    "user_href": "/profile/Amit-Sharma-277"
                },
                {
                    "user_id": "Brij Kishore Mishra",
                    "user_href": "/profile/Brij-Kishore-Mishra"
                },
                {
                    "user_id": "Mandar R. Mutalikdesai",
                    "user_href": "/profile/Mandar-R-Mutalikdesai"
                },
                {
                    "user_id": "Ishank Sharma",
                    "user_href": "/profile/Ishank-Sharma"
                },
                {
                    "user_id": "Subhodip Biswas",
                    "user_href": "/profile/Subhodip-Biswas"
                },
                {
                    "user_id": "Nivas Kumar",
                    "user_href": "/profile/Nivas-Kumar-3"
                },
                {
                    "user_id": "Anvy Shetty",
                    "user_href": "/profile/Anvy-Shetty"
                },
                {
                    "user_id": "Sneha Bhattacharya",
                    "user_href": "/profile/Sneha-Bhattacharya"
                },
                {
                    "user_id": "Himanshu Tagra",
                    "user_href": "/profile/Himanshu-Tagra-1"
                },
                {
                    "user_id": "Paras Vora",
                    "user_href": "/profile/Paras-Vora"
                },
                {
                    "user_id": "Chandan Singh",
                    "user_href": "/profile/Chandan-Singh-11"
                },
                {
                    "user_id": "Bidhan Pathak",
                    "user_href": "/profile/Bidhan-Pathak"
                },
                {
                    "user_id": "Sayan Chowdhury",
                    "user_href": "/profile/Sayan-Chowdhury"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arzoo Sahni",
                "href": "/profile/Arzoo-Sahni-4"
            },
            "answer_text": " We all know that how much important education is. In every year millions of scholars complete their 10+2 education and take entry in the new phase of life with the hope of making it top Universities and colleges .And, for all these pass out students there are plenty of colleges that are try hard every year to get their attention and fill up their seats. The pressure on students to put immense work hard and score well to get into a decent college is main thing that everybody wants. But, there is something that goes hidden from the students and parents, i.e., the struggle that colleges face to attract the students towards them for admission and keep up with the pace. No matter what, the education sector has become a business because of some money minded businessman who invest in education sector and build a building of money making ideas rather quality education, and it runs on money and efforts taken by humans. It is like any other business project that requires constant capital and nurturing. What makes a college BRAND? I will tell you, Its students, when after completing the course students give positive feedback that is called brand, and it will be possible when a college imparts excellent knowledge, changes individual temperament, Provides good practical knowledge, Placements, because brand name matters to great extent after when it comes to get a good job and skills. There are many fake brands also that bribe many news agencies for attractive advertisements. At the time of admission you should be careful about these fake attractions. I will make you understand with an example- I am a student of KCC Institute of Technology and Management in greater Noida. I took admission in this institute because it has a new set of curriculum that were designed and develop with an extensive research of latest market trends and the prospects of future. College , over a period of time, developed an authority in the domain as it is the only institute in that area which started with the courses that were job oriented. It offers B.Tech with specializations As the time passed by and when other colleges realized the importance of these courses that are being taught in the university KCC and they also started some of courses. Since the KCC was the first one to provide these courses it led the race and still leading . But, after a course of period colleges started the same course things went down. Because you can make a exact copy but original always remain the same. I got placed in a renowned company with a package of 10LPA. and this is equal to an average IIT student. All i want to say sometimes you get trapped in wrong branding so just make a wise decision on your own. I visited the colleges of Greater Noida, but no one is even closer to KCC in terms of specialized course. I am not saying that other colleges are not providing extra courses but not as good as KCC. KCC is the only college which is authorized academic partner with AUTODESK in Greater Noida. Thank You!! ",
            "date": "Answered May 28, 2020",
            "views": "941",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harshit Rohtela",
                    "user_href": "/profile/Harshit-Rohtela-1"
                },
                {
                    "user_id": "Aditi Yedake",
                    "user_href": "/profile/Aditi-Yedake"
                },
                {
                    "user_id": "Tanishq Verma",
                    "user_href": "/profile/Tanishq-Verma-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Randy Long",
                "href": "/profile/Randy-Long-26"
            },
            "answer_text": "Unfortunately yes, I once thought of applying for a job and realize it was full of MIT people, was a good old boy society, they only hired their own kind. This is way before the Microsoft, Google, Amazon, culture, stupid and absurd questions are asked in interviews. It’s a pity because college is just what you put into it, whether it’s Ivy League or not. And many people graduate from Ivy League school that floated through them because of family wealth. I had a friend who who interviewed for a job, he was told if he got it, he would have to shave his beard. One of his old professors asked him, do you really want to work for an outfit like that? It’s the same for people who hire on brand college name. ",
            "date": "Answered April 12, 2020",
            "views": "525",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shailesh Hatte",
                "href": "/profile/Shailesh-Hatte"
            },
            "answer_text": "It doesn't matter in the ultimate aims of your life. But, you will feel like it does in your day to day life.If you want to be recognised just by your college name then it is advisable for you to get a good college. On the other hand, if you want to be recognised by your deeds, then just get an admission to the college of your domain and excel in your field. You have got to sacrifice and/or choose one of these.All the best buddy! If you want further explanation, let me know. ",
            "date": "Answered February 16, 2014",
            "views": "24",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaya Surya",
                    "user_href": "/profile/Jaya-Surya-13"
                },
                {
                    "user_id": "Olivia Reilly",
                    "user_href": "/profile/Olivia-Reilly-21"
                },
                {
                    "user_id": "Ronak Baghmar",
                    "user_href": "/profile/Ronak-Baghmar-1"
                },
                {
                    "user_id": "Shyang Bian",
                    "user_href": "/profile/Shyang-Bian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sourabh Agrawal",
                "href": "/profile/Sourabh-Agrawal-2"
            },
            "answer_text": "yes. it does. ",
            "date": "Answered February 16, 2014",
            "views": "1",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adarsh Chaurasiya",
                    "user_href": "/profile/Adarsh-Chaurasiya-31"
                },
                {
                    "user_id": "Shilpa Suri",
                    "user_href": "/profile/Shilpa-Suri-8"
                },
                {
                    "user_id": "Raghav Verma",
                    "user_href": "/profile/Raghav-Verma-130"
                },
                {
                    "user_id": "Shilpa Suri",
                    "user_href": "/profile/Shilpa-Suri-10"
                },
                {
                    "user_id": "Vinod Sindhi",
                    "user_href": "/profile/Vinod-Sindhi-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leona Sharon",
                "href": "/profile/Leona-Sharon-1"
            },
            "answer_text": "Not always until you can prove yourself to the employer. If you have the required skill then branding of college doesn't matter.. Good college and good score is just a gate-pass to employability but in the long run your skill is what matters the most. ",
            "date": "Answered February 17, 2014",
            "views": "21",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Olivia Reilly",
                    "user_href": "/profile/Olivia-Reilly-21"
                },
                {
                    "user_id": "Rohitha Manchineella",
                    "user_href": "/profile/Rohitha-Manchineella"
                },
                {
                    "user_id": "Yashika Mutreja",
                    "user_href": "/profile/Yashika-Mutreja"
                },
                {
                    "user_id": "Ronak Baghmar",
                    "user_href": "/profile/Ronak-Baghmar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Regina Brown",
                "href": "/profile/Regina-Brown-7"
            },
            "answer_text": "Branding sometimes matter but it's certainly not above your potential or skill. But, combination of both,i.e., a branded college and your skills can take you to the peak of success. ",
            "date": "Answered March 5, 2014",
            "views": "19",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sakshi Singh",
                    "user_href": "/profile/Sakshi-Singh-1151"
                },
                {
                    "user_id": "Elsa Smith",
                    "user_href": "/profile/Elsa-Smith-38"
                },
                {
                    "user_id": "Neeru Soni",
                    "user_href": "/profile/Neeru-Soni-19"
                },
                {
                    "user_id": "Olivia Reilly",
                    "user_href": "/profile/Olivia-Reilly-21"
                },
                {
                    "user_id": "Anshul Vaidya",
                    "user_href": "/profile/Anshul-Vaidya-5"
                },
                {
                    "user_id": "Sagar Bhat",
                    "user_href": "/profile/Sagar-Bhat-8"
                },
                {
                    "user_id": "Rajavel KS",
                    "user_href": "/profile/Rajavel-KS"
                },
                {
                    "user_id": "Akshit Mittal",
                    "user_href": "/profile/Akshit-Mittal-23"
                },
                {
                    "user_id": "Ronak Baghmar",
                    "user_href": "/profile/Ronak-Baghmar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amey Jain",
                "href": "/profile/Amey-Jain"
            },
            "answer_text": "Brand increases opportunities that you may also get if you study from a average college but then you have to work more hard for it. Brand will help surely, you may not need that much skill if you are studying from a brand. Studying from a average college you have to prove yourself at every step ahead, so try your best.ATB ",
            "date": "Answered May 23, 2014",
            "views": "19",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arnab Mondal",
                    "user_href": "/profile/Arnab-Mondal-282"
                },
                {
                    "user_id": "Olivia Reilly",
                    "user_href": "/profile/Olivia-Reilly-21"
                },
                {
                    "user_id": "Sarthak Saxena",
                    "user_href": "/profile/Sarthak-Saxena-17"
                },
                {
                    "user_id": "Ravi Prakash",
                    "user_href": "/profile/Ravi-Prakash-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Praga",
                "href": "/profile/Praga-1"
            },
            "answer_text": "Firstly, any institution or an organizaion would require a brand name. Even if it is a charity organisation, it would still require a brand name, and the founder should be cautious of it, because, any entity would have some gain, even if it may not be a financial gain. For eg., in this case, when the vision is to provide good education to students, gaining student reach itself is a gain. Above all, these days educational institutions are also made into commercial business, in that case as well, we do require a brand name. ",
            "date": "Answered May 24, 2018",
            "views": "906",
            "upvotes": " Answer requested by Pankhuri Srivastava",
            "upvoters": [
                {
                    "user_id": "Olivia Reilly",
                    "user_href": "/profile/Olivia-Reilly-21"
                },
                {
                    "user_id": "Apoorv Ashutosh",
                    "user_href": "/profile/Apoorv-Ashutosh"
                },
                {
                    "user_id": "Rahithya Sampathi",
                    "user_href": "/profile/Rahithya-Sampathi"
                },
                {
                    "user_id": "Amit Chowdhary",
                    "user_href": "/profile/Amit-Chowdhary-1"
                },
                {
                    "user_id": "Devanshu Dwivedi",
                    "user_href": "/profile/Devanshu-Dwivedi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malik Arman",
                "href": "/profile/Malik-Arman-6"
            },
            "answer_text": "Never…. Nobody ask your college name in company what matters is you skills ",
            "date": "Answered July 6, 2019",
            "views": "126",
            "upvotes": "0"
        }
    ]
}