{
    "title": "Does corporal punishment the best means to correct truancy and stubbornness in students? - Quora",
    "tags": [
        "Truancy",
        "Spanking (corporal punishment)",
        "Discipline",
        "Punishment",
        "Students",
        "Schools",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elizabeth Entn",
                "href": "/profile/Elizabeth-Entn"
            },
            "answer_text": "No assaulting someone and beating someone up in a professional setting such as student teacher is not the best approach. It is an approach that would ideally land the assaulter in prison. If the laws would not land the assaulter in prison, the person beating up children will have to live with the fact they are an adult, who beat up children. I’m not sure of the age of the kids, but usually attendance tied to grades works. If kids are not taking school seriously at all and not showing up, it may be many things. First of all maybe they HAVE been hit in school by teachers which would cause a form of PTSD. I certainly would not want to attend a school where I was physically assaulted - being truant would then be a healthy reaction for unhealthy circumstances. Maybe some of the children have issues at home? Maybe the culture (again I don’t know where you live) isn’t valuing education and there needs to be a systemic solution. But I can tell you - i would not want to go anywhere I was hit. ",
            "date": "Answered October 24, 2020",
            "views": "50",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rakesh Tripathi",
                    "user_href": "/profile/Rakesh-Tripathi-216"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gaspar Marino",
                "href": "/profile/Gaspar-Marino"
            },
            "answer_text": "If a student is stubborn, punishment is not going to change that personality trait. As far as truancy is concerned, from my own experience, I was caught cutting class in middle school(grade 7 or 8) school called my dad…I received a good hard bare bottom belting when he got home….I never cut or missed a day of school after that…all through high school and college. So it worked for me. ",
            "date": "Answered October 24, 2020",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Colin Harrison",
                    "user_href": "/profile/Colin-Harrison-67"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colin Harrison",
                "href": "/profile/Colin-Harrison-67"
            },
            "answer_text": "It is one of the means to correct truancy but there are others which can be as effective not involving a corporal punishment, eg detention or reports to parents and the cancelling of privileges ",
            "date": "Answered October 24, 2020",
            "views": "50",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Elizabeth Entn",
                    "user_href": "/profile/Elizabeth-Entn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Caveman Broda",
                "href": "/profile/Caveman-Broda"
            },
            "answer_text": "Yes it is spare the rod spoil the kid. The strap is needed to correct them. The truth seeker ",
            "date": "Answered October 25, 2020",
            "views": "16",
            "upvotes": "0"
        }
    ]
}