{
    "title": "How to qualify for the BHU online entrance exam for a BSc in physics - Quora",
    "tags": [
        "Bachelor of Science in Physics",
        "Indian Institute of Technology Varanasi (IIT BHU)",
        "Banaras Hindu University",
        "Exam Strategies",
        "Exam and Test Advice",
        "Bachelor of Science Degrees",
        "University Exams and Tests",
        "Physics",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anushka Sharma",
                "href": "/profile/Anushka-Sharma-484"
            },
            "answer_text": "Hey there! I am pursuing B.Sc. (Hons.) Mathematics from the Banaras Hindu University. I had secured an AIR 549 and female category rank of 77 in the UET examination. So it's quite easy to make it to Institute of Science , BHU, if you have very clear basics.Clear concepts will help you sail through. So considering that you have already prepared for your boards examination, I'll be giving you some end time tips for the BHU UET. Let's take it for one subject at a time. For mathematics, just revise it up with NCERT. Solve all variety of questions and make sure you do not miss any type. Practice as much as possible because the questions in the exam are going to be lengthy. You will even be able to find some direct questions from the NCERT in the paper. So, at least go through the NCERT books of both 11 and 12 standards. Also, prepare all the formulae thoroughly.Talking about physics, the paper would consist of numericals and conceptual problems. So, prepare all the formulae very thoroughly. Next, practice numericals. They won't be very hard but will be asked from almost all of the syllabus. So, practice them. If you don't have enough time, read NCERTs, at least for chapters like semiconductors, atoms, nuclei, heat, thermodynamics etc. Again, taking into account this quarantine time, you have got ample time so you could read HC Verma sir's book for building up your concepts plus you can solve some initial numericals as well. That will do it all.Finally, coming to chemistry. All I would say here is,NCERT is your Ramayana, Bible, Quran everything. Just prepare the NCERTs the best way you can and you will get all the questions done.Some important tips are here for you. Just practice time management so that you do not suffer during the exam. It's not important to attempt all question but make sure the one's you are doing are correct. Do no leave incomplete the problem you start to solve just because you feel it's taking a lot of time. If you know it, do it.Finally, have faith and confidence in yourself. You have been working the entire year and you know it all. Believe it. You will get through it.So yeah, that's it. All the very best! ",
            "date": "Answered March 31, 2020",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shanya Rai",
                    "user_href": "/profile/Shanya-Rai-1"
                },
                {
                    "user_id": "Shreyas Singh",
                    "user_href": "/profile/Shreyas-Singh-24"
                },
                {
                    "user_id": "Upendra Chaubey",
                    "user_href": "/profile/Upendra-Chaubey-14"
                },
                {
                    "user_id": "Kunwar Aditya Pratap Singh",
                    "user_href": "/profile/Kunwar-Aditya-Pratap-Singh-1"
                }
            ]
        }
    ]
}