{
    "title": "How to stop myself from playing video games and focus on school even though it is boring - Quora",
    "tags": [
        "Dealing with Boredom",
        "Boredom",
        "Focusing and Concentrating",
        "PC Gaming ",
        "Games",
        "Self-Improvement",
        "Video Games",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeffrey Hall",
                "href": "/profile/Jeffrey-Hall-106"
            },
            "answer_text": "Close any video game apps.Put anything you need to play videogames somewhere hard to get to, e.g. on the top of a high dresser behind some other stuff. This highly reduces the temptation.Force yourself to finish your work before you play videogames. And when you do finish your work, you can play videogames guiltlessly.Try to do work as much as possible on non-electronic devices.If you can’t resist the temptation, give your videogames to your parents and don’t request them back until you’re done with homework.Also, let me just say that I was once in your position as well. I loved videogames and just could not stop playing them long enough to get my homework done. Now, I’ve learned to balance my life a bit more. I’ve learned to get the boring work done as soon as possible so I can play videogames without feeling guilty. I get A’s and B’s in school, and I still find time to play video games several hours a day. The 5 points I listed above worked well for me, and hopefully will for you too. Good luck :) ",
            "date": "Answered September 19, 2019",
            "views": "113",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nicola Darbyshire",
                    "user_href": "/profile/Nicola-Darbyshire-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Xavier Starr",
                "href": "/profile/Xavier-Starr-1"
            },
            "answer_text": "Well there are 2 things I'm aware of that you can do Put all your gaming console far away from your reach - This will create a barrier between your mind from accessing the console and eventually drift you apart from it, and this develops a mindset by which you may find other activities more interestingKeep to a schedule - This option is difficult at first, but if you are willing to commit to it, you actually will have time to play video games. By this I mean, draw up a weekly schedule that includes all the time you need to study and focus on your schoolwork (homework and assignments) and how much time you'll need to complete them efficiently. Remember you need to be committed and comfortable with the pace you're working at. During the weekends, it's an opportunity to play video games for about 1–3 hours. Your school work will become interesting only when you decide to make it passionate about!It will happen only when you decide to take control of what you want to do, so don't leave it for tomorrow,, start today to make the progress run for itself to show, best of luck..",
            "date": "Answered September 20, 2019",
            "views": "73",
            "upvotes": " Answer requested by Carter Bolles"
        },
        {
            "author_info": {
                "name": "Marc Ortega",
                "href": "/profile/Marc-Ortega-4"
            },
            "answer_text": "What I did was I just find an alternative hobby to videogames. Right now I'm doing martial arts as my stress free hobby. Its enough to keep me satisfied but also not as addicting compared to gaming. I noticed other people say to store your consoles away and for me personally I cant do it because i know where it is. I would probably ask a family member and tell them to store the console away in a location you dont know where to find. That or sell your consoles. Once done with that, the next alternative to that is using your phone which isnt as addicting compared to gaming. ",
            "date": "Answered September 24, 2019",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roman Buloichyk",
                "href": "/profile/Roman-Buloichyk"
            },
            "answer_text": "By isolating yourself from one thing and exposing to the other. But doing this head-on will lead to resistance, like, it's very hard to just stop playing videogames and start focusing on all school stuff without having a good reason to do this. You have to find something engaging in studying, like you find something engaging in videogames. ",
            "date": "Answered September 26, 2019",
            "views": "14",
            "upvotes": " Answer requested by Carter Bolles"
        },
        {
            "author_info": {
                "name": "Ron LeFew",
                "href": "/profile/Ron-LeFew"
            },
            "answer_text": "Simple. Remove the temptation. Take the power cord or phone (not sure what you play on) and give them to a parent to hold onto until your school work is done. ",
            "date": "Answered September 19, 2019",
            "views": "19",
            "upvotes": "0"
        }
    ]
}