{
    "title": "How does learning occur? How can you facilitate this in a classroom? - Quora",
    "tags": [
        "Classrooms",
        "Educational Technology",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Josephine Misson",
                "href": "/profile/Josephine-Misson"
            },
            "answer_text": "Learning occurs when a teacher transmits knowledge to a student and that the latter retains the material. In my opinion, Technology is changing the way students learn but also the way professors teach! And this is great news, teachers should embrase this situation! Times are changing and technology is everywhere. Putting this reality to the good of education is a must and the benefits from it are real! Technology can bring many benefits to education and facilitate the learning and teaching experience. Such as using these mobile devices that usually distract your students in class to a better good. This can be done by improving participation and interaction with your audience. One great benefit is for instance, the fact that technology enables very effective audience response systemsin classrooms. Audience response systems are a great way of increasing the level of participation and interaction with your audience and students tend to enjoy the class more and remember the content better. Wooclap is an awesome and easy tool for that. It’s a great interactive tool used on all devices; smartphones, tablets and computers. All you need is the link to the website and you can turn presentations, classes, meetings into a great interactive experience. It is a good way to change the rhythm of classes by transferring part of the learning directly to your participants. This allows great interaction, collaboration and more engagement from your classroom. Go check the website : https://www.wooclap.com/en/. Check out Wooclap’s twitter account: wooclap (@wooclap) | Twitter for more info on the benefits of technology in education! ",
            "date": "Answered May 7, 2018",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sébastien Lebbe",
                    "user_href": "/profile/Sébastien-Lebbe"
                },
                {
                    "user_id": "Justine Gerard",
                    "user_href": "/profile/Justine-Gerard-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Noel Walker",
                "href": "/profile/Noel-Walker-18"
            },
            "answer_text": "Learning occurs through experiences, and as a teacher, you set up experiences for students that will foster learning. For example, a kindergarten teacher may tell the same story about jack the rabbit every day, projecting the story and the words from her computer onto the board. Each day different words are highlighted and the class has to say that word instead of the teacher. With each new day, another word is highlighted until one day the majority of words are highlighted and the students are reciting those words themselves. Throughout the day, then, the teacher will focus on those words as ‘words of the day’ - students may write them, color them, spell them out with blocks, and other hands on things… and that’s how they start learning to read. So as a teacher, you start with your objective- what you want the students to learn- and then you think of a thousand interesting ways to get them to learn it. One or two ways are never enough- 3 ways is the minimal for me- and then you plan out the activities you thought of to relate to your objective, you implement it to the class, then evaluate whether it worked- did they learn it? And if they didn’t, don’t worry, you can try again tomorrow. ",
            "date": "Answered May 5, 2018",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Pattison",
                "href": "/profile/Robert-Pattison-4"
            },
            "answer_text": "It is hard work! But you may have noticed that some students know the name of all their favourite team members and their team's statistics. If you ask them when they learned them, they don't know! It wasn't a formal process. I had to take a relief lesson. The instructions were something like” Do odd-numbered questions on page ABC exercise XYZ” It was algebra. I had started writing on the board, but I stopped and told them a story about algebra and how it is one of the major breakthroughs in history. I had noticed there was an adult in the class, I did not know why, but it turned out he was a specialist teacher for the Aboriginal students in the class. At the end of the lesson, he rushed forward and said: “you had my students full attention all through the lesson, I have not seen it before, do you know you were using traditional Aboriginal storytelling techniques”? I said, “No, I was using traditional Fijian storytelling techniques!” We both laughed. But everyone loves a story. When teaching in Fiji for six years I found that that is the traditional way of passing on knowledge. Interestingly the pass rate in the exams went up too. I teach maths and physics. I have books on the lives of mathematicians and physicists. Maths and physics did not just “appear.” Very interesting people were totally involved. Learn about them and a lot follows, on my last visit to the UK I spent an afternoon in the house where Sir Isaac Newton once lived. It is very well set out for students. ",
            "date": "Answered October 7, 2019",
            "views": "578",
            "upvotes": "0"
        }
    ]
}