{
    "title": "How to score 600+ marks in the NEET (I've got 65 days left to study and still haven’t started the preparation yet) - Quora",
    "tags": [
        "NEET 2017 Preparation",
        "NEET 2018 Preparation",
        "NEET Preparation",
        "All India Institute of Medical Sciences (AIIMS)",
        "Studying Advice",
        "Exam and Test Advice",
        "National Eligibility cum Entrance Test (NEET)",
        "Exam and Test Preparation",
        "Studying",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "ClearExam",
                "href": "/profile/ClearExam-1"
            },
            "answer_text": "See For cracking NEET, NCERT is enough. All you have to do is study each chapter line by line, understand it, analyze it, make 3 D images while studying it. After you are done with a chapter. Read it again thoroughly. Create your own question with each line you study. Keep two sheets/copies with you.  One for short notes and other for important formulas. This will help you in revising later. After doing all this Hot yourself with all the questions you can find on that particular chapter and try and answer it REVISION, REMEMBER, PRACTICE These are the keys to crack Neet. You must revise all the chapters you have already studied. REVISE them regularly. Revise from short notes you made. It'll take less time.If you haven't rememberd the formulas, the pointers. There's no point studying. Because in the main examination, if you don't know a formula you can't answer that particular question.Practice…. The more question you practice, the more will be your chances for cracking it. Practice opens up our mind. It makes us deal with any question that come up. It helps in building confidence.Coming to PHYSICS. It's okay, if you are weak at it. All you need to do is Concept clearing - first make yourself clear about what the topic is saying, what's it's based, what are all the applications under it.How to apply - After getting through the concept clearing. See for where you can apply it, how you can apply it. On which types of questions you can apply.Practice - Do as many question on that particular topic. So that you won't forget it later.All the best!! Hope it helps!! ",
            "date": "Answered July 27, 2020",
            "views": "11",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Swapnil Patil",
                    "user_href": "/profile/Swapnil-Patil-1302"
                },
                {
                    "user_id": "Shakti Kumar",
                    "user_href": "/profile/Shakti-Kumar-420"
                },
                {
                    "user_id": "Ananthakrishnan A",
                    "user_href": "/profile/Ananthakrishnan-A-5"
                },
                {
                    "user_id": "Arjun",
                    "user_href": "/profile/Arjun-1473"
                },
                {
                    "user_id": "Soniya",
                    "user_href": "/profile/Soniya-224"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mansi",
                "href": "/profile/Mansi-504"
            },
            "answer_text": "Yes you can prepare fron now Because you are surely 12th passed now, so you know very little basics so revise some basic concepts first then start from high weightage chapters it will help you to get good marks Now much books isn't require because of time so you just focus on NCRET and previous year questions is must…you can find previous year question on internet And if you don't understand some chapter then go to youtube there are many teachers who studied for Neet like Biomentors,unacdemy neet etc you can study from there According to me Biomentors is best and it's depends on you from which teacher you can understand so please explore and study You can get your desire marks now Start study from now ",
            "date": "Answered July 23, 2020",
            "views": "221",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ananthakrishnan A",
                    "user_href": "/profile/Ananthakrishnan-A-5"
                },
                {
                    "user_id": "Sneha Venkatesan",
                    "user_href": "/profile/Sneha-Venkatesan-4"
                }
            ]
        }
    ]
}