{
    "title": "How to master maths of class 10 - Quora",
    "tags": [
        "Maths Class 10",
        "Mathematics Education Advice",
        "Mathematics Exams and Tests",
        "Exam and Test Preparation Advice",
        "Educational Exam and Test Advice",
        "Studying Advice",
        "Mathematics Education",
        "Academic and Educational Advice",
        "How-to Question",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sonal Prasad",
                "href": "/profile/Sonal-Prasad-12"
            },
            "answer_text": "Maths was my enemy for almost whole of my school life. The subject became a huge hindrance in me getting my high scores. Let me tell you I went about tackling it(my method worked in 2013, I am sure it works even today). Let’s go in steps: I joined a tuition. Cliche, I know. It helped me though. Tuition helped me to allot a specific amount of time to maths everyday. I made it a point to join a tuition which has a small batch size, so that I can easily talk and clarify my doubts with my teacher.Solve all the NCERT questions. I tell this to every student. NCERT textbook is your Bible. Be thorough with all the sums(including examples) of NCERT. When I say solve, I mean take a pen and book, write and solve. DO NOT READ MATHS, PRACTICE IT.When you are practicing maths, keep a thin book with you to write down all the formulae. Make sure you write what each variable stands for. Whenever you have time, go through formulae. If not use it for last minute reference before entering your exam hall.After solving NCERT questions thoroughly, dig up all previous year question papers. Dig previous 10 year’s question paper. Solve them using timer. Make sure you complete your paper( write the answer the way you would write in your exam, with all the steps) in 2.5 hrs. Attempt your co-ordinate geometry and statistics questions also within this 2.5 hours. This will improve your speed.Grab a reference book, I used Together with and R.D.Sharma. Try solving them as much as possible. Approach your tuition of school teacher if you are not able to solve. Please remember, while checking the solutions of solved questions in reference book, there is a chance that your method might be different or your final answer does not match. Don’t fret, books can be wrong at times. Again, approach your teacher.Remember your exam is a written exam and maths is a subject which can have calculation mistakes while writing, hence practice writing.DO NOT use calculator while practicing the questions. Calculate manually. Once you have finished doing the exercise, cross-check using calculator.(A tip) Usually the numbers used in the questions would be such that the calculation becomes easy. Usually you will get a perfect answer within few steps. If you didn’t probably you are using a longer method or your answer is wrong. Crosscheck!(Not applicable for R.D.Sharma’s questions)I am sorry the answer went long, but this is what I did. It seems like a lot but trust me, it is difficult to do. After doing all of this, my marks in 10th was 10.00(CGPA) and in 12th it was 99/100. I am telling you my marks so that you know that the method actually works. I had a group of friends with whom I used to practice and all of them got equally good marks. I hope this helps you. All the best! ",
            "date": "Answered March 5, 2019",
            "views": "19",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Beena Pant",
                    "user_href": "/profile/Beena-Pant-5"
                },
                {
                    "user_id": "Tejas .B.Chinnanagoudar",
                    "user_href": "/profile/Tejas-B-Chinnanagoudar"
                },
                {
                    "user_id": "PARVEEN BHATIA",
                    "user_href": "/profile/PARVEEN-BHATIA-10"
                },
                {
                    "user_id": "Yash Negi",
                    "user_href": "/profile/Yash-Negi-23"
                },
                {
                    "user_id": "Nidhi Gupta",
                    "user_href": "/profile/Nidhi-Gupta-1321"
                },
                {
                    "user_id": "Farhan Nish",
                    "user_href": "/profile/Farhan-Nish"
                },
                {
                    "user_id": "Preeti Rai",
                    "user_href": "/profile/Preeti-Rai-181"
                },
                {
                    "user_id": "Indu Balakrishnan",
                    "user_href": "/profile/Indu-Balakrishnan-2"
                },
                {
                    "user_id": "Madhusudan Kulkarni",
                    "user_href": "/profile/Madhusudan-Kulkarni-6"
                },
                {
                    "user_id": "Sunil Sharma",
                    "user_href": "/profile/Sunil-Sharma-134"
                },
                {
                    "user_id": "Vishal Rajput",
                    "user_href": "/profile/Vishal-Rajput-481"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shivam",
                "href": "/profile/Shivam-542"
            },
            "answer_text": "Maths is a very important subject or we can say that it is a very scoring subject. If you master the maths of class 10 then it would definitely help you in class 11 ( If you would take maths in class 11). Let me tell you what I did to get good marks in maths and what I did wrong during the preparation of maths in class 10. Your concepts should be clear - For mastering maths, your concepts should be crystal clear. Go through NCERT, Youtube videos, etc to understand the concepts.Practice Practice!! - Without daily practice, you cannot master maths. Maths is not a subject to mug up the answers. It needs practice. Practice different types of question from different books ( If you have completed your NCERT)Solve NCERT thoroughly- Ncert should be your first priority. First complete NCERT then go for other books.Never ever rely on NCERT - It may sound absurd but remember you want to MASTER MATHS. You do not want to just pass in the exams. Once you have completed NCERT, go for higher level books like- RD SHARMA, RS AGGARWAL. I Think it is a MUST to solve RD SHARMA or the latter one to master maths. Don’t solve all the questions of RD SHARMA but at least solve the solved examples and few questions from HOTS ( High Order Thinking Skills).Solve about 20 previous years question paper - Solving previous year question paper will help you to know that what type of questions are asked mostly every year. Try to solve it in 3 hours as this is the time you are given in your exams.Never leave the weak chapters - Never leave the chapters which you find hard and you are weak in it. Give more time and solve more questions from that chapter.Enjoy maths - Never take maths as a burden. If you solve maths reluctantly than you will never be able to get good marks in maths. ENJOY the essence of maths.Remember that you want to master maths. Give your Hundred percent and score well in maths. Always Remember:- “ If You Can Dream It, You Can Achieve It” ",
            "date": "Answered April 10, 2019",
            "views": "1",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sangeetha Chandrashekar",
                    "user_href": "/profile/Sangeetha-Chandrashekar-1"
                },
                {
                    "user_id": "Rudra Jani",
                    "user_href": "/profile/Rudra-Jani-8"
                },
                {
                    "user_id": "Gaurav Saini",
                    "user_href": "/profile/Gaurav-Saini-720"
                },
                {
                    "user_id": "Bhupendra Singhl",
                    "user_href": "/profile/Bhupendra-Singhl"
                },
                {
                    "user_id": "Shubham",
                    "user_href": "/profile/Shubham-1139"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pallavi Moonka",
                "href": "/profile/Pallavi-Moonka"
            },
            "answer_text": "I used to suck at this particular subject until class 9. I literally used to fail each year in Mathematics and hated the subject because I used to find it difficult to understand. Thereafter, I took private classes from a someone who was 3 years elder to me. Since then, my perspective towards the subject and also my marks in it drastically improved. I realized that I did not know the basic concepts of maths that could help me understand the problems. So, first I made that clear which should be your first step. There is a reason why we do sums in a particular manner. There is a reason behind most of the formulas. Try to understand that, instead of mugging up all the formulas. Read the Introduction provided for each chapter. It will help you understand a particular chapter. Then, practice. All the sums from the book that you follow in your school. The exercises. The test sums. The examples. Everything. DO NOT GO FOR SELECTIVE STUDY & DO NOT TRY TO STUDY EVERYTHING ON THE DAY BEFORE YOUR EXAMS. Yes. You read it right. I have seen students worried about the subject only before the exams. In-spite of taking tutions, they pay the least interest in the subject throughout the year. Study for the subject at least half an hour a day (Minimum). Focus more on weak chapters. Ask your friends and teachers for sums which you are unable to understand. Try working on the sums alone. PUT APPROPRIATE EFFORT AND SEE THE CHANGE. If I can score good in the subject, anybody can. I REPEAT, ANYBODY CAN. ",
            "date": "Answered October 16, 2016",
            "views": "41",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/HYDRA-UNKNOWN"
                },
                {
                    "user_id": "Farhan Nish",
                    "user_href": "/profile/Farhan-Nish"
                },
                {
                    "user_id": "Veera Paralkar",
                    "user_href": "/profile/Veera-Paralkar"
                },
                {
                    "user_id": "Sanjay Banerjee",
                    "user_href": "/profile/Sanjay-Banerjee-1-1"
                },
                {
                    "user_id": "Sidhartha Das",
                    "user_href": "/profile/Sidhartha-Das-33"
                },
                {
                    "user_id": "Raj Shekhar Sengar",
                    "user_href": "/profile/Raj-Shekhar-Sengar"
                },
                {
                    "user_id": "Swathi Bhat",
                    "user_href": "/profile/Swathi-Bhat-18"
                },
                {
                    "user_id": "Sunil Sharma",
                    "user_href": "/profile/Sunil-Sharma-134"
                },
                {
                    "user_id": "Anushka Chandra",
                    "user_href": "/profile/Anushka-Chandra-6"
                },
                {
                    "user_id": "Divyansh Yadav",
                    "user_href": "/profile/Divyansh-Yadav-67"
                },
                {
                    "user_id": "James Matthew",
                    "user_href": "/profile/James-Matthew-98"
                },
                {
                    "user_id": "Abhijeet Chaudhuri",
                    "user_href": "/profile/Abhijeet-Chaudhuri-2"
                },
                {
                    "user_id": "Amal Aimamadhu",
                    "user_href": "/profile/Amal-Aimamadhu"
                },
                {
                    "user_id": "Mayuri",
                    "user_href": "/profile/Mayuri-69"
                },
                {
                    "user_id": "Sanjana Pati",
                    "user_href": "/profile/Sanjana-Pati-3"
                },
                {
                    "user_id": "Deepak Rawat",
                    "user_href": "/profile/Deepak-Rawat-468"
                },
                {
                    "user_id": "Shirsendu Mondal",
                    "user_href": "/profile/Shirsendu-Mondal-2"
                },
                {
                    "user_id": "Bhavya Bansal",
                    "user_href": "/profile/Bhavya-Bansal-24"
                },
                {
                    "user_id": "Poonam Bhatnagar",
                    "user_href": "/profile/Poonam-Bhatnagar-4"
                },
                {
                    "user_id": "Intakhab Hussain",
                    "user_href": "/profile/Intakhab-Hussain-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priyanka Kashyap",
                "href": "/profile/Priyanka-Kashyap-40"
            },
            "answer_text": "You can follow the below tips- Prepare a list of all important formulae and concepts for quick revision.Understand the usage of the formulae.If there are any doubts clear your doubts as soon as possible from your teacher.Focus on NCERT books for studying as majority of exam revolves around NCERT books, but practice questions from other books in addition to NCERT.Complete all NCERT questions and solved examples.Practice a few questions from previous chapters as you study a new chapter. This will make sure you stay in touch with the concepts.Practice writing down the steps you take for solving a question as the process also gains marks.Do not skip any topic, complete the syllabus thoroughly.Feel free to think out your answers on rough paper. It helps in understanding the question quicker and you can use a column in your answer sheet for rough work during exams.Pay attention to details, a single misplaced decimal sign or - or + can lead to an incorrect answer in questions you otherwise know.Always write out questions even if you know them mentally, writing helps improve your answering style.Practice answering previous year papers and sample papers within the time limits of the official exam.Definitely practice the last 5 year question papers.Identify trends in the question paper.Identify your weak areas, where you are unable to answer and where you answer incorrectly.Increase your speed in answering so you are able to complete the exam and have some time for revision during the exam.Create a study schedule and focus on studying and practicing weak areas and doing a few practice questions in areas you are comfortable in.With theorems and concepts remember to understand the applications thoroughly.Keep your formulae/concept list with you and read it at least 3 times a day.Long answer questions are scoring and generally come from algebra geometry, mensuration and trigonometry, so prepare accordingly.Hope this helps!!! Good Luck!!! ",
            "date": "Answered November 15, 2016",
            "views": "18",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/HYDRA-UNKNOWN"
                },
                {
                    "user_id": "Neeraj Kumaar",
                    "user_href": "/profile/Neeraj-Kumaar-4"
                },
                {
                    "user_id": "Md.sultan -",
                    "user_href": "/profile/Md-sultan-51"
                },
                {
                    "user_id": "Albert Einstein",
                    "user_href": "/profile/Albert-Einstein-329"
                },
                {
                    "user_id": "Prakash Mahalle",
                    "user_href": "/profile/Prakash-Mahalle"
                },
                {
                    "user_id": "Om Stark Stark",
                    "user_href": "/profile/Om-Stark-Stark"
                },
                {
                    "user_id": "Uma Shankar Mishra",
                    "user_href": "/profile/Uma-Shankar-Mishra-6"
                },
                {
                    "user_id": "MedhA Arun",
                    "user_href": "/profile/MedhA-Arun"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Adarsh-Kr-41"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dibyank Darshi",
                "href": "/profile/Dibyank-Darshi"
            },
            "answer_text": "First dont take maths as a burden.. Best way to learn maths is simply nothing but enjoying it.. Now there are certain steps you need to follow.. First of all Buy an RS Aggarwal and follow it by heart and faith.. because I think it has more basic questions as compared to NCERT and it gets your level to the height which is needed.. Solving Questions, understanding concepts is one thing but remembering formulas is another.. Some say that just note down the formulas in separate page nd blah blah.. you can do that but it gives a feel of burden.. isnt it.. remember you dnt need to take this thing as a burden.. So my way is a bit different but it is effective.. Theres nthng much to do, just get some basic questions say 5–10 or 15 based on that formula.. now start solving them one by one, keeping the formula beside.. now for first question see the formula and solve it.. repeat this for second and third.. then try not looking at the formula and writing that on your own.. if you feel you dnt remember just have a look at that.. continue this process and after few attempts you will realise that you have learned the formula.. now the key here is to choose the questions wisely.. so keep the first 3 questions purely basic.. and then let the question rise its level.. so that you can practice, learn the use and remember the formula at the same time.. Once you do this.. then that seperate paper with all formula thing will come in play in the form of revision.. Just follow these with your heart, have faith and trust yourself.. Hope you do the best.. ",
            "date": "Answered October 16, 2016",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saim Syed",
                    "user_href": "/profile/Saim-Syed-11"
                },
                {
                    "user_id": "Deepak Rawat",
                    "user_href": "/profile/Deepak-Rawat-468"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikhil Raj",
                "href": "/profile/Nikhil-Raj-402"
            },
            "answer_text": "I believe anybody can master class 10 Math, weather the student is a topper or a slow learner. Here are some steps to master class 10 Math. Believe in yourself that you can learn and be able to understand all the concepts.Open sources ( Textbook,Notes,Videos ) and start learning the concepts. Hustle every minute and be clear with the concept and doubts.Practice all the examples problems and exercises.This is the most important phase and helps you to Master the concepts and problems.And that’s it…. If you are able to complete all the above steps of every chapter then you are completely ready for giving the exams and get good results. Here is my youtube channel in which I will be uploading motivational videos and education content Nikhil Raj I have recently uploaded Trigonometry concepts check it out and don’t forget to subscribe to my channel. All the best. ",
            "date": "Answered January 25, 2020",
            "views": "159",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aniket Bilari",
                "href": "/profile/Aniket-Bilari"
            },
            "answer_text": "As you have not mentioned your board, I will answer predecting that you are from state board(SSC). Firstly you have to give some of your study time to maths daily because it's really a scoring subject. Probably maths is divided into three important categories,i.e. Algebra, Geometry and Trigonometry.You must study this subject as per the weight age.Don't avoid Trigonometry. While studying,please don't focus on only one subject. You must be thorough in topics like Graph, statistics and geometric construction. Remember one thing, while doing construction label all necessary points.Practice at least one, of all type before the exam. Start preparing from minimum marks to maximum marks.Take a look at marking sceme. If you go according to marking sceme it will be really a great help. HOTS(high order thinking skills) questions -This type of questions plays prominent roll in your exam because they have maximum marksize. If you want to score maximum score you must practice it effectively. To conclude I wish you All the very best for your exam.Guineingly,if you work hard you may score out of marks in the subject.I answer this from my last year experience. This year maharshtra SSC board had change the syllabus. Wish you all the best again… ",
            "date": "Answered July 13, 2018",
            "views": "543",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Swapnil Bilari",
                    "user_href": "/profile/Swapnil-Bilari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amit Jodha",
                "href": "/profile/Amit-Jodha"
            },
            "answer_text": "Maths of class 10 is an important part in the life of all the engineers who went on to give JEE in future and have to face maths for sure in first two years of BTech. I say so because if you are not good in 10th maths, you will most probably develop a fear for the subject and avoid it at higher level. So it is important to be good and interested in 10th Maths. To master it,devote time in solving as much as you can and RD Sharma is a great way to do that. The book have thousands of question which actually develops your mind to face any challenge in subject. If you understand a topic than it would be far easier and interesting so solve solve solve is your only option.(I don’t believe on solving all of them,only the tough and different ones). On a lighter note Maths of 10th is the easiest thing I’ve studied as a subject in last 6 years and that include 9th maths too. In fact its the second last A1 I’ve got(last one being 12th Maths) so it has to be easy. ",
            "date": "Answered November 16, 2016",
            "views": "19",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amal Aimamadhu",
                    "user_href": "/profile/Amal-Aimamadhu"
                },
                {
                    "user_id": "Sanjana Pati",
                    "user_href": "/profile/Sanjana-Pati-3"
                },
                {
                    "user_id": "Shreya Tanna",
                    "user_href": "/profile/Shreya-Tanna-6"
                },
                {
                    "user_id": "Harshit Khandelwal",
                    "user_href": "/profile/Harshit-Khandelwal-40"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Sangwan",
                "href": "/profile/Abhishek-Sangwan-35"
            },
            "answer_text": "The overwhelming feeling of facing the board exam for the first time accompanied by the stress of getting acquainted with the preparation strategy of Class 10 can be really tough. For subjects like Maths, there are no shortcuts devised for the students apparently. The only way to prepare well for Class 10 Mathematics is to practice as much as you can. For practising also, you must know the right approach and by the right approach, we mean to say that the right reference book. So, narrowing down the list of reference books available for students, the inference is – NCERT books should be your Bible. Yes, you heard it right! Getting well-versed with NCERT textbook for Class 10 Maths is one of the best ways to conquer the fear of not getting good marks in Class 10 board exams. The idea of mastering the 10th board Maths in 60 days is as good as achievable if you delve deeper into the concepts of NCERT books of class 10 Maths. Not to mention, while solving the textbooks questions, you might as well search for NCERT Solutions for Class 10 Maths. Right, isn’t it? Well, technology has paved the way for that also. The Maths NCERT Solutions for class 10 are readily available on the internet on some of the most genuine and trusted websites like Vedantu, where you can get the FREE PDF of each and every chapter starting from Real Numbers to complex ones like Statistics and Probability. Not to mention, you should also refer other reference books like RS Aggarwal and RD Sharma will also immensely help you with your preparation for class 10 Maths. But again, in order to solve the questions of the above-mentioned reference books seamlessly, you need to get the concepts of NCERT books imprinted on your mind. ",
            "date": "Answered March 9, 2019",
            "views": "250",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Deepak S",
                "href": "/profile/Deepak-S-543"
            },
            "answer_text": "Maths is considered to be the most difficult subject. We often see that majority of the students hate Maths and neglect this subject due to obvious reasons. However, students must realise that no subject is too difficult. Maths is a sequential subject and should be studied in the right way. The main reason students struggle with Maths is either they have neglected the basics in the previous years or they are studying in a wrong way. A large number of students have developed a negative attitude towards this subject. In this article, we have listed a few of the tips to master this subject. If you are preparing for the Class 10 Maths exam, this article will surely help you. Here is How to Master Maths of Class of 10 ",
            "date": "Answered September 13, 2019",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Van Crocol",
                "href": "/profile/Van-Crocol"
            },
            "answer_text": "Never read mathematics- Practice by solving out each and every question. Solving will provide you an idea on where you are going wrong and how could you improve on them.Many a times students tend to mug up the questions, mainly the theorems, which is not good preparation. You should never learn and mug up any question or theorem. Frequent testing- Attempt same pattern of questions and decipher the technique applied to solve those. This will give you a clearer understanding of the subject.Look for new questions on the similar context from Previous Year Question paper, Sample paper and other Model test paper. This will also help you gain confidence for the exam. Make a timetable- You should always time yourself while answering the sample papers as it will help you manage time during the exam.Revise as many times as you can. Also, try and finish chapters which you find easy to understand as it will boost your confidence. Devote less time to the chapters you are comfortable with. While preparing, mark the questions and topics that you find difficult. And, devote more time to these trouble areas instead of procrastinating or avoiding them. Important formulae and definitions- Every chapter of mathematics contains certain formulae and definitions that every student is expected to know. Prior to learning any formula, read the definition related to it and make sure that you have understood the definition.While studying, mark the formulae that you find are difficult to derive and revise these formulae again and again to make sure that these are on your fingertips. Regularity- Another important factor is the regularity of practice. There’s no doubt that all the subjects are equally important and you must spend a significant amount of time on each. But ensure that your timetable takes care of mathematics on a regular basis. more infomation visit edukeha site it help you more ",
            "date": "Answered June 3, 2018",
            "views": "249",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Preeti Dwivedi",
                    "user_href": "/profile/Preeti-Dwivedi-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chinmoy Ranjan Khadgaray",
                "href": "/profile/Chinmoy-Ranjan-Khadgaray"
            },
            "answer_text": "The appropriate thing about this answer is I am too from class 10. According to me, the mathematical concepts that we learn in this grade is little bit easier than class 9. But as everybody knows Practice makes a man perfect, but I would tell to you to PERFECT PRACTICE MAKES A PERSON PERFECT.First, you have to clear each and every concept of any particular chapter. Then practice all questions from NCERT at least two times, you go for RD SHARMA. Example- Introduction to Trigonometry.First put all the identities, ratios and values in your mind. Practice from NCERT, but you should practice from RD SHARMA or RS AGARWAL. But remember, mathematics is not all that we want, you should master all subjects. THANKYOU. ",
            "date": "Answered October 31, 2016",
            "views": "439",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shantanu Dash",
                    "user_href": "/profile/Shantanu-Dash-4"
                },
                {
                    "user_id": "Dhananjaya Swain",
                    "user_href": "/profile/Dhananjaya-Swain-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Farhan Shaikh",
                "href": "/profile/Farhan-Shaikh-139"
            },
            "answer_text": "Class 10 the Maths is…I am not going to say easy, as it will blow the fuse in any class 10 student’s mind. Now for getting a really good score in Maths u will really have to full throttle at around this time. I will break it into two parts as I am assuming u are really under pressure now and your mom may be keeping an eagle eye on you. Strategy I really advise you to attempt the Open Book Test(OTBA, if they still have it now). That's in the exam time and it has a lot of weight age. Second I would really recommend to scan the paper during the reading time for the easy questions which you can solve comfortably and completely. Please never fall in the trap of attempting it backwards…you will never ever pull it off…believe me I have tried it in SA1…. And well scored poorly (approx. 75/90) Now for the PREPARATION By now u might be thorough with your portion so keep on practicing the past papers they help u a lot . Also some of the questions like in examples of the chapter surface area and volume they ‘canal’ questions and the ‘ bucket’ questions should be on your tip, not the numercals but the steps. And that's all!! I think u are locked, cocked and loaded. I have done this for my SA2 and have scored an 82 (paper corrected by board). And also got a 10(CGPA) ",
            "date": "Answered December 27, 2016",
            "views": "234",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akash Kumar",
                "href": "/profile/Akash-Kumar-1103"
            },
            "answer_text": "Mastering math is not a difficult job if u have desire to do so. First of all follow a good book will i recommend is R. D. Sharma.Then lay more stress on undetstanding the concepts.If u lag somewhere in the concepts of previous classes then just open those old books have a look.U can also see vedios from the u tube.After understanding the concept try to solve example by you r own and if u r unable to do so then just refer to the solutiona.in this way your thinking skills will develop. Ultimately u will be the master in math. ",
            "date": "Answered October 16, 2016",
            "views": "145",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ziya Shaikh Safvi",
                "href": "/profile/Ziya-Shaikh-Safvi"
            },
            "answer_text": "Firstly…10th maths is very easy. Make it a habit to go through NCERT and slove question…less question but of different variety….variety means go through the question of different concept…and most important if you want to pursue maths in 11 & 12. So start focusing trigonometry now. It will help you a lot. I know it’s difficult but make a paatern…in these days focus to borads but in 10th vacations focus on 10th trigonometry. And for now start revising sample paper...solve last 5 years question papers…and if you are not able to solve then practice solution also… ALL THE VERY BEST Thankyouu… Hope it will help you… ",
            "date": "Answered March 5, 2019",
            "views": "101",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suchit Yadav",
                "href": "/profile/Suchit-Yadav-21"
            },
            "answer_text": "You can easily master mathematics through these tips Make a separate formula notebookRecheck your solutionMake a separate practice notebookpractice problem regularlyPractice problem daily for 30 minutesIf you want to know in detail. You can check this, it will definitely improve your mathematics https://mathsknowledge.com/how-to-be-good-at-maths/ ",
            "date": "Answered September 16, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aviral Mishra",
                "href": "/profile/Aviral-Mishra-42"
            },
            "answer_text": "Hii there, Hopin u'll be fine. My brother is in class 10th, and he is goin to have board exam day after tomorrow. At the beginning, what I told him, the same i will say to you, Study all the concepts and Solve NCERT properly, with examples.As you finish each chapter from NCERT, move to NCERT EXEMPLAR, SOLVE IT THOROUGHLY.Do same for all the chapters.TILL NOW you are good with your concepts and you hold a good grip at maths. Now you take RD SHARMA or RS AGARWAL and complete it. You can study trigonometry and coordinate geometry from SL LONEY and algebra from HALL AND KNIGHT. IT will surely help you. Thanks. ",
            "date": "Answered March 5, 2019",
            "views": "162",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Himali Thakur",
                "href": "/profile/Himali-Thakur-1"
            },
            "answer_text": "Basically class 10th maths contain algebra and geometry. Starting with algebra one can initially try to clear the concepts related to the topic per chapter then solve the exercise question leading with solved examples of each chapter. For geometry similarly as algebra. One can maintain different books for both the subject in which they can practice the sums and use them as LMR(last minute revision ). Once you have done with exercise questions and solved examples you can continue with problem set and hots. ALL THE BEST. ",
            "date": "Answered December 15, 2017",
            "views": "103",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prashant Kumar",
                "href": "/profile/Prashant-Kumar-1643"
            },
            "answer_text": "I think you should take 2 books for your boards mission. First book should be NCERT textbook which you should read and practice chapter by chapter .Don’t forget to look the examples given in the book as they are of most importance if you can solve those without referring answer after chapter is finished then it is enough . 2nd book should one of following which should be used after you have finished NCERT book for practice of questions based on same pattern. RS agarwal’sRD Sharma’sNCERT ExamplarOnce you have finished the whole thing start again.Repeat until exams. Prashant Kumar's answer to Which maths book is best for class 10 cbse RD Sharma or Oswal Question bank? ",
            "date": "Answered December 26, 2016",
            "views": "433",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhinav Tyagi",
                    "user_href": "/profile/Abhinav-Tyagi-82"
                },
                {
                    "user_id": "Nagaratna Biradar",
                    "user_href": "/profile/Nagaratna-Biradar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paras Panjwani",
                "href": "/profile/Paras-Panjwani"
            },
            "answer_text": "Basically I hate this system and even I am a part of it as I am also a student. And even I hate this question about asking one about how to study a particular subject? It should be of your choice that how you want to study . It is possible that one may ask this question just to know the trick of gaining marks and shortcut about it, but this only reason lets me hate our system. Rather than hating and revolting against this, even if we are part of it, lets change it by becoming someone who can change, and that through it. Lets score marks by our ways and show this society that we made it and now we’re gonna change it. On a serious note apart from the above topic , sample papers and previous’ year papers helps a lot as they help to create experience of giving examination, and solving 15–20 of them and giving yourself a deadline of 3 hours will help a lot. ",
            "date": "Answered December 27, 2016",
            "views": "187",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "MKumar",
                "href": "/profile/MKumar-12"
            },
            "answer_text": "If your questions is related to strategy just to study maths , irrespective of 10th or any other standard than i can help you… Maths is called the language of nature,We speak English , Hindi or other language to interact,Computers use Assembly languages,Java,Cobol to intereact,Similarly you can interact with nature using maths through equation. Each part in maths have some specific representation of nature, suppose Coordinate Geometry it resembles the shape found in the nature. e.g Rectangle,Parabola e.t.c all the shapes are found in nature. The Best way to make any subject interesting is by relating it to the real-world and understand how it will be implemented in real world. Alway’s remember the more you practice the more luckier you get. ",
            "date": "Answered December 26, 2016",
            "views": "564",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Polmi Khare",
                    "user_href": "/profile/Polmi-Khare"
                },
                {
                    "user_id": "Vidhi Singh",
                    "user_href": "/profile/Vidhi-Singh-29"
                },
                {
                    "user_id": "MedhA Arun",
                    "user_href": "/profile/MedhA-Arun"
                }
            ]
        },
        {
            "author_info": {
                "name": "Intakhab Hussain",
                "href": "/profile/Intakhab-Hussain-1"
            },
            "answer_text": "First clear the concepts of each chapter.write separate formula of each chapters and memorize like it is on the tip of your tongue.Now the most important part is “PRACTICE”.practice will make you perfect, and remember if enough is done, start practicing within a time limit it will help you to speed up your calculations. That’s all !",
            "date": "Answered October 16, 2016",
            "views": "609",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sanjana Pati",
                    "user_href": "/profile/Sanjana-Pati-3"
                },
                {
                    "user_id": "Shreya Tanna",
                    "user_href": "/profile/Shreya-Tanna-6"
                },
                {
                    "user_id": "Poonam Bhatnagar",
                    "user_href": "/profile/Poonam-Bhatnagar-4"
                },
                {
                    "user_id": "Raja Pawar",
                    "user_href": "/profile/Raja-Pawar-3"
                },
                {
                    "user_id": "Apaar Pandey",
                    "user_href": "/profile/Apaar-Pandey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fiza Sheikh",
                "href": "/profile/Fiza-Sheikh-6"
            },
            "answer_text": "See. Maths is a subject that literally needs daily practice. If you want to score a 100 on 100 then daily practice is all you need. Just give at least 1 hour each day. Before exams try sitting for entire three hours to solve sample papers. Attempt section D that has max marks questions because when you take and exam your are fresh minded at the beggining. Try to gain max in the last section. Solve the 1 markers in the reading time given to you . learn those derivations prove that quest questions theorem thoroughly. I hope these steps help you. Best of luck. :) ",
            "date": "Answered September 23, 2018",
            "views": "308",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harsh TB",
                    "user_href": "/profile/Harsh-TB"
                },
                {
                    "user_id": "Anisha Goyal",
                    "user_href": "/profile/Anisha-Goyal-16"
                },
                {
                    "user_id": "Sanjana Pati",
                    "user_href": "/profile/Sanjana-Pati-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nivaan Prachurya",
                "href": "/profile/Nivaan-Prachurya"
            },
            "answer_text": "Maths can be a tricky subject but if you Practice regularly you can easily get above 95. Class 10th has some tricky chapters like Trignometry but dont worry just try to understand the reason behind the theorems and formulas and solve each and every question of your NCERT book, before the exams try to solve previous year ques. and lookup for different types of ques. which can come regarding a particular topic. (PRO TIP- Start from the beginig of your class 10th session and practice regularly). Hope you score good in maths! Best of luck!!!! ",
            "date": "Answered June 29, 2018",
            "views": "196",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "MedhA Arun",
                    "user_href": "/profile/MedhA-Arun"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jatin Goyal",
                "href": "/profile/Jatin-Goyal-46"
            },
            "answer_text": "Listen friend I am gonnna give you the most practical way to do it. And it is “ Start applying your maths in your surrounding. Every thing I said every f…..g thing is governed by maths. Try to find out their equation. Equation on which objects are working / living. And you will master the whole of maths.not of class 10 but even of PHD “ And focus on “ concepts and real significances “ of topic what you read ",
            "date": "Answered June 24, 2017",
            "views": "221",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sanjana Pati",
                    "user_href": "/profile/Sanjana-Pati-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "AMAN KUMAR GUPTA (A.K.G)",
                "href": "/profile/AMAN-KUMAR-GUPTA-A-K-G"
            },
            "answer_text": "You can start up with RD SHARMA first as it contains topic in easy language then try NCERT questions yourself. The benefits of practicing RD Sharma first is that it already covers many NCERT and board questions due to which NCERT questions then becomes interesting automatically. Practically both of these will make your maths easy and you will score 90+ definately if you practice RD atleast 2 times before finals. Best of luck for exams. ",
            "date": "Answered September 23, 2018",
            "views": "150",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Apaar Pandey",
                    "user_href": "/profile/Apaar-Pandey"
                }
            ]
        },
        {
            "author_info": {
                "name": "AVINASH KUMAR",
                "href": "/profile/AVINASH-KUMAR-1848"
            },
            "answer_text": "For mastering class 10 math or any class math first thing u should do is that practice . As we know” practice make a man perfect”. Second thing u should do is that refer a good books. Books like R D Sharna, R S Aggrwal. If u r a cbse student then I will recommend u to refer ncert book. And then u can refer to the books I have mentioned above ",
            "date": "Answered October 16, 2016",
            "views": "78",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sunil Halapeti",
                "href": "/profile/Sunil-Halapeti"
            },
            "answer_text": "Pay attention to proofs in geometry. Pay attention to geometrical constructions particularly the tangents to circles touching internally and externally. Pay attention to problems on trigonometry identities problems and heights and distances. Drawing graphs. Solutions to quadratic equations. ",
            "date": "Answered December 26, 2016",
            "views": "97",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sidharth Thakur",
                "href": "/profile/Sidharth-Thakur-12"
            },
            "answer_text": "FIRST OF ALL YOU WILL HAVE TO DECIDE WHETHER YOU ARE CONCENTRATED FOR BOARDS OR HIGHER KNOWLEDGE. IN FIRST CASE, IF YOUR MOTIVE IS TO GET GOOD MARKS IN BOARDS THEN PRACTICE NCERT thoroughly and BELIEVE ME IN BOARDS MORE THAN 80% QUESTION ARE FROM NCERT. IN CASE YOU’VE DONE THAT GET ON WITH OTHER BOOKS LIKE RS AGGARWAL AND/OR RD SHARMA. IF YOU ARE ABLE TO SOLVE EACH AND EVERY SUM OF THESE BOOKS THEN YOU HAVE DONE A GREAT JOB. PAT YOURSELF BACK. IN SECOND CASE, IF YOU ARE FOCUSSED ON IIT AND WANT SOME TOUGHER PROBLEMS TO COME UP THEN GO FOR PEARSON’S IIT FOUNDATION FOR MATHEMATICS. ENJOY maths Thankyou ",
            "date": "Answered May 31, 2018",
            "views": "332",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sahil Rana",
                "href": "/profile/Sahil-Rana-76"
            },
            "answer_text": "Math is the only subject where you can take 100 out of 100 marks. The only thing is in practicing the math problems daily again and again. it is not a subject of cramming but rather understanding the concept of a problem. And if you wanted to clear your concept for your 10th board class then the book RD sharma is the best. Well the thing is every book is best and had their own types of qualities in solving the problem so you can take any and start practicing the numericals of it to clear your every concept. And if you are asking for cbse board exams Then you can also clear your concept from the ncert book itself, but just don't forget to go through every example in it. .. ",
            "date": "Answered December 26, 2016",
            "views": "213",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kishore Kumar",
                "href": "/profile/Kishore-Kumar-1190"
            },
            "answer_text": "Only practice help you to master in maths. It is easy subject, if you practice and somone who teachs math in correct way. I have started recently videos on youtube for Class 10, I hope if anyone will go through one by one. I am sure it would be easy. KK Shah Classes  The above is sample video for you. ",
            "date": "Answered April 16, 2019",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ayush Anand",
                "href": "/profile/Ayush-Anand-112"
            },
            "answer_text": "Always clear ur basic mathematics like simplfications,rules and basic formula. And give ur startup with a very basic book RS aggarwal and do the whole examples of it. U may follow any other books. After that when ur concept become clear then go through NCERT, u find that it will be easier to solve it bt some difficulties may happen. When u solve NCERT again second time then u feel that u become a master of maths and like that it helps u in future. All the best. ",
            "date": "Answered November 14, 2016",
            "views": "275",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nikhil Anil Prakash",
                "href": "/profile/Nikhil-Anil-Prakash"
            },
            "answer_text": "I am an ICSE student and i dont know much about the State or CBSE.. If you are an ICSE student practice the practise papers you find at the back of you textbooks and previous 10 years question paper ….i am pretty sure that some of the questions will be repeated .. Hope this helps ",
            "date": "Answered December 30, 2016",
            "views": "85",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amit Gupta",
                "href": "/profile/Amit-Gupta-704"
            },
            "answer_text": "Before writing anything i jst want u to know that i gt 87 marks in class 10 1SEM,now u will read it till last. When i ws in class 10 i never tried to master the maths i jst made 2 copies 1 classwork n 1 homework,i use to solve each question of ncert in my homework copy(half of them i already have solved in classwork copy).n then i did the same thing solved each question of ncert with every step n made a new fare ccopy. If u do the same It would be the best way to practise n score marks in ur exam ",
            "date": "Answered October 16, 2016",
            "views": "112",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akshit",
                "href": "/profile/Akshit-23"
            },
            "answer_text": "Practice regularly. Even if it's just 15 or 30 mins a day. And before 2weeks of your exams. Try to practice sample papers as much as you can. And clear your concepts. And remember,math is not a difficult subject, it's just a little stubborn and we need to treat it right..and work it out thoroughly. Cheers. Never give up. After all humans were the one who solved math. ",
            "date": "Answered October 16, 2016",
            "views": "254",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gehna Kochhar",
                    "user_href": "/profile/Gehna-Kochhar-1930178"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harshit Krishna Agnihotri",
                "href": "/profile/Harshit-Krishna-Agnihotri"
            },
            "answer_text": "BE THOROUGH WITH YOUR NCERT. THEN BE THOROUGH WITH RD SHARMA(its the best book for 10th class maths). IF YOU STILL HAVE TIME..TRY SOME QUESTIONS FROM RS AGGRAWAL. THEN AT EXAM TIME DONT DO ANY QUES FROM ANY SOURCE BOOK. JUST USE ANY SAMPLE PAPER BOOK. SOLVE IT WITH FULL HONESTY. GIVE 3HRS FOR SOLVING. THEN ANALYSE IT. FIND YOUR MISTAKE AND REVISE THE TOPIC AGAIN AND TRY THE NEXT SAMPLE PAPER and so on.. IF YOU FOLLOW THIS..YOU’LL DEFINITELY SCORE ABOVE 85 OUT OF 90 IN MATHS! BEST OF LUCK. :) ",
            "date": "Answered October 23, 2016",
            "views": "123",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akshita Agrawal",
                "href": "/profile/Akshita-Agrawal-38"
            },
            "answer_text": "If you want to master class 10 th maths than you need to solve each and every question in RD Sharma book.Some questions in maths requires proper understanding, some require skill in solving problems with greater speed, some require quick recall and some require analytical capability. So first understand the question and then start solving them.You can buy huge pool of Mathematics books from online website named Sastabooks . I have ordered many books from that website, they have recent price with very fast and good service.",
            "date": "Answered June 4, 2020",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shubham Patel",
                    "user_href": "/profile/Shubham-Patel-39"
                },
                {
                    "user_id": "Poonam Bhatnagar",
                    "user_href": "/profile/Poonam-Bhatnagar-4"
                },
                {
                    "user_id": "Kanha Nutan",
                    "user_href": "/profile/Kanha-Nutan"
                },
                {
                    "user_id": "Pallavi Moonka",
                    "user_href": "/profile/Pallavi-Moonka"
                },
                {
                    "user_id": "Apaar Pandey",
                    "user_href": "/profile/Apaar-Pandey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mahesh Yogi",
                "href": "/profile/Mahesh-Yogi"
            },
            "answer_text": "Practice……………Practice………………Practice Don’t mug the answers try to get the idea of the questions. Improve your basic knowledge in mathsBe clear with conceptsImprove your calculation speedLearn all the formulasTry to solve a problem by using different methodsBest of luck…!! ",
            "date": "Answered October 16, 2016",
            "views": "548",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sanjana Pati",
                    "user_href": "/profile/Sanjana-Pati-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saurabh Mahurkar",
                "href": "/profile/Saurabh-Mahurkar-2"
            },
            "answer_text": "Hey buddy thanks for asking!!! Class 10 is considered to be one of the important phase in our life. But do not get panic about exams. Maths is the subject where you have to practice more than anything else. It is the subject where you have to think analytically than mugging up the sums. Here are some tips to boost up maths : Go through syllabusPick the topics you feel hard.First take simple sums to boost up your confidence.Practice as many questions as you can. Hope that helps..:)",
            "date": "Answered September 23, 2018",
            "views": "147",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ankush Shrivastava",
                    "user_href": "/profile/Ankush-Shrivastava-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Himanshu Sharma",
                "href": "/profile/Himanshu-Sharma-489"
            },
            "answer_text": "There are many YouTube channels which cover all the topics from Basics to Advance. You can subscribe these channels and understand the concepts step by step. Maths is not just to solve questions but to know why we are doing this on a whole. Have a mindset to solve problems not only from the textbooks but puzzles from other books and concepts. I have seen a new YouTube channel Class 10th Maths Lectures which is just started with the syllabus so you can subscribe the channel to go with the concepts one by one. Or you can subscribe to other old channels but you will have to find the topics from hundreds of old videos. ",
            "date": "Answered July 14, 2019",
            "views": "82",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Apaar Pandey",
                    "user_href": "/profile/Apaar-Pandey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tatva Keswani",
                "href": "/profile/Tatva-Keswani"
            },
            "answer_text": "Do only maths while doing maths! People listen to music and stuff… that's wrong…Solve all examples and exercises!Solve past 20 years papersThat's it! Got full by doing this!!! ",
            "date": "Answered October 16, 2016",
            "views": "129",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Udit Gupta",
                    "user_href": "/profile/Udit-Gupta-70"
                },
                {
                    "user_id": "Rani Pathak",
                    "user_href": "/profile/Rani-Pathak-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rishabh Pathak",
                "href": "/profile/Rishabh-Pathak-12"
            },
            "answer_text": "Practice and practice….! NO! Not enough! You must be knowing the concepts too. Solve RD Sharma!! Done and dusted! Still if you are left with time.. Practice solving previous year papers within 2.5 Hours… Time management is very very important in maths exam! All the very best! Furthur queries appreciated! ",
            "date": "Answered December 26, 2016",
            "views": "115",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ajaypal Singh",
                    "user_href": "/profile/Ajaypal-Singh-70"
                },
                {
                    "user_id": "Shruti",
                    "user_href": "/profile/Shruti-235"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jitendra Kumar",
                "href": "/profile/Jitendra-Kumar-2422"
            },
            "answer_text": "due to lockdown every students didn’t get their study sources well even i can’t teach my students so i am going to launch 10 icse board maths class on my yoitube channel (maths_funda). i hope many students need that class which is absolutely free so i need support from those students who really wants to study so all those who want that class have to share my youtube channel to their friends…search maths_funda by jitendra and subscribe the channel to get the maths videos thanks. ",
            "date": "Answered April 17, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhishek Anand",
                "href": "/profile/Abhishek-Anand-1708"
            },
            "answer_text": "you can visit my previously answered question.Though the question was different but the answer i had written matches to your question to a large extent. so visit once and if any problem still remains,then feel free to give feedback or ask question. Abhishek Anand's answer to How should I study math? Abhishek Anand's answer to Is NCERT maths sufficient for the class 10 2018 board? Hope it helped… ",
            "date": "Answered June 28, 2018",
            "views": "128",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ajay Singh",
                "href": "/profile/Ajay-Singh-2208"
            },
            "answer_text": "If your school teacher is not efficent in providing you good teaching then join a good tuition in your area and try doing Ncert first and then go on for dinesh mathematics. Dont go for Rs or Rd sharma because they are not complete food for class 10 concepts. If u dont want to join any tuition just devote atleast 3 hours a day for self practice and you can also watch online tutorials of chapters which u find difficult. Study on TABLE not on bed. ",
            "date": "Updated January 13, 2017",
            "views": "224",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Apaar Pandey",
                    "user_href": "/profile/Apaar-Pandey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ritesh Jain",
                "href": "/profile/Ritesh-Jain-43"
            },
            "answer_text": "For a good command on maths:- Improve your calculationsLearn all the formulae by heartTry to understand the concepts and develop some interest in the subjectPractice, practice and practice",
            "date": "Answered October 16, 2016",
            "views": "215",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Prit Wade",
                    "user_href": "/profile/Prit-Wade"
                },
                {
                    "user_id": "Apaar Pandey",
                    "user_href": "/profile/Apaar-Pandey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akie Pakie Jaiswal",
                "href": "/profile/Akie-Pakie-Jaiswal"
            },
            "answer_text": "Firstly complete a chapter from NCERT then go for the same chapter through any other book which gives you hundreds of questions of various types. Being a tutor I recommend my students P K Garg. It has got many questions of various types. What is important is to solve many questions to make that pattern clear. This is how you can get good marks as now pattern has changed . Questions do come out of the book. So be ready. ",
            "date": "Answered December 26, 2016",
            "views": "115",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Misha Rana",
                "href": "/profile/Misha-Rana-7"
            },
            "answer_text": "First clear all your concepts with the help of your teacher or tutor DO NCERT . It is a must, don't do it for the sake of doing it but you should be crystal clear with all your concepts. Then you can try examples from other sources like RD ( only the selected examples) Practice a lot of sample papers. If you do this dedicatedly you will sure score full marks. ",
            "date": "Answered September 23, 2018",
            "views": "160",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Promod Kumar Sharma",
                "href": "/profile/Promod-Kumar-Sharma"
            },
            "answer_text": "It is not advisable to adopt any short-cut in mastering maths till class X. If you can not handle anything that was taught in class 7th, please pick up the class 7th book and master it. Believe me, it will not much time because you have grown beyond the class 7th level. Just kill the hesitation of learning/relearning what you have not been able about to grasp earlier. May be such approach will carry you forward through out your life. I am an engineer by qualification and fair amount of practice. Temperamentally, I am a learner. ",
            "date": "Answered October 16, 2016",
            "views": "168",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tejaswara Reddy",
                "href": "/profile/Tejaswara-Reddy"
            },
            "answer_text": "Show interest and one should feel be excited to listen the class One should not battifye the answers Improve your creative skills and try to do same problem in different way ",
            "date": "Answered October 16, 2016",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Divyanshu Singh",
                "href": "/profile/Divyanshu-Singh-135"
            },
            "answer_text": "If you have appropriate time then go for RD Sharma and do solve all the exercise thoroughly! If you don't have ample time then prefer the NCERT first as it will cover all your basics and is best from the academic point of view. And if you still have some time left the practice previous year maths questions of JEE mains. ",
            "date": "Answered August 5, 2017",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Saptorshi Choudhury",
                "href": "/profile/Saptorshi-Choudhury"
            },
            "answer_text": "Just solve all the problems of NCERT Maths first. If you are done with it then you can try sample papers by OSWAL and previous years papers. If you are a courageous guy then I’ll strongly suggest you to solve RD Sharma or S Chand Hope this Helps Best of Luck ",
            "date": "Answered October 16, 2016",
            "views": "153",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aakanksha Sharma",
                    "user_href": "/profile/Aakanksha-Sharma-66"
                }
            ]
        },
        {
            "author_info": {
                "name": "Asif Mumtaz",
                "href": "/profile/Asif-Mumtaz"
            },
            "answer_text": "Dear Students, Do you find Trigonometry tough ? And think it's too late to practice now!! Don't worry just go through the link below and have your trigonometry concept crystal clear in minutes.For Class 10(ICSE,CBSE & State boards).  ",
            "date": "Answered January 28, 2017",
            "views": "205",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "MedhA Arun",
                    "user_href": "/profile/MedhA-Arun"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sourav Sarkar",
                "href": "/profile/Sourav-Sarkar-170"
            },
            "answer_text": "Just rely on R.D.SHARMA, It's the best book in the market for the purpose. One can rely solely on it and can be assured to score over 90%. In addition to those solve as many practice paper as possible for time management skills. Hope this would help you.. ",
            "date": "Answered December 26, 2016",
            "views": "172",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Naveen Kumar",
                "href": "/profile/Naveen-Kumar-6305"
            },
            "answer_text": "first of all solve NCERT question all correctly because it is basic for you .then solve other books and also give school test which gives u confidence if U get good marks. ",
            "date": "Answered December 26, 2016",
            "views": "141",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abhilasha Jha",
                    "user_href": "/profile/Abhilasha-Jha-56"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vijaya Rana",
                "href": "/profile/Vijaya-Rana-1"
            },
            "answer_text": "Well i will give you a very good advice as i myself scored 95 in maths and i know u can do it too….. just PRACTICE everyday … simple and easy :)) yes if u wanna score those 5 marks i couldnt for 100 then i donno. ",
            "date": "Answered October 16, 2016",
            "views": "30",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Apaar Pandey",
                    "user_href": "/profile/Apaar-Pandey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Avni Swami",
                "href": "/profile/Avni-Swami"
            },
            "answer_text": "Solve NCERT book first atleast 2–3 times. Then move on to some refresher like RS Aggarwal or RD Sharma. Solve them atleast twice too but smartly don’t sit and solve the complete book. ",
            "date": "Answered October 16, 2016",
            "views": "121",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "MedhA Arun",
                    "user_href": "/profile/MedhA-Arun"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kavin Selva",
                "href": "/profile/Kavin-Selva"
            },
            "answer_text": "U can master  10th class maths.only  after clearing maths in engineering.  Wen u upgrade ur knowledge, u can easily master the things whch are below u ",
            "date": "Answered October 16, 2016",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aditi Raj",
                "href": "/profile/Aditi-Raj-14"
            },
            "answer_text": "first do not think of marks go for concepts if your concept will be clear then you can solve any problems related to your syllabus. ",
            "date": "Answered December 26, 2016",
            "views": "50",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Ayush Sarda",
                "href": "/profile/Ayush-Sarda-1"
            },
            "answer_text": "If u are done with your ncert questions then u must try RD Sharma and cengage. If u are interested for IIT then u must try cengage for development of basic concepts that will be needed for IIT exam. ",
            "date": "Answered December 26, 2016",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Krutarth Bhatt",
                "href": "/profile/Krutarth-Bhatt"
            },
            "answer_text": "Oswaal,my friend. It brings assurity with itself and instills confidence in the student. Get it and look how well you achieve excellence. ",
            "date": "Answered October 16, 2016",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sanskar Laddha",
                "href": "/profile/Sanskar-Laddha"
            },
            "answer_text": "CLASS 10 MATHS IS FULL OF JOY . JUST ENJOY EVERY PROBLEM . YOU DON'T NEED ANY OTHER THING IF U GET INDULGE IN MATHS. BTW RD SHARMA , SL LONEY ARE TOO GOOD. ",
            "date": "Answered March 5, 2019",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kushagra Agrawal",
                "href": "/profile/Kushagra-Agrawal-55"
            },
            "answer_text": "Practice makes a man perfect Its a perfect saying for maths Practice as much as you can and you will find maths is easy af ",
            "date": "Answered July 9, 2018",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bulbul Shastri",
                "href": "/profile/Bulbul-Shastri"
            },
            "answer_text": "With continuous practice my friend! Maths is all bout practice,practice and practice…. ",
            "date": "Answered October 16, 2016",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Indranil Mitra",
                "href": "/profile/Indranil-Mitra-22"
            },
            "answer_text": "To practice. The sums regularly. With a permanent Schedule of it in ur time table ",
            "date": "Answered October 16, 2016",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manil Kashyap",
                "href": "/profile/Manil-Kashyap-1"
            },
            "answer_text": "Well then Complete RS Agarwal for as many times as you can. And u will definitely score 100 marks ",
            "date": "Answered December 26, 2016",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Himanshu Gupta",
                "href": "/profile/Himanshu-Gupta-992"
            },
            "answer_text": "Practice more different types of questions ",
            "date": "Answered October 16, 2016",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sohinee Mondal",
                "href": "/profile/Sohinee-Mondal"
            },
            "answer_text": "By practising it. ",
            "date": "Answered November 7, 2016",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bhavna Malhi",
                "href": "/profile/Bhavna-Malhi"
            },
            "answer_text": "By following NCERT books. ",
            "date": "Answered October 17, 2016",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Viplav Mahawar",
                "href": "/profile/Viplav-Mahawar"
            },
            "answer_text": "I think u know the answer . ",
            "date": "Answered October 16, 2016",
            "views": "56",
            "upvotes": "0"
        }
    ]
}