{
    "title": "How would teachers react if giving out homework was banned? - Quora",
    "tags": [
        "Homework",
        "Teachers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charlotte Best",
                "href": "/profile/Charlotte-Best-4"
            },
            "answer_text": "When I was still teaching, I would have been thrilled not to have to grade written work, but how exactly would banning homework have benefited my students? As much as I would have loved being relieved of the work, I would have rejected a ban on homework. I was a high school English teacher. In class if we were reading a novel, the students’ homework assignments, in part, consisted of reading the novel so class time could be spent on discussing it and on other work. If homework had been banned, then what? Would the students have spent class time reading the novel while I spent class time watching them read? What a monumental waste of our time! When creating homework assignments, teachers should be mindful of students’ time outside of class, such as after school activities and family time. I tried to keep my assignments short and direct, either as a review of that days’ work or as a preparation for the next day, and I also made a point of remembering that I was not a student’s only teacher. Besides, homework isn’t just about working on assignments. Doing homework is also about learning personal skills like self-discipline, responsibility, and time management. Since retiring from teaching, I am even more of a believer in homework. Presently I work as a shelver at a branch of our local public library, and this particular library branch is across the parking lot from a K-8 public school. Every school day, and I do mean EVERY day, at 3:00 a crowd of students rushes in the library looking like people in a desert thirsting for water. But it’s not knowledge they are thirsting for. They make a beeline for the open computers and they spend the next THREE hours playing video games. That is Monday through Friday, every school day of every week. They rarely, if ever, open or check out books. They rarely, if ever, do homework. They do not play outside. They do not miss a day during the school year. I am not a curmudgeon. I know kids need a break after school, and I know families need time to be together. But how does playing video games for all these hours benefit students? And how many more hours do they spend at home playing more video games? ",
            "date": "Answered September 25, 2017",
            "views": "451",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bradley Torkkola",
                    "user_href": "/profile/Bradley-Torkkola"
                },
                {
                    "user_id": "Jennifer Smith",
                    "user_href": "/profile/Jennifer-Smith-3255"
                },
                {
                    "user_id": "Angeline Pappas",
                    "user_href": "/profile/Angeline-Pappas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jad Grey",
                "href": "/profile/Jad-Grey"
            },
            "answer_text": "I think most teachers will be happy! No spending nights n weekends marking papers - some with stupid n nonsensical answers. Problem: school time table normally does not give sufficient time for drills - required by most mathematics topics and other subjects. Just a side comment: Some Singaporean parents would call the school if they thought that the school was not giving enough homework! ",
            "date": "Answered September 24, 2017",
            "views": "244",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gabriel Arámbulo",
                    "user_href": "/profile/Gabriel-Arámbulo"
                },
                {
                    "user_id": "Abdul Rahman",
                    "user_href": "/profile/Abdul-Rahman-653"
                },
                {
                    "user_id": "Arjun Gajula",
                    "user_href": "/profile/Arjun-Gajula"
                },
                {
                    "user_id": "Rob Lowe",
                    "user_href": "/profile/Rob-Lowe-9"
                }
            ]
        }
    ]
}