{
    "title": "How to get an A for O-level English - Quora",
    "tags": [
        "English Education",
        "GCE O Levels",
        "GCE A Levels",
        "English as a Second Language (ESL)",
        "Learning English",
        "Academic and Educational Advice",
        "English (language)",
        "Education",
        "Exams and Tests"
    ],
    "response": [
        {
            "author_info": {
                "name": "Asim Raza",
                "href": "/profile/Asim-Raza-84"
            },
            "answer_text": "Well, You have to do these things:- Enhance vocabulary ( for that you should read literature ).Practice Past Papers.Must have very good understanding of the language.Must have critical thinking approach.Paper 1 ( Written ) ( Directed Writing ) Always read and comprehend the given situation.Take care of specific format.Word Limit must kept in view (200 - 300)Expand content points.Sequence of the contents points must not be changed.At least three paragraphsProper opening and closing according to the given task.Time factor - not more than 35 minutes.Creative Writing Out of five options, you are supposed to attempt 1.Language proficiency ( writing skill) is the main objective of this part.Words Limit - 350 - 500A good use of vocabulary (adjectives, adverbs, etc) where necessary.ParagraphingUse of Linking verbs such as : However, therefore, Although, though, similarly, likewise, consequently, etcEvidence of planning such mind map.You must write accordingly to the given context.Paper 2 ( Reading for Meaning ) Passage 1 You are required to write 12 correct content points. However, you can write up to 16. There is no negative marking.Your summary must contain contents points as well as use of your own words and be written with correct expression. All elements of summary writing should be consideredWord limit 150–180.The last part is of Opinion/ Facts/ True / False.In case of opinion, it's derived from a fact that can be proved. You have to read that paragraph over and over again in order to pick the correct one. Same is the case with Facts.Reading for Meaning. ( Passage 2) You must develop your reasoning / critical thinking skills. There are two major categories of questions :- Explicit and Implicit. For Explicit questions; evidence will be there in the passage. For Implicit questions, you have to invoke your reasoning skills.There are Vocabulary questions such as one word replacement and MCQs.There are own word explanation questionsThe most crucial part is MCQs based vocabulary ( contextual based) and meaning and effect questions, One has to be very careful while attempting this part. One should rather must read the given area again and again on order to attempt it correctly.Following these guidelines, you can even attain A*. ",
            "date": "Updated September 6, 2020",
            "views": "57",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Olímpia Costa",
                    "user_href": "/profile/Olímpia-Costa"
                },
                {
                    "user_id": "Arshaq Shahid",
                    "user_href": "/profile/Arshaq-Shahid"
                }
            ]
        }
    ]
}