{
    "title": "How will we protect our environment if some of the people are not interested in climate change? - Quora",
    "tags": [
        "Environment Protection",
        "Protection",
        "Environmentalism",
        "Climate Change",
        "The Environment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aaron Dahlen",
                "href": "/profile/Aaron-Dahlen"
            },
            "answer_text": "Hello Jeremy, As a young man, you will find that the world is a wonderfully complex place. We have all been there - if only people would do this or the other, the world would be a better place. As we age, we see that this is a very dangerous way of thinking. Who are we to make such statement for others? How can we trust a person in authority who would make such proclamations? Instead of focusing on the individual, I invite you to embrace the complexity of this world. There are so many other things that can be done to improve humanity. The best part is that improving the world improves the climate. For an example, please take the time to view this video by Paul Hawken. Regards, APDahlen  ",
            "date": "Answered December 7, 2018",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ed Kohler",
                "href": "/profile/Ed-Kohler"
            },
            "answer_text": "There are people who could care less about climate change who have out solar panels on their home because it's cheaper than what their local utility charges. A person doesn't have to be an environmentalist to want to reap the economic benefits of more efficient lightbulbs or appliances. Regarding climate change impacting pollution, there are people who find that concept too abstract who may still want to have cleaner air for their grandkids suffering from asthma, or cleaner lakes so their pregnant daughter can eat fish caught at their cabin. If they oppose coal for some reason other than climate change we can see similar results for different reasons. ",
            "date": "Answered December 5, 2018",
            "views": "84",
            "upvotes": "0"
        }
    ]
}