{
    "title": "How to select a proper school for my kid - Quora",
    "tags": [
        "School Children",
        "Schools",
        "Children"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kate Moore",
                "href": "/profile/Kate-Moore-149"
            },
            "answer_text": "I see on your profile that you live in India—-and my answer is driven by what I know, which is education in the United States. I have no clue whether it is relevant to your situation or not, but here are my thoughts: It all depends on your situation and your child’s needs. Consider location, convenience of transportation, size of the school, teacher:student ratio, social interactions among students in the school, cost of attending, particularly when looking at private schools, whether there is a specialized ‘magnet’ curriculum or a general curriculum, etc. Note that I did not say ‘check the reviews and test score reports’ yet. If I were seriously debating between two or more schools I would check those, but they would be last on my list of things to look at. Ideally, talk to students and parents of the schools you are considering, and get a feel for the comfort level they have with the atmosphere of the school. Sitting in a lobby, waiting to be interviewed for a middle school teaching position in Arizona, I was able to hear several parents discussing how unhappy their children were, and the reasons for their unhappiness. I had two thoughts 1) Is this where I want to work? (And the answer soon became ‘not just no, but hell no) and 2) None of these parental concerns have anything to do with academic excellence; they all had to do with school/administrative culture, and that was borne out in my interview. , I see on your profile that you live in India—-and my answer is driven by what I know, which is education in the United States. I have no clue whether it is relevant to your situation or not. Best Wishes! ",
            "date": "Answered August 7, 2019",
            "views": "211",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Neha Batra",
                    "user_href": "/profile/Neha-Batra-28"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tushar Singh",
                "href": "/profile/Tushar-Singh-1076"
            },
            "answer_text": "Hey reader, On the basis of the following you should select a school for your kid, Discipline Attitude of teacher towards student Infrastructure Playing area Scope of development in non acedamics And other activities like picnic , hospital visits etc. ",
            "date": "Answered August 7, 2019",
            "views": "74",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Neha Batra",
                    "user_href": "/profile/Neha-Batra-28"
                }
            ]
        },
        {
            "author_info": {
                "name": "Esquare",
                "href": "/profile/Esquare-4"
            },
            "answer_text": "When selecting proper school for your child keep in mind that school is near by location and provide better education for your child. For multiple options of schools in mumbai go to page theschoolnearby. ",
            "date": "Answered June 24, 2018",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jitin Chawla",
                "href": "/profile/Jitin-Chawla-1"
            },
            "answer_text": "It would also depend on the age of the student. If it is a school with a modern outlook, it’s all the more desirable. The school environment should be healthy and safe, and enabling for the child. The school should have ample opportunities for the child to be creative and learn The school should focus on the holistic development of the child, not just academics but also extra- curricular activities. ",
            "date": "Answered August 7, 2019",
            "views": "120",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Neha Batra",
                    "user_href": "/profile/Neha-Batra-28"
                }
            ]
        },
        {
            "author_info": {
                "name": "Debjani Das",
                "href": "/profile/Debjani-Das-55"
            },
            "answer_text": "The school that caters to wholesome growth of the child. Every child is born with immense possibilities and one track pressure on education often destroy s those faculties the child is born with. Holistic and wholesome education is of utmost importance for a child to flourish. ",
            "date": "Answered August 7, 2019",
            "views": "78",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Neha Batra",
                    "user_href": "/profile/Neha-Batra-28"
                }
            ]
        },
        {
            "author_info": {
                "name": "Indumathi Yelchur",
                "href": "/profile/Indumathi-Yelchur"
            },
            "answer_text": "In some European countries children are not admitted to schools until they complete 7 years of age. Two or three days ago there was an article on home schooling, in Times of India newspaper. Children are with their mothers and other members of the family. They do not go to school. They learn everything..from their mother. Parthasarathy ",
            "date": "Answered August 8, 2019",
            "views": "51",
            "upvotes": "0"
        }
    ]
}