{
    "title": "How should I prepare for the NTSE Stage II 2020? - Quora",
    "tags": [
        "NTSE Stage 2",
        "NTSE Preparations",
        "National Talent Search Examination (NTSE)",
        "2020 (year)",
        "Exam and Test Preparation",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aditya Mittal",
                "href": "/profile/Aditya-Mittal-140"
            },
            "answer_text": "Hey buddy, you are asking this question implies that you have qualified stage 1, so congratulations for it. Now arriving at the question, i qualified stage 2 back then in 2016, i don't know how much the pattern has changed since, i will tell you what worked for me. There used to be negative marking at that time which i have heard is not the case as of now. MAT : 100 questions, 120 minutes Approximately 72 seconds to read, understand and solve each question. Phew!, Speed is a must guys, practice as much as you can and yeah the most significant thing, don't fall in the trap i.e there will be some questions that you know you will be able to solve but those will consume much more than 72 seconds, don't do them in the first go, you will end up wasting so much of time. Practice is the key here. The more you will practice, the quicker you will become. In series, missing terms and coding decoding, if you are not getting the pattern or logic, come back to it later. In short, do all the less time taking and easy questions in the first go. SAT : 100 questions , 120 minutes 40 - Social Science, 40 - Science, 20 - Maths First attempt the Social Science portion as it will take less time, do assertion reason and chronological order questions with a bit carefulness . Then move on to Science, first attempt biology followed by chemistry. Now you are left with Physics and Maths. Attempt theoritical conceptual questions of physics first, now Maths and numericals of Physics need to be done. Now it's entirely your choice based on which among the two you like more, do that first. Additional : (1) Social Science : complete ncert's nothing less , nothing more (2) Don't panic. BEST OF LUCK ! ",
            "date": "Answered March 14, 2020",
            "views": "703",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aarya Sahani (आर्य साहानी)",
                    "user_href": "/profile/Aarya-Sahani-आर्य-साहानी"
                },
                {
                    "user_id": "Sujana Engineering",
                    "user_href": "/profile/Sujana-Engineering"
                },
                {
                    "user_id": "VN Sudhakaran Neelamegan",
                    "user_href": "/profile/VN-Sudhakaran-Neelamegan"
                },
                {
                    "user_id": "Sunny Kumar",
                    "user_href": "/profile/Sunny-Kumar-5812"
                },
                {
                    "user_id": "Cyril Owusu",
                    "user_href": "/profile/Cyril-Owusu"
                },
                {
                    "user_id": "Arusha",
                    "user_href": "/profile/Arusha-3"
                },
                {
                    "user_id": "Shaurya Sharma",
                    "user_href": "/profile/Shaurya-Sharma-66"
                }
            ]
        }
    ]
}