{
    "title": "How does highschool prepare you for college? - Quora",
    "tags": [
        "High School Education",
        "The High School Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Praveen Kumar",
                "href": "/profile/Praveen-Kumar-23803"
            },
            "answer_text": "I’m an 18-year-old college freshman in California right now, and this is what I have to say about this question: Much of it depends solely on how you make use of your high school experience. I graduated high school with a 4.3 GPA and 10 AP classes taken. I also did a year of football (I played DB) before getting my knee blown out and totally fucked for 6 months. To make up for my inability to play football, I also did things like Science Fair/Olympiad and started a few clubs, which eventually got me to quit football for the rest of high school. I am now a biology major at my local university seeking a career in neurosurgery. Since medical schools often emphasize the importance of being a Mr. Perfect, I guess I can say that I did spend my experience in high school well. The things I did helped me get into UC Davis, UC Riverside, UCSB, UC Merced, UC Irvine, and UCSD. I instead chose to go to Fresno State University in my hometown and am currently in my first semester of college. In the end, my heavy involvement in extracurricular activities helped me balance my academics with my social life and still do well academically and socially. Hear me when I say that this is a skill that is SO, SO critical to surviving college. See, my dad told me that in order to get the most out of college, you can’t afford to be a bookworm. You need to study really well AND be extremely prominent socially. Going back to that statement about medical schools wanting applicants to be absolutely perfect, this is what I mean. Social networking is a highly important skill that can play a critical role in helping your career take flight. If you just sit down and study all day, you are neither practicing proper time management nor are you refining yourself and preparing for your future via social networking. You are not talking to those super-intelligent professors and researchers in your university who will give you nice research opportunities, nor are you receiving the advice of people in the same boat as you and how they are preparing for their career. I know some older guys who were absolute bookworms in high school and carried it on into college, and I can tell you that half of them have experienced mental breakdowns because of how mundane their lives were. They ended up with almost no friends, no one to study with (some of them did fail classes because of this), and no social life, meaning that they’re swimming through this ocean all alone. That is incredibly tough to do. I know it sounds harsh, but here’s the bitter truth: no matter what your career goal is, it is important to strive to be absolutely PERFECT in every respect, from the way you make your dorm room bed, to the way you dress and converse, to the grades you get on your final exams. I’m not saying I’m perfect. I mean I ain’t gonna post pictures of myself but I’m 5’5” and 125 lbs at 18 years of age, which is quite small for a guy and especially for a former high school football player. There are girls on campus who are twice my size lol. Yes, I am not of ideal stature. Yes, I do get the occasional B on a test. Yes, I do sometimes say stupid shit in a conversation. Yes, I am a bit black-washed, which is weird for someone of Indian descent. You don’t see a lot of Indian guys joining a sport dominated by black people. But that’s me. No matter what my flaws are, I STRIVE to be the best version of me every day. When did I start? High school, and boy am I thankful I started preparing myself then. It helps to have these good time management skills and social skills that I would’ve otherwise not had if I hadn’t trained myself in high school. This is where high school really becomes important, because I knew my 1510 SAT score wouldn’t be even the least accurate in assessing whether I was really ready for college. To be ready for college, it takes grit and INTRINSIC motivation, not really as much an SAT or ACT score. Ain’t nobody gonna be pushing you to turn in assignments in college like your high school teachers probably did. In college, if you didn’t do your homework on time and accurately, then that’s your funeral and ain’t nobody gonna attend it but you. Stop asking bullshit questions like this, because your teachers ain’t gonna do a damn thing in preparing you for college. That’s up to YOU, son. It’s what YOU make of it. If you don’t want to be involved in high school, then that’s going to come back to bite you later in college and the work world. Here’s a suggestion, then: get your ass off your couch and start putting in the WORK to be a better, more well-rounded individual. Come on man! It all starts now. You feel me? ",
            "date": "Answered November 7, 2019",
            "views": "394",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gilbert Mansergh",
                "href": "/profile/Gilbert-Mansergh"
            },
            "answer_text": "They say they are, and have done so for about 100 years. But this is only true for those students who have been identified as being “college-bound.” The non College Prep (CP) students used to have classes that taught skills useful in the workforce such as home economics classes, shop classes, typing, auto mechanics, agriculture techniques etc.. Many school districts have done away with “tracked” classes and instead offer more easily digestible (aka “dumbed-down”) classes for everyone. However, at the same time. schools today often offer Advanced Placement (AP) classes which will allow kids with certain skills and knowledge to attain course credit in subjects like History, Biology, Trigonometry, etc. when they go to college. It used to be, that Preparation for college was easily determined by the numeric Intelligence Quotient (IQ) score a student did on an educational test (most often, the Stanford-Binet). Researchers eventually realized that this test was primarily a measure of verbal fluency (which is actually a pretty good measure of success in college). In California, anyone who graduates from High School or obtains their GED can go to Junior College to earn an AA degree or certificate in some field of study, so I guess you could truthfully say that our high schools are preparing students for college. ",
            "date": "Answered October 5, 2019",
            "views": "271",
            "upvotes": " Answer requested by Georgeanna Gorrell",
            "upvoters": [
                {
                    "user_id": "Darius Parris",
                    "user_href": "/profile/Darius-Parris-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eddie Mann",
                "href": "/profile/Eddie-Mann-10"
            },
            "answer_text": "High School doesn’t prepare everybody for college. However, some people learn study habits, learn not to procrastinate, learn to pay attention in class, etc. In other words, they learn how to learn at a higher level. Some go on to community colleges with their old ineffective high school (bad) study habits. (This included me for a long time.) Some use their learned study habits as a ladder to tackle more demanding coursework. In many cases a lot of us end up calling these people “boss”. Obviously there are tons of exceptions of every kind. I was happy with C’s in high school. I was happy with C’s for my first couple of years of college, because I never studied, and never needed to just to skate by. For many classes I never even bought the book. ",
            "date": "Answered June 2, 2020",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Shore",
                "href": "/profile/Scott-Shore-1"
            },
            "answer_text": "We need a more tightly worded question. The deeper and thus the metaphorical “elephant in the room” is the what we mean by education and what should adolescents learn today from the ages of 15–18? Do we have realistic expectations of the value of college? This would be a totally different and longer discussion. To answer your question as asked, I would that high school does not prepare you for college any more than college prepares you for life. Obviously high schools with teachers who teach exceptionally well by some honest metric and whose teachers are motivated and inspired to impart a lifelong love of learning do a better job of preparing students for college. To the extent that the school sees secondary education as college preparation and backs up its teachers is the extent to which high school prepares a student. As a general proposition, I’d say high school does a terrible job of preparing students for college. The entire educational system needs A MAJOR overhaul…but that’s a book. ",
            "date": "Answered September 2, 2016",
            "views": "484",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amanda Belcore",
                    "user_href": "/profile/Amanda-Belcore"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiwimaru",
                "href": "/profile/Kiwimaru"
            },
            "answer_text": "AP courses - the AP exams gave me college credit.High School taught me some fundamental skills such as algebra and calculus. This is only useful for me because STEM-related majors. An Art or Music Major may not find it as useful.High School has a GPA system that many colleges would look at during the admission process.In high school, from my experience: English Classes - this should be called reading class. Students would read a few chapters overnight, fill out a worksheet, come into class and take a redundant quiz, go over the worksheet. There would be like one or two major essay assignments. Occasionally, there might be a vocab quiz which contains words from the book. In high school, writing only comes in one form: Essays, and they teach it like a mathematical equation: (Hook + Background + Topic Sentence + Example + Analysis + Concluding Sentence + Clincher = Essay). In college, writing is taught the way it should be, an art form! It’s more expressive. Math Classes - the rough basics of algebra and calculus were the most important skills for me in college. There are still many little nit-picky stuff that I have yet to see again. For example: Imaginary numbers (useful for Electrical Engineering majors I believe), Flower Graphs (I haven’t seen much use for that), geometric proofs (I have never seen that since geometry class at high school). History Classes - for me, high school’s history class wasn’t that useful in regards to the college courses. In High School, it talked mostly about blacks vs whites, racism problems, social class, human stupidity. In College, there is a Gen Ed history requirement, but I get to choose the course that I want to fulfill it which could be something completely different than high school’s history courses. Science Classes - From what I heard, introductory science classes in college were much easier than science classes in my High School. High School prepares you in the sense that its very existence is a requirement in the societal system to enter college. ",
            "date": "Answered September 2, 2016",
            "views": "889",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Irfan Mirza",
                "href": "/profile/Irfan-Mirza-46"
            },
            "answer_text": "I am from Pakistan, so what I am about to write would be reflective of my experience in high school. Teachers in high school certainly do their bit, when it comes to preparing students for the next step of their journey. In Pakistan, corporal punishment is quite common. When students fail to perform to a certain set standard, then teachers try to tell them in the most forceful manner known to them that they, the students, need to get their act together and start performing well. The problem still prevalent in our system is that we still have a one size fits all model: starting form 9th grade, all of the students, whether they have any interest in science or not, are forced to study Mathematics, Physics, and Chemistry. In case of students neither interested in nor capable of studying science subjects, this approach not only wastes their time but also forces them to take an otherwise avoidable path. That digression aside, I believe that teachers in high schools certainly try to instil some sense into the students. Whether all of the students can be taught the same subjects is another story. ",
            "date": "Answered June 26, 2018",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kim Ham",
                    "user_href": "/profile/Kim-Ham-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Y. Boakye-Yiadom",
                "href": "/profile/Y-Boakye-Yiadom"
            },
            "answer_text": "High school prepares one for college in many ways. The first objective is attaining college level vocabulary. In college you would do a lot of reading so you’ve got to develop your verbal skills. In addition to your vocabulary you need critical reading skills. You have to learn to read at a faster rate. The second objective is develop your reasoning and mathematical skills. High school provides the much needed foundation for science programs. You would also do a lot of reading in other fields like history. In addition to this college admission officers would be on the look out for well rounded students. They do this by going through the extra-curricular activities like leadership positions, clubs and societies and sports. ",
            "date": "Answered September 2, 2016",
            "views": "716",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Praveen Kumar",
                    "user_href": "/profile/Praveen-Kumar-23803"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raymond Crutcher",
                "href": "/profile/Raymond-Crutcher-2"
            },
            "answer_text": "I never expected a high school teacher to prepare me for anything other than passing the course. It was always my responsibility to apply myself as rigorously as possible (which I flaked off on now and again). Some classes had interesting content while some were just a waste of my energy — but that didn’t mean I didn’t give it my fullest effort. I had to prepare myself. I always felt sorry about the classmates who didn’t like the teacher, or the teacher didn’t like them, with the conclusion being they wouldn’t try. This would only hurt them and maybe set up a lifetime precedent that wasn’t going to serve them well (I would suspect a life of excuses: unliked, no breaks, unfair conditions — creating their own karma). ",
            "date": "Answered July 3, 2020",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David G. Duggan",
                "href": "/profile/David-G-Duggan"
            },
            "answer_text": "It depends on where you go to high school and where you go to college. If you go to a moderately rigorous high school which values literature, the sciences, culture and achievement, you’ll be well prepared wherever you go. If you go to a high school which is essentially a trade school or a social finishing school, you may not be prepared for the rigors of, say Harvard. But where there’s a will there’s a way. Just see the movie “Legally Blonde.” ",
            "date": "Answered June 3, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gary Soechting",
                "href": "/profile/Gary-Soechting"
            },
            "answer_text": "High schools make an attempt to try to prepare students for college. College is not for everyone. Many if not most students have to take remedial courses in college to learn what they should have learned in high school. What schools should be teaching is how to handle real life. I’ve had high school students that could not sign their own name, could not tell time using an analog clock or even tie their shoes. ",
            "date": "Answered July 3, 2020",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arlene Holt",
                "href": "/profile/Arlene-Holt-1"
            },
            "answer_text": "Some schools are poorly run. Teachers do the minimum. Student morale is low. In schools where students are motivated because teacher are committed to providing quality courses, students are prepared for college. Regrettably, students with potential are not encouraged to be the best they can be if they are in a poor school. It is important for parents to be selective about the schools their children will attend. ",
            "date": "Answered October 11, 2019",
            "views": "35",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Boohoo-26"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ann Fitz",
                "href": "/profile/Ann-Fitz"
            },
            "answer_text": "It gives you the necessary documentation, and the time spent there enables you to mature socially and emotionally as well as academically. ",
            "date": "Answered June 4, 2020",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alexandre Tabet",
                "href": "/profile/Alexandre-Tabet"
            },
            "answer_text": "Introductory level courses at university assume that students have reached a certain level in language, writing, reading comprehension and mathematics, all of which are acquired throughout high school. Furthermore, university students are expected to have reach a level of maturity that students develop through their experiences in high school. ",
            "date": "Answered June 3, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Seelam Reddy",
                "href": "/profile/Seelam-Reddy-1"
            },
            "answer_text": "Is high school preparing you for college? Some good schools yes. Mostly yes. Parents must. Teachers must. Friends must. Counsellors must. Mentors must. Relatives must. ",
            "date": "Answered October 5, 2019",
            "views": "16",
            "upvotes": " Answer requested by Georgeanna Gorrell"
        },
        {
            "author_info": {
                "name": "Allen Seay",
                "href": "/profile/Allen-Seay"
            },
            "answer_text": "If you take all the high school math that you can it will definitely help you with math in college if you go into engineering or science areas. Non science areas won't require as much math and if you do well in English classes in high school that will help you with writing skills in college English. ",
            "date": "Answered September 3, 2016",
            "views": "254",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daniel Murphy",
                "href": "/profile/Daniel-Murphy-479"
            },
            "answer_text": "They do. Some even prepare them to handle to course work. Most are ill-prepared to succeed in college. ",
            "date": "Answered July 3, 2020",
            "views": "26",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Ben Chu",
                "href": "/profile/Ben-Chu-1"
            },
            "answer_text": "Fulfill all those prerequisite courses for college… Maturing up process.. ",
            "date": "Answered September 2, 2016",
            "views": "123",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kevin Bryant",
                "href": "/profile/Kevin-Bryant-179"
            },
            "answer_text": "Yes supposed to prepare them ",
            "date": "Answered July 3, 2020",
            "views": "12",
            "upvotes": "0"
        }
    ]
}