{
    "title": "How is COVID-19 affecting mental health? - Quora",
    "tags": [
        "Current Events in Medicine and Health",
        "COVID-19 (2019-2020)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Melissa Wingfield",
                "href": "/profile/Melissa-Wingfield-6"
            },
            "answer_text": "Thank you for the A2A. Idk how others’ mental health has been affected because of COVID, but I can tell you personally how it is affecting me. The main thing for me is stress; lots of stress, on top of the stress I already deal with on a daily basis. Ironically, I am not very stressed about getting COVID … I do everything I can to keep myself healthy, wear the masks, constantly wash my hands, etc, so if I ever get COVID, I know I did everything possible to prevent it. I am also not stressed about staying inside a lot more … that is something I have done before, and it never bothered me. When I was not doing well with the agoraphobia, I was inside of my apartment 6 out of 7 days every week, for a few years, before finally getting out more. So I have no issues with that. What really causes the most amount of stress for me, and while this might sound trivial to some people in the realm of how much COVID has affected everyone’s (or almost everyone’s) mental health, the tele-health appts with my therapist (2x/week) have really affected me. While I 100% understand why we are having tele-health appts, and that she has no control over when the offices will be opening up (they are still closed indefinitely), the tele-health appts are getting to me. And while I am thankful for them, because they are better than nothing, they have still added so much extra stress in my life. They didn’t stress me out in the beginning, but as months have passed, they have started to. Compared to when we met in her office, I don’t feel like I am getting as much out of it (in terms of therapy work) as I was back then. I am getting something out of the appts over tele-health, but it isn’t anything like it was when the appts were in her office. I tend to say less than I did in the office, over tele-health; I don’t want to say as much because the walls are “thin” here, and others can most likely hear if they are around. Sometimes the appts go really well, but that doesn’t happen often enough. Also, with the tele-health appts being from our homes, there are distractions, mainly on her end. On my end the only distraction is the phone ringing, and I only answer it if I am waiting for a call (which I tell her at the beginning of the appt as a head’s up). Otherwise I don’t answer it; if it rings, I mute the ringer, or, it is already in another room. On her end, the main distraction is her puppy, who usually needs some sort of attention during my appts. By attention I mean being petted, barking at another dog or person he sees outside the door, etc, where she has to get up to calm him down or redirect his attention … something that takes her attention off of the appt. When the dog is barking (for whatever reason), and after she calms him down, she is back talking with me … but by then she sometimes has lost her train of thought, so the conversation we had been in the middle of is pretty much over. (I lose my train of thought very easily, especially when I am distracted … and in general, I don’t have very good recall unless I am prompted/reminded what we were talking about). One time she put her dog in another room and closed the door to the room she was in, because he was barking so much … however, after doing this, he just kept barking and barking until she opened the door again, letting him back in the room, because the barking itself became too distracting. Since then, the dog comes and goes as he pleases, but usually stays in the same room as her. Since her dog has gotten older, his bark is now very loud. When he barks non-stop during any of my appts, I asked her to please stop the dog from barking because I can’t hear anything she is saying, and I can’t talk over it. One time I was getting very frustrated by it (not only because it was happening, but also because the barking happens a lot), and she said, “Melissa, he’s going to bark.” What am I supposed to say to that? And this happens at many tele-health appts. The dog is always there and needs some sort of attending to, which interrupts my appt. Rarely does he not need attention in some way. If he causes a lot of time for her being away from the computer during my appt, she will add on some extra time to the appt. But that does not stop the barking. Anyway, I think you get my point. So it stresses me out to have the tele-health appts with my therapist. I know I can choose to not have the tele-health appts, but on the other hand, they are still my appts, so I shouldn’t have to choose anything in the first place. I can’t choose to not have therapy. For me, it doesn’t work like that. Without therapy I would be much worse off, so I stick with it, despite distractions, because it is better than nothing. I have voiced to her about the barking and it being distracting, and that I hate the tele-health appts in general (when she has asked me how I like them), so she knows. She has told me that she really likes the tele-health appts because they are, to her, more personal (or a word similar to that). The whole thing also is anxiety-provoking for me. So to answer your question, how is COVID affecting mental health, for me personally, COVID is affecting my mental health because of the tele-health appts with my therapist. They have added more stress to my life, for reasons given within this answer. However, I am not giving up. Like I was saying, this may seem trivial to some people, but when you need therapy for mental illness reasons (2x/week), and the appts become a problem, it causes a lot of added stress, with the pandemic still going on. ",
            "date": "Answered August 16, 2020",
            "views": "623",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joy D",
                    "user_href": "/profile/Joy-D-50"
                },
                {
                    "user_id": "Margie Kohler Searing",
                    "user_href": "/profile/Margie-Kohler-Searing"
                },
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srisai Obulam",
                "href": "/profile/Srisai-Obulam"
            },
            "answer_text": " This is an excellent question. Most of them are facing mental health issues during this pandemic.  Fear,stress are normal when we are faced to with uncertainty or unknown. So it is understandable that people are experiencing fear during this covid pandemic.  Countries all over the world are taking the strict measures,to slow down the spread of the virus and to prevent transmission of the disease government has put lockdown,this lead to restriction of physical movement. And this restriction may ranges from no gathering in public places to stepping out of the house except for daily essentials.  Same like a coin has two sides; this also has two sides.  Talking about Postive side ; we are spending quality time with our family and having good communications with them during this lockdown,and of negative side constant viewing of the walls around us and being in the same place for a quite long time made people feel like they are living in a cage.  These Public health actions taken by government, such as social distancing, can make people feel isolated and lonely and can increase stress and anxiety.  And also people are facing issues such as changes in daily lives, few losing job leading to financial crisis or fear of getting corona or already having it or they were being ostracised by their families and neighbours for having COVID-19 when they didn’t have it, all of which affected the mental well-being of many.  Stress! Everyone reacts differently to stressful conditions. It depends on your background, your social support from family or friends, your financial situation, your health and emotional background, the community you live in, and many other factors.Mostly the vulnerable population are under going through stress more.  And it cause the following:  ▪Fear and worry about your own health and health of your loved ones. ▪Changes in sleep or eating patterns. ▪Worsening of chronic health problems. ▪Increased use of tobacco,alcohol and other substances. ▪Worsening of mental health conditions.  And we have also seen that there is spike in suicidal rates during this pandemic.  Dr Soumitra Pathare, a consultant psychiatrist and Director of Centre for Mental Health, Law and Policy at ILS said that “More than half of the people who die of suicide in our country don’t have a diagnosable mental illness.”  Social isolation, anxiety, fear of contagion, uncertainty, chronic stress and economic difficulties lack of food may lead to the development or exacerbation of stress-related disorders and suicidality.  ▪We just never know what a person is going through...all u can do is be kind...show some empathy towards others....it costs nothing. Give moral support, talk with them, don't judge them or make fun of them over their imperfections or fears. ▪Do not shun or judge people with a CoVid infection.Remember they need  care and concern. Tell them about  precautions, measures they have to take and how to get medical assistance, if required. ▪Sharing is caring. Understand if someone around you needs advice, food or other essentials. Be willing to share.   \"Minding your mind \" is important   ▪Connect with your friends,family and colleagues. ▪ Disconnect from fake news. ▪ Exercise regularly, Eat & drink well, Sleep well.  ▪Practice meditation,pranayamas. ▪ Enjoy yourself.   Be good. Be happy. & Believe in yourself.  And remember, This too, shall pass. Thank you :) adToks|Talks that Detox  Instagram handle:  dToks |Talks that Detox (@dtoks.live) Follow us on for more updates.  Join our Facebook group if you need mental support. We are ready to support you at all times. ",
            "date": "Updated August 17, 2020",
            "views": "2",
            "upvotes": " View 29 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pramodya Thilakarathna",
                    "user_href": "/profile/Pramodya-Thilakarathna"
                },
                {
                    "user_id": "Joandreas Kårstø Skrukli",
                    "user_href": "/profile/Joandreas-Kårstø-Skrukli"
                },
                {
                    "user_id": "Aayushi Arora",
                    "user_href": "/profile/Aayushi-Arora-6"
                },
                {
                    "user_id": "Monika Vijay",
                    "user_href": "/profile/Monika-Vijay-26"
                },
                {
                    "user_id": "Bobby Konapuram",
                    "user_href": "/profile/Bobby-Konapuram"
                },
                {
                    "user_id": "Pooja Sree",
                    "user_href": "/profile/Pooja-Sree-17"
                },
                {
                    "user_id": "Kuntay Kavya Rao",
                    "user_href": "/profile/Kuntay-Kavya-Rao"
                },
                {
                    "user_id": "Abhilash Akepati",
                    "user_href": "/profile/Abhilash-Akepati-1"
                },
                {
                    "user_id": "Kishore E",
                    "user_href": "/profile/Kishore-E-18"
                },
                {
                    "user_id": "Manaswi Gogri",
                    "user_href": "/profile/Manaswi-Gogri"
                },
                {
                    "user_id": "TECH DEVIL",
                    "user_href": "/profile/TECH-DEVIL-5"
                },
                {
                    "user_id": "Raveendiran Settu",
                    "user_href": "/profile/Raveendiran-Settu-1"
                },
                {
                    "user_id": "Arya Bhaskar Akkapeddi",
                    "user_href": "/profile/Arya-Bhaskar-Akkapeddi"
                },
                {
                    "user_id": "Khifayath Ahmed",
                    "user_href": "/profile/Khifayath-Ahmed"
                },
                {
                    "user_id": "Sai Srinivas",
                    "user_href": "/profile/Sai-Srinivas-508"
                },
                {
                    "user_id": "Yagna Narayan",
                    "user_href": "/profile/Yagna-Narayan-1"
                },
                {
                    "user_id": "Bhavana Chinnu",
                    "user_href": "/profile/Bhavana-Chinnu-8"
                },
                {
                    "user_id": "Vishnu Vardhan RedDy",
                    "user_href": "/profile/Vishnu-Vardhan-RedDy-511"
                },
                {
                    "user_id": "Ragul",
                    "user_href": "/profile/Ragul-78"
                },
                {
                    "user_id": "Shanmukha Srinivas",
                    "user_href": "/profile/Shanmukha-Srinivas-72"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Shu",
                "href": "/profile/Steven-Shu-5"
            },
            "answer_text": "Covid-19 is quite frankly, terrible for mental health. Especially if you are an introvert. Lockdown becomes an excuse to stay inside, to avoid others, and to isolate yourself at home, indulging in all the guilty pleasures. The problem is, humans are social creatures. We as a species are meant to be banded together in groups, living, laughing, loving, together. When this fundamental aspect of human social structure is stripped and derailed, humans suffer. We suffer immensely. Take prison punishment as an example. Solitary confinement is one of the worst, maximum-security containments there are to prison inmates. Why is that? It strips people of their ability to socialize. The intent of solitary confinement, of course, is to preclude the inmate from being a threat to other people, but the collateral damage is clear and deep. Let’s take this back to introversion. Socializing in high human density areas drains the energy from introverts. They prefer alone time and like to relax by themselves. That does not mean they thrive from a lack of human interaction. As humans, we interact with each other in many different ways, most of the time mundane ways, such as asking that grocery store employee where the Brussel sprouts are, or exchanging niceties with the garbage man. Introverts, although they may avoid explicitly indulging in social activities, still obtain these small social interactions throughout the day. But not with Covid-19 lockdown. Lockdown takes everything away, almost like solitary confinement. And the introverts, although they may not realize it at first, are also losing even these mundane opportunities to interact with people. This becomes a big problem as time passes. Depression, anxiety, loneliness, and sadness can set in. But how to fix this? A positive mindset. Optimism. Trying new things and being thankful and showing appreciation for the little things. Convincing yourself that you are happy and that you get what you want can go a long way. Behold the might of psychology. Just know that the worst of life will pass, and that pain exists for the sole purpose of making the light on the other side brighter, sweeter to behold when the suffering passes. Stay safe. ",
            "date": "Answered October 13, 2020",
            "views": "170",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Heart It Out",
                "href": "/profile/Heart-It-Out-1"
            },
            "answer_text": "Coronavirus, also known as COVID-19 is a disease which originated in China in 2019. Owing to it’s huge widespread and enormous loss of life that was caused by this disease, it has been declared a pandemic. Countries all over the world are taking strict measures and are employing strict guidelines to prevent the spread of this infection. These restrictions may range from banning public gatherings to more stringent measures such as a lockdown, which means that nobody can leave their houses, except for essentials. COVID-19 has affected the mental health of all individuals, irrespective of their financial conditions and age. There is an increased level of anxiety, stress and helplessness in most individuals which is caused by the lack of knowledge about when this pandemic will end and when life will return to normal. The new normal of ‘work from home’ for most working professionals has created an immense amount of frustration, anger and distress as they are unable to match their pre-lockdown productivity levels, create a routine and maintain a healthy work life balance. At the same time, children and adolescents are confused and unsure of how to handle this time. They are worried and concerned of the widespread damage around them and some of them are unable to process this. Parents are flustered and unsure of how they can manage their work load along with their families. Isolation is leading to excessive feelings of loneliness and sadness, amongst the young and old, alike. The elderly, who have been hit extremely hard by the pandemic, are unable to cope up with the technology dependent world and are constantly looking for alternative resources to help them with their concerns. Social distancing has made it harder for them to interact with other individuals and this thus leads to feelings of isolation, loneliness and sadness. Alot of mental health organizations are working round-the-clock to provide mental health support to anyone who needs it during these difficult and unprecedented times. ",
            "date": "Answered May 12, 2020",
            "views": "15",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Srisai Obulam",
                    "user_href": "/profile/Srisai-Obulam"
                },
                {
                    "user_id": "Ishita Pandey",
                    "user_href": "/profile/Ishita-Pandey-31"
                },
                {
                    "user_id": "Sarah Edwards",
                    "user_href": "/profile/Sarah-Edwards-626"
                },
                {
                    "user_id": "Pauline Lazo",
                    "user_href": "/profile/Pauline-Lazo-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Parth Prajapati",
                "href": "/profile/Parth-Prajapati-325"
            },
            "answer_text": "We’re all in a bind. We are now dealing with two different contagions – the virus and negative emotions that follow. I work with accountants and most of them feel overwhelmed, anxious, frustrated, fearful and most of all, helpless. Business is on hold, and they’re caught in a knock-on effect because the cashflow has stopped. In human beings, the primitive instinct to counter a crisis is by going into our survival mode. In other words, as animals of evolution, we like to take action by ensuring the protection of ourselves and our loved ones.  But COVID-19 is devastating because it leaves us to do nothing. We’re required to isolate ourselves, sit still in our homes while our finances crumple. Our lack of control is causing us anxiety, sleepless nights and damaging or mental health day by day. The thing is in our in our civilized worlds, the virus isn’t our only enemy. Our survival is also threatened by the disruption in our finances and everyday functioning of business. Even if we end up protecting our bodies and health by remaining in isolation indoors, we’re failing to protect other crucial factors of livelihood – like business and travel for essential purposes. To counter helplessness, we end up overworking, making poor rash decisions and leading to disheartening outcomes. We fall into vicious cycles of exhausting ourselves, further weakening our mental well-being. There’s a useful podcast back me up on this too: COVID-19 Special: Podcast on Mental Health in Accountants with Karen Reyburn and Rachel Thomas Sadly, we don’t pay attention to any of it and try to work through it. I think if we want to get through this we need to start practicing self-care. Protecting yourself from a mental health illness is just as important as protecting yourself from the virus. ",
            "date": "Answered April 15, 2020",
            "views": "1",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Margie Kohler Searing",
                    "user_href": "/profile/Margie-Kohler-Searing"
                },
                {
                    "user_id": "Angha Gaikwad",
                    "user_href": "/profile/Angha-Gaikwad-1"
                },
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                },
                {
                    "user_id": "Daryl De Jabil",
                    "user_href": "/profile/Daryl-De-Jabil"
                },
                {
                    "user_id": "Rishmita Aich",
                    "user_href": "/profile/Rishmita-Aich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dnyanada Joshi",
                "href": "/profile/Dnyanada-Joshi-10"
            },
            "answer_text": "Every responsible Indian ,following the footsteps of the union and the state government is doing their bit to fight against the ghastly virus by sitting in their houses and exploring themselves. Keeping the cliched jokes aside,this very situation around us consciously affects our physical state and subconsciously affects our mental state. The constant sight of the very same walls around us and the people builds two different psychologies.Speaking of the positive side,the frequency of communication and transparency in a family has increased and on the other side of the coin,”too many vessels result in more noise”. In such situations,the only bread earners would also be going through financial shortcomings along with a shift in their mental state.The students, who are far away in cities need both financial and emotional support. The vulnerables in society I.e the senior citizens, also are praying for a helping hand by their side and at most places their prayers are being answered . It is more likely that people are affected by the fact of fear that they’ll catch up the virus than actually catching it http://up.So the number of psychologists are equivalent to the doctors. This virus will obviously change the psychologies of billions out there in the world,let’s hope they change to more positive ones rather than to the non favourable. ",
            "date": "Answered April 11, 2020",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Varad Joshi",
                    "user_href": "/profile/Varad-Joshi-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allie Steffenson",
                "href": "/profile/Allie-Steffenson"
            },
            "answer_text": "COVID 19 has wreaked havoc over the world for the past few months and changed it forever. As of July 2020, many states are requiring that masks be worn in public to prevent the transmission of the virus. This is a serious problem for those with anxiety. Masks can cause panic attacks, increased anxiety and depression in some people. Just wearing the mask makes them anxious. Some cannot return to work because they cannot wear a mask. Anyone that suffers from excessive worry now has a new threat to be concerned with. The increase in this affects all of their day to day activities. It’s difficult to concentrate when you are constantly worried. Quarantine did a number on most people. Loneliness, depression, anxiety and suicidal thoughts are on the rise due to having to distance themselves from friends and family. Those who live alone and are used to social interaction daily are really struggling. People need touch. It’s an important part of a healthy mental state. Increased need for mental health treatment has caused a several issues as many offices were closed for month or months and the physicians need to create a new way of seeing their patients. This leads to longer wait times and decreased confidence in their treatment and treatment providers. On top of all of that, financial concerns aggravate an already fragile state of mental health. Those are just some of the ways that this virus has destroyed many lives. If you are struggling and you can’t get in to see a therapist or doctor, try an online workshop to help stabilize your mental health and get through the upcoming months. I’ve used these: Grounding Groups - MyWellbeing with success. Good luck! We’re all in this together!!! ",
            "date": "Answered July 7, 2020",
            "views": "493",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akanksha Sharma",
                "href": "/profile/Akanksha-Sharma-419"
            },
            "answer_text": "Covid 19 is affecting mental health on an unprecedented scale. People all over the world are grappling with fear, anxiety and insecurity over their survival. The corona virus can be passed from one person to another. So imagine, people are being fearful, distrustful, suspicious and even in some cases hostile towards their fellow human beings. I am not talking about the much-needed social distancing measures here. I am referring to the extremities - racism and xenophobia. Macro-levels of humanity apart, people’s mental health is getting affected on the individual level in India, in the following ways: Anxiety over the closure of businesses, loss of jobs, worsening financial conditionsPanic over possibly running out of food and essential suppliesObsessive worry and negative thoughts about their loved ones potentially contracting the virusObsession for checking the news for updates in every five minutes, feeling anxious when they are not able to check the newsConfusion over when the lockdown in India will end and when they can get back to their normal routines.Adjustment disorders with respect to staying at home, and doing all the household chores by themselves (referring to people who used to employ maids and cooks, who have now stopped coming to work)Relationship problems as a result of being stuck at home with family members or spouse at all times; leading to greater fights, conflicts and stress (this is especially applicable to people who did not have good relationships with each other in the first place)Sense of despair, doom and gloom about the future of humanityProlonged sense of helplessness with regards to themselves and othersOver- indulgence in conspiracy theories and fantasies about the pandemicFollow me on Instagram at the rate becauseyoumatter_bym for daily mental health tips in these 21 days of lockdown. ",
            "date": "Answered March 26, 2020",
            "views": "22",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Margie Kohler Searing",
                    "user_href": "/profile/Margie-Kohler-Searing"
                },
                {
                    "user_id": "Aishika Pal",
                    "user_href": "/profile/Aishika-Pal-1"
                },
                {
                    "user_id": "Lloyd Fernandes",
                    "user_href": "/profile/Lloyd-Fernandes-9"
                },
                {
                    "user_id": "Ken Lucas",
                    "user_href": "/profile/Ken-Lucas-1"
                },
                {
                    "user_id": "Priyanka Gupta",
                    "user_href": "/profile/Priyanka-Gupta-2998"
                },
                {
                    "user_id": "Richard Goubeaux",
                    "user_href": "/profile/Richard-Goubeaux"
                },
                {
                    "user_id": "Daryl De Jabil",
                    "user_href": "/profile/Daryl-De-Jabil"
                },
                {
                    "user_id": "Diana Hanania",
                    "user_href": "/profile/Diana-Hanania"
                },
                {
                    "user_id": "Man Man",
                    "user_href": "/profile/Man-Man-610"
                },
                {
                    "user_id": "Nick M",
                    "user_href": "/profile/Nick-M-349"
                },
                {
                    "user_id": "Nikhil Narang",
                    "user_href": "/profile/Nikhil-Narang-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jasmine Chen",
                "href": "/profile/Jasmine-Chen-240"
            },
            "answer_text": "COVID-19 has made us more stressed, anxious, uncertain, and lonely than ever. Here are some practical ways to deal with the physiological stress reaction while in quarantine, or really, anytime. What can I do to combat stress? 1. Breathe in for 5, out for 5. Our average breathing pace is 12-16 breaths per minute, or ~4 seconds each. That’s only 2 seconds in, 2 seconds out. When you’re stressed, you may notice it speeding up even more. Slow it down and try to do it from your belly (technically, your diaphragm), not your chest. Deep, abdominal breathing activates neurons that detect blood pressure. These neurons signal to the vagus nerve, the “brakes” on the stress car, that blood pressure is becoming too high, and the vagus nerve, in turn, responds by lowering your heart rate and blood pressure. 2. Do some push-ups, sit-ups, or pop in a YouTube workout video. Put that excess adrenaline to good use! Think of it as “running” from your perceived danger. 3. Laugh. Studies show that laughter reduces stress and increases immune function. Instead of scrolling through feeds on Covid-19, watch standup comedy. In a study of cancer patients, the improvement from humor was even more pronounced than from other coping mechanisms such as distraction. 4. Affirm your values. Studies have shown that those who reflect on their values experience less stress and show a substantial decrease in cortisol compared to control groups. Do you know your top values? We cover this in the LIFE app under Mission 3, so I won’t go into it in detail here, but highly recommend. Understanding your values is crucial not just for stress management but also for motivation, goal-setting, and decision-making. So, get grounded and more productive while in quarantine by thinking about yours. 5. Write three things you’re grateful for. While it sounds cheesy, clinical trials have shown that gratitude can have dramatic and lasting positive effects, from lower blood pressure to improved immune function, to more acts of helpfulness and generosity. People who experience gratitude can cope more effectively with everyday stress, show increased resilience in the face of trauma, recover more quickly from illness, and enjoy more robust physical health. This scientific intervention is as simple as keeping a gratitude journal. 6. Practice progressive muscle relaxation, an exercise that involves clenching certain muscle groups one at a time and then slowly releasing them. People with insomnia often find this is helpful for falling asleep. Here’s a full article on how to practice this and which muscle groups to clench. What can I do to combat anxiety? Anxiety provokes a much greater cardiovascular response than the slightly milder worry. Worry can trigger solutions and strategies, while often, anxiety borders on uncontrollable. Anxious thoughts in your head are hard to calm. Distracting only helps for so long; pesky thoughts sneak in any chance they can get. That’s why, instead of dismissing or avoiding anxious thoughts, do something even tougher: train them. 1. Practice Cognitive Behavioral Therapy. Pioneered in the 1960s, CBT has become the most widely researched form of therapy. The best part is, it's so easy you can do it yourself in five minutes. The cognitive model says that the \"reality\" we experience is just our interpretation of events, or our immediate thoughts about them. Change your thoughts, change your feelings, and change your behavior. For example, thinking “I can’t do anything right” might create a feeling of hopelessness that leads to behaviors like giving up. On the other hand, thoughts like “I could have done some things differently” might create interest which encourages reflection and growth. 2. Do structured problem-solving. Breaking down a problem and deciding on a course of action can help you break free from useless rumination. Here’s how: Define the problem. What is it you’re really anxious about? Who is involved? List possible solutions. Think of this as one big brainstorm.Choose the idea you think is best and evaluate it. How much time and effort will it require?Write a solution statement.Then, to avoid overwhelm, break that solution statement into much smaller steps. What’s one thing you can do this month? This week? Today? Right now? 3. Grounding exercise. Sometimes, we’re so anxious that we can’t even think through the above. If you are at the point of panic, follow the below exercise. Look around you and find: 5 things you can see4 things you can touch3 things you can hear2 things you can smell1 thing you can tasteLonger-term, here are things you can do daily to ward against anxiety. 4. Buy probiotics and stay hydrated. Serotonin is a chemical that transmits messages between nerve cells. It affects so many aspects of our well-being that it’s commonly called the “happy chemical,” impacting our mood, appetite, and cognitive functioning. It is estimated that 90% of the body's serotonin is made in the digestive tract. From bowel movements to eating, your gut is like a second brain. Take care of it with probiotics and water. 5. Keep your sleep schedule. In quarantine, our schedules may be thrown out of whack. Without our regular morning commutes, we may sleep in, and perhaps stay up later as well. Like stress, sleep disruption has been linked to multitude of short- and long-term health consequences. Short-term, it makes us more susceptible to stress, depression, and anxiety; it impairs cognitive performance and increases risky behaviors. Long-term, sleep disruption can lead to heart disease, weight issues, diabetes, and cancer. ",
            "date": "Answered September 1, 2020",
            "views": "413",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Angela Chapman",
                "href": "/profile/Angela-Chapman-46"
            },
            "answer_text": "It’s not the Covid- 19 that’s affecting my mental health. It’s the gypsy that’s harassing me that’s Dan, and his astral projection friends that are affecting my mental health, and my third eye being trapped to this house in California, and I’m in Florida. I need the government to get rid of the house. The Virgin Mary’s ghost channel me, and I don’t know how to open, and close the third eye. I didn’t know you had to, or really know much about mystical stuff. I was playing with magic, and I got stuck. That Gypsy Dan knew my clairaudience would open up, and the psycho gypsy has been stalking me since 2013, and now.. trying to “ USE” me to upgrade himself, and trying to balance with Sylvia Browne, and has been harming me, and other people by threatening me to be noticed, and famous. He thinks he’s some GOD, and wants everyone to worship him. He’s really arrogant, and nasty. He’s jealous of my brain ( third eye),and my “ heart” because he’s a pisces moon,a nd is a nusiance to the industry,and me. He keeps belittling me, and threatening me, and trying to prevent me from being balance with the industry, and insulting me, and telling me to not upgrade myself. Or telling other people to not upgrade me. He’s been lying about me, and lying to the people in the house about me, and some already know he’s lying, and lying about me too. He’s trying to make me commit suicide, and go brain dead. That’s his goal. He’s a psycho path. So.. the people in the house are belitting me, and insulting me everyday, and calling me ugly, and saying how I’m upgraded in the industry, and how arrogant, and mean it’s mind, and heart is. That’s all I listen to. I listen to identity fraud of pretending to be me, and constantly.. putting me down,a nd Screaming at me so I can hear it. This gypsy dan has telepathy, and is reading my mind without my consent,a nd doesn’t like me.. because he’s insulting me, and pretending to be me. He isn’t my gypsy anyways, it’s Joanne. This gypsy Dan came from Nick Wellner who’s my enemy, and is a nusiance. He’s been dumped from the industry, and he got back into the industry, and he’s been dumped again, and he’s yelling, and taking it out on me, and same with the people in the house. They’re telling me how everything reflects “ BAD” on me.. when they’ve been the one dumped. So.. Amber is pretending to be me that’s really Angela online. Amber get’s dumped, and say’s Amber is Angela that’s me. How frustrating, and annoying to deal with a narcassistic girl. You dump her, and she throws it on someone else, and say’s it isn’t me. You tell her it’s a no, and she tell’s Angela it’s a no, and it’s not her. She say’s I’m balance with this Sultan of Brunie house, and say’s I’m balance with the industry, and say’s I’m not fat. I’m balance with a tummy tuck, and they’re going to remodel me. She’s ugly, and she say’s it’s Angela that’s her that’s ugly, but yet she’s pretending to be me, and that’s Angela. Pretty manipulative, and cunning I say to pretend to be me.. that’s Angela, and then reverse getting dumped, and throwing it on Angela. You’re calling Angela ugly, fat, and hairy, and how your Girlfriend is a lot prettier then me, and I said many times I’m not trying to upgrade myself, and I’m told to stay away from the industry. So.. that isn’t Angela who’s Amber. If you were Angela that was Amber you would be modest looking, and not asking anyone for anything, and have a foul mean mouth, and is pompous looking. You would first off be some what chubby, and not really over weight that’s fat. The other is Angela isn’t ditsy, she’s mono tone, and smart. The other is Angela is half white, and mixed, and Amber is full blooded white. The other is Amber isn’t psychic, it’s Angela that’s psychic, but she thinks she’s psychic, and she’s been dumped, and told she isn’t. She’s a narcassist that’s Amber, and Angela isn’t a vain person. She’s extremely humble, and has gifts for people in the industry that are victims of her bullying them, and the affect is about me because of Nick Wellner. The other is Amber keeps insulting me, and so how is she Angela? Amber is spiteful, and I’m not. Angela has a scorpio Mars, and is self controlled, and not weak, and acting wacko with malicious intent all over the industry. Amber has a pisces Mars, and a Pisces Venus, and a Capricorn Moon. She keeps using people, and is a gold digger. Angela isn’t asking anyone in the industry to upgrade her, and using people for it’s money. Angela has a Capricorn Venus, but she’s picky with love, and isn’t a slut. Amber is pretending to be me, and trying to upgrade me as a porn star slut, and trying to balance me as some slut with screwing rock stars all over the industry. Well.. for starters I come from a conservative back ground, and I’m not a slut. I have a brain, and isn’t physical looking. I’m drawing, and painting,a nd Amber isn’t. If amber was me.. she would have art work to show people in the industry. The other is the gifts I bought people that are victims of being harassed. If I was inside the house with Amber.. she would have boxe’s and have Jackie’s address because she actually met her, and gave it to me. There’s no gifts or boxes in the house, and so you’re not Angela who’s Amber. It’s I create, and not I use. That’s who’s affecting my mental state of mind because I’m psychic, and I have clairaudience, and I stuck listening to it’s nasty mouth out loud. It isn’t just her, it’s the whole house. The people are morally indecent, and nasty looking. Love, Angela ",
            "date": "Answered May 21, 2020",
            "views": "464",
            "upvotes": " Answer requested by Jay Harewood",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Diver",
                "href": "/profile/Jeff-Diver-1"
            },
            "answer_text": "Miguel and Nazir, Here are the official pages from CDC[1] and WHO[2] on this topic. Since the #Trump administration decided the best plan was to have no plan in dealing with Covid-19[3] , there are additional mental stressors for US citizens related to the collapse of our economy (depression). The 50 US states were left to deal with Covid-19 on their own and as a result, there are also regional stresses as some states are seen to be favored over others. “…periods of economic recession are possibly associated with a higher prevalence of mental health problems, including common mental disorders, substance disorders, and ultimately suicidal behaviour.”[4] “Controlling the popularization of unhealthy coping mechanisms is also a key public health measure. “[5] In fact, the more serious and lasting mental health problems may come from the economic depression in the US and the world, not the virus itself.[6] [7] [8] -Jeff Footnotes[1] Coronavirus Disease 2019 (COVID-19)[2] Mental health and COVID-19[3] The plan is to have no plan - PressThink[4] Mental health outcomes in times of economic recession: a systematic literature review[5] The global economic crisis: effects on mental health and what can be done[6] Hardship during the Great Recession linked with lasting mental health declines[7] Workplace Mental Health - Quantifying the Cost of Depression[8] How Do Economic Downturns Influence Levels of Depression? - Psychiatry Advisor",
            "date": "Answered August 6, 2020",
            "views": "296",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jayshree Banka",
                    "user_href": "/profile/Jayshree-Banka-2"
                },
                {
                    "user_id": "Jincy Bassilia",
                    "user_href": "/profile/Jincy-Bassilia"
                },
                {
                    "user_id": "Elle Rae",
                    "user_href": "/profile/Elle-Rae-8"
                },
                {
                    "user_id": "Sangamitra Moktan",
                    "user_href": "/profile/Sangamitra-Moktan"
                },
                {
                    "user_id": "Bannhi Sarkar",
                    "user_href": "/profile/Bannhi-Sarkar-1"
                },
                {
                    "user_id": "Rajesh Mahapatra",
                    "user_href": "/profile/Rajesh-Mahapatra-22"
                },
                {
                    "user_id": "Sayan Majumder",
                    "user_href": "/profile/Sayan-Majumder-28"
                },
                {
                    "user_id": "Diptangshu Karmakar",
                    "user_href": "/profile/Diptangshu-Karmakar"
                },
                {
                    "user_id": "Pratyush Bhowmik",
                    "user_href": "/profile/Pratyush-Bhowmik"
                },
                {
                    "user_id": "Surya Pravo Mukherjee",
                    "user_href": "/profile/Surya-Pravo-Mukherjee"
                },
                {
                    "user_id": "Adhiraj Ghosh",
                    "user_href": "/profile/Adhiraj-Ghosh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prithwish Sannigrahi",
                "href": "/profile/Prithwish-Sannigrahi"
            },
            "answer_text": "It was the best of times, it was the worst of times, it was the age of wisdom, it was the age of foolishness, it was the epoch of belief, it was the epoch of incredulity, it was the season of light, it was the season of darkness, it was the spring of hope, it was the winter of despair.”  As the COVID-19 pandemic rampages on through much of the civilized world, it’s not an overstatement to say that our lives have been turned upside down in the past few months. As a species, we have been collectively forced to retreat to the hills – to abandon all illusions of control as we are reminded almost daily of the fragility of our existence. A timely reminder, that. Our approach to these life-changing few months has been interesting, to say the least. As a people, our response has see-sawed between the extremes- at times humorously over-cautious, at other times embarrassingly naive and inadequate. As a student of medicine and an avid follower of psychiatry, I have often wondered whether there exists a scientific model to explain the rollercoaster of emotions we have experienced over the past six months. Turns out, there is. Elisabeth Kübler-Ross, a Swiss American psychiatrist, published her book On Death and Dying in 1969. Building on the work of earlier bereavement as well her experiences with terminally ill patient, Kübler-Ross theorized that those experiencing grief go through a series of five emotions: denial, anger, bargaining, depression and acceptance. Commonly referred to using the acronym DABDA, these stages of grief originally described the thought processes that human beings typically go through when confronted by the news of their own impending death, but was later extended to grieving friends as well, who seemed to undergo a similar process.  Though originally postulated to account for terminally ill patients, Kübler-Ross’s theory was later extended to include any form of major personal loss- the loss of a loved one, the end of a relationship, loss of employment, and so on. Unsurprisingly, it fits the bill for our current predicament all too well. Denial is where it all began. As the whispers of a new respiratory illness in Wuhan grew to a buzz in January, most of us were unperturbed. Even as the first cases were reported in the Indian subcontinent, we didn’t see cause for alarm. Surely the people in charge would figure it out. They did get the SARS epidemic under control, right? How is this any different? Yet, slowly but surely, the cases keep piling up, and it’s no longer possible to dwell in denial, and we shift gears to anger. Much of it is taken out on unscrupulous NRIs who flunk quarantine measures and endanger others. The teenage son of a bureaucrat is lynched on social media for allegedly evading security measures. We’re angry, and we need someone to crucify.  And as the panic truly sets in, the bargaining takes centre stage. Perhaps the virus won’t be able to withstand the brutal summer heat. Perhaps a Janata Curfew will stop it in its tracks. Everyone, from critical care specialists to snake oil peddlers, has an opinion- and the banter is deafening. The imposition of strict lockdown measures follow, altering life as we know it. Bars and restaurants pull down their shutters, and streets lie deserted. It is life unlike anything we have witnessed before. As the novelty wears off and the new normal sets in with all its weight, it is hard not to be depressed. Death is ubiquitous, the present unpalatable, and the future bleak.  Which brings us to the final stage of our little play – acceptance. Everything wears off, even fear. Most of us have stopped obsessing over the number of cases. The mounting death toll doesn’t shock us any more. As a medical student, I am resigned to the fact that, despite all the precautions, for most of us, it’s a case of when, not if. From being repulsed by the monster in its infancy, we have graduated to sitting comfortably next to it in all its rage. David Kessler, the eminent psychiatrist, puts it succintly: “There’s denial, which we saw a lot of early on: This virus won’t affect us. There’s anger: You’re making me stay home and taking away my activities. There’s bargaining: Okay, if I social distance for two weeks everything will be better, right? There’s sadness: I don’t know when this will end. And finally there’s acceptance. This is happening; I have to figure out how to proceed. Acceptance, as you might imagine, is where the power lies. We find control in acceptance. I can wash my hands. I can keep a safe distance. I can learn how to work virtually.”  Stay safe everyone, and have a good week ahead. ",
            "date": "Answered August 1, 2020",
            "views": "11",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aditi Khedkar",
                    "user_href": "/profile/Aditi-Khedkar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tanya Parihar",
                "href": "/profile/Tanya-Parihar-7"
            },
            "answer_text": "For me this lock down has affected my mental health in a good manner. You might be surprised that why this thing happened to me. So the reason is that I left my first job (for some reasons) in the middle of the year after graduation so I have no college, no plans for future. Everyone and everything around me was running so fast and I was sitting at home from 3 months and was constantly thinking that what to do in future and I had just forgot to live in present and that thing started kind of depressing me. But then the whole world comes to lockdown, everyone around me become just like me sitting idle at home. The fast moving world stopped at the same time. Everyone started doing the same things (eating,sleeping etc 😂) without any guilt that I was doing from more than 3 months before the lockdown. Suddenly I become less tensed about my future. I begin to live in present. I started not to feel sorry about how and why I waste my time. Because everyone around me was doing the same thing.  I was fully aware about how this lockdown was going to be unfortunate for our world but still for my mind it gave me a kind of relaxation. From this I just concluded that what happens around yourself create a large impact on your mind. Sometimes our mood changes automatically with change in the environment around us !! It was easy for me to adjust in quarantine because I was already kind of in lockdown before the actual lockdown. 😛😛 ",
            "date": "Answered May 25, 2020",
            "views": "602",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jane Smith",
                    "user_href": "/profile/Jane-Smith-3005"
                },
                {
                    "user_id": "Michael J. McFadden",
                    "user_href": "/profile/Michael-J-McFadden"
                },
                {
                    "user_id": "Umesh Gupta",
                    "user_href": "/profile/Umesh-Gupta-60"
                },
                {
                    "user_id": "Norman Luz",
                    "user_href": "/profile/Norman-Luz"
                },
                {
                    "user_id": "Virginia Hanlon",
                    "user_href": "/profile/Virginia-Hanlon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kindly",
                "href": "/profile/Kindly-4"
            },
            "answer_text": "The pandemic has been quite unexpected for all of us. During the Corona-virus pandemic, it has been both a necessity and our responsibility to follow the rules of social distancing. Although, some relaxations have been made of Covid-19 lockdown, the restrictions are still being followed due to the increasing cases in the world. Amongst the major restrictions of the lockdown, not been able to socialise has been a limitation alongside the drastic change of plans for everyone in 2020. This has been a cause of anxiety and stress all around the globe. Many of us are feeling out of place, lack of routine, lazy, and often moody. At times like this, it becomes crucial and the first priority for all of us to take care of our mental health and of each other. Even though there are multiple helplines that are offering mental health help during Covid-19, it is essential to always start from taking care of your mental health at a personal level. Here are some tips on how to take care of your mental health during COVID and otherwise on a regular basis by following some simple techniques: Make a Routine: During lock-down, being at home most of the time makes it difficult to follow and stick to a routine. Until now we had been used to having a work time and then the rest of the time to relax at home. But since that’s out of the window, let’s try to make a routine to stick to by ourselves! Psychological Benefits of Routine: Having a routine reduces the uncertainty and helps manage the levels of stress. It helps reduce anxiety and keeps you motivated to do the daily activities. Once you stick to an everyday routine, you would experience an improved quality of sleep and a regular pattern of sleep that helps you in staying energised for the next day too. When you know the tasks to accomplish in a day, you do finish more tasks than when one does not follow a routine. Read more on my blog. Also, reach us for online self care guidance and sessions. :) #bekindtoyourmind Mental Health Blog | Kindly ",
            "date": "Answered July 17, 2020",
            "views": "413",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lawrence Bloom",
                "href": "/profile/Lawrence-Bloom-2"
            },
            "answer_text": "The Covid-19 situation hasn’t had much effect on my mental health. Social distancing is my usual procedure anyway. I go to the grocery store about every 10 days, and it is more crowded now, mostly because the restaurants are closed and people have to eat at home. My main outside activity is going to a park and walking on the trails. Seattle has a lot of good parks, but they are mostly closed now. The parks weren’t crowded before but with schools being closed and other gathering places being shut down, lots of people started going to the parks. There wasn’t any place else to go. The parks went from being mostly empty to having full parking lots. If my wife was still alive, it would be very stressful, she had Parkinson’s dementia and was partially crippled. She watched the news and would have been very upset and worried. She had family in Manila and would have been very upset about the situation in the Philippines. Now it’s just me, and being alone is no hardship for me. Covid-19 is very upsetting for most people, and disrupts their lives. My only inconvenience so far is the closing of the parks, which isn’t very significant. I am 70 and have some of the health issues that could make getting sick, serious for me, ventilators sound painful and they say they aren’t much use. Sooner or later, I’m going to be exposed anyway. I’m fortunate in that Covid-19 doesn’t have much effect on my mental health. ",
            "date": "Answered April 13, 2020",
            "views": "840",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yash B",
                    "user_href": "/profile/Yash-B-62"
                },
                {
                    "user_id": "Wesley Warren",
                    "user_href": "/profile/Wesley-Warren-16"
                },
                {
                    "user_id": "Virginia Grant",
                    "user_href": "/profile/Virginia-Grant"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Molyneux",
                "href": "/profile/Robert-Molyneux"
            },
            "answer_text": "Virginia Grant, The pandemic has affected my mental health because it has highlighted the basic lunacy of my fellow humans that have hoarded toilet paper and besiege Quora generally, and me particularly with questions about how to wipe your bum after your daily shit. I assume Muslims have had a quiet laugh about this. I have been following the “debate” in the USA about how China is responsible for the USA’s atrocious management of a pandemic that has all the characteristics of a pandemic, and which anyone with a basic education ought to be able to comprehend after an announcement by their 51 governments on what it is, and the actions that might be taken, as per pandemics in the world since the Black Death in 1369. I have seen the commentaries on Quora from the USA about how in due course the USA ought to punish China by measures including warfare, all published by Quora as click bait. This is very depressing, but pretty much reinforces my long-held view that the USA is full of insane warmongers… Fortunately, the Australian governments and political parties are working together (for the first time in decades) to tackle both the health and the economic issues of the pandemic with the potential that this could extend beyond the pandemic to make Australia even stronger and more resilient. This has included my wife working from home. I have been involuntarily retired since about 2012. So I have revived my computer expertise to get my wife’s office set up, using Zoom and Skype, and to make our printers work properly for the first time in years… And finally, ta! da!, I have joined a university project to learn to play the piano. This started as a fortnightly lesson at a university campus half an hour drive away, but now is being done remotely. So I have connected up my Yamaha keyboard to my computer, and installed Zoom, Rosegarden and Audacity so I can participate in remote lessons, and store and exchange music between me and the university project team. So, I think overall the pandemic has fortunately improved my mental health. ",
            "date": "Answered April 13, 2020",
            "views": "981",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                },
                {
                    "user_id": "Betty Bever",
                    "user_href": "/profile/Betty-Bever"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donna Sailer",
                "href": "/profile/Donna-Sailer-1"
            },
            "answer_text": "There are so many things this isolation and anxiety inducing contretemps is causing. I can't understand how even more people aren't being affected by this. Elderly: fear of catching this thing, fear of spending more than can be afforded to keep safe, not having the ability to touch or hold loved ones, having people (friends AND total strangers) wearing masks whenever they do get out of the house. Middle aged adults: having children at home instead of school, fearing their parents might get sick, worrying they might lose their jobs or not be able to get another if they did, worrying incessantly if this whole mess will be cleared up before too long, stress, anxiety, depression, WORRY Young adults: worry, anxiety, economy Kids: school is different, mom and dad are different, news is scary, people are dying, can't hang with my friends, can't go anywhere, can't do anything except make mom and dad more frustrated. These are just a few ideas (of the top of my head) of why mental health is being so impacted by the coronavirus. There are plenty more. I even SUFFERED from grieving this past weekend not because I lost someone, but because I CAN'T GET A HUG from anyone, let alone my newborn grandson! Stay safe because someone cares for you and you don't want them to hurt, if you don't believe the coronavirus is gonna get you. ",
            "date": "Answered April 20, 2020",
            "views": "525",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hope Nield",
                    "user_href": "/profile/Hope-Nield"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathaniel Jacobson",
                "href": "/profile/Nathaniel-Jacobson"
            },
            "answer_text": "How has the COVID-19 lockdown affected your mental health? A long time ago I read the book “King Rat,” by James Clavell, who also wrote “Shogun” and “Taipan.” All three were three of my favorite books. All take place in the far east. King Rat takes place in a Japanese POW camp that was fenced in, probably not too different from what you might imagine our recent late presidential candidate was in, John Mccain. The “King Rat” character, the main one, survives for the years they are held prisoner by pllaying the black market. He ends up “wealthy” not really but like you would be if you were successful in a prison environment, playing the odds and greasing the palms of the people in power, the Japanese guards and even facing his fears with the Japanese evil commander that shows up. I was entranced by this book but the ending was very sudden when the American’s liberate the camp at the ending of the war (WWII). They take one look at him being all fit and everyone else tired and skin and bone and think he is a traiter paid by the Japanese. That is how I feel. When this thing ends, my feeling more “normal” because I am more “crazy” than everyone else normally will be a shock. ",
            "date": "Answered April 1, 2020",
            "views": "362",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rajashri Bala",
                    "user_href": "/profile/Rajashri-Bala"
                },
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                },
                {
                    "user_id": "Alisa Ushakova",
                    "user_href": "/profile/Alisa-Ushakova-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susan Iversen",
                "href": "/profile/Susan-Iversen-1"
            },
            "answer_text": "Oh hell YEAH! I have bipolar 1 with delusional episodes and personally, this quarantine life has made me and my mental illness worse 10 times fold. I am fighting depression by trying to stay busy with stupid shit. Fighting with all I have. But after being depressed, I am at a very high risk of turning manic. Even though I take medication for depression, I have to be careful how much that med is increased, because if I take too much it throws me into a manic episode you. Not good either way. Mania has set in 3 times since the outbreak of the virus. Again, not good. Dealing with this has made me, via telephone , deal with my physician and my therapist on a more than regular basis. And is helpful. Stabilizing is definitely and seriously more difficult during this time. I try following all the rules, but even so, I could achieve better results with my mental health if I was not stuck here in limbo. Hopefully, it will be easier to manage after this crazy pandemic. Do what you must to stay safe and healthy. ",
            "date": "Answered May 14, 2020",
            "views": "804",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dee Franklin",
                    "user_href": "/profile/Dee-Franklin-1"
                },
                {
                    "user_id": "Farhan Qureshi",
                    "user_href": "/profile/Farhan-Qureshi-15"
                },
                {
                    "user_id": "Dennis Priede",
                    "user_href": "/profile/Dennis-Priede"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cole Shel Kiah",
                "href": "/profile/Cole-Shel-Kiah"
            },
            "answer_text": "I’d like to claim that suddenly having so much free time has been both good and bad for our various mental states, but that honestly feels like a lie. So far, there’s been very little good to come from it. I’m just one of many in a host’s multiple personality system though, so perhaps it would be best to try to answer this question for each individual alter. Personally, I’ve been angrier this past week than I ever have been before. Our host’s father refuses to clean up after himself in any way, and because I’m the one who’s the most affected by both messes and unfairness, I’ve been constantly upset by having to maneuver my way through endless crumbs in the kitchen, washing up his dishes to even have a kitchen to work in, and walking over cat litter in the carpet that he’s unbothered by because he left the cat boxes directly outside of our bedroom for over a week. I was so angry that an email I sent to our therapist made him hesitant to even continue sessions this week, and in our “internal house” where all the alters live, my brother volunteered to spend a night sleeping on the couch just so that I could have a night alone to try to calm down. The alter who’s normally viewed as the angriest in our system is actually doing alright right now, ironically. As a rarity, he’s the one actually looking forward to being able to talk to our therapist about his genuine emotions rather than just having someone to scream at. He’s been upset for awhile because of a relationship that exists between other alters in the system, and he feels like now is a better time than ever before to bring it up with our therapist. I just hope that he can control himself enough to be able to have the conversation that he wants to without devolving into rage and personal attacks. He’s also been feeling a mix of emotions because, for the first time in a long while, he threw a metal tool at our host’s father and created another hole in the wall before he went and tore up the living room as well. He got destructive and began making threats as a way to make our host’s father finally clean the litter boxes that had been untouched for an entire month, and part of what’s made me so angry is that the violence actually worked to get the litter boxes cleaned. Several of us have tried to ask for fairness in socially acceptable ways, and it angers me that our host’s father just continues to prove that we’ll only ever purposefully act out in evil ways because it’s all that he’s willing to listen to. Our host alter has been excited to catch up on his Torah reading because he’s a few months behind on it. He wants to be caught up on the readings by Passover. On a couple of recent days, he’s made progress, but I don’t know if he’ll be able to achieve his goal at this point, given how out of control some of the alters have started going. One alter has resorted again to stealing in this past week, and we’ve also been arguing with her because we don’t want to allow her to give into her eating disorder. None of us are able to work for money right now, meanwhile our host’s father is actually gaining money off of our misery at this time because his work has been entirely unaffected, he’s saving money on the doctors we’d normally see and Lyft rides we’d normally take, and he’s receiving a full refund for this semester’s college classes. Despite him having more money and us having almost none, he refuses to give us any extra for sanity (even though he’d also hate having to pay for another hospitalization). So, the alter that doesn’t have a problem with stealing went ahead and used over $100 to buy a new LEGO set to keep herself and others entertained, and then she stole about $200 more for delicious fresh food (mostly vegetables and fish) that isn’t going to negatively affect our physical disorder any further. We have yet to face the full repercussions of her actions. One alter is more depressed than he has been in a very long time. I suppose the good that’s come of that is that he’s written some amazing poetry for the first time in several months, maybe even years. This alter normally has anxiety and finds it hard to smile, but, lately, he’s basically lost interest in almost everything. I can’t even convince him to work on the art projects that he’s been working on for years, even though he finally has the time now to do so uninterrupted. He could probably even finish at least one with all the time we have now, but he can’t bring himself to even try. It makes me sad that I don’t know how to help him more. I can do my best to understand him and know him, but I can’t help him. Another alter has been almost entirely silent recently, which in itself is somewhat scary. Oftentimes, we let her keep to herself because she claims that she doesn’t want to be around most people, but I’m worried about how she might end up if no one’s paying attention to her for too long. The alter who’s normally able to enjoy himself with alcohol and music and good food has also been upset as of late because he feels as though he was incredibly honest with our therapist for the first time ever last week and that our therapist then subsequently ignored all of his attempts to share genuine emotions. I don’t think it’s true that our therapist ignored him; I think other alters got in the way of them being able to have a conversation at the end of last week. This alter was already feeling bad though, ever since our last trip to the psych ward (just before the massive COVID outbreak started). Watching a particular movie in the psych ward made him start missing home more than he had in a long time, and then being forced into isolation directly afterwards has been very hard for him, like he’s in Psych Ward 2.0 now. He’s openly said that he doesn’t like going to therapy because he doesn’t see a point in being vulnerable with other people, and now he feels hurt because he thinks that our therapist didn’t value his attempt at sharing real emotions enough. The two alters that I’ve left out at this point are the youngest and the oldest, and I think it’s safe to say that both of them are mostly just tired. The oldest (my brother) is usually tired throughout most of life, but he’s spent more time just lying in bed, doing nothing this past week than any of us have in years. There’s not much other choice for him though, I suppose, since he always feels too tired and weak to accomplish anything. The youngest just wants to be able to play with his toys, but there hasn’t been much time for that either amongst all the chaos that’s been unfolding in our system and this household. Every day, I like to think that we’ll get something worthwhile accomplished. There’s so much to clean up and so many unfinished projects and so much good that could come from this time. Living with our host’s father definitely makes everything worse though, especially for my personal ability to function, since I’m the one who freaks out over the constant trail of messes that he leaves every moment he’s awake. I’m the one who’s normally in charge of keeping everything together for all of us, and, I guess, more than anything, I’m just afraid now that so long as I’m living around that man and unable to simply walk to a refrigerator without being infuriated by his mess, every single alter in this system will progressively get worse until we truly don’t have a therapist or anything else left. And if that were to happen, then I don’t know how I would stop the suicidal alters. It’s already becoming difficult, and I don’t think I have the strength to hold on indefinitely. ",
            "date": "Answered April 1, 2020",
            "views": "346",
            "upvotes": " Answer requested by Jay Harewood",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                },
                {
                    "user_id": "Justin Savatdy",
                    "user_href": "/profile/Justin-Savatdy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rhea Jain",
                "href": "/profile/Rhea-Jain-27"
            },
            "answer_text": "COVID-19 is certainly and largely affecting our mental health. In such times of uncertainty and stress, we can encounter a lot of negative feelings like fear, anxiety, loneliness, worry and more. We are facing a pandemic at present and to be concerned of its consequences is normal, we see huge number of people getting adversely affected by it everyday and it keeps increasing. Every aspect of our life has changed. Movements are restricted, we meet only a limited number of people, we cannot socialise, go to office or school, and cannot do activities that we are used to do. All this has definitely hd an impact on our plans and expectation in the year 2020. Due to this drastic change in our lifestyle, to adjust with it is very difficult and disappointing which has already led to a large number of depression cases, extreme steps like suicides and self harm incidences. We can clearly witness this affect that COVID-19 has on our mental health. But, we need to stay strong, help each other and be mentally and physically fit. We must ensure that our dear ones are doing well and are emotionally stable as All of us are Together, in this. Also, for a better understanding of mental health and wellness, visit dToks Mental Health Community ",
            "date": "Answered August 14, 2020",
            "views": "182",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pierre Pagé",
                "href": "/profile/Pierre-Pagé-2"
            },
            "answer_text": "Greetings Miguel and Jay, The lock down caused by the stock market crash and the collapse of world’s economic system as we knew it and the lock down caused by the flu virus aka Covid-19 did not affect my mental health. What I observed among people is the fear fuelled by what I would call Covid-1984: misleading information, contradictory information, media shooting fear into people rather than making informed scientific statements. For example, if there is a deadly virus, such as Ebola (71% death rate regardless of your health), you do not open public swimming pools, restaurants and bars when you haven’t found the source of the infection (persons) and isolate them. Unfortunately, many people suffer from serious health condition(obesity, diabetes, cancer, etc)which makes them highly susceptible of deadly complications if infected by the flu virus, as they do yearly, pass-on from those complications. And that, generates fear, but not enough to make some of them change, and surely not enough to create a state of panic in the world’s population…So all the media coverage and the political counter truth, create a rather negative impact on people’s mental health: from insecurity to shear paranoia and rage. It is rather challenging, mind boggling for most of us. We are homeschooling our daughter who is now in grade 11, so nothing new for us as far as staying home; we often wash our hands, nothing new there either. It is other people’s reactions that are mostly challenging! In Peace and Friendship, Pierre ",
            "date": "Answered August 3, 2020",
            "views": "150",
            "upvotes": " Answer requested by Jay Harewood, Miguel Paraz and 1 more",
            "upvoters": [
                {
                    "user_id": "Dean Robertson",
                    "user_href": "/profile/Dean-Robertson-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Shore",
                "href": "/profile/Jon-Shore-1"
            },
            "answer_text": "That is an excellent question. As a psychotherapist who has clients all over the world I am seeing a large increase in new clients coming to me for depression, anxiety and panic related issues due to the pandemic. Even my current clients have expressed deep concerns but they have the tools to deal with these issues and we just have to work on reinforcing those skills. I have even written an article and posted it about the consequences of change and panic and coping skills required for dealing with the depression and anxiety in this crisis. The majority of people are afraid of rapid change and the COVID-19 pandemic is creating rapid change in our world. Once the pandemic has ended and the virus is contained and there is a viable vaccine available to everyone there will still be millions of people with PTSD and depression as a result of the intense emotions and traumas associated with their reactions to the pandemic. It is extremely important to learn how to deal with rapid change in our world because this is not the last time something like this will happen. We can thrive through change or we can fail to thrive. I hope everyone chooses to thrive. I hope this is helpful for you. Take care, Jon  ",
            "date": "Answered March 15, 2020",
            "views": "864",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alex C",
                    "user_href": "/profile/Alex-C-806"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tara S",
                "href": "/profile/Tara-S-178"
            },
            "answer_text": "It is creating a huge area of unknowns for most of society. People who are afraid, suffer more mental health issues. The fear is disrupting order throughout the world because scared people act irrationally. There is uncertainty in finances, and that in turn causes stress. People are losing their jobs. They are not sure how food will be put on the table. Most people are also no accustomed to staying home or not being social. Introverts finally have our little advantage. Depression sets in from being alone, unable to visit compromised or elderly family. Kids are suffering not having their friends around. Deaths are constant and it is human nature for that to produce anxiety. That brings grief. It is also frustrating in countries with poor leadership and low scientific understanding because misinformation spreads faster than truth. In short, this pandemic is negatively effecting a large number of people psychologically because it is the equivalent to taking your very worst day ever, and having it on repeat for a year or more. ",
            "date": "Answered October 17, 2020",
            "views": "63",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rachit Ahuja",
                    "user_href": "/profile/Rachit-Ahuja-5"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Raghul-83"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Craven",
                "href": "/profile/Michael-Craven-14"
            },
            "answer_text": "I’m doing fine. Thinking about getting a dog though. Why? I don’t exercise nearly enough. With a dog, I’d be walking him several times a day. That’d be good, both for my health and it’d make my personal physician happy, which in turn would make both my wife and I happy… it’s all rather circular. We wouldn’t get to go very far, although there is a walking path that supposedly crisscrosses our state. Unfortunately, our governor has closed all of our parks, and other recreational spaces and ordered a “shelter in place” order. Since only my wife has been designated as essential personnel, which would be kinda hard for me to be as I’ve been retired for a few years now, there’s not much need for me, saving aforesaid physical exercise needs, for me to go anywhere, I hesitate to even go to our local pharmacy which is less than a mile away. My children, all come to me in one way or another, calls to see grandchildren have been popular, two of my sons live in the other apartment ( my second oldest owns the duplex we live in ) one lives on the other side of the bay, And my oldest just bought a home about ten minutes away… So as long as I maintain my preventative doses ( 1 dose per day ), I’m fine. GOt a lot of things to do, sketches for future woodcarving projects, writing prompts, responses to questions from Quorans, researching topics for characters in a novel I’m working on… plenty to do… ",
            "date": "Answered April 10, 2020",
            "views": "434",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sakshi Shrivastava",
                "href": "/profile/Sakshi-Shrivastava-8"
            },
            "answer_text": "Honestly, it was kinda shaky initially. I got addicted to smoking and alcohol and had a rough time managing my relationships. I started taking therapy, it has helped a lot. I think what helped, even more, were these changes I made: Started meditating. It was difficult, SO difficult. But I kept at it, and now, I look forward to meditating each day. I started with guided meditations and that’s what I’d recommend to those who are just beginning their journey.Started living slowly. Less phone. Less Netflix. Less news. Less screen time.Tried doing nothing for the first 30 mins of each day. I’d just sit in the backyard and look at the plants. I tried doing nothing, just sitting there and sipping my coffee.I drew boundaries at work. I was, of course, working more than ever initially, I wanted to find an escape and working till 4 am and starting back again at 10 am was becoming routine for me. I drew boundaries, I made some rules for myself. Now I hardly ever work after 7 or 8 pm.Built a routine: Eliminating decision fatigue by deciding exactly what I’ll do each morning/night helped a lot.Communicated more with my husband: End of the day, we’re all going through this together. He had his own ways of dealing with this life-changing event and I had mine. We were both suffering at the hands of this emotional turmoil and tried to communicate more openly and sharing more freely about our feelings helped a lot.I hope this helps. I’m here if you need any more support. You can also find me on Instagram and Linkedin where I share my experiences with my mental health more often. Sending you sunshine! ",
            "date": "Answered July 6, 2020",
            "views": "402",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aditi Khedkar",
                "href": "/profile/Aditi-Khedkar-1"
            },
            "answer_text": "Ahh in a very terrible manner. No kidding.  As pessimistic it might sound, Covid-19 has taken the worse toll on mental health. Apart from physical distancing , which already makes you a loner, many people are facing other issues like job hunting, recession, some are dealing with layoffs, freshers are unable to apply for jobs and students unable to apply for student visa for higher studies. The list doesn't end here. Personal life is on a different level screwed up. You have to stay home(which is necessary), meeting friends has been in the form of video call and voice calls. After 6 months, it has started escalating now. The naive me thought due to pandemic and lockdown, at least people would stay in their homes and crime rate would not increase. But boy was I wrong. Domestic violence cases has increases. Riots, hate crime, everything is just THE SAME. Nothing has been changed on the positive scale. Only good side I can think of right now is, people are working out, those who are working at home have time for their families and can pursue their lost hobbies or develop a skill. Freelancing is being encouraged and more and more people are migrating towards part time jobs.  I think everybody should at least consider therapy when vaccine will be developed and situation to be back to normal. This might take a while. ",
            "date": "Answered August 14, 2020",
            "views": "373",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alex C",
                    "user_href": "/profile/Alex-C-806"
                }
            ]
        },
        {
            "author_info": {
                "name": "Corey De Bruin",
                "href": "/profile/Corey-De-Bruin-5"
            },
            "answer_text": "For many it is creating issues. For some the conditions are causing or speeding up the development of mental health conditions, for others it is making their current mental health conditions worse. Most of the people who haven’t developed one from the conditions or who haven’t had existing conditions worsened, are getting sub clinical symptoms such as anxiety or depressive symptoms that aren’t severe enough to warrant a clinical diagnosis. There are very few people haven’t developed some sort of distress from the conditions that COVID has brought on and I’m anticipating that after this is all over, there will likely be ongoing trauma & trauma based illnesses (PTSD or complex PTSD) in quite a large amount of the world’s population. ",
            "date": "Answered August 16, 2020",
            "views": "134",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gillian Isaacs Russell",
                "href": "/profile/Gillian-Isaacs-Russell"
            },
            "answer_text": "You asked what Covid-19 is doing to the practices of therapists and psychiatrists. I just attended an open Town Meeting on Zoom sponsored by the American Psychoanalytic Association. Nothing like this has ever been done before. Nearly 400 clinicians attended. We have all moved our practices online or to the telephone, very difficult as we depend heavily on perceiving the “whole person.” People are not just brains or minds, and communication is not just verbal. But when technologically-mediated that is what the communication can become. It is hard for us to do our best. It is an abrupt change for which most are unprepared. It is exhausting. And, of course, we are human and have to manage our own anxiety and fear. So it is very hard: we are in unknown territory and it was helpful to hear from clinicians who had navigated 9/11 or Katrina. We will support each other in the most thoughtful way possible so that we can be of use and support to our patients. ",
            "date": "Answered March 22, 2020",
            "views": "921",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishnudas Pai",
                "href": "/profile/Vishnudas-Pai"
            },
            "answer_text": "Our overall well being and health ,peace, happiness etc are all a function of our karmas (chosen by our Soul for payback before our birth , ) and the karmas ( good and bad ) we did in present birth , and our prayers to the Creator by chanting, meditation ,good philanthropic deeds ,charity , selfless social service etc. But all these present karmas and prayers are to be done with untainted hands . If prayers are done regularly with tainted hands they are just rejected and are of no use in mitigating our sufferings or undergoing chosen presdestined karmas for payback. If prayers are done regularly with clean hands of clean karmas there will be heavenly grace available for condonation by the Creator in addition to Angellic interventions of help in distress or in emergencies while we are on earth. So it can't be any different in Covid 19 pandemic situation … It is akin to “ Sadesathi “ period in Hindus which we consider a period of seven and a half years in a total zodiac cycle of past 30 years as the worst suffering period for any individual. During this seven and half years the person's concerned are battered in worst manner or get elated in the best manner depending upon thier karmas for the past 30 years . Similar is the case with Covid 19 pandemic scenario. Gist of the answer to this question is that Covid 19 pandemic or any witchcraft cannot alter our mental state or well being by overriding our karmas . References are Dr Michael Newton, Dr Brian Weiss,Dr Kondaveti Newton,Khorshed Bhavnagari ,Edgar Caycee, Richard Martini , DrJim Tucker ,Dr Even Alexander , Swami Vivekananda,Swami Yogananda , Swami Nimishananda, who are all authorities on Soul Journey works . ",
            "date": "Answered July 2, 2020",
            "views": "290",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Harshini Sugumar",
                    "user_href": "/profile/Harshini-Sugumar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Linda .Dumpe",
                "href": "/profile/Linda-Dumpe-1"
            },
            "answer_text": "The coronavirus pandemic is an epidemiological and psychological crisis. The enormity of living in isolation, changes in our daily lives, job loss, financial hardship and grief over the death of loved ones has the potential to affect the mental health and well-being of many. Even in this time of physical distancing, it’s critical to seek social support and connection with others. It’s also important to know the signs of anxiety, panic attacks, depression and suicide so you can easily identify them, not just among your family, friends and neighbors, but for yourself. I have found the tapping solution to be a big help! I discovered it through energy psychologist Mary Sise. In the video below you can try for yourself as she was recently featured in The Shift Network doing the EFT and explaining what it is.  ",
            "date": "Answered May 25, 2020",
            "views": "292",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yasmine Yehia",
                "href": "/profile/Yasmine-Yehia-5"
            },
            "answer_text": "Hello, I don’t really know what you want to hear but this is what’s going on. I feel like an untouched object that your mum has kept near the fridge forever. I know social distancing is for everyone’s good. But I've also read that human beings that don’t get hugged/ touched have a shorter life span. I’m not saying I’ll die if I don’t get a hug in a couple of weeks ; I’m saying maybe the hugs my friends gave me (that I've never felt how important those were until now) actually helped me have a healthier life. DAD? Also my Dad is a doctor at a different country ,which means he’s stuck there as a citizen and helpful but at danger as a doctor. He usually visits us every 3 months or so but with the Corona condition I haven’t seen him in 4 months already and I’m sure I’ll have to wait a lot more. I terribly miss him yet other people surely NEED him. THE IMPRISONING, AGAIN. Can I mention that we only open our windows on Fridays.( because most of our furniture is made up of very detailed wood- which has the ability to store a lot of dust apparently) I want to breathe. I need to breathe nevertheless the tiring cleaning. I want to feel the cold breeze against my skin. I've learned that gas particles are always in motion yet for the first time I feel all the carbon atoms still near me. suffocating me. I’ve mostly only slept at home. After all I want me and my people to stay safe and not catch the virus, so I stay home. WHO I’M IMPRISONED WITH. I also see the same people (my mum and my sister) everyday , which I thought was alright before but now that I’m doing it I don’t think I prefer it. they both keep questioning my habits. HELLO? Have you even ever met me? Turns out seeing strangers that knew nothing about you after all mattered. At least they don’t give you instructions about how to not do the stuff you regularly do with your friends. I know my inability to do nothing facilitates my aggression towards them ,so I imagine this is all in my head and that I’m over reacting. I want to run. You know what I’m saying? Not runaway or anything. just RUN. MOVE. I need more movement in this utterly boring routine. I’m only an eleventh grader (NOT REGULARLY HOME SCHOOLED) and I’ve been taking daily tuitions with my friends after school for the past 2 years. I had a pretty busy life and now that I have nothing to do I acknowledge that I actually like being busy. My existence is futile right now. I’m frustrated. NOTE: THANKS FOR ASKING! Is anyone else having trouble staying home? ",
            "date": "Answered April 1, 2020",
            "views": "234",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Mucci",
                "href": "/profile/Robert-Mucci-1"
            },
            "answer_text": "It is not in its self affecting mental health but the worry of it is . Also in lockdown people had more time to think about things and worrying over their future and the getting of the virus. The power of the Hug is amazing and during the lock down there were no Hugs to placate to smooth, to ease the tension. Of the millions of people furloughed they are worried if also they will have a job to go back to also. No cup of tea no smoothing hand to comfort those mentally stressed out. I also believe to a certain degree ,but don’t get me wrong that more and more people are claiming that they have a mental health problem were in a number of cases it was just anxiety. We have broken down the family in a lot of cases, fragmentation of it is the main cause of a lot of mental problems for people no longer have a shoulder to cry on anymore, and the lock down has brought this home so many today who are “home alone “ ",
            "date": "Answered July 30, 2020",
            "views": "170",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Srisai Obulam",
                    "user_href": "/profile/Srisai-Obulam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Umegla .m",
                "href": "/profile/Umegla-m"
            },
            "answer_text": "COVID has threatened the entire mankind. It is found out that 16-18% of people are feeling depression and anxiety due to COVID. The mindset of people has changed from the pre-to-post outbreak of COVID. The relationship between disease and human health is not a new concept. COVID has created a major health issue worldwide. It can spread through close contact when an infected person coughs, sneeze, and some droplets are thrown out by the infected person. Many people have even lost their jobs. Having no source of income leads to stress and tension. Even suicide cases are increasing in many countries. Trapping in their own houses and not going out has affected the mental strength of people. The unbearable anger due to the imposition of quarantine may lead to negative outcomes. The fear the COVID is not allowing the infected people to fight against the disease. This results in many people lost their lives while dealing with the virus. Distress, boredom, social isolation, and frustration are the key impact of COVID. In this pandemic, we have to be secure and taking care of our health. Grand Care Group is providing the best shielding material to protect the lives of people. They offer the best quality face masks, Gloves, and PPE kits. They supply the material all over the world at very reasonable prices. Contact them for any sake of requirements. Contact as: www.grandcaregroup.com Address: Ďurková 23, 949 01 Nitra, Slovakia Number: +421 905 552 101 ",
            "date": "Answered October 19, 2020",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ava Junn",
                "href": "/profile/Ava-Junn"
            },
            "answer_text": "It depends from people to people. As I'm not in a position where I have to wear a mask for many hours it's cool for me. Social distancing doesn't bother me. The thing that bothers me is that people end up having nothing to do, so they come in the normally empty forest near my home. They leave their garbage, they kill animals without reason, they bother others, they're way too friendly with my unfriendly dog so I've got to keep an eye on them, which wasn't the case before covid. Other than those disturbances, covid19 didn't affect my mental health. I'd be glad if people could go back to their activities instead of coming where I live though. They're not behaving respectfully. I'm surprised that given the temperatures they still didn't set the forest on fire “inadvertently”. ",
            "date": "Answered August 7, 2020",
            "views": "139",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harendra Sewada",
                "href": "/profile/Harendra-Sewada"
            },
            "answer_text": "I think covid-19 more affect mental health rather body. For the last few days, people have been locked inside the house for quite some time after killing their wishes.Where they get to see only one way of atmosphere If I had not seen anything since childhood, then he would have lived comfortably in that closed house, but it is becoming difficult for those who have seen a little world. And it is human nature that we wait for Sunday So that we can rest comfortably on that day and if you are given a lot of time to rest, then that rest will become your headache To avoid these, we must first reduce the scope of our thinking and after that we should replace things. For example at a time office we should set some other work same as office and give more to physical exercise and yoga to refrsh mind ",
            "date": "Answered July 1, 2020",
            "views": "110",
            "upvotes": " Answer requested by Aparna Singh Maurya",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                },
                {
                    "user_id": "Mohamed Amin Ben Salem",
                    "user_href": "/profile/Mohamed-Amin-Ben-Salem"
                },
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aasthaa Verma",
                "href": "/profile/Aasthaa-Verma"
            },
            "answer_text": "Covid 19 has become more like a lifestyle after being a pandemic. We were put in a lockdown and got limited to our homes. Staying in closed spaces has never felt as claustrophobic as this. Hence it is natural if you feel tired, lost or demotivated. Your life has entered the slow mode which our fast paced lifestyle could not handle. There were also many people who lost their jobs, homes and families. So if you think about it, you should be thankful if you still have a roof over your head , food in your belly and sleep at nights. Your pain and concern is not futile but you have to use your empathy to support you in this strange time. Our mental health is really important and underrated aspect of our life. This is an opportunity to work sincerely on it. Give yourself some space to breathe free and find motivation in the people around you or the nature just outside. This time is for your personal growth. Use it for things you procrastinated about and if you don't feel like it, that is alright as well. Even if you are able to sort a tiny issue in your life, you are sorted by all means. ",
            "date": "Answered October 11, 2020",
            "views": "127",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Toasterman",
                    "user_href": "/profile/Toasterman"
                },
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelli Shomaker",
                "href": "/profile/Kelli-Shomaker"
            },
            "answer_text": "How much of an impact not being able to socialize has on a person varies. People have different personalities. There are personalities where people are codependent. They have ‘other’ esteem. These people have a strong drive and need to be around others. There are the introverted people who don't need as much contact. By in large, we are social beings. Our existence has depended on it. As cave dwellers and nomads, we were in clans and tribes. Our ‘old’ or ‘lizard’ brains kick into anxiety mode if we feel isolated. This can set off pre-existing mental health issues or it can be a new issue. The trend I have noticed is just how narcissism is almost at a epidemic level in the US. It has been the norm in the Bible belt and has spread. (That's my opinion.) I see a trend where a lack of a social conscious is excepted. Rebellion and oppositional behavior is a way of getting attention and used to relieve boredom. These people feed off of each other's narcissism. We are in uncharted territory as a nation. We feel the lack of solid, intelligent leadership in the White House and that only feeds the anxiety fire. So, I see anxiety as the number one problem of this pandemic and it has been the spark that has ignited other mental health issues for those that are susceptible. ",
            "date": "Answered May 30, 2020",
            "views": "175",
            "upvotes": " Answer requested by Jay Harewood, Engr Nazir Ahmad Baig and 2 more",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dipanwita Dutta Biswas",
                "href": "/profile/Dipanwita-Dutta-Biswas"
            },
            "answer_text": "Due to Covid-19, our mental health has really taken a toll. Locked up in a same environment without a change gets really tough. We are having comparatively higher mood swings, emotional outbursts and stressing over small things. And it is normal to feel this way, we all are in this, together. Now since we are allowed to have movement around our building colony, we can walk around the Colony with all protective measures or take walk on building terrace for some change in environment. Meditation always helps and I suggest one should do Yoga and meditation atleast one hour in the morning for maintaining the balance of our body elements. Music, dancing, cooking and podcasts surely help. I came across a podcast channel spreading awareness on mental health called Dtoks and I feel y'all should check it out too: dToks Mental Health Community . ",
            "date": "Answered August 17, 2020",
            "views": "107",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gaynor Lowell",
                "href": "/profile/Gaynor-Lowell"
            },
            "answer_text": "My mental health is okay, we're all caught up in this BS, and there's really nothing we can do about it accept live through it as we have live through all the other tragedies that has been brought Upon Us by ourselves. There are people who are going to be going ape shitt. (I picked that one up from the military). People are going to be blaming the other one for the problem. Depends on your Race, Creed or Color who you blame it on. The right is going to blame the left, the left is going to blame the right. It all boils down to stupid Man tricks. Men control the world and they're doing a messed-up job of it. Everybody dies one day. Something's going to kill you, me, us. This one's taking a lot of us out of circulation, mainly because of the fear that is being generated by it. The world we live on will never be the same. We may be looking at Global Economic Collapse, which in likelihood will lead to World War 3. Which will lead to the fall of our great civilization. Let's hope they can come up with a vaccine, however you have the anti-vaccination movement out there, question is will these people take the vaccine if it's available? Let's hope we learn a lesson from this one, and learn to better cooperate with each other. The coronavirus has shown us how small our world is and how independent we are upon each other. It seems that the generational future doesn't remember the generational past. May logic and understanding come to the ones call Men. ",
            "date": "Answered April 7, 2020",
            "views": "453",
            "upvotes": " Answer requested by Amy Potter",
            "upvoters": [
                {
                    "user_id": "Arun K Shukla",
                    "user_href": "/profile/Arun-K-Shukla"
                },
                {
                    "user_id": "Betty Bever",
                    "user_href": "/profile/Betty-Bever"
                },
                {
                    "user_id": "Geneva Ashdene",
                    "user_href": "/profile/Geneva-Ashdene"
                },
                {
                    "user_id": "Bernd Kohler",
                    "user_href": "/profile/Bernd-Kohler"
                },
                {
                    "user_id": "Dominika",
                    "user_href": "/profile/Dominika-108"
                },
                {
                    "user_id": "Alex Vickers",
                    "user_href": "/profile/Alex-Vickers-26"
                },
                {
                    "user_id": "Jacqueline Gage",
                    "user_href": "/profile/Jacqueline-Gage-2"
                },
                {
                    "user_id": "Cody Crouse",
                    "user_href": "/profile/Cody-Crouse"
                },
                {
                    "user_id": "Ash",
                    "user_href": "/profile/Ash-3123"
                },
                {
                    "user_id": "Anthony Powers",
                    "user_href": "/profile/Anthony-Powers-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vidhi Jain",
                "href": "/profile/Vidhi-Jain-555"
            },
            "answer_text": "Coronavirus and the lockdown situation in India has restricted the physical movement of people, which is affecting the mental health of people drastically. One main reason for this is Fear of being infected by the virus. The other reason for mental health being affected is the significant changes in the lifestyle of people. All the restrictions that are imposed on the general public which does not even allow them to visit their favourite places or meet their friends is also affecting them.People are also not able to adapt very easily to the new techniques of Work from Home or Home Schooling that had to emerge as per the current situations. All of these reasons are collectively adding on to the worries of people and making them feel depressed or anxious. The only way to root out this problem is to involve into meditation and yoga practices, do as much as physical work possible in the home only and keep connected with the friends and near and dear ones to not feel isolated and anxious. But, do not worry, SiashMed is here to help you. You can get in touch with a psychologist online in the comfort of your home using the SiashMed - Order medicines online;hospitals and doctors app and get your problems solved to the maximum extent. ",
            "date": "Answered June 15, 2020",
            "views": "198",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Betty Bever",
                    "user_href": "/profile/Betty-Bever"
                },
                {
                    "user_id": "Tanvi Kankonkar",
                    "user_href": "/profile/Tanvi-Kankonkar"
                },
                {
                    "user_id": "Graham lee Gordon",
                    "user_href": "/profile/Graham-lee-Gordon-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nastasia Zibrat",
                "href": "/profile/Nastasia-Zibrat"
            },
            "answer_text": "Like the previous poster said, I can’t speculate on mental health in general, but I can talk about my mental health. I worked in acute inpatient psych for 5 years, and while it was a rewarding experience, the hospital’s lack of appropriate COVID response was one of the biggest reasons why I quit. I realized that I could not bear it if I infected my daughter, my husband, my in-laws (who are immunocompromised), and it made me realize what is really important in my life. I thought, eff it, and took a huge risk in starting my private practice. In a way, COVID made me take stock of what’s truly important to me, and what I want to be doing with my life. On the negative side, I am increasingly sad, since I can’t see my own parents and sister, since they live in another country. I’m frustrated with the anti-maskers, I’m afraid for the future, and some days, my anxiety is really bad. ",
            "date": "Answered August 17, 2020",
            "views": "103",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                },
                {
                    "user_id": "Betty Bever",
                    "user_href": "/profile/Betty-Bever"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rishivignan",
                "href": "/profile/Rishivignan"
            },
            "answer_text": "Covid 19 has serious effects on all of us especially on our mental health. All the stress happening around us during this pandemic time has serious effects on our mental health. To overcome the problems related to the mental health we can practise yoga which is of great help.Yoga helps in attaining inner peace and thus improving our mental health. To know more about how yoga therapy can be used to improve mental health is discussed in our below attached blog. Kindly have a look. Can Yoga improve mental health during the COVID-19 crisis? - Rishivignan ",
            "date": "Answered April 30, 2020",
            "views": "151",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kyle Doe",
                "href": "/profile/Kyle-Doe-11"
            },
            "answer_text": "The COVID-19 pandemic separated me from my normal life by cancelling work and geographically estranging myself from the my social circle of friends and family. This allowed me time to sit alone with my mental health issues which instantly manifested themselves relentlessly. Since I lacked responsibility however these issues became purpose and I was forced to look at them and change my lifestyle or die. I am glad I had the space and time to do so safely and that I am able to stay connected to the world virtually. I will say I believe I have made some changes to my habits that puts me on a more kierkegaardian driven path of concious behavior but it also drew me closer to the expression of an old philosophy teacher “every day above the ground is a good one\" ",
            "date": "Answered April 12, 2020",
            "views": "363",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Derrik Pates",
                    "user_href": "/profile/Derrik-Pates"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marc Lambert",
                "href": "/profile/Marc-Lambert-9"
            },
            "answer_text": "Not at all, it has put more stress/pressure on me and soon there will be trauma but I do not allow this to stimulate my faulty right anxious/negative brain, as long as I keep use of my left logical/positive brain maximised my mental and physical heath is maximised. EGMi maximises left brain use, it has been well tested over the last few years with family cancer and death, family suicide, other family sickness, financial stress, the drought and fire danger, the right wing world push by Putin and the CPC and now the virus but it juts keeps on working, stay well and spread out. ",
            "date": "Answered March 29, 2020",
            "views": "330",
            "upvotes": " Answer requested by Amy Potter",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Louise Lyons",
                "href": "/profile/Louise-Lyons-2"
            },
            "answer_text": "200 doctors signed a letter to President Trump, requesting he lift or ease lockdown measures about 2 months ago. In the letter the doctors told how these lockdown measures ( not the virus itself) were affecting people lives. More people were becoming depressed and those with diagnosed depression got worse, ending in suicide for some. They also noticed a rise in alcohol consumption and abuse along with increased marital and family issues including abuse of spouses and children. People are being fed exaggerated and false news increasing their fear and anxiety. The doctors noted an increase in suicide, deaths from unchecked heart conditions that were exacerbated by worry and anxiety, and increased deaths due to crimes and anger. ",
            "date": "Answered July 30, 2020",
            "views": "106",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tristram Carlyon",
                "href": "/profile/Tristram-Carlyon"
            },
            "answer_text": "I'm sorry, Miguel Parez, I really don't know. I'm not going to speculate either - too many people doing too much of that & doing nothing but confusing already frightened people. But I will give you a personal answer - if I wasn't barking mad before covid-19, I may be doubting my sanity before much longer. ",
            "date": "Answered September 12, 2020",
            "views": "46",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mila Lana",
                "href": "/profile/Mila-Lana-2"
            },
            "answer_text": "Two things: - TV annoys me (interestingly, are there any events without the participation of Covid-19 in Russia?) - I'm annoyed by the chaotic actions of the authorities (according to Russian law, authorities can impose restrictions in two cases: war and emergency. But they did not declare this. However, they have the audacity to impose fines on people for violating the recommended regime. Recommended regime! This is not an order, this is a recommendation - only the person decides what to do, to observe or not to observe the recommendations) These are not mental problems. But this is an annoyance due to legal chaos and media fixation on the virus. I'm annoyed.  ",
            "date": "Answered April 9, 2020",
            "views": "743",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arun K Shukla",
                    "user_href": "/profile/Arun-K-Shukla"
                },
                {
                    "user_id": "Gerardo Aguirre",
                    "user_href": "/profile/Gerardo-Aguirre-9"
                },
                {
                    "user_id": "Michael Wayne Box",
                    "user_href": "/profile/Michael-Wayne-Box"
                },
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suzy McKee Charnas",
                "href": "/profile/Suzy-McKee-Charnas"
            },
            "answer_text": "Well, it’s pretty depressing, and some mornings I wake up feeling very anxious before I even turn on the news (which I’m trying to do less often). But some of that could be about having recently turned 80 and the fact that my life partner, my late husband, died a couple of years ago so we can’t cheer each other up any more. I’m in the “high risk” range for the virus, old as I am and having asthma, although it’s a mild case. I also find myself turning more to some pretty heavy reading, much of it about the nature of Time, evolution, and what science tells us about the universe. I find the shift in perspective stimulating, absorbing, and of course distracting, in the best possible way. ",
            "date": "Answered April 11, 2020",
            "views": "439",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jennifer Decoteau",
                "href": "/profile/Jennifer-Decoteau-1"
            },
            "answer_text": "I can answer for myself. I have schizoaffective disorder. It’s basically a mood disorder (like depression or bipolar) mixed with features of schizophrenia. My negative features (hallucinations, delusions) are controlled by medication. With or without meds, psychosis is brought on by extreme stress or feeling overwhelmed. This is a stressful and overwhelming time! Can’t see my doctors face to face, routines all out of whack, kids out of school for the foreseeable future, etc. ",
            "date": "Answered April 20, 2020",
            "views": "303",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Etienne Charilaou",
                    "user_href": "/profile/Etienne-Charilaou"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samiksha Tripathi",
                "href": "/profile/Samiksha-Tripathi-14"
            },
            "answer_text": "It has been approximately seven months of first nationwide lockdown due to COVID-19. Coronavirus changed the life of the people both positively and negatively. There is a lobby of people who are happy because they came to home after a very long time. They have got an opportunity to spend time with family and friends. Due to ease in office hours and work from home facility, people are getting time for their hobbies and interests. Some people started their start-ups for essentials like masks, etc. Hence, it can be said that they are having a good time. On the other hand, there is a lobby of people who have been affected severely by the pandemic. They are having fear, anxiety, pain, etc. as they have lost their jobs. They have rents to pay, EMIs and daily expenses. They are survived by joint family. Thus, it has become difficult for them to handle the situation. They are having restless days and sleepless nights. One of the most common example is that of a director who was one of the directors in famous TV serial 'Balika Vadhu' was forced to sell vegetables. Thus, in this critical time, we need to support eachother. “Baba ka Dhaba” got famous due to proper use of social media and efforts of people. There are many others who need us. ",
            "date": "Answered October 13, 2020",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Greco",
                "href": "/profile/Richard-Greco-3"
            },
            "answer_text": "It is putting a lot of stress on the general population and I just read an article today that talked about that very subject. Here is the headline: PTSD expert: Americans are being ‘psychologically abused’ by Trump and will face health crisis for years. and this is the article: PTSD expert: Americans are being 'psychologically abused' by Trump and will face health crisis for years. According to the article, and others that I have come across, the belief is that the COVID-19 is going to affect our emotions for years to come coupled with the ravages of the scandal-machine of Donald Trump. ",
            "date": "Answered September 12, 2020",
            "views": "49",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Michael Wayne Box",
                    "user_href": "/profile/Michael-Wayne-Box"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amolika Chandel",
                "href": "/profile/Amolika-Chandel"
            },
            "answer_text": " The coronavirus disease 2019 (COVID-19) pandemic may be stressful for people. Fear and anxiety about a new disease and what could happen can be overwhelming and cause strong emotions in adults and children. Public health actions, such as social distancing, can make people feel isolated and lonely and can increase stress and anxiety. I believe for Covid-19 the correct word to use is ‘Physical Distancing’ & not ‘Social Distancing’ Healthy ways to cope with stress : Make time to unwind. Try to do some other activities you enjoy.Connect with others. Talk with people you trust about your concerns and how you are feeling.Connect with your community- or faith-based organizations. While social distancing measures are in place, consider connecting online, through social media, or by phone or mail.Take breaks from watching, reading, or listening to news stories, including those on social media. Hearing about the pandemic repeatedly can be upsetting.Take care of your body.Take deep breaths, stretch, or meditate.",
            "date": "Answered August 15, 2020",
            "views": "131",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mary Sestak",
                "href": "/profile/Mary-Sestak"
            },
            "answer_text": "When life serves you lemons. I make lemonade. If you possess increased resilience then covid 19 will not be detrimental on your mental health. For example. I choose to do all the things I have wanted to do but put on the backburner due to a high paced life style. I am now enjoying learning how to self teach myself on the guitar and am loving it. I am recycling and upholstering two chairs I got from goodwill. I am creating mosaics on mannequins. I am sewing cushions for my new studio. I am taking out more time to read now. I am experimenting with new recipies. I am in the garden redesigning my back yard and on top of that I have been lucky enough to still have a job during this crisis. So now I am taking more time for the things I love to do and enjoying myself immensely. COVID has given me the opportunity to STOP and smell the roses.. R evaluate and r establish my purpose and goals in life. It’s all about perspective. Im an optimist so I guess that helps me also. ",
            "date": "Answered May 19, 2020",
            "views": "161",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ralph Pifer",
                "href": "/profile/Ralph-Pifer"
            },
            "answer_text": "The data we have suggests that we are seeing upticks in all the following areas: Anxiety in general;Worsening anxiety disorders;Depression in general—and worsening of those with existing diagnoses;Substance abuse is increasing;We suspect child and spouse abuse is on the rise;We are worried about increased rates of suicide—though the data is not in;COVID itself causes small and large strokes, inflammation in the brain, leaves individuals in a “mental fog, etc. It is clear that many people recovering from the disorder my have lingering effects—the full scope of these have yet to be determined.Stay well. Stay safe. ",
            "date": "Answered July 31, 2020",
            "views": "113",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lacee LeClercq",
                    "user_href": "/profile/Lacee-Marie-LeClercq"
                },
                {
                    "user_id": "Michael Wayne Box",
                    "user_href": "/profile/Michael-Wayne-Box"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matea Sršen",
                "href": "/profile/Matea-Sršen"
            },
            "answer_text": "I have to say that surprisingly, I don’t see any significant negative consequences. The reason for my “surprise” is that I am a big extrovert and was at first scared that the lack of personal contact with people will be unbearable. However, during the lockdown, I’ve realized that I also really enjoy spending time with myself. My friends and family are always available on the phone if I need them, and I am available to them if they need me. Here in Germany, the lockdown hasn’t been as strict as in some parts of the world. I could go for a walk every day. And it’s been sunny and warm here even before everything regarding corona escalated. I've actually never spent so much time outside before the crisis… But now, I walk around my neighborhood every day, listening to some audiobooks or music. This has been a mostly therapeutic period for me, part of which I owe to the fact I generally don’t have any major life problems, nor does my family. My biggest struggle is studying for exams and working on my master thesis. Hopefully, these are the only problems I have in life until October… ",
            "date": "Answered April 22, 2020",
            "views": "433",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kartik Naidu",
                "href": "/profile/Kartik-Naidu-48"
            },
            "answer_text": "COVID-19 has its impacts as it has killed numerous people across the world. However, the most disturbing aspect of COVID 19 has been its effects on global mental health. It is not even funny to the extent it has played havoc with the mental health of people triggering panic and scare. One needs to understand the situation and take the right measures, panic happens when we as individuals think that we can control everything specially. We need to focus on everything that is within our hands instead of regretting things that are not. ",
            "date": "Answered August 28, 2020",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sunanda Chaudhary",
                "href": "/profile/Sunanda-Chaudhary-8"
            },
            "answer_text": "The Business of Health in the Covid-19 Era The Blue Circle The Covid-19 pandemic has overwhelmed our health infrastructure. India’s coronavirus infections have surged to overtake the U.K, becoming the fourth worst-hit nation, only behind the U.S, Brazil, and Russia. The situation remains dire, particularly in Delhi and Mumbai where state-run hospitals have run out of beds and are turning patients away. The Delhi High Court on June 11 permitted all the private hospitals in the city, which are equipped with labs to conduct tests and have the sanction of the Indian Council of Medical Research (ICMR). It was imperative to allow private hospitals to conduct tests as there are just 17 labs in the public sector in Delhi, with the capacity to test only 2,900 people per day. In the private sector, 23 labs have been granted permission, which has a combined capacity of testing 5700 people per day. The decision comes after the Supreme court slammed the Delhi government for a low testing rate in the region which is reporting 1800-2000 cases every day. On an increase in the number of cases in the capital, Delhi’s Deputy Chief Minister Manish Sisodia shared that by current estimates there would be more than half a million cases by the end of July, requiring more than 80,000 hospital beds. To reduce the burden on public infrastructure, the Delhi government has directed all the private hospitals in the capital to reserve 20% beds for admitting Covid patients. ",
            "date": "Answered June 18, 2020",
            "views": "153",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lalantika Harish",
                "href": "/profile/Lalantika-Harish"
            },
            "answer_text": "Mental health is being impacted the most because of the covid-19, at an individual level. Being locked down at home, and forcing people to live a life that they never expected, triggers anxiety, fear, anger and many more negative emotions. With lack of awareness about mental health, it becomes even more difficult for people engage in creative and constructive activities to occupy and distract their mind from the daunting boredom. Relationships could be bearing the strain of individual anxiety and anger, resulting in resistance and hostility. ",
            "date": "Answered June 3, 2020",
            "views": "103",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mare Stone",
                "href": "/profile/Mare-Stone"
            },
            "answer_text": "It’s very hard for many people even if you still have a job. At times you feel like your caged in your own home. You always have to be hyper vigilant in being aware who is around you and always wearing your mask BECAUSE WHO KNOWS you may be carrier AND NOT KNOW IT! I have had situations where I have flat out told them Please put your mask on. I am NOT one to stand down to anyone no matter how big, how dangerous people come off as. I’ll file a civil suit against you in a heartbeat and I’ll include the establishment where I was that wouldn’t enforce the mandate manditory mask law. Hers the deal YOU don’t ever want to go up against a Mom with an Autistic child that is at risk because he’s asthmatic. IF HE gets sick. And if I get sick from your ignorance and blatant neglect of the New mandated laws then I promise with with everything ounce of my being I Will make it my mission and I Will Bring you down and financially I will spent 10, 20 or 30 thousand dollars to make a simple cost of a mask $1.99 cent point. Then you will financially be begging me to stop and I won’t until I have made my point. I will also take the establishment that failed to escort you out and refuse to serve you no matter what store I’m in. I have already acquired lots of documentation, pictures to prove my point plus I have an eye witness. I am not afraid even until my last breath. Do not underestimate anyone. So listen Up. Wear your mask NO matter if you have symptoms or NOT. I expect no less. An encounter with me will be alarming and not pretty. Best Wishes ",
            "date": "Answered August 1, 2020",
            "views": "157",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Virginia Grant",
                    "user_href": "/profile/Virginia-Grant"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vicki Herrmann",
                "href": "/profile/Vicki-Herrmann"
            },
            "answer_text": "COVID has not had any sort of negative affect on my mental health. I self isolate to some degree no matter what, and I have everything I need in order to stay home. I am not making a lot of changes, other than cleaning more often than I did before COVID. If anything, my mood has improved because I have something else to consider other than my mundane experience. About the only thing that bothers me is when people freak out and damn near hyperventilate over details of avoiding contact with other people. This is TEMPORARY. Even if it goes on for the whole summer, it's not the end of the world (well, for some people maybe it is) but life does go on. This too, shall pass. ",
            "date": "Answered April 1, 2020",
            "views": "144",
            "upvotes": " Answer requested by Jay Harewood",
            "upvoters": [
                {
                    "user_id": "Claudio Barboza",
                    "user_href": "/profile/Claudio-Barboza-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Janis Tribble",
                "href": "/profile/Janis-Tribble"
            },
            "answer_text": "Imagine you are watching a horror movie about a virus running amok, then you wake up. And it is not a dream. It is your new reality. And if you live in US, you are bombarded with media telling you that you are going to die. Your family is going to die and all the young children are going to die. That is a lot of stress to be under. Especially if you are a young family, or a family with grandparents in a nursing home. No matter what the facts are, people argue with me all the time. Based not on reality, but on their reality of created fear. Fear is a paralyzing emotion. It can color everything you think. Paralyzed with fear, is not the way to live a life. ",
            "date": "Answered August 1, 2020",
            "views": "163",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lacee LeClercq",
                    "user_href": "/profile/Lacee-Marie-LeClercq"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Kiernan",
                "href": "/profile/Chris-Kiernan-5"
            },
            "answer_text": "Worrying about ourselves and each other getting sick has placed a good deal more stress on both my wife and myself. Trying to deal with and speak out about the miserable, pathetic, and criminal pandemic response of the Trump government has increased our anger to the boiling point. So, increased stress and anger would pretty much sum it up. ",
            "date": "Answered August 17, 2020",
            "views": "70",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Serhant-Hedkins"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Eamon",
                "href": "/profile/Don-Eamon"
            },
            "answer_text": "I’m holding up well, perhaps as well as if not better than most others. I’m a bit of a homebody as it is, even though I do miss the company of others a little, I know that this is temporary, and that will return. Rather than worry or become depressed, I find things to keep me occupied, such as this morning, I cleaned out the fruit-and-veggie drawer in my refrigerator. It’s the little things. I’m doing a little reading, keeping up any new ideas to protect against possible infection, and watching some movies on Hulu and Netflix. I don’t worry about going outside, but I do prepare when I do. I take all the reasonable precautions. Stay safe! ",
            "date": "Answered March 31, 2020",
            "views": "237",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rana Abdul Rahman",
                "href": "/profile/Rana-Abdul-Rahman-5"
            },
            "answer_text": "Most of the countries have taken action to reduce the action of COVID-19 through safety measures such as lockdown,social distancing and distribution of surgical masks.Such measures and the disease it self have A bad effect on mental health of a human.Most of the people are scared of this virus beacuse of rumours and the increasing of death rate day by day due to corona virus And people got depressed and avoid going to hospital when they are ill.people should go to hospital for regular check ups and should obey the policies given by government.They should avoid going out without any reason. ",
            "date": "Answered June 15, 2020",
            "views": "91",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dawn Selanders-Mercer",
                "href": "/profile/Dawn-Selanders-Mercer"
            },
            "answer_text": "It really hasn’t changed my mental stability! I meditate, I go for a walk, I FaceTime with family and friends I color mandalas, open all the blinds you get light in the house. Which really helps. I’m not a Dr. so this is just about how I handle all this Covid-19. I also have a FaceTime counseling appts. Once a week. It’s more about taking my meds and keeping my mind from wondering on to stress. I hope this helps! Stay safe, mentally and physically healthy! ",
            "date": "Answered April 19, 2020",
            "views": "237",
            "upvotes": " Answer requested by Jay Harewood",
            "upvoters": [
                {
                    "user_id": "Richard Petek",
                    "user_href": "/profile/Richard-Petek"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Gregory",
                "href": "/profile/Jeff-Gregory-32"
            },
            "answer_text": "Anyone who is so afraid of this virus should lock themselves in a closet and stay there for the rest of their lives. There are a billion virus’s out there every second of every day. We were given immune systems for good reason. Trust yourselves. Trust your immune system. Eat properly, exercise, get plenty of sunlight. And breathe. ",
            "date": "Answered April 12, 2020",
            "views": "181",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Garrett",
                "href": "/profile/Richard-Garrett-4"
            },
            "answer_text": "It hasn’t affected me as far as I can tell, but I’m weird to begin with. It’s kind of an official sanction to live the life I always lived, so it’s not really a change. Almost a relief. We’re all weird now! I find it irksome to be so cautious and shall we say deliberate about my shopping, and I don’t do it every night but twice a week, and I keep it short and when nobody else is around. But being told I have to stay away from crowds is a blessing! I can and do go for long drives up into the mountains to get out. No contact there and a bit of variety. Something I’d do anyway. ",
            "date": "Answered March 31, 2020",
            "views": "389",
            "upvotes": " Answer requested by Amy Potter",
            "upvoters": [
                {
                    "user_id": "Margie Kohler Searing",
                    "user_href": "/profile/Margie-Kohler-Searing"
                },
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bernard G. Chambers",
                "href": "/profile/Bernard-G-Chambers"
            },
            "answer_text": "I am super pissed at two groups. First the ChiComs for allowing the virus out of their Class #4? lab and then not telling the truth about it. Saying it did not spread between people. And the second group are the low IQ, mental midgets in the mainstream media for false reporting, biased reporting, for not challenging obviously inaccurate pronouncements by politicians such as those who welcomed people to China Town festivals for PC reasons ",
            "date": "Answered April 2, 2020",
            "views": "435",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Richard Petek",
                    "user_href": "/profile/Richard-Petek"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rasik Lal",
                "href": "/profile/Rasik-Lal-3"
            },
            "answer_text": "In office visits are down. Most of the therapy is being provided online through secure apps. Medicare in many cases has promised to pay for such therapy as also some insurances for some kinds of therapy. In hospital therapy is still going on like before, but with additional precautions. Most of the specialty programs like partial hospital and intensive outpatient programs are closed. This is for both mental health and substance use. . ",
            "date": "Answered March 22, 2020",
            "views": "286",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Margie Kohler Searing",
                    "user_href": "/profile/Margie-Kohler-Searing"
                },
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Hilgenkamp",
                "href": "/profile/Brian-Hilgenkamp-1"
            },
            "answer_text": "it has not much at all. My wife works for a healthcare provider and I am a farmer so neither of us lost jobs ect so outside of our social lives outside work going to hell it has not affected us much emotionally. My bowling leagues were canceled middle of last month but had they not been they would be ending now or close to it anyway. My wife had to watch her aunts funeral web streaming. My church services are on youtube and closed to the public. So that part of life is shut down. But our work lives are the same. ",
            "date": "Answered April 20, 2020",
            "views": "99",
            "upvotes": " Answer requested by Jay Harewood",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "J.W. Saret",
                "href": "/profile/J-W-Saret"
            },
            "answer_text": "I assume you mean my perception of my mental health . Self diagnosis of mental health is liable to be flawed. It's not much different, I've always been a reader, rational and introverted. I have low social needs and often prefer to think instead of interact. I'm gloved up when away from home and thus cannot operate a touch screen which leads to: I suppose the biggest mental health marker I've observed is thanking Alexa, Hey Google, or Hello Moto when they perform some task for me. It's not that I imagine they are thinking feeling beings or even have any meaningful probability of evolving into one. It just feels wrong to ask Alexa to play a radio station, Hey Google to send or read a text or Hello Moto to attempt but fail whatever I've asked it to do without saying “thank you” . Old or unsane? You decide. ",
            "date": "Answered April 13, 2020",
            "views": "355",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ernest Pendergraft",
                    "user_href": "/profile/Ernest-Pendergraft"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sohail Ahmed",
                "href": "/profile/Sohail-Ahmed-7"
            },
            "answer_text": "Thanks Amy for A2A. Frankly, I wish I had a zero degradation value in respect of my mental health (that I imagine to be quite good by the grace of Allah). I have a few worries therefore a certain low-level degradation is not ruled out. I have a scattered family. Covid-19 is a wide-spread phenomenon. So, the multiplicative effect of the spread of disease gives rise to general worries about overall wellbeing of the family members. Global Covid-19 triggers wide-range worrying. Thanks for reading the above short answer. ",
            "date": "Answered April 1, 2020",
            "views": "344",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Michael Wayne Box",
                    "user_href": "/profile/Michael-Wayne-Box"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeno M. Vann",
                "href": "/profile/Jeno-M-Vann"
            },
            "answer_text": "It has not really affected my mental health at all I guess. I'm not making any changes to my lifestyle. I don't go around people much anyway, I'm always stockpiled while I train and excersize daily. I’m always aware and knowledgeable about things most are unaware of. My high intuition and clairvoyance is mainly the reason. I practice Zen, Qi Gong (Tai Chi) and Kuji-in as well. I have a sense of feeling like “ this too shall pass.\" ",
            "date": "Answered March 30, 2020",
            "views": "285",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Betty Bever",
                    "user_href": "/profile/Betty-Bever"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mehr Baloch",
                "href": "/profile/Mehr-Baloch-12"
            },
            "answer_text": "Uptill now it would say no. But if it prolongs for months than obviously it will affect. Social media, news almost everything is just over flowing with the discussion of corona virus. Its causing depression. But there isn’t any solution except lock down in different countries. #StayHome #StaySafe ",
            "date": "Answered April 10, 2020",
            "views": "108",
            "upvotes": " Answer requested by Jay Harewood",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simran Arora",
                "href": "/profile/Simran-Arora-542"
            },
            "answer_text": "Covid-19 has distorted mental health in various ways. For example- there are more of suicidal thoughts in your mind, less interaction with friends, and claustrophobic settings have made it worse. While some parts of the country are still under lockdown, it is important for all of us to support each other during such crisis. Below are some of the tips that could help you to improve your mental health during lockdown.https://thebackstoryy.com/improve-mental-health-during-lockdown/ ",
            "date": "Answered July 30, 2020",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Leatherbury",
                "href": "/profile/William-Leatherbury"
            },
            "answer_text": "It has not affected it at all and I don’t understand why you would ask such a question. Sure, I’m concerned. Sure, I’m worried. Sure, I fear for the health of my family and loved ones. That doesn’t mean my mental health is any different than it was when there were dangers from contaminated lettuce or green vegetables. These are extraordinary times but this will surely not be the last of the disasters we will see. ",
            "date": "Answered April 11, 2020",
            "views": "280",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jana Kalekye",
                "href": "/profile/Jana-Kalekye"
            },
            "answer_text": "I find that because of the advancements in technology, I'm still able to continue in therapy so this has been extremely helpful. However, having said that I'm also an extrovert and am missing being face to face. It's hard to live alone and I do have moments of feeling the loss of connection. I'm a regular church attender in an evangelical church and I love children. I'm missing the kiddos that I work with immensely. I also made myself reach out and be honest that I was struggling. I have a support team around me plus my therapist so I'm fortunate. It's hard to reach out for me, I'd much rather withdraw when I'm in trouble. I would suggest if you're struggling that at minimum you hear a voice if FaceTime isn't possible. I believe that sending texts is okay but you are really guessing sometimes if the person is kidding or serious. I find it better to at least talk so there's not so much misunderstanding. If you're a gamer, you still need stimuli outside of the game. Great to have a common interest but again I think conversation is important outside of game talk. ",
            "date": "Answered May 21, 2020",
            "views": "102",
            "upvotes": " Answer requested by Jay Harewood",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anshul Gautam",
                "href": "/profile/Anshul-Gautam-89"
            },
            "answer_text": "Covid-19 has turned into somewhat of a mental health crisis, with the anxiety and paranoia and isolation in lockdown. More people are reaching out to therapists (which is a good thing) and that indicates the crisis that it has become. Read more : http://3minread.xyz/cognitive-overload-and-covid-19/ ",
            "date": "Answered August 2, 2020",
            "views": "109",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sharon Jones Smith",
                "href": "/profile/Sharon-Jones-Smith-1"
            },
            "answer_text": "Many people are getting anxious & depressed. They have trouble sleeping 💤. You need to keep busy & exercise. This helps people alleviates the symptoms. Don’t watch the news all day. It’s depressing to see the cases & deaths go up every hour. I stopped watching most of the news. I only watch the local news now. ",
            "date": "Answered July 28, 2020",
            "views": "622",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cheri McNew-Mulholland",
                "href": "/profile/Cheri-McNew-Mulholland"
            },
            "answer_text": "Since I’m older, and live alone, not much has changed. Although, it’s extremely frustrating to not be able to make a doctor or dentist appointment! So I sit back and observe others. My mental state is as usual. Other people’s are off the charts!! Just when I think mankind couldn’t get any worse, someone does something that hits an all time low! How about your mental health? I hope it’s much brighter than mine! 😊 ",
            "date": "Answered May 5, 2020",
            "views": "78",
            "upvotes": " Answer requested by Amy Potter",
            "upvoters": [
                {
                    "user_id": "Kushal Sareen",
                    "user_href": "/profile/Kushal-Sareen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terri Breedlove",
                "href": "/profile/Terri-Breedlove-3"
            },
            "answer_text": "I'm doing pretty good. I wash my hands often, OCD. Can't seem to keep my hands off my face though. I believe we will overcome this IF people would stay home. How are you doing with this Coronavirus? ",
            "date": "Answered March 29, 2020",
            "views": "73",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Satyajeet Sen",
                "href": "/profile/Satyajeet-Sen"
            },
            "answer_text": "I dont think this will affect mental health of humans!Its more to do with psychological thinking and fear.This is being instilled by our so called special media!We should not fear this virus and this virus is less threatening than comman-cold!Only old age people with weak immune system can die because of it!We should instead start thinking of the solution for it than to fear it ",
            "date": "Answered March 17, 2020",
            "views": "177",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rita Lamy",
                "href": "/profile/Rita-Lamy"
            },
            "answer_text": "Well, it is pretty dam stressful. As this is a very new virus, the effects on the brain are still being investigated. Consequently, it is unclear at this time what those effects are globally. For those who already have mental illnesses, I would imagine having this virus is exacerbating their symptoms. ",
            "date": "Answered July 29, 2020",
            "views": "341",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Swarnim Bhardwaj",
                    "user_href": "/profile/Swarnim-Bhardwaj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muskan Bansal",
                "href": "/profile/Muskan-Bansal-258"
            },
            "answer_text": "Covid-19 is a curse for our mental health. Sudden lifestyle changes or problems like financial distress and disruptions to work and social activities were significantly associated with depression and anxiety, as well as it decreased our psychological well-being. This pandemic has impaired our quality of life we were living before. We should be empathetic to all those who are affected mentally as they need and deserve our support, compassion and kindness specially in these uncertain times. ",
            "date": "Answered October 14, 2020",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Breyer",
                "href": "/profile/Peter-Breyer-2"
            },
            "answer_text": "Covid draws the major detriment from the fear that is being stirred by the media. On social media, on websites, on TV and in the news there are constantly bad news about Covid. How many new infections there are (notice nobody talks about the death rate anymore as it has severely dropped over the last month and is nothing more than the seasonal flu). So my advice to people is to turn off the news and live happy ever after. ",
            "date": "Answered June 29, 2020",
            "views": "76",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Montego Cruz",
                "href": "/profile/Montego-Cruz"
            },
            "answer_text": "Many people are feeling a financial strain during this worldwide crisis and coupled with fear mongering, it is having a profound effect on mental health. Supermarkets are being cleared of food and health care essentials, the streets are empty, businesses are closed or going under. We will definitely be seeing a recession very soon. All these things are weighing on people and they are stressed, anxious and tired. ",
            "date": "Answered March 17, 2020",
            "views": "293",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Randy Almond",
                "href": "/profile/Randy-Almond-3"
            },
            "answer_text": "My mental health has been affected by COVID-19 only to the point that I am concerned about OTHERS’ health, not my own. Of course, I am practicing ALL mandates in place as consistent with working full-time in an essential sector. IF I should become infected and die, I will just be going “home” sooner than I planned, but it will NOT be outside of God’s all-knowing provision. ",
            "date": "Answered April 19, 2020",
            "views": "69",
            "upvotes": " Answer requested by Jay Harewood",
            "upvoters": [
                {
                    "user_id": "Virginia Grant",
                    "user_href": "/profile/Virginia-Grant"
                },
                {
                    "user_id": "Steve Gannon",
                    "user_href": "/profile/Steve-Gannon-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maryam Salman",
                "href": "/profile/Maryam-Salman-46"
            },
            "answer_text": "an increasing number of actual and suspected cases..These factors may contribute to various levels and severity of psychological pressure, which may lead to a feeling of loneliness and helplessness and may result in stress, anxiety, irritability, mental fatigue, and depression….that's why Covid-19 affecting mental health, 😞 ",
            "date": "Answered August 22, 2020",
            "views": "51",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kushal Sareen",
                    "user_href": "/profile/Kushal-Sareen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sana Shf",
                "href": "/profile/Sana-Shf"
            },
            "answer_text": "This is very unexpected situation,because we all are running one or other way of survival ,our busy schedules suddenly became motionless,we all are planning things counting on our hours but it turns out into an unpredictability .definitely we all face a situation with lots of questions like?what?how?when? With out any answers,,the uncertainty humiliates us But we have to move on,we are self sufficient,not alone ,we are going to survive together,heal each other,nothing is permanent this bad day going to end soon,again we will watch the beutiful rainbows,feel the snow,going to hold the wind soon,just wait few more days,,,nothing can broke us, we are going to prove how strong we are, ",
            "date": "Answered April 12, 2020",
            "views": "357",
            "upvotes": " Answer requested by Amy Potter",
            "upvoters": [
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                },
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Syed Hasan",
                "href": "/profile/Syed-Hasan-157"
            },
            "answer_text": "It has made the outside world a minefield and has restricted your movements and the necessities you need to buy. A lot of people have had panic attacks and anxieties. I am lucky that I can buy enough food for myself and to do home improvements for the next six weeks. I am thankful my mental health is in good shape and I have to keep safe and be patient. ",
            "date": "Updated April 30, 2020",
            "views": "167",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Zelda Finch",
                    "user_href": "/profile/Zelda-Finch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ronald Bobeck",
                "href": "/profile/Ronald-Bobeck"
            },
            "answer_text": "Okay as a Vietnam veteran, it is like waiting to roll outside of the wire to go into harms way. Really do not worry about dying. Your dead that's it . Unless your religious. It is getting injured and suffering for a long time . People look at me and think that I do not care , I guess when you have had to make peace of your death at 19 years old It changes you for sure. ",
            "date": "Answered May 5, 2020",
            "views": "244",
            "upvotes": " Answer requested by Amy Potter",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Whitlock",
                "href": "/profile/Mark-Whitlock-9"
            },
            "answer_text": "Isolation is worse for many of us if has been horrific can’t do much travel can’t go to coast stuck at home there is a wave of depression sweeping the world those who suffer with mental illness are experiencing lethargic lifestyle ",
            "date": "Answered August 17, 2020",
            "views": "43",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kushal Sareen",
                    "user_href": "/profile/Kushal-Sareen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Logan Casey",
                "href": "/profile/Logan-Casey-4"
            },
            "answer_text": "It's taking a toll on those isolated from loved ones, those who have lost their jobs, etc. Those living in constant fear. Domestic violence is up, depression is up, suicides are way up. So it's definitely having an affect. ",
            "date": "Answered August 1, 2020",
            "views": "327",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Betty Bever",
                    "user_href": "/profile/Betty-Bever"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Hufstutler",
                "href": "/profile/Alan-Hufstutler"
            },
            "answer_text": "It’s a virus. It didn’t, at least not in my world. I didn’t read the whole article, it’s just too poorly written to warrant the time investment. ",
            "date": "Answered July 16, 2020",
            "views": "122",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Bill Hazelton",
                    "user_href": "/profile/Bill-Hazelton-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Milton R Brown",
                "href": "/profile/Milton-R-Brown"
            },
            "answer_text": "Masks can filter air a bit and force mouth breathing to get oxygen needed. After some time of an hour or more the wearer notices some loss of cognitive thinking. In their car in about 10–15 minutes the problem is remedied and Retuned to. normal ",
            "date": "Answered July 28, 2020",
            "views": "14",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Signe Adam",
                "href": "/profile/Signe-Adam"
            },
            "answer_text": "Easy ! Because this pandemic is a HUGE stress. Stress exacerbates any weakness or flaw………..if a person is struggling with disturbing mental health symptoms, the added stress created by this pandemic makes it worse. Real life worries about income, safety, social contact, food supply, cleanliness could all have negative effects on anyone. ",
            "date": "Answered April 20, 2020",
            "views": "130",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Seybert",
                "href": "/profile/Bob-Seybert"
            },
            "answer_text": "From my perception we were failing mental health before Covid-19. Now it is much worse. We are losing the belief in the scientific way. Politics are very troublesome. ",
            "date": "Answered August 22, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Mccaffery",
                "href": "/profile/Michael-Mccaffery-7"
            },
            "answer_text": "Yup. Folks were not meant to be hermits. We are meant to form groups and read each others faces. But, until we get a vaccine, we need to practice voluntary silence, masks, distance, sunlight, windage, ventilation, sanitation and care for the other medical conditions. We are in this together until we find a way out. Which will happen! Be intelligent and don’t be obstinate. Go with the science as it is discovered. Stay rational as we build our intelligence to combat the flight or fight syndrome. ",
            "date": "Answered August 27, 2020",
            "views": "35",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abigail Mcgrath",
                "href": "/profile/Abigail-Mcgrath-9"
            },
            "answer_text": "For people who are social and do not like to be alone. the isolation is probably making them more likely to feel depressed. People who are accustomed to spending time with friends and family probably find it very lonely to have to be indoors. ",
            "date": "Answered June 11, 2020",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Norman Simenson",
                "href": "/profile/Norman-Simenson-1"
            },
            "answer_text": "Because if there is too little social interaction, we risk the effects of social isolation! “Hawkley points to evidence linking perceived social isolation with adverse health consequences including depression, poor sleep quality, impaired executive function, accelerated cognitive decline, poor cardiovascular function and impaired immunity at every stage of life.” See in The risks of social isolation See also Isolation Has Profoundly Creepy Effects on The Human Body And Brain and What Coronavirus Isolation Could Do to Your Mind (and Body) ",
            "date": "Updated April 30, 2020",
            "views": "141",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lori Gunn",
                "href": "/profile/Lori-Gunn-8"
            },
            "answer_text": "It hasn’t. In fact, I’m more at peace than before because i am fortunate enough to be able to work from home and still get paid. This has been a gift for me. I like many others needed time to do things around the house, read, clean up the yard and all of those little projects that i never got around to. ",
            "date": "Answered May 25, 2020",
            "views": "107",
            "upvotes": " Answer requested by Jay Harewood",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gina Hernandez",
                "href": "/profile/Gina-Hernandez-122"
            },
            "answer_text": "I personally don't really care. I'm not to worried about it. Whatever happens happens. You can't control it You don't know what tomorrow will bring. I could go outside and get killed by a bus crossing the street ",
            "date": "Answered August 1, 2020",
            "views": "275",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mehak Jain",
                    "user_href": "/profile/Mehak-Jain-122"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prakash Shenoy",
                "href": "/profile/Prakash-Shenoy-16"
            },
            "answer_text": "8.7.2020 Hello I am having bipolar disorder for last 45 years and I am stable without symptoms for last 10 years. During lockdown, in the first month I go5 busy with my hobby of DIY electronics projects. The days went quiet well. After a month the components got over. There after I started getting bored. After about 15 days I started feeling low and weak. I contacted my psychiatrist and she adjusted my med dose. There after I felt better. I am still feeling good. Have started listening to music. Reading and contributing to social media. Talking with friends on the phone,.etc. My office has also started working with work from home based that keeps me occupied. All the best ",
            "date": "Answered July 8, 2020",
            "views": "115",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Mary Huebner",
                "href": "/profile/Mary-Huebner-1"
            },
            "answer_text": "My children and grandchildren live in California. I haven’t seen any of them since Christmas when I used to see them 3–4 times a year. That’s the biggest effect. And I can’t do my normal volunteer work, teaching ESL, working for Unity Hospice and other activities. ",
            "date": "Answered September 20, 2020",
            "views": "9",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nicholas Darton",
                "href": "/profile/Nicholas-Darton-1"
            },
            "answer_text": "I dont think 19 effects the brain directly, but how we have been told to act (lockdown)has created a mental health problem, plus the complications of 19 may cause concern leading to mental health ",
            "date": "Answered October 18, 2020",
            "views": "21",
            "upvotes": " Answer requested by Miguel Paraz"
        },
        {
            "author_info": {
                "name": "Gunther Martens",
                "href": "/profile/Gunther-Martens-1"
            },
            "answer_text": "Covid -19 has no effects on the brain, its a sickness only of the body, lock down has effects on people,s mental health, just like being in prison etc, ",
            "date": "Answered August 25, 2020",
            "views": "23",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Alasdair Fairbairn",
                "href": "/profile/Alasdair-Fairbairn"
            },
            "answer_text": "Not mine; but I suspect it will have a considerable effect on many. My heart goes out to them. For me as an 84 year old vulnerable I will accept what happens grateful for the life I have had and hopeful that it doesn’t cause too much disruption for others. ",
            "date": "Answered April 4, 2020",
            "views": "107",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Jörg Sattler",
                "href": "/profile/Jörg-Sattler-1"
            },
            "answer_text": "Not at all. I am still as crazy as i was when i was born 75 years ago. ",
            "date": "Answered May 12, 2020",
            "views": "187",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Macenzie Buddenhagen",
                "href": "/profile/Macenzie-Buddenhagen"
            },
            "answer_text": "It's teaching people to distance themselves from others and to not socialize as much. Humans need socialization and covid is teaching everyone how to be afraid to interact or communicate. ",
            "date": "Answered August 3, 2020",
            "views": "138",
            "upvotes": " Answer requested by Miguel Paraz"
        },
        {
            "author_info": {
                "name": "Miguel Paraz",
                "href": "/profile/Miguel-Paraz"
            },
            "answer_text": "This is a sad one - health care workers are affected. ‘I Couldn’t Do Anything’: The Virus and an E.R. Doctor’s Suicide ",
            "date": "Answered July 11, 2020",
            "views": "56",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Jannie Pressley",
                "href": "/profile/Jannie-Pressley"
            },
            "answer_text": "Amy, I know who I am , what I am, and how I am. I have never been afraid to be alone… maybe because I was the oldest child of many siblings. I have many learned skills to make or do, plus, there are neighbors, family and Internet! My mental health is excellent and I am able to accept that in times like these, people can become depressed, but, I understand the reason it may occur and move on to something I enjoy doing. I also go out when I want; distancing of course. ",
            "date": "Answered May 5, 2020",
            "views": "268",
            "upvotes": " Answer requested by Amy Potter"
        },
        {
            "author_info": {
                "name": "John Drake",
                "href": "/profile/John-Drake-126"
            },
            "answer_text": "Its the unconstitutional lock downs/quarantines that are causing all the problems, more people have died from it than the virus. ",
            "date": "Answered September 18, 2020",
            "views": "21",
            "upvotes": " Answer requested by Miguel Paraz"
        },
        {
            "author_info": {
                "name": "Brian Kirkpatrick",
                "href": "/profile/Brian-Kirkpatrick-26"
            },
            "answer_text": "Adversely. ",
            "date": "Answered August 1, 2020",
            "views": "45",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Gerry Roberts",
                "href": "/profile/Gerry-Roberts-15"
            },
            "answer_text": "Elementary, dear Watson, use your computer/tablet and Google it. This isn’t the forum to give a teaching lesson in microbiology. ",
            "date": "Answered July 16, 2020",
            "views": "132",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Daniel Reichert Sr.",
                "href": "/profile/Daniel-Reichert-Sr"
            },
            "answer_text": "I’m a little tense and nervous but I’m in control of my domain. It’s annoyingly frustrating watching Bill Gates propagate his vaccination serum “without any medical training “ like he invented it. He’d be the parking lot attendant without the shoulders he used to stand upon to get where he is.TY4TQ ",
            "date": "Updated April 20, 2020",
            "views": "274",
            "upvotes": " Answer requested by Virginia Grant"
        },
        {
            "author_info": {
                "name": "Rebecca Hockenhull",
                "href": "/profile/Rebecca-Hockenhull-1"
            },
            "answer_text": "It's magnifying things by feeding off of depression, anxiety and psychosis and causing chaos there in. ",
            "date": "Answered October 17, 2020",
            "views": "9",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Eric Fields",
                "href": "/profile/Eric-Fields-62"
            },
            "answer_text": "Fortunately, not much. I am fortunate. I have a great marriage and my pets keep me amused on a daily basis. Most importantly, I have used this time to start a project I have always wanted to do but never had the time for which is writing a book. I am quite passionate about this project and it keep me very busy and excited to get to work on it every day. Also, I am still seeing patients, mostly online, and this also makes me feel very useful. ",
            "date": "Answered May 5, 2020",
            "views": "164",
            "upvotes": " Answer requested by Amy Potter"
        },
        {
            "author_info": {
                "name": "Sanjeev Jain",
                "href": "/profile/Sanjeev-Jain-98"
            },
            "answer_text": "I am healer and I help people by healing them in their various issues. The only change happened is that now I have started treating corona patient also. Thank you ",
            "date": "Answered July 8, 2020",
            "views": "90",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Lucas Jerzy Portela",
                "href": "/profile/Lucas-Jerzy-Portela"
            },
            "answer_text": "The desires, wishes, and projects of billions of people being put in suspension for indefinite period, and their most mild eroticism like hugging or shaking hands being forbidden - why should they, we, stay mentally healthy and sane with all that…?! ",
            "date": "Answered April 21, 2020",
            "views": "131",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Marcus Lester",
                "href": "/profile/Marcus-Lester-2"
            },
            "answer_text": "I’m fine. Having my usual efforts at spring maintenance, remodeling a house for sale, making things in the shop. I’m as busy in retirement as I’ve ever been. And I save a lot of money on gas by not going to town unless it’s really necessary. ",
            "date": "Answered April 3, 2020",
            "views": "57",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Mason Kelsey",
                "href": "/profile/Mason-Kelsey-4"
            },
            "answer_text": "Most people have been forced to confront their fears and ignorance and most have reacted in a negative manner. ",
            "date": "Answered August 1, 2020",
            "views": "31",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Drew Swindells",
                "href": "/profile/Drew-Swindells"
            },
            "answer_text": "it puts a strain on people by upsetting their routine and loneliness too. leats to anxiety and depression ",
            "date": "Answered August 17, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Alan Carter",
                "href": "/profile/Alan-Carter-3"
            },
            "answer_text": "Stress for sure. My biggest concern is denial. Have more people than I’d like state this is overblown and they are going to continue as usual. End of the day, washing your hands and not touching your face is be best I have to offer for yourself and the rest of us. ",
            "date": "Answered March 12, 2020",
            "views": "177",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "D Tassone",
                "href": "/profile/D-Tassone"
            },
            "answer_text": "Is the question a generality or is it ment to be directed at people that have a mental illness in either case the simple answer is what is your mental state to begin with, it can Caz anxiety on many different levels depression, insecurity the list goes on ",
            "date": "Answered August 1, 2020",
            "views": "93",
            "upvotes": " Answer requested by Miguel Paraz"
        },
        {
            "author_info": {
                "name": "Bruce Harper",
                "href": "/profile/Bruce-Harper-30"
            },
            "answer_text": "Yes. There’s been a big increase in mental health admissions. ",
            "date": "Answered August 1, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Thomas Burns",
                "href": "/profile/Thomas-Burns-131"
            },
            "answer_text": "Very badly as resources are aimed at the virus ",
            "date": "Answered July 30, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Guido Colacci",
                "href": "/profile/Guido-Colacci"
            },
            "answer_text": "Makes me sadder and more fatigued than normal. ",
            "date": "Answered July 30, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Wesley Warren",
                "href": "/profile/Wesley-Warren-16"
            },
            "answer_text": "I have more ambition and hope for the future than I have in fifty years. The bloody century long oil war is officially over. ",
            "date": "Answered April 13, 2020",
            "views": "151",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Derrick Iozzio",
                "href": "/profile/Derrick-Iozzio"
            },
            "answer_text": "Pandemic presents many different emotions and behaviors. It could be the statistics (as reported in the news), the uncertainty surrounding the crisis, other people’s reactions to it- a myriad of things come into play. To offset this, use only factual information, take care of yourself, practice mental health first aid. ",
            "date": "Answered April 21, 2020",
            "views": "126",
            "upvotes": " Answer requested by Emma Blackburn"
        },
        {
            "author_info": {
                "name": "Peter Larsen",
                "href": "/profile/Peter-Larsen-112"
            },
            "answer_text": "It hasn’t. I follow the pandemic situation quite closely, listen to the advice of the experts, listen to protective measures outlined by the authorities, and use common sense. ",
            "date": "Answered April 8, 2020",
            "views": "123",
            "upvotes": " Answer requested by Amy Potter"
        },
        {
            "author_info": {
                "name": "Edward Yetemian",
                "href": "/profile/Edward-Yetemian"
            },
            "answer_text": "Being afraid to go out as I used before the virus ,thinking about my family a lot more ,by being home I miss many places I used to go ,and the fresh air outside ,afraid to eat the delicious food now because I don’t trust the restaurants I used to trust. Love to travel but now I can’t because of the virus. ",
            "date": "Answered May 6, 2020",
            "views": "72",
            "upvotes": " Answer requested by Amy Potter"
        },
        {
            "author_info": {
                "name": "Maria Pugliese",
                "href": "/profile/Maria-Pugliese-5"
            },
            "answer_text": "I am being very non-productive. I thought I would have a lot of time to work around the house but I feel very unmotivated. I sleep, play video games, watch TV, and go on Quora. The whole situation is historic and depressing. ",
            "date": "Answered April 7, 2020",
            "views": "118",
            "upvotes": " Answer requested by Busari Arundhati"
        },
        {
            "author_info": {
                "name": "Ellen Micheletti",
                "href": "/profile/Ellen-Micheletti"
            },
            "answer_text": "I’m an introvert by nature and am pretty happy by myself, but I do like to meet and talk. All this forced isolation can sometimes get to me especially when the weather is dreary and rainy. It doesn’t help that I am not in the least bit afraid to get out and go walking or to the store and all my friends and acquaintances are all scared out of their shoes. But I remain hopeful and optimistic. It helped that I was finally able to go to Mass and Communion today for the first time in two months. ",
            "date": "Answered May 20, 2020",
            "views": "74",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Savannah Hayl",
                "href": "/profile/Savannah-Hayl"
            },
            "answer_text": "Like most people, it’s been pretty shitty. I could go on to name specifics but I think shitty is the best way to put it. H ",
            "date": "Answered June 15, 2020",
            "views": "32",
            "upvotes": " Answer requested by Jay Harewood"
        },
        {
            "author_info": {
                "name": "John Tan",
                "href": "/profile/John-Tan-592"
            },
            "answer_text": "Probably would be worst than we expected COVID-19: Severe brain damage possible even with mild symptoms | DW | 09.07.2020 ",
            "date": "Answered August 22, 2020",
            "views": "24",
            "upvotes": " Answer requested by Miguel Paraz"
        },
        {
            "author_info": {
                "name": "Bo Thompson",
                "href": "/profile/Bo-Thompson-6"
            },
            "answer_text": "Meh, they’ve been threatening to release the diseases for a while now. No coincidence HIV was released when Reagan was elected. ",
            "date": "Answered April 18, 2020",
            "views": "140",
            "upvotes": " Answer requested by Virginia Grant"
        },
        {
            "author_info": {
                "name": "Margaret Atherton",
                "href": "/profile/Margaret-Atherton-3"
            },
            "answer_text": "At the moment i am fine, as its only been about three weeks isolation in u.k. I have kept busy and fortunately we do have a garden which is a god send with the lovely spring weather we are having. Now ask me in six months time (which at the moment is the length we have been given to isolate which includes no shopping, or leaving the property at all) and the story will probably be very different. ",
            "date": "Answered April 7, 2020",
            "views": "138",
            "upvotes": " Answer requested by Amy Potter"
        },
        {
            "author_info": {
                "name": "John Talbot",
                "href": "/profile/John-Talbot-21"
            },
            "answer_text": "A2A. I am very fortunate I have a house with a garden - so I can go outside and I have worked in solitude from home for the last 20 years. Isolation makes zero difference to me, it is my preferred state. I feel very concerned for people who live in blocks of flats (apartments) they must be having a terrible time, especially those with small children and babies. ",
            "date": "Answered April 10, 2020",
            "views": "161",
            "upvotes": " Answer requested by Amy Potter"
        },
        {
            "author_info": {
                "name": "Shiv Kumar",
                "href": "/profile/Shiv-Kumar-3077"
            },
            "answer_text": "Greetings For the answer go to international webinar and Global Lecture Series videos posted on YouTube channel@topperstouch Shiv ",
            "date": "Answered August 1, 2020",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Luesley",
                "href": "/profile/David-Luesley"
            },
            "answer_text": "Depression. Always been prone to it. The change in my daily routine. I'll get over it. One foot in front of the other. ",
            "date": "Answered May 6, 2020",
            "views": "129",
            "upvotes": " Answer requested by Amy Potter"
        },
        {
            "author_info": {
                "name": "Bill Brown",
                "href": "/profile/Bill-Brown-155"
            },
            "answer_text": "I’ve noticed people are ““sharper tongued” than usual, quicker to “fly off the handle”! Of course this may be a manifestation of the example set by Trump, on TV. ",
            "date": "Answered August 1, 2020",
            "views": "481",
            "upvotes": " Answer requested by Miguel Paraz"
        },
        {
            "author_info": {
                "name": "Richard Goubeaux",
                "href": "/profile/Richard-Goubeaux"
            },
            "answer_text": "see… Akanksha Sharma’s answer above. ",
            "date": "Answered May 4, 2020",
            "views": "99",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Droege",
                "href": "/profile/Robert-Droege"
            },
            "answer_text": "Not for me. ",
            "date": "Answered April 1, 2020",
            "views": "133",
            "upvotes": " Answer requested by Amy Potter"
        }
    ]
}