{
    "title": "How should I start my preparation for NDA if I am a class 12 student? - Quora",
    "tags": [
        "NDA Preparation",
        "Preparations",
        "National Defence Academy (NDA)",
        "Class 12th in India",
        "Academic and Educational Advice",
        "Exam and Test Preparation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paras Verma",
                "href": "/profile/Paras-Verma-11"
            },
            "answer_text": "Thanks for A2A. NDA exam comprises of two tests -1) Mathematics - 300 marks2) General Ability Test - 600 marks But you need to qualify both tests simultaneously (score atleast 30% marks in each) in order to qualify the exam.So, it is compulsory to qualify both the papers.  First of all, talking about the MATHS Paper, it is not very very tough paper. It is an average exam if you have prepared well. But the main problem is the time. You have to do 120 questions in 150 minutes which is quite difficult keeping in mind the difficulty level of the questions. So you should never go for \"tukka baazi\" in maths exam. About 70-80 questions are enough to score good in maths but try to do maximum questions as this will help you come in merit list after you clear your interview.So you should prepare for your maths exam properly. Cover all the important topics from class 11 & 12th ncert textbooks like sets, relations and functions, trigonometry, inverse trigonometry, permutations and combinations, binomial theorem, limits, derivatives, integration, complex numbers, sequences and series, probability, 2d and 3d geometry, matrices and determinants,statistics,probability, etc. You should remember some shortcuts in order to save your time as time is the biggest hinderance to qualify maths exam. ARIHANT'S PATHFINDER is a good book for preparing for mathematics as it covers many shortcuts as well which will save your time during the exam. Now coming to the GAT Paper, you should be well aware of the History of India, Politics and the Constitution of India , India's climate and geography etc.You should be well aware of whats happening in India and the world at time. One of the most scoring part in gat paper is the english section, so improve your vocabulary and this will surely help you. Eng section carries 200 marks and you should try to score maximum in this section. Rest of paper carries history, geography, politics, biology, chemistry, physics, current affairs related questions. But Chemistry, Physics and Biology will be easy if you are well aware of its basics and CBSE class 11 and 12th syllabus. So start preparing for your NDA exam at the earliest. All the best !! ",
            "date": "Answered April 4, 2016",
            "views": "21",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Unni K Pillai",
                    "user_href": "/profile/Unni-K-Pillai"
                },
                {
                    "user_id": "Shreyas Vajratkar",
                    "user_href": "/profile/Shreyas-Vajratkar"
                },
                {
                    "user_id": "Dikshant Sharma",
                    "user_href": "/profile/Dikshant-Sharma-164"
                },
                {
                    "user_id": "Ramkumar Dagur",
                    "user_href": "/profile/Ramkumar-Dagur"
                },
                {
                    "user_id": "Piyush Rai",
                    "user_href": "/profile/Piyush-Rai-99"
                },
                {
                    "user_id": "Abhishek Thakur",
                    "user_href": "/profile/Abhishek-Thakur-842"
                },
                {
                    "user_id": "Sanjay Awati",
                    "user_href": "/profile/Sanjay-Awati-3"
                },
                {
                    "user_id": "Robin Romiyo",
                    "user_href": "/profile/Robin-Romiyo"
                },
                {
                    "user_id": "Pruthiraj Patra",
                    "user_href": "/profile/Pruthiraj-Patra"
                },
                {
                    "user_id": "Kiran Muragodnavar",
                    "user_href": "/profile/Kiran-Muragodnavar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kamal Singh Bhati",
                "href": "/profile/Kamal-Singh-Bhati-2"
            },
            "answer_text": "NDA Exam Preparation Tips A common query among all the aspirants preparing for this exam is, ‘How should I start my NDA exam preparation?’. To answer this question, here are some important expert tips on how to prepare for the NDA exam. For better understanding, we have divided the study plan of the NDA exam in 4 different phases, which will help you prepare better and track your progress accordingly. Phase I of the NDA & NA Preparation This is the starting phase of your NDA & NA exam preparation and during this phase, you need to familiarize with the NDA & NA exam inside out. This would include gathering information about the pattern, syllabus, cutoff, study material, reference sources etc. Here are some point-wise guidelines of the NDA study plan, to be followed by the candidates for the National Defense Academy & Naval Academy exam: 1. Know the syllabus The NDA & NA (II) Paper will broadly be divided into two parts:(a) Paper I – Mathematics(b) Paper II – General Ability (Part A: English & Part B: General Knowledge)You can go through the syllabus of NDA & NA exam for more details! 2. Know the pattern of exam We have already shared the exam pattern of the NDA & NA exam. Make sure that you go through it for an overall understanding of the exam structure. Phase II of the NDA & NA Preparation: Prepare notes & Practice Topics thoroughly This is the main and the most important phase of your NDA preparation. Start studying the topics in depth and practice questions based on them regularly. Here are a few tips for this phase of the NDA & NA study plan: After the candidates get an understanding of the syllabus, they must collect books that are easy to comprehend by them and start making notes.The candidates can also take help from other sources such as e-books, online tutorials, online groups, blogs, social networking sites, newsletter, etc.The notes need not follow any pattern as long as the candidate is comfortable with reading and understanding them.(A) NDA Study Plan for Mathematics section: Mathematics is considered as a scoring section and a deep understanding is preferred over last-minute reading.When it comes to mathematics, remembering shortcuts, applying mental arithmetic, memorizing simple calculations, etc. will help save time and space.The weightage of each topic is different. Hence, a candidate must know which topic should be given more preference. For instance, the weightage of mensuration and trigonometry is more. This is followed by statistics. Hence, the candidate should have a rough analysis of the weightage given to each chapter so that he can accordingly prioritize topics and manage time.Devote at least 2-3 hours per day for the preparation of Mathematics section of the NDA exam. Remember, you have already studied the topics from which the questions will be asked from 9th -1 12th You just need to brush up those topics and practice them thoroughly.(B) NDA Study Plan for English Section: When it comes to English, the general pattern has synonyms, antonyms, reading comprehension, spotting the errors, para jumbles, ordering of sentences, fill in the blanks with appropriate words, etc.Preparation for these topics warrants the need of a planned approach. Getting a grip on grammar is imperative, and for this reason, books like “Word Power Made Easy” by Norman Lewis come in handy.Apart from studying English grammar books, regular reading of the newspapers, and watching English news channels will ensure that the candidate has enough exposure to ensure proper command over the language.Make sure that you spend at least 1.5-2 hours regularly to prepare the English section.(C) NDA Study Plan for General Knowledge section: This section consists of physics, chemistry, general science, history, geography, and current events.To tackle the science part of this section, the candidate must clear his basics of science by using any generic science book.When it comes to geography, physical features of India – mountains, plateaus, deltas, rivers, estuaries, etc. need to be thoroughly understood. Country and state boundaries should also be focused on.Indian polity is another topic that is to be comprehended in depth.The candidate should also learn about various economic terms and reforms, 5-year plans, NITI Aayog, census, schemes such as Pradhan Mantri Jan Dhan Yojana (PMJDY), Pradhan Mantri Ujjwala Yojana (PMUY), etc.Ancient, medieval and modern history makes up for an interesting read and can be understood easily by the candidates.For current affairs, especially those that have occurred in the past few months, the candidate must use all possible resources, such as magazines, internet, television, newspaper, newsletter, blogs, social networking sites, etc.The candidate should prepare pointwise notes on major economic or budget-related news, news related to new inventions in science and technology, sports, currencies, stock markets, books and authors, awards and honors, abbreviations, major/national holidays, important days, government reforms and schemes, organizations (both national and international, such as the United Nations, Amnesty International, World Bank, International Labor Organization, etc.). These notes should be brief enough for quick revisions yet informative enough to ensure a clear understanding.The syllabus of this section is huge and hence, candidates need to ensure that they maintain a proper balance between the different sub-topics of this section, for their timely preparation and revision.Candidates can follow the under-mentioned day-wise preparation plan of for the NDA exam to cover all the topics properly: Phase-III of the NDA & NA Preparation: Solve previous years’ question papers & Mock/ Sample tests Once the candidates feel that they are prepared enough, they must refer to previous years’ question papers of the NDA/NA examination to find where they lack and focus on those topics again.Online mock papers are available in abundance and solving them is the best way to get an idea of the plausible type of questions, marks distribution, and importance of each topic.The candidate can purchase books that have a collection of previous years’ question papers or refer to online portals.The candidate can also join study groups or study circles to meet other candidates and discuss question papers and solutions.In this manner, the candidates can get help from others on topics that they find difficult to comprehend while helping others understand topics that they find easy.Phase-IV of the NDA & NA Preparation: Last minute revision guidelines Last minute revision is useful but can prove to be tricky unless the candidate knows what to revise. Here, short notes come in handy.The candidate must go through all mathematics formulae and tricks. These formulae should be written topic wise to ensure that they are easy to recollect while revising.The squares and cubes must be brushed up again. Bullet points brushing over important points from physics, chemistry, general science, history, geography, and current events should be written as quick notes for easy reference.AT LAST ALL THE BEST",
            "date": "Answered July 6, 2019",
            "views": "447",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bhagyashree Bhargavi",
                    "user_href": "/profile/Bhagyashree-Bhargavi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harshit Tripathi",
                "href": "/profile/Harshit-Tripathi-215"
            },
            "answer_text": "NDA exam is not very difficult you can easily crack it . Cracking NDA exam is depends upon your hard work ,dedication and guidance. Below some tips to prepare for exam is given you may use them NDA Preparation Tips For Paper 1 – Mathematics This test will cover topics like Integral Calculus, Differential Equations, Trigonometry, Algebra, Vector Algebra, Matrices and Determinants, Analytical Geometry, Statistics & Probability. To prepare for this section, the first and foremost requirement is to have clarity in concepts. The questions will test your basic understanding of the concepts. Go back to the basics if concepts are not clear and try to solve as many sums as possible. For this paper, you will also have to learn time management , wherein you solve all the questions within the stipulated time. Ideally, there would be 200 questions to be solved within 120 minutes, so you will have to practice to come up with the answers in less than a minute. Here, emphasizing on mental mathematics may be a good idea where you learn to solve the questions mentally most of the time. NDA Preparation Tips For Paper 2 – General Ability Part A: English The English test is for 200 marks and covers topics like vocabulary, grammar and usage and comprehension. This test evaluates the basic command a person has on the language. To prepare for this Read an English newspaper dailyLearn new words – Expand your vocabularyGo back to basic grammar and learn the rules thoroughlyRead an English newspaper daily, learn new words, go back to basic grammar and learn the rules thoroughly.Part B: General Knowledge The GK test is for 400 marks and will check a candidate’s general understanding and his insight into the Current Affairs within the country, and outside. The test will comprise six sections: General Science, Indian history, Physics, Geography, Chemistry and Current Events. To prepare for this test Follow the news updates regularlyBe aware of the latest happenings in the field of sports, arts, literature etc.Read about the current economic scenario in the country, the recent and past policy changes and such other topics that are directly related to India and its neighbouring countries.Follow the news updates regularly, be aware of the latest happenings in the field of sports, arts, literature, and the like. Read about the current economic scenario in the country, the recent and past policy changes and such other topics that are directly related to India and its neighbouring countries. ",
            "date": "Answered August 9, 2020",
            "views": "91",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paramjeet Singh",
                "href": "/profile/Paramjeet-Singh-1450"
            },
            "answer_text": "For MATHS ONLY Do Class 11th and Class 12th Maths Do TRIGONOMETRY,PROBABILITY,STATISTICS,ARITHMETIC AND GEOMETRIC PROGRESSION,VECTORS,MATRICES AND DETERMINANTS These topics will Cover Almost 90 Questions and By Studying These Chapters you Can Easily do 60 Questions For ENGLISH Do Basics of Grammar like PREPOSITION,ARTICLES,ADVERVSAND SYNONYMS,ANTONYMS By Studying These Chapters You Can Easily do 30–35 Questions For SCIENCE JUST DO Basics Concepts for PHYSICS,CHEMISTRY AND BIOLOGYJUST READ TILL CLASS 10TH and do Only Basics of Class 11th and Class 12th For SOCIAL STUDIES 1.HISTORY-MAINLY FOCUS ON TRAVELL Continue Reading",
            "date": "Answered April 1, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Black Demo",
                "href": "/profile/Black-Demo-1"
            },
            "answer_text": "1)If you prepare without coaching:Buy Dr. R.S. Agarwal's mathematics for NDA and NA (to prepare for maths) and Arihant's Path Finder (for remaining subjects). Though Path Finder has mathematics portion as well, I recommend that you practice mathematics from R.S. Agarwal. Devot your weekends to preparation for NDA.  2)If you opt for coaching:*they tell you everything there* I would suggest that you prepare without coaching and if you are not able make it in the first attempt then opt for coaching for your next attempt. ",
            "date": "Answered April 3, 2016",
            "views": "774",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Robin Romiyo",
                    "user_href": "/profile/Robin-Romiyo"
                },
                {
                    "user_id": "Sushila Duhan",
                    "user_href": "/profile/Sushila-Duhan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shailesh Tiwari",
                "href": "/profile/Shailesh-Tiwari-120"
            },
            "answer_text": "First of i would love to say u that written exam of NDA is quiet EASY.. U will find it easy if u have prepared GS portion of the syllabus…. Maths questions are very easy and u can easily do about 70 out of 120 questions.. Which is far greater than the qualifying marks… For ENGLISH— it is also an easy part of xam n u will find it easy too if u have a normal level of grammar knowledge… . For reference…study ‘PATHFINDER’ by arihant.. It is sufficient. . . BEST OF LUCK. ",
            "date": "Answered March 31, 2019",
            "views": "185",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shiv Prabhat Aaryan",
                    "user_href": "/profile/Shiv-Prabhat-Aaryan"
                },
                {
                    "user_id": "Saurabh Mishra",
                    "user_href": "/profile/Saurabh-Mishra-1395"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akhil Kumar Singh",
                "href": "/profile/Akhil-Kumar-Singh-7"
            },
            "answer_text": "Buy some good book for NDA..  This book is good you will definitely crack NDA enrtrance by this book. Thank u Plzzz upvote ",
            "date": "Updated March 4, 2018",
            "views": "222",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shiv Prabhat Aaryan",
                    "user_href": "/profile/Shiv-Prabhat-Aaryan"
                },
                {
                    "user_id": "Abhishek Natu",
                    "user_href": "/profile/Abhishek-Natu-2"
                },
                {
                    "user_id": "Partha Pratim Das",
                    "user_href": "/profile/Partha-Pratim-Das-102"
                },
                {
                    "user_id": "Jay Vardhan Singh Chouhan",
                    "user_href": "/profile/Jay-Vardhan-Singh-Chouhan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alok Yadav",
                "href": "/profile/Alok-Yadav-435"
            },
            "answer_text": "For qualifying NDA you just have to use a book named as PATHFINDER with the help of thia book you can qualify entrance But but man if you are really awesome then and only then you can qualify interview that's really to tough ",
            "date": "Answered March 4, 2018",
            "views": "103",
            "upvotes": " Answer requested by Rudraksh Saklani",
            "upvoters": [
                {
                    "user_id": "Rajesh Patil",
                    "user_href": "/profile/Rajesh-Patil-11"
                },
                {
                    "user_id": "Siddharth Sinare",
                    "user_href": "/profile/Siddharth-Sinare"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aakash Sharma",
                "href": "/profile/Aakash-Sharma-603"
            },
            "answer_text": "The NDA syllabus is actually very similar in content to Class 12 syllabus. Just follow the NCERTs well and try and solve as many objective questions across all subjects. Students who are not very proficient in Maths and English should put special emphasis on objective type preparation for these topics. For more information refer to www.pscprep.com ",
            "date": "Answered November 2, 2017",
            "views": "145",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paddy",
                "href": "/profile/Paddy-60"
            },
            "answer_text": "Yeah, absolutely. It's better to do it because if you clear everything including SSB and medicals then you'll be in NDA just after completing 12th. ",
            "date": "Answered August 14, 2017",
            "views": "153",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ramkumar Dagur",
                    "user_href": "/profile/Ramkumar-Dagur"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aviral Chandan",
                "href": "/profile/Aviral-Chandan"
            },
            "answer_text": "Well Do ncert of class 11 and 12 thoroughly, practice english and read geography of class 10 And yes if you can ,you can read some gk too. Maths will be the key to cut off. Leave history it is very very tough! Cheers! ",
            "date": "Answered December 28, 2018",
            "views": "122",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Pritam Dahal",
                "href": "/profile/Pritam-Dahal"
            },
            "answer_text": "A2A.Check my answer to this question Pritam Dahal's answer to What is the best way to crack NDA 2 written exam while appearing in 12th? ",
            "date": "Answered April 1, 2016",
            "views": "522",
            "upvotes": " Answer requested by Anshul Solanki"
        },
        {
            "author_info": {
                "name": "Jai G Sharma",
                "href": "/profile/Jai-G-Sharma"
            },
            "answer_text": "You Should Start With Basic Preparation Like Regular Practices Of Math And Science of Class 6 to 12 and English Grammar. ",
            "date": "Answered August 1, 2020",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prateek Singh",
                "href": "/profile/Prateek-Singh-853"
            },
            "answer_text": "You can prepare both …. In nda questions are from 11 and 12 maths, general English, and genral news and science. So if you study for 12 your half of the preparation is done.. only you have to do the second half. All the best ",
            "date": "Answered November 5, 2017",
            "views": "97",
            "upvotes": "0"
        }
    ]
}