{
    "title": "How to get students to take their grades seriously - Quora",
    "tags": [
        "Grade Point Average and Graduate School Admissions",
        "Grades (education)",
        "Grade Point Averages",
        "Graduate School Admissions",
        "Teaching"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Kruger",
                "href": "/profile/Peter-Kruger"
            },
            "answer_text": "I am actually going to disagree with both of the other answers.  I think it's very possible to get students to take grades seriously.  The trick is that they have to mean something to them.  The way we usually do grading is completely meaningless to them, and frankly more than a bit arbitrary.  60% means what, exactly?  And why does it constitute passing most of the time?   My students get four marks: mastery, proficiency, basic, and re-do.   I don't grade them on individual assignments so much as I used to, or at least not in the sense of \"This worksheet is worth ten points towards your final grade.\"  I started going to a standards-based grading system, which was really weird for my kids at first, but once they got the hang of it, it got a lot easier for them.   Instead of fifteen assignments in the gradebook with point totals, I have assignments that are literally the standards I am expected to cover in the units.  I use a Google Sheet with the standards on it formatted to do some fancy trickery as students add in evidence that they are mastering those standards. Those sheets are individually shared with Doctopus, and the kids and I mutually work on them. They edit them with evidence, and I edit them with revised marks. Under each of the progress monitoring sheets, the students have some assignments that are mandatory and can't get out of, like certain papers.  Other things that are sort of busywork they can either do or propose an alternative assignment that they run by me, but either way, they have to show me evidence that they are meeting the standards.  When they have evidence, they email me and have me take a look.  If I like what I see, I change their color codes and proficiency status.   Mastery gets you 100% or A, Proficiency is 90%, or B+ on our grading scale, Basic is a 70%, or D+ on our scale, and if they get less than that, they just have to re-do the assignment.  I don't accept failure.  If they never bother to do or redo the assignment, it just becomes a 0 and they can't reach proficiency in the standard.  If they don't reach proficiency in the standard, they get an incomplete for the course until they do. If they don't clear up an incomplete in the first 15 days of the next term, it's an F.   All of my standard categories and almost all of my assignments have rubrics with descriptors of what mastery looks like, so there is no wiggle room for them to say, \"Well, I think it's mastery.\"  That's nice.  Mr. K doesn't agree. I piloted it with a one-section class last year for one unit, and it was really quite magical.  The students actually took the whole thing seriously, and finally understood what the grades meant.  They could see what assignments were available for them to complete standards, and they could see in real-time how we were getting there.  It was a crazy amount of prep work, as I had to have the entire unit laid out beforehand.  I could't just make up work on the fly.  But, it also gave them the flexibility to add their own evidence if they did crappy on a quiz or worksheet and gave them multiple ways to demonstrate mastery.  In the end, everyone was much happier about the whole thing.   They were really excited about the idea that they didn't have to do stupid busywork that they didn't like if they could come up with a better idea.  I was happy not having to grade 25 plug and play worksheets done crappily fifteen minutes before class.  It took away the excuse of late work.  It did mean a bit of a rush at the end of the unit, but the advanced kids got their work out of the way right away, so it all kind of balanced out.  It did mean I couldn't grade on autopilot anymore, and did keep me on my toes.  In the end, I would say it was probably about as much work as before, but with much better results.   It was a little confusing to explain to parents and administrators, but the system works, and most importantly: my students understood what we were doing, why, and I knew for absolute sure that they had reached proficiency in the standards and were prepared to move on to the next level. ",
            "date": "Answered July 16, 2014",
            "views": "820",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Madhav Narayan",
                    "user_href": "/profile/Madhav-Narayan"
                },
                {
                    "user_id": "George Melcer",
                    "user_href": "/profile/George-Melcer"
                },
                {
                    "user_id": "Kamalakkannan Ravi",
                    "user_href": "/profile/Kamalakkannan-Ravi"
                },
                {
                    "user_id": "Kate Lambert",
                    "user_href": "/profile/Kate-Lambert-3"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Calais-Reno"
                },
                {
                    "user_id": "Sandeep Venkataram",
                    "user_href": "/profile/Sandeep-Venkataram"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Colagioia",
                "href": "/profile/John-Colagioia"
            },
            "answer_text": "Don't. I realize that this is unpopular, but grades are--largely--a recurring indicator of precisely how disappointed in yourself that you're supposed to be.  Whether or not you mean them that way (and obviously, no instructor seriously does), that's the way they're taken.  It's an abstraction of deficiency that doesn't have the decency to explain what is deficient. No student with an intelligence is going to take that seriously.  Or, rather, the people who take it seriously take it far too seriously and don't need to, because they're really good at what they do.  It's shameful what those kids are allowed to go through. Get the students to care about the subject matter.  That's what they're there for, not to earn anybody's approval.  And the former generally takes care of the latter. ",
            "date": "Answered July 16, 2014",
            "views": "215",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ugnius Kerulis",
                    "user_href": "/profile/Ugnius-Kerulis"
                }
            ]
        }
    ]
}