{
    "title": "How to know if a degree from a university is fake - Quora",
    "tags": [
        "Fake University",
        "Fake Diplomas and Degrees",
        "Higher Education",
        "Colleges and Universities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhishek Mitra",
                "href": "/profile/Abhishek-Mitra-172"
            },
            "answer_text": "As students, you must know how to spot bogus degrees from real ones if you want to truly have a bright future! Fake degrees from diploma mills have certain telltale signs that can help you distinguish them from the real ones. These are the signs you should keep an eye out for. Google the name of the universityIt’s quite easy to believe that the diploma mill concerned is not actually a diploma mill but a real institution because of the name it has. Most mills make sure that they have names that sound genuine and try to imitate the names of real universities as closely as possible in this regard. So to know if the university you are applying to is fake or real, you need to Google the name and scan through the results. If Google doesn’t show up verifiable results, you know it’s fake. Look up the addressWell, some diploma mills are so good at doing what they do that Googling them may actually show up search results that can convince you that the place is authentic. However, to be absolutely sure that it is a real educational institution rather than a fake, you should look up the address on Google Street View. There are high chances that the given address may show results of a coffee shop or a residential building when you check it on Street View. Check the seal on the degreeEvery degree has an embossed seal on it; at least all the real ones do for sure. If you see that the degree you’re getting from the concerned institution does not have a seal, you should treat it as a red signal and lodge a complaint stating you have been duped. That said, there are tricksters out there who will go as far as to even put an authentic looking seal on their degrees so that you can’t possibly know if they are real or not. In that case, you should scan the degree for other signs and then make your decision. Examine the signatureThe next thing you need to take a look at are the signatures on the degree certificate. If they are not in ink, and appear as if they have been digitally printed, you can safely assume that the degree is fake. Real degrees are individually signed by the members of the faculty of the educational institution concerned. Moreover, real signatures will not end abruptly, and you will be able to see their trail on a real degree. Scout for spelling errorsThis one is such an obvious mistake that most diploma mills make that you can almost wonder how they are still in business! If you observe carefully, you will find some very obvious spelling mistakes in your diploma certificate. If you’re not so sure about the spelling of certain words yourself, run the soft copy of the certificate through an online spell checker to be sure. Search for watermarksThese may be slightly harder to detect than any of the other signs we have mentioned so far, but the good thing is that you can use them as a stamp of authenticity as diploma mills will not be able to fake this. To look for a watermark, or a hologram, you will have to hold your degree up in very bright light and check for their reflection. In case you don’t find one, you can deem the degree as fake. “The authenticity of a university can also be determined using the Department of Education’s website. A list of recognised accrediting agencies is listed on the website. Cross-reference the accreditation institute listed on your college’s page, and compare it with the ones on the Department of Education’s page to see whether your university has received its credibility from one of these well-known agencies. “ “The department of education also lists secondary and postgraduate schools with standard accreditation. Standard colleges and universities adhere to the Higher Education Act (HEA) which was passed by the Congress in 1965. The HEA made sure that the accreditors of universities would ensure the quality of the curriculum being taught in the respective college courses.”- The News Minute In the end, the choice is yours. You can still choose to go down the way of a fake degree and think of it as a solution to all your academic problems. But how is that going to do you any good? Companies have now become much wiser and carry out a thorough background check before hiring students who are fresh out of college. Besides, with a fake degree, you don’t even get the chance to learn valuable skills that can help you perform at your maximum capacity when you get a job. So our advice is that you save yourself from the rut of fake degrees and go for a genuine one. It might be harder to get an authentic degree, but it will be well worth the price. Please upvote if you like the answer. ",
            "date": "Updated August 12, 2020",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rajnish Singh",
                    "user_href": "/profile/Rajnish-Singh-84"
                },
                {
                    "user_id": "Mark Hales",
                    "user_href": "/profile/Mark-Hales-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "MaryBeth Lizek",
                "href": "/profile/MaryBeth-Lizek"
            },
            "answer_text": "The best way to verify whether the applicant has a degree or not is to require him to have the university send you his official, original transcript in a sealed envelope. This should be sent directly to you (not to him so he sends it to you). Transcripts will have special watermarks and seals. ",
            "date": "Answered July 25, 2019",
            "views": "276",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charlie Montross",
                "href": "/profile/Charlie-Montross"
            },
            "answer_text": "You can do what industry does, contact the university directly to verify if the person on the degree certificate was authentic. And/or request a notarized transcript from the person showing the awarding of the degree in question. Universities will be happy to help because they are protecting their reputation and “don’t want to dilute their brand”. ",
            "date": "Answered May 30, 2018",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Peter De Vroede",
                    "user_href": "/profile/Peter-De-Vroede"
                }
            ]
        }
    ]
}