{
    "title": "How to decide which branch of computer science to pursue - Quora",
    "tags": [
        "Computer Science Education Career Advice",
        "Career Advice and Computer Science Education",
        "Career Advice for Computer Programmers",
        "Career Advice in Computer Science",
        "Computer Science Education",
        "Computer Programming"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vinod Chandrasekaran",
                "href": "/profile/Vinod-Chandrasekaran"
            },
            "answer_text": "Ask people. If you want to take a job after graduating, talk to your seniors in various companies about the kind of work they do, what technologies they work on, what skills they require and so on. Ask your recruiters themselves what role they are hiring for. Try to drill down into specifics. Ask them what team they are leading and where they plan to fit you in. They will appreciate the interest and passion that you are showing and the fact that you aren't just another fresher who will settle for any job that pays a decent salary. Introspect about which subjects in CS you truly enjoyed. Did you like Algorithms? Well, every software company requires a decent understanding of that subject. The \"dream companies\" like Google, Facebook, Amazon etc. will test you primarily on Algorithms and Data Structures. They require a deep understanding and mastery of these subjects. If you liked hardware, computer architecture, microprocessors, operating systems, look for companies developing embedded software (ST Microelectronics, Samsung, Robert Bosch etc.). You will be exposed to the internal nuts and bolts of complex systems and get an opportunity to work on system software. For computer networks, you have Cisco, Novell, Bell Labs etc. Operating systems - Microsoft, Sun Microsystems. E-business software - Trilogy, Oracle. EDA - Synopsys, Cadence, Mentor Graphics. EDA is a great field where you get to work with beautiful algorithms that operate on transforming hardware designs. I'm sure you can find out more through Googling and asking around. If you truly have a passion for CS, the best idea would be to go for further studies, preferably a Ph.D program. If you have done good project work with a Professor and published something, you have a good chance. That will be your best bet to explore the subject, since you will get to work on a field of your choice, and tackle a research problem that no one else has solved. All the best! ",
            "date": "Answered October 16, 2015",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Edward Isajanyan",
                    "user_href": "/profile/Edward-Isajanyan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Burleson",
                "href": "/profile/Michael-Burleson-2"
            },
            "answer_text": "You're approaching this backwards.  You're starting with the masters as the ultimate goal and working backwards to justify it.  Instead you should be considering getting a masters only when you've worked enough to know what you want to pursue and know that a masters will be necessary to achieve it.   Maybe you'll graduate and start working and find out you like what you're doing just fine.  Maybe you'll find out you hate tech work in general and switch careers entirely.  You'd be surprised how often that happens! Anyways- the point is if you have to ask what masters degree to pursue, a masters isn't for you.  It will be really obvious to you once that degree is necessary. Stop worrying and work on your undergrad. ",
            "date": "Answered March 3, 2015",
            "views": "667",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jitender Kumar Madaan",
                "href": "/profile/Jitender-Kumar-Madaan"
            },
            "answer_text": "You already know the answer, you are just not telling it to yourself. At the end of every day, write 5 things in day which made you happy and why? Analyse to the level, whether it was learning the concept or getting the work done with specifics of the subject you dug into. Another advice is to go deep/advanced into the study of that field and keep a check on your interest level.  Keep doing this for some months, while exploring different fields. Then read it and identify the moments you felt most joyous in, even more excellent if these moments are while you were studying advanced concepts in a field.  Help you, this should, young Jedi. ",
            "date": "Answered June 13, 2014",
            "views": "1",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Srijan Rastogi",
                    "user_href": "/profile/Srijan-Rastogi-1"
                },
                {
                    "user_id": "Ahmed Mohamed Abd El-Hamid",
                    "user_href": "/profile/Ahmed-Mohamed-Abd-El-Hamid"
                },
                {
                    "user_id": "Vishakha Patil",
                    "user_href": "/profile/Vishakha-Patil"
                },
                {
                    "user_id": "Devesh Sati",
                    "user_href": "/profile/Devesh-Sati-2"
                },
                {
                    "user_id": "Azhar Hussain",
                    "user_href": "/profile/Azhar-Hussain-1"
                },
                {
                    "user_id": "Gaurav Madaan",
                    "user_href": "/profile/Gaurav-Madaan"
                },
                {
                    "user_id": "Sean Leary",
                    "user_href": "/profile/Sean-Leary-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sean Leary",
                "href": "/profile/Sean-Leary-1"
            },
            "answer_text": "I agree with Kiran Gangadharan.  [The rest of this answer is directed to those who are pursuing a BS or equivalent in CS.]  An undergraduate degree is only intended to survey the state of knowledge in your field of study. Getting familiar with and developing an interest in many different areas is a good strategy. If you decide to do graduate work, your advisor can guide you to areas of active research that might lead to employment in a specific field. But when you graduate with a BS, your first and only job is to find full time employment. You can focus on places that do the work you happen to be interested in, and choose which offers you will accept, but the actual work you do is going to be up to your employer. ",
            "date": "Answered June 13, 2014",
            "views": "19",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jeff Nelson",
                    "user_href": "/profile/Jeff-Nelson-32"
                },
                {
                    "user_id": "Edward Isajanyan",
                    "user_href": "/profile/Edward-Isajanyan"
                },
                {
                    "user_id": "Ahmed Mohamed Abd El-Hamid",
                    "user_href": "/profile/Ahmed-Mohamed-Abd-El-Hamid"
                },
                {
                    "user_id": "Johnny Ho",
                    "user_href": "/profile/Johnny-Ho"
                },
                {
                    "user_id": "Christian White",
                    "user_href": "/profile/Christian-White-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yash Garg",
                "href": "/profile/Yash-Garg-10"
            },
            "answer_text": "Idea behind the structure of bachelor's program is to present agglomerate different aspects of CS. If you analyze the course structure of your Cs program you will find various courses from data structures, operating systems, databases, operating system.  The best way to figure out your interest is to figure out which course stirs analytical thinking while you are studying it. Graduate education is not one of those degree program that i done for the sake of attaining a degree. The major of your program decide the jobs you will get in future. ",
            "date": "Answered October 21, 2015",
            "views": "799",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ahmed Mohamed Abd El-Hamid",
                    "user_href": "/profile/Ahmed-Mohamed-Abd-El-Hamid"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiran Gangadharan",
                "href": "/profile/Kiran-Gangadharan"
            },
            "answer_text": "First of all, it's totally ok to dance around. In fact you should do that, unless you're planning on working as a full-time researcher on a particular field or topic in Computer Science. A lot of engineers spent significant years of their lives wearing different hats until they finally figure out something that they really want to stick to.  And I don't blame you. Computer Science is fun after all :) ",
            "date": "Answered June 13, 2014",
            "views": "12",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kriti Kapoor",
                    "user_href": "/profile/Kriti-Kapoor-7"
                },
                {
                    "user_id": "Ahmed Mohamed Abd El-Hamid",
                    "user_href": "/profile/Ahmed-Mohamed-Abd-El-Hamid"
                },
                {
                    "user_id": "Vishakha Patil",
                    "user_href": "/profile/Vishakha-Patil"
                },
                {
                    "user_id": "Sean Leary",
                    "user_href": "/profile/Sean-Leary-1"
                },
                {
                    "user_id": "Azhar Hussain",
                    "user_href": "/profile/Azhar-Hussain-1"
                },
                {
                    "user_id": "Gaurav Madaan",
                    "user_href": "/profile/Gaurav-Madaan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ahmet Güneş",
                "href": "/profile/Ahmet-Güneş"
            },
            "answer_text": "Dancing around is the key actually. We all danced around. I tried electronics, database administration, coding, testing, economics, biological computation etc. I couldn't catch any oportunity yet I have a plan. You will have a plan too my plan is mixing all of these and being a businessman. You will have plan for yourself. Just keep dancing. ",
            "date": "Answered June 15, 2014",
            "views": "555",
            "upvotes": " Answer requested by Azhar Hussain"
        }
    ]
}