{
    "title": "How to handle online studies and self-study when there are approximately 7 hours of online classes - Quora",
    "tags": [
        "Self Study",
        "Online Training",
        "Online",
        "Study Habits",
        "Studying Advice",
        "E-learning",
        "Exam and Test Preparation",
        "Studying",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Unnamed",
                "href": "/profile/Unnamed-188"
            },
            "answer_text": "First of all prioritize. Think about what is more important for you at that point of time, and plan to give more time in your schedule to that. Also, it is not all that difficult in these times especially. You can do slyly do Self study in some of the classes that you think you can skip for the day. I mean, there is some amount of advantage in these classes right. Also, even when you are attending 7 hours of online lectures, you can still manage to study for atleast 3–4 hours everyday and extend that on weekends. Make a schedule, find out where you are wasting your time, and keep reminding yourself how important this is to you. Then just sit down and get going. And if that is still troubling you then you can try different things, like studying with me videos or the pomodoro method. In that metthod you set a 25 or 50 minute timer and you sit down to study, you take a 5 minute break and do another session of 25 or 50 minutes. That has been proved to be highly productive. Anyways, all the best. Remember that time is manageable, you just need to try. Also, here is a link of the study with me video it you are interested. It helps concentrate better.  ",
            "date": "Answered July 8, 2020",
            "views": "72",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manjari Varshney",
                    "user_href": "/profile/Manjari-Varshney-6"
                },
                {
                    "user_id": "Aryan Katiyar",
                    "user_href": "/profile/Aryan-Katiyar-43"
                }
            ]
        }
    ]
}