{
    "title": "How to solve physics sum ICSE - Quora",
    "tags": [
        "Science + Technology",
        "Problem Solving in Physics",
        "Indian Certificate of Secondary Education (ICSE)",
        "Problem Solving",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Suvam Roy",
                "href": "/profile/Suvam-Roy-5"
            },
            "answer_text": "When I was at your position I also faced the same hassle you are facing right now. First six month were very tough to go on. But I never gave up.I tried again and again. But once it was in my grip it became the most favorite subject. So here are my some tips which may somehow help you. Assuming you are a novice. First read your text book on the topic you want to master your-self. Then afterwards memorize all the simple formulas. You can only efficiently memorize the formula only you do some very simple and short example on that topic or formula. First start from mechanics. It has less number of formulas but the application is vast. In the mechanics you have start from Vector-Scalar part as it is the heart of mechanics. After doing some problems then you switch to Force part and after wards Energy-Potential and Work. First study the topics ,realize the matter and then go through some example which are very easy .But don’t go for harder example in the beginning. My opinion is at the beginning don’t try to solve the examples by your own first go through the examples read line by line and realize why they do so what are the relations and how it’s related to what you have studied. After going through 10–20 examples you will be already accustomed what they are dealing with then you can try the 21th problem by your own. You may not be able to get success then you see the solution and realize the problem but how long will you be unsuccessful ? 3 times? 4 times ? 5 times ? But I bet you at 6th time you will be quiet experienced enough to solve it. Don’t worry everyone has to go through this stage but who is patient will survive. And I promise you, once you will accustomed with the matters Physics is the best subject ever. And if you find any problem in Physics you can ask freely and I will try my best to solve it. Thank you and Good luck , Have a blast in Physics !! ",
            "date": "Answered October 23, 2016",
            "views": "190",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/S-ASOKEN-BINDU"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mehant Kammakomati",
                "href": "/profile/Mehant-Kammakomati"
            },
            "answer_text": "Hey , Isn't a funny to ask. I don't thing so we summations and difference making in physics especially in icse board. so moreover if it comes to problems. So well then move in to solve the textbook problems. To solve the problems , simply I say ‘UNDERSTAND’ not the concept but the problem, not the book you are reading But what you are seeing . Because I feel physics for icse board is not so hard to achieve . Keep on doing . cheers ! ",
            "date": "Answered March 24, 2017",
            "views": "389",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "VIJAYKUMAR KAMMAKOMATI",
                    "user_href": "/profile/VIJAYKUMAR-KAMMAKOMATI"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sai Vittal B",
                "href": "/profile/Sai-Vittal-B"
            },
            "answer_text": "First, read and be thorough in the concept. Second, take that sum and deeply analyze like how can you solve by using the concepts you read. (This one is only applicable for tricky sums) Third, after first two, I'm sure you are in track and if not, consult your respective teacher about where are you going wrong! Hope this answer finds you well :) Good luck ← ",
            "date": "Answered October 22, 2016",
            "views": "188",
            "upvotes": "0"
        }
    ]
}