{
    "title": "How much money does a high school teacher make? - Quora",
    "tags": [
        "High School Teachers",
        "Teachers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Noel Walker",
                "href": "/profile/Noel-Walker-18"
            },
            "answer_text": "First off, public schools pay all teachers the same regardless of what they teach (but there are sometimes extra incentives for math or special ed- but these aren’t too common and typically only in challenging schools). So feel free to choose elementary, high school, music, art, whatever- it's all treated the same. Salaries are different based on education and experience. School systems use something called a salary table or salary chart (most school systems publish this online, so google the district your interested in and their salary table, and you’ll probably find it. Teachers are 10 month employees, so look at their 10 month pay. When you find this salary table, you will notice that along the top they list the education- like bachelors degree, master's, phd, etc., and on the side is step one, two, three- these represent how many years you’ve taught (basically). So if you have a master's and are on step 5- it will list what that salary is. As for what to expect, schools in rural areas pay less. -so expect a new teacher with a bachelors to make anywhere from 30,000 to 36,000 a year. Bigger cities pay more (but the cost of living is more), so expect 40,000 to 48,000 a year. A master's degree will normally give you between 1,500 to 3,000 more a year depending on the school district. And each year of experience gives you between 800 to 1500 more a year. When I started teaching, I made 32,000 a year with a master's (12 years ago) in a rural district. After two years I moved to the D.C. area and jumped to 50k, and now I am on step 9 (I should be on step 12 but they didn't give raises during the financial crisis), and I make about 63k a year…. and I get two months of vacation. The way summer break works is that the school pays me based on working a 200 day contract (that’s typical for a teacher school year). My school lets me decide whether I want my salary just for those 10 months of work, or whether I want them to stretch it over 12 months so I always get a check- I do the 12 month pay, so with every check, they deduct about $300, which will then be given back to me over the summer. This ensures my check is alway pretty much the same all year. So how does it feel living with this salary? I’m married with one child, my wife is a nurse that works 40 hours every week. And with that, we own a modest home in the D.C. area, we drive normal but not new cars, and we have a fairly high sense of security that we won't lose our jobs. My teaching job covers our insurance (teachers often get the best health insurance and many other jobs offer stuff that's a lot more expensive that cover less), and i get to spend all summer with my son (which saves us about 3k in child care costs.) So if you want to teach and you care more about job security and work/home life balance- teaching is awesome (it starts very very hard but gets easier with each year). If you care more about climbing up the ladder by working harder and getting raises, teaching is a horrible profession. So keep that in mind. ",
            "date": "Answered August 6, 2017",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rohan Verma",
                    "user_href": "/profile/Rohan-Verma-506"
                },
                {
                    "user_id": "Gyapti Teotia",
                    "user_href": "/profile/Gyapti-Teotia"
                },
                {
                    "user_id": "Cheyenne Strickland",
                    "user_href": "/profile/Cheyenne-Strickland-1"
                },
                {
                    "user_id": "Amit Bhardwaj",
                    "user_href": "/profile/Amit-Bhardwaj-43"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Brown",
                "href": "/profile/Greg-Brown-153"
            },
            "answer_text": "Here is an article online: http://blogs.edweek.org/edweek/teacherbeat/2017/02/which_states_pay_teachers_the_.html?cmp=cpc-goog-ew-topics&ccid=topics&ccag=Teacher+Pay+Article&cckw=teacher%20salary&cccv=content+specific+ad&gclid=EAIaIQobChMIp4aKtOrD1QIVkjRpCh3WRw1xEAAYASAAEgJzk_D_BwE Keep in mind that higher salary often goes hand in hand with higher cost of living. Nobody gets rich teaching, but teachers often have a very rich life by other standards — doing what we love and teaching the next generation. IN many places, the salary of two married teachers combined can provide a very comfortable life financially. Private teachers often make less. Teachers in religious schools are often paid less and may be expected to give a percentage of their salary back to the school or church as their “tithe.” If one wants their own children to attend the school, waived tuition for them may be added back to the pay to determine a total benefit of working for the school. If you choose to teach the children who need help the most, no salary will justify the amount of mental and psychological effort required to do it well. But, each time one of those students makes it through to become an adult friend equipped to live in the community, a teacher is paid more than any bank can hold. ",
            "date": "Answered August 6, 2017",
            "views": "505",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gyapti Teotia",
                    "user_href": "/profile/Gyapti-Teotia"
                },
                {
                    "user_id": "Andrew Hoi",
                    "user_href": "/profile/Andrew-Hoi"
                },
                {
                    "user_id": "Carolyn Dakis",
                    "user_href": "/profile/Carolyn-Dakis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Khani",
                "href": "/profile/Daniel-Khani-2"
            },
            "answer_text": "It really depends on the teacher and most of their salaries are public so you could look it up. My Intro to engineering design teacher last year is making $100,000 per year, and so does my Computer science teacher, and a principles of engineering teacher I have. Their is also this certification teachers can get for a good boost in their income which is what my IED teacher did. I didn’t bother looking up other teachers but I cant imagine them being higher due to the fact that teacher dont work for the school they are employed by CTE. I don't know what that is so dont ask me. Teachers can choose to do more jobs like STEM coordinator which is what one of my teachers did and that helps the pay. Just know I don't think teachers make much unless they teach something that requires special skill sets particularly the STEM field which is what all three of those teachers where teaching. ",
            "date": "Answered October 1, 2019",
            "views": "134",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Kosner",
                "href": "/profile/Jay-Kosner"
            },
            "answer_text": "I was employed by a unit district. Teachers were paid according to earn degrees and years of service. Average teacher pay started at about $50000 and went up from there. My pension is low six figures a year, so final pay was greater than that. A lot of people compare teachers to burger flippers. Teachers are highly skilled individuals. When we say a child doesn't learn we criticize the teacher. But parents are often unskilled. Parents wanting to maintain a good living both work out if the house. Who watches the children: the community gang banger. ",
            "date": "Answered August 6, 2017",
            "views": "163",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Berger",
                "href": "/profile/James-Berger-3"
            },
            "answer_text": "A high school teacher salary varies. It depends on each state’s funding, each school district’s salary scale, each teacher’s degree Bachelor’s and/or Masters, each teachers number of years teaching experience, whether the school is public, charter, or a private school, and adjunct or extracurricular assignments like Deans, sports coaching, or Gifted and Talented Coordinator, or Title Nine Coordinator. Please check each school districts web-site for a salary schedule. Salary schedules at public schools are usually available to the public. ",
            "date": "Answered August 6, 2017",
            "views": "179",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hillary Sibille",
                "href": "/profile/Hillary-Sibille"
            },
            "answer_text": "Thanks for the A2A. Salaries vary, depending on years of experience, educational degrees and, most importantly, where the teacher is working. I’m not sure, but I think this information is available in general terms in local government websites. After all, taxpayers have a say in local budgets. Teachers in private schools earn considerably less, because the school receives no government support whatsoever. While it’s considered impolite in the USA to ask people how much they earn, you may want to talk to local teachers you know about salaries, to get an idea. You can certainly ask about the general scale, rather than individual pay. I hope this helps. ",
            "date": "Answered August 6, 2017",
            "views": "260",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Howard",
                "href": "/profile/Michael-Howard-158"
            },
            "answer_text": "They make enough. Maybe not always as much as they deserve, but the exact amount really depends on the state they’re in, and especially how long they’ve been teaching (plus other considerations, like their education level or subject area). Teaching is definitely a unique field. There’s a lot that goes into it, and a lot that you can get out of it. If you’re considering teaching, the best advice I can give is to talk to teachers about it, and see if you can get some hands-on experience — not just in the classroom, but outside of it as well. Teaching is less of a job and more of a lifestyle, I’d say.  ",
            "date": "Answered August 8, 2017",
            "views": "251",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elijah Velaski",
                    "user_href": "/profile/Elijah-Velaski"
                },
                {
                    "user_id": "Carolyn Dakis",
                    "user_href": "/profile/Carolyn-Dakis"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Carrick",
                "href": "/profile/John-Carrick-5"
            },
            "answer_text": "That depends upon where he or she is employed. New York ($79M), Massachusetts (78M), and Ontario (71M U.S.), all have generous pay scales, because they value quality education. S.Dakota ($42M), Mississip1 ($43M) and Quebec ($56M U.S.) undervalue the work of their teachers . ",
            "date": "Answered August 6, 2017",
            "views": "133",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steven Zhang",
                "href": "/profile/Steven-Zhang-128"
            },
            "answer_text": "According to US News &a World Report, the average US high school teacher makes ~$57,000 with the top 10% making $91,000 and the bottom 10% making $38,000. Personally as a student who has had very magnificent teachers who have all acted as very impactful mentors during an emotionally and hormonally-charged period of my life, I feel like high school teachers are not paid enough for their contribution in inspiring and aiding students during a turbulent time of the students’ lives. ",
            "date": "Answered August 6, 2017",
            "views": "225",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cheyenne Strickland",
                    "user_href": "/profile/Cheyenne-Strickland-1"
                },
                {
                    "user_id": "Igbo Clifford Chimaizuobi",
                    "user_href": "/profile/Igbo-Clifford-Chimaizuobi"
                },
                {
                    "user_id": "Carolyn Dakis",
                    "user_href": "/profile/Carolyn-Dakis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karen Hames",
                "href": "/profile/Karen-Hames"
            },
            "answer_text": "Salary for any teacher varies from school district to school district as well as state to state. Another consideration for pay is the experience and education of the applicant. A masters degree pays more than a bachelors degree. Someone who has been teaching will start at a higher salary than a new teacher. Every district has a website. You should be able to access each ones salary there. If not, call the human resources department and ask. You have a right to know what your potential earnings will be. ",
            "date": "Answered August 6, 2017",
            "views": "189",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gerald Hawkins",
                "href": "/profile/Gerald-Hawkins-2"
            },
            "answer_text": "Every state is different. 2017-2018 Average Starting Teacher Salaries by State Gives the NEA analysis of salary by state. In some states high school teachers get a bit more. Overall the difference between high school and elementary teachers averages about $2000 in the USA. ",
            "date": "Answered July 5, 2019",
            "views": "89",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sowmyaa Arun",
                "href": "/profile/Sowmyaa-Arun"
            },
            "answer_text": "Please provide more specific questions like Location, Subject and our company AcadsHR can surely assist you with this. AcadsHR works exclusively with the education sector in India and UAE ",
            "date": "Answered January 21, 2020",
            "views": "46",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Siddarth B",
                    "user_href": "/profile/Siddarth-B-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kate Moore",
                "href": "/profile/Kate-Moore-149"
            },
            "answer_text": "For U.S., K-12 https://www.teacherportal.com/teacher-salaries-by-state/ ",
            "date": "Answered November 13, 2019",
            "views": "30",
            "upvotes": "0"
        }
    ]
}