{
    "title": "How to educate those around you who are unaware of the depths of mental health - Quora",
    "tags": [
        "Mental Illness",
        "Mental Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew Stachura",
                "href": "/profile/Matthew-Stachura-2"
            },
            "answer_text": "Oh this is such a good question! Honestly it’s hard to educate people, not because it’s something difficult to help someone understand the depths of mental health, but because people don’t ask for more understanding. This is something very frustrating for me as I suffer from depression and anxiety and my twin brother, although he loves and cares about me, has no idea what it’s like and doesn’t ask me any questions that he has, or challenge stereotypes he thinks is true. So my advice would be to first, open the floor to questions. Tell whoever u want to learn more about mental health that they can and should ask you if they need help understanding something. Second, come up with examples of situations where something has affected your mental health or someone else’s that can convey what it’s like. Journal I find that for myself, keeping a log of my emotions and well being helps me remember specific examples of how my mental health has affected me, and also works for tracking how I’m doing and what triggers my depression. For this I use an app called Daylio which I highly suggest. Outside Sources Something that really helps me when I’m depressed or having a panic attack is to watch ted talks of people who have struggled with mental health or who are trained professionals. These videos and other articles or websites could also help friends or family understand what you are going through, maybe better than anything that you could say to them. I will leave some links at the bottom for those who want it. Artwork As someone who loves drawing, painting, and the arts in general, I find that this is a great way of expressing how you feel. Art is something that brings an understanding that words can’t, and believe me I’m not the first to have figured this out. Loads of people have created artwork, creative writing pieces, dance routines, etc. that express what mental illness is like and could be a great resource for education for the depths of mental health I hope this helps, and here are some links to videos that have helped me:        ",
            "date": "Answered July 3, 2018",
            "views": "108",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "KB Wakhley",
                    "user_href": "/profile/KB-Wakhley"
                }
            ]
        },
        {
            "author_info": {
                "name": "MaryPat Conley",
                "href": "/profile/MaryPat-Conley-1"
            },
            "answer_text": "Well, you’ve got your work cut out for you. You didn’t indicate what the alternative beliefs were so it’s difficult to address. Does this person deny that sick people hallucinate (without having let’s say a fever) and does this person feel people are bad rather than mad? Does this person feel career criminals couldn’t be suffering from a psychosis and they’re capable of standing trial and innocence by reason of insanity is off the table? I’m a former psych nurse. I taught psych. It’s hard to wrap my head around the thought of thousands or millions of criminals being incarcerated without any hope of getting out while the system lets them suffer behind prison doors. I can’t offer you much guidance because people who are irrational about the plight of the mentally ill just blow me away. If you feel strongly about this, appeal to their sense of reason. Jeffery Dahmer was NOT a sane man, nor was Charles Manson. I wish you luck. ",
            "date": "Answered January 6, 2019",
            "views": "105",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Melissa Wingfield",
                    "user_href": "/profile/Melissa-Wingfield-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "SaraSue Crawford",
                "href": "/profile/SaraSue-Crawford"
            },
            "answer_text": "First of all, those around you need to want to be educated. If they don't care, then nothing you can say or do will have an impact. I've learned this the hard way, over many years of trying to get several family members to understand. Some just don't want to understand and I've had to (grudgingly) accept that and limit their presence in my life. If the people around you want to understand, explaining it is easy. Start with the facts, such as what's causing a particular mental health issue, then work your way up to explaining your personal experiences and perceptions. Then ask if they have any questions. For example, when I'm explaining my anxiety to someone who wants to understand, I'll say, “my brain processes stress more strongly than it should. Something that shouldn't be threatening at all is often perceived as a major threat to my safety and my adrenaline kicks into overtime, which makes me react like I'm being chased by a chainsaw-wielding serial killer. Do you have any questions?” ",
            "date": "Answered July 3, 2018",
            "views": "391",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Shaffner",
                    "user_href": "/profile/Jim-Shaffner"
                },
                {
                    "user_id": "Angele Roy",
                    "user_href": "/profile/Angele-Roy"
                },
                {
                    "user_id": "Deborah Basel",
                    "user_href": "/profile/Deborah-Basel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Di Anna Hicks-Ross",
                "href": "/profile/Di-Anna-Hicks-Ross"
            },
            "answer_text": "I have a friend who very adamantly told me to “snap out of it” during my last deep depressive state (where I ended up hospitalized for attempting suicide.) I talked with her after my discharge and she was very upset that I was suicidal and she would never even think of taking her own life what was my problem? I compared my mental illness/abnormal brain chemistry to my diabetes. I pointed out to her that I can’t control either and take meds for both. If my sugar had dropped and I ended up in a coma and in the hospital would she blame me or tell me to “snap out of it” and she said no. She has accepted my mental illness symptoms and is much more understanding now. Thanks for asking. ",
            "date": "Answered May 16, 2019",
            "views": "79",
            "upvotes": " Answer requested by Annie Hua",
            "upvoters": [
                {
                    "user_id": "Angele Roy",
                    "user_href": "/profile/Angele-Roy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deborah Basel",
                "href": "/profile/Deborah-Basel"
            },
            "answer_text": "You get them information pamphlets from a reputable mental health support source. I'm unsure what support is in your country. I only know Australian services.If you see a good article, especially if it is written by someone who experiences the same mental illness as yourself and whose words resonate with you, print it out and hand it to your family and friends. Ask them to read them. Tell then after they have read them, if they want, they can ask you questions.Also, having a family therapy session with your psychiatrist or psychologist can help. I did this with my psychologist, my mum and my son. My mum knew 'everything about depression because she had one depressive episode years ago. But my psychologist set her straight. Explained words that are hurtful for me and don't help. It made a big difference to my mums understanding of why I couldn't just get up and do things. ",
            "date": "Answered July 4, 2018",
            "views": "55",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sarah Waters",
                    "user_href": "/profile/Sarah-Waters-16"
                },
                {
                    "user_id": "MaryPat Conley",
                    "user_href": "/profile/MaryPat-Conley-1"
                },
                {
                    "user_id": "Gina Hughes",
                    "user_href": "/profile/Gina-Hughes-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Grahame Cossum",
                "href": "/profile/Grahame-Cossum"
            },
            "answer_text": "I think there is a possibility you may have a blind spot. Ask yourself this question instead. Why do I feel the need to educate someone who doesn’t believe in mental health about mental health? Honestly, I didn’t say that to put you down. I said it so you could save yourself a lot of time and frustration. Let them believe what the hell they want. You are trying to convince someone of a fact. Mental health is a fact like breathing is a fact, if they need convincing of a fact it sort of alludes to the personality of the person you are talking to. Don’t waste your time. ",
            "date": "Answered January 4, 2019",
            "views": "138",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "MaryPat Conley",
                    "user_href": "/profile/MaryPat-Conley-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sara Arenson",
                "href": "/profile/Sara-Arenson"
            },
            "answer_text": "Why do you need to educate anyone about mental health? It’s obvious that many people suffer and current treatments aren’t very good. Unless you’re a psychiatrist or professor, “educating” people about a vague idea is not very honest. Don’t pretend you know more than you do. Read books by David Healy, Terry Lynch, and Joanna Moncrieff, to learn what psychiatry is really about. “Mental health” has become an ideology. Again, it’s about being humble and honest. Desist from labeling your fellow humans, accept that they suffer and need other forms of help, and abandon buzzwords. ",
            "date": "Answered January 7, 2019",
            "views": "57",
            "upvotes": " Answer requested by Annie Hua",
            "upvoters": [
                {
                    "user_id": "Gina Hughes",
                    "user_href": "/profile/Gina-Hughes-6"
                },
                {
                    "user_id": "Eve Grove",
                    "user_href": "/profile/Eve-Grove-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carol Remfrey Foote",
                "href": "/profile/Carol-Remfrey-Foote"
            },
            "answer_text": "Thanks for your question Annie. I wonder why you want to try and educate someone who doesn't believe in mental health? I am curious about how this impacts on you as I guess this someone is important to you and if you have a mental health issue, them not believing you have this must be distressing? Do they believe in physical health problems? I don't know how you could educate someone who is so resistant or closed off to this. I would suggest you consider using a phrase such as ‘ when you say you don't believe in mental health issues I feel…….’ and think about how you feel is it sad, angry, dismissed, distressed, fear? Rather than try to educate them let them know how they impact on you which is a more powerful intervention. I hope this helps. ",
            "date": "Answered June 19, 2019",
            "views": "47",
            "upvotes": " Answer requested by Annie Hua",
            "upvoters": [
                {
                    "user_id": "Mohammad Ali",
                    "user_href": "/profile/Mohammad-Ali-240"
                },
                {
                    "user_id": "Kyrani Eade",
                    "user_href": "/profile/Kyrani-Eade"
                }
            ]
        },
        {
            "author_info": {
                "name": "Melody Stocks-Marler",
                "href": "/profile/Melody-Stocks-Marler"
            },
            "answer_text": "In my experiences, the audience has to be captive. There is a lot of people, cultures and the like that refuse to believe that mental illness exists. So, leave literature around from NAMI. suggest a movie or book on someone's life experience. Then let them ask you. Otherwise, you can get disheartened by your attempts. Keep attempting to educate. Maybe not individuals, but at events and political rallies. Get the word out of you feel the call. It is worth it. ",
            "date": "Answered January 4, 2019",
            "views": "41",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Daniel Foster",
                    "user_href": "/profile/Daniel-Foster-9"
                },
                {
                    "user_id": "Angele Roy",
                    "user_href": "/profile/Angele-Roy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Derrick Iozzio",
                "href": "/profile/Derrick-Iozzio"
            },
            "answer_text": "Maybe by educating that person that mental health challenges are real. You will need to pursade them that statistics show that about 1 in 5 adults experience mental illness in a year, in the US that is about half of the adult population (around 46%), These statistics are real and can be verified on any number of mental health websites. Present the facts to the person and maybe they will come around. ",
            "date": "Answered June 19, 2019",
            "views": "17",
            "upvotes": " Answer requested by Annie Hua",
            "upvoters": [
                {
                    "user_id": "Jerry Martin",
                    "user_href": "/profile/Jerry-Martin-225"
                },
                {
                    "user_id": "Kathleen Hester",
                    "user_href": "/profile/Kathleen-Hester-2"
                },
                {
                    "user_id": "Theresa Day",
                    "user_href": "/profile/Theresa-Day-14"
                },
                {
                    "user_id": "Daniel Foster",
                    "user_href": "/profile/Daniel-Foster-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gina Hughes",
                "href": "/profile/Gina-Hughes-6"
            },
            "answer_text": "It is very difficult to try to educate anyone who does not want to learn. If the person holds an inflexible, irrational belief, it may not be at all possible. You could try to engage them in conversation about a related topic and feel them out about their interest in possibly hearing what you have to say, but you are not likely to penetrate their rigid defenses. ",
            "date": "Answered January 4, 2019",
            "views": "21",
            "upvotes": " Answer requested by Annie Hua",
            "upvoters": [
                {
                    "user_id": "Gina Hughes",
                    "user_href": "/profile/Gina-Hughes-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Duncan Mckinnon",
                "href": "/profile/Duncan-Mckinnon-6"
            },
            "answer_text": "You can’t educate a fool! Alexander Pope - a poet of the eighteenth century, was plagued by people who wanted him to read and appraise their poems, he said: ‘I’d like to tell the secret to every fool that he’s an ass!’. But of course, you can’t because they’re F09876s. That problem is not a new one, my friend. ",
            "date": "Answered January 4, 2019",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christina J. Arendsen",
                "href": "/profile/Christina-J-Arendsen"
            },
            "answer_text": "You don’t, unless they ask you to, which I doubt they’ll do. Now if it’s a matter of you dealing with a psychiatric diagnosis, and someone close to you does not ‘believe’ in mental health issues, that’s a different question. But be aware that it’s very hard to change a person’s beliefs / prejudices. ",
            "date": "Answered January 4, 2019",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robin Knight",
                "href": "/profile/Robin-Knight-18"
            },
            "answer_text": "Show them the facts. Take them to visit some one with a mental illness. Go visit a hospital with mental illness patients. The thing is mental illness is a scientific fact whether you believe in it or not so it doesn’t matter what they believe cause it’s there. Period. ",
            "date": "Answered June 19, 2019",
            "views": "12",
            "upvotes": " Answer requested by Annie Hua"
        },
        {
            "author_info": {
                "name": "Alan Koenigsberg",
                "href": "/profile/Alan-Koenigsberg-1"
            },
            "answer_text": "You can’t educate someone who doesn’t have an open mind and a willingness to learn about anything.I’m not sure how anyone could not believe in health, of any sort. If this person doesn’t believe in health, you have a rough time ahead of you.",
            "date": "Answered January 4, 2019",
            "views": "130",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Mimi Yana",
                "href": "/profile/Mimi-Yana"
            },
            "answer_text": "How do you educate someone who doesn't believe in God about God? Well, in the same way….'There is a strong belief system, advocated by (dash) and supported by (dash), who think or who have presented some evidence that (dash) exhist….tada! For God's sake, don't force people to think as you do, everyone is entitled to their own opinion. ",
            "date": "Answered January 4, 2019",
            "views": "32",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Tonya Toothman",
                "href": "/profile/Tonya-Toothman"
            },
            "answer_text": "You do so by treating mental health issues like any medical issue. You name the issue and describe the symptoms then give treatment options. Then the ball is in the other persons hands as whether to believe it or not. ",
            "date": "Answered June 17, 2019",
            "views": "12",
            "upvotes": " Answer requested by Annie Hua"
        },
        {
            "author_info": {
                "name": "Iustin Floroiu",
                "href": "/profile/Iustin-Floroiu"
            },
            "answer_text": "You can try to explain mental illness to them, but try to be calm even when they do not understand or are not even trying to. Many people do not even want to understand it. ",
            "date": "Answered July 4, 2018",
            "views": "56",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Hannah MacAskill",
                "href": "/profile/Hannah-MacAskill"
            },
            "answer_text": "You can only truly educate those who want to learn ",
            "date": "Answered July 3, 2018",
            "views": "48",
            "upvotes": " View 4 Upvoters"
        },
        {
            "author_info": {
                "name": "Onyx Raven",
                "href": "/profile/Onyx-Raven-1"
            },
            "answer_text": "Why fight a losing battle? Clearly mental illness, or whatever they call it, exists, they just have a different rationale for it. Let them. Its no skin off your nose if they dont share your beliefs. ",
            "date": "Answered June 20, 2019",
            "views": "14",
            "upvotes": " Answer requested by Annie Hua"
        },
        {
            "author_info": {
                "name": "Eve Sang-Bryan",
                "href": "/profile/Eve-Sang-Bryan"
            },
            "answer_text": "Please crawl from beneath the huge rock under which such an uninformed Middle Ages person has been residing ‼️ E Samg,MD ",
            "date": "Answered January 4, 2019",
            "views": "28",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "James Ballard",
                "href": "/profile/James-Ballard-68"
            },
            "answer_text": "ORIGINAL QUESTION : “How do I educate someone who doesn’t believe in mental health about mental health?” Generally you cannot. Such is the nature of avoidance of unpleasantries. And the nature of chronic denial. ",
            "date": "Updated January 29, 2020",
            "views": "48",
            "upvotes": " Answer requested by Annie Hua"
        },
        {
            "author_info": {
                "name": "Jennifer Mathers",
                "href": "/profile/Jennifer-Mathers-3"
            },
            "answer_text": "You can't teach someone that's not willing to learn. If they don't want to know it's their loss. Not your responsibility to make them understand. ",
            "date": "Answered December 19, 2019",
            "views": "33",
            "upvotes": " Answer requested by Annie Hua"
        },
        {
            "author_info": {
                "name": "Miranda Marnik-Said",
                "href": "/profile/Miranda-Marnik-Said"
            },
            "answer_text": "How do you educate a creationist about evolution? You don’t. They don’t believe in it, so teaching them about it won’t do anything. ",
            "date": "Answered June 28, 2019",
            "views": "13",
            "upvotes": " Answer requested by Annie Hua"
        },
        {
            "author_info": {
                "name": "Carol Sumilas Boshears",
                "href": "/profile/Carol-Sumilas-Boshears"
            },
            "answer_text": "Send them to a hospital psych ward. ",
            "date": "Answered July 3, 2018",
            "views": "7",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jane Whitacker",
                "href": "/profile/Jane-Whitacker"
            },
            "answer_text": "not, he/she doesn’t believe. or you must want to change him/her with some great arguments depending the needs ",
            "date": "Answered January 3, 2019",
            "views": "17",
            "upvotes": "0"
        }
    ]
}