{
    "title": "How to learn by doing - Quora",
    "tags": [
        "Learning Machine Learning",
        "Learning New Things",
        "Machine Learning",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Costas Mamais",
                "href": "/profile/Costas-Mamais"
            },
            "answer_text": "It depends what you mean by “learn” and “doing”, the principles are the same however: memory and feedback (positive and negative ). The brain (the driving part of your body) is made up of many cells. The main cells are the neurons, that are interlinked in various ways to make centers and pathways. Each part of your brain is responsible for a different activity, like movement of muscles, hearing, seeing, feeling, breathing etc. The neurons are charged electrically and communicate with other neurons and with the rest of the body via nerves (your spine has many nerves that go to your muscles and organs and back again) by electrical currents. Although neurons may not be able to duplicate (meaning that you have less neurons when you are older than when you are younger), we do know that they can form new connections and make existing connections stronger. If there is a certain pathway that is used often, then the connection gets stronger, and the electricity is more likely to flow that way rather than through another connection. Doing something means that you use certain nerve cells and connections: thinking about it, sending the information to your body, e.g. which muscles to use when cycling, and receiving information back from the body, e.g equilibrium, touch etc. Once your brain receives feedback from your environment and from your body (i.e. from your muscles and your ears and your eyes) the actions that resulted in a good outcome are reinforced, and the actions that resulted in a bad outcome are repressed. For example when cycling, your brain wants you to be upright and not fall (you do not have to think about it, its automatic). If your muscles do something that disturbs the balance (like lean too much towards the left), your brain responds to correct them. Of course, it has never been subjected to cycling before so it takes a while to adapt to the new situation and tries different ways to see what happens. A positive outcome is kept in memory and awarded in some way. The more you cycle, the more chances are that the corrective procedure will be used and the stronger it will become. Same with any other physical activity. Some activities require a conscious effort. For example, you can keep playing the piano all you want, unless you consciously try to become better, you will not learn. You may become faster in pressing keys, but you you not learn the piano if all you do is keep pressing random keys. In this case, feedback is more complex and has to do with internal motivation and pleasure centers that activate when a task is completed. The principle is the same, if you play the right notes, the brain likes it and the connections in the neurons that made it possible become stronger because of continuous use. Then your brain remembers which keys to play and when and becomes automatic: the pathways have been set and all you have to do is make the decision to start playing. The rest just follows a predetermined pathway so fast that you do not have to do any thinking. And that is why it is important to create good habits :) If you do stupid things all the time, your body learns to keep doing them and it is harder to “unlearn” them. In fact you cannot unlearn anything, all you do is learn something else and hope that it is stronger than the old thing so that it is used more often. You cannot unlearn riding a bike, but you can learn to ride it better. Long post, hope it helps in some way. ",
            "date": "Answered June 24, 2018",
            "views": "121",
            "upvotes": "0"
        }
    ]
}