{
    "title": "How to convince my parents to let me do online school - Quora",
    "tags": [
        "Persuasion",
        "Diabetes",
        "Fear",
        "Family Relationships and Dynamics",
        "Parents",
        "COVID-19 (2019-2020)",
        "Family"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elizabeth Perry",
                "href": "/profile/Elizabeth-Perry-21"
            },
            "answer_text": "If you think you might have diabetes, you need to get the lab work done to determine that. It’s a really quick set of tests (urine and blood to test your sugar levels, insulin levels, hormone levels and organ function) and you’ll have results within a week. You could do it at a walk in clinic. Once that’s out of the way, you need to talk to your parents about why they feel they need you to do in person. It could be they don’t feel comfortable leaving you alone at the house for long stretches while they have to work, or they worry you won’t be able to keep up. But get your vitals checked first so everyone’s working off of known quantities. ",
            "date": "Answered August 23, 2020",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dawn Heistand",
                "href": "/profile/Dawn-Heistand-2"
            },
            "answer_text": "First - you need to go online to see if your school does online schooling ! Second - ask your parents if it is alright with them if you do online schooling at home ? if so then do it this way but if not then you have to go to school ! having diabetes has nothing to do with online schooling ! for you can do your diabetes thing before you get to school ! my brother has diabetes and can go to work after he takes care of his diabetes ",
            "date": "Answered August 23, 2020",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Watson",
                "href": "/profile/Stephen-Watson-211"
            },
            "answer_text": "If you are concerned about being a diabetic, that takes priority over COVID. You ask your parents to get an appointment for testing and discussing your concerns with the doctor. While you are waiting for the results, the doctor will provide the information that you and your parents and school will need to know to adjust your diet, exercise, and studies. As long as you maintain good hygiene and manners, COVID is a manageable concern. If you are concerned about restricting yourself to online studies, ask your doctor to check data for your area and speak with your parents. The only thing you can do is learn the facts, not the rumors, and discuss it to a conclusion. ",
            "date": "Answered August 23, 2020",
            "views": "40",
            "upvotes": " Answer requested by Comfy Mocha"
        },
        {
            "author_info": {
                "name": "Nellie McConnell",
                "href": "/profile/Nellie-McConnell-2"
            },
            "answer_text": "How old are you? Can your parents help you with your classes? I wouldn't want my kids in public schools because of the indoctrination and virus. I don't care what age. I talked to my son abou about the two grandchildren education years ago. They went to private schools and got education . Both doing great. ",
            "date": "Answered August 23, 2020",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Judy Gill",
                "href": "/profile/Judy-Gill-2"
            },
            "answer_text": "“Might” have diabetes? What symptoms are you showing that lead you to believe you’re at risk? Perhaps, if your doctor says you are diabetic, either type one or type two, you parents would reconsider. But your having a mere suspicion of suffering from that very serious condition is not reason for you to ditch school, even if you plan to try online courses. ",
            "date": "Answered August 23, 2020",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephanie Simons",
                "href": "/profile/Stephanie-Simons-12"
            },
            "answer_text": "Find statistics of kids your age getting infected from school transmittion. Find evidence of diabetes increasing the chance of you getting it and possibly being affected more. Guilt trip them into it. Lay it on thick that you're terrified. ",
            "date": "Answered August 23, 2020",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Heather Caskey Willcockson",
                "href": "/profile/Heather-Caskey-Willcockson"
            },
            "answer_text": "Make them take you to a doctor and get tested for diabetes. Then, if you don’t have it, just get over it because there’s no reason you can’t do in person school, and virtual learning isn’t learning. ",
            "date": "Answered August 23, 2020",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carolyn Weed",
                "href": "/profile/Carolyn-Weed"
            },
            "answer_text": "You never said how old you are. If both your parents work they may not want to have you home alone. Talk to your doctor about it. ",
            "date": "Answered August 23, 2020",
            "views": "32",
            "upvotes": "0"
        }
    ]
}