{
    "title": "How many hours do high school teachers spend grading assignments? - Quora",
    "tags": [
        "Grading",
        "Teachers",
        "Teaching",
        "The High School Experience",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Purcell",
                "href": "/profile/Bob-Purcell-2"
            },
            "answer_text": "When I was a classroom teacher I was very inefficient at first, almost grading something from every student every day. This turned my 6 - h school days into 60-h school weeks. By the third year I had it down to about 50-h, sometimes less, sometimes more but 50 on average. If a 40-h week is considered the norm (I know many entrepreneurs may spend twice that, some athletes and celebrities much less, but the average working Jane or Joe usually counts 40 h as a full week). In the 39 weeks in my usual school year this would work out to about 1950 h. Given the average working salary is based on 2000 h per year, it means that my extra-long vacation did not mean fewer hours worked, but more concentrated worktime. The grading was about a 75% portion of this 30 h each week,— say, 20 h or so for grading each week. During exam periods it may work out to twice this with many 6-h days in school and 8 h grading for each of four or five days. After twenty years in the classroom I became an administrator—suddenly, I had social time to spend with my wife and now grown kids. I missed the teaching dearly, but the grading not so much! My at-school day went from 6h to about 9.5 h but I seldom took work home. I occasionally had reports to prepare outside of school hours, and some meetings were scheduled for administrators during vacation periods, but overall my evenings were free. I did attend many more extra-curricular activities on evenings or weekends than I had time to spend when I had grading to do. ",
            "date": "Answered June 10, 2017",
            "views": "12",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rich Pratt",
                    "user_href": "/profile/Rich-Pratt-5"
                },
                {
                    "user_id": "Annie Brown",
                    "user_href": "/profile/Annie-Brown-247"
                },
                {
                    "user_id": "Ellen Dial",
                    "user_href": "/profile/Ellen-Dial"
                },
                {
                    "user_id": "Jessica Keegan",
                    "user_href": "/profile/Jessica-Keegan-1"
                },
                {
                    "user_id": "Michael Jørgensen",
                    "user_href": "/profile/Michael-Jørgensen-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stewart Bone",
                "href": "/profile/Stewart-Bone-1"
            },
            "answer_text": "Grading papers and marking students work is popular but not always necessary. I taught an IB program without any and the students did just as well. While I accept the idea of grading as a feedback process, the mentality of it is in question. I have decided to do group marking with students and ask them to write down corrections and comments on their assignments in class while we go through the questions. It is these comments and corrections I look at. Few are needed if the student is performing well. Weaker students tend to write less. They rarely act on advice either. If you think about it, grading is problematic but I do not wish to use the time to explain here. I use about 2 hours a week and most of my grading is on what happens in the teaching time in front of me. Grading is part of the production/ product mindset. Teachers and students feel it is where the wage is earnt. It is a tradition, a part of the game, the script of the roleplay, the power axis, the purpose of the student, a way of defining your worth, a control tool. Finland does not give any homework (apparently) and is at the top of the PISA rankings in Europe. Go figure! ",
            "date": "Answered June 10, 2017",
            "views": "785",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Parker Knudson",
                    "user_href": "/profile/Parker-Knudson-1"
                },
                {
                    "user_id": "Gianna Renee",
                    "user_href": "/profile/Gianna-Renee"
                },
                {
                    "user_id": "Michael Jørgensen",
                    "user_href": "/profile/Michael-Jørgensen-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jill Shapiro",
                "href": "/profile/Jill-Shapiro-2"
            },
            "answer_text": "The number of hours depends on the type of assignment. Essays and longer written assignments take me a long time because I give a lot of feedback and explanation. I can usually grade 3 or 4 essays an hour. With 25 to 30 students per class, and four classes, well, you do the math. I try to stagger classes and writing assignments so I don't have to grade 100 essays at a time. If what you are really asking is how much time do teachers put in outside the actual school day, you also need to take into account lesson planning, creating or finding materials, etc. my estimate would be 3–4 hours after school and 10 or so hours on the weekends which adds up to 25–30 hours of work outside the regular school day ",
            "date": "Answered June 9, 2017",
            "views": "523",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Kaplan",
                    "user_href": "/profile/Daniel-Kaplan"
                },
                {
                    "user_id": "Jessica Keegan",
                    "user_href": "/profile/Jessica-Keegan-1"
                },
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Ang Sib",
                    "user_href": "/profile/Ang-Sib"
                },
                {
                    "user_id": "Marcy Buono",
                    "user_href": "/profile/Marcy-Buono"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doug Grudzina",
                "href": "/profile/Doug-Grudzina"
            },
            "answer_text": "I taught 12th grade AP, honors, and college prep English. Before we adopted a workable rubric and anchor set, it could take me 20 minutes to a half hour to properly comment on and then grade a single essay. A research paper would take an hour. Keep in mind, I was not simply a circle-the-error-and-slap-on-a-grade teacher. Teaching writing is as much about teaching kids to think as teaching them to craft grammatically correct sentences. So, for me, “grading” included asking questions, pointing out logical fallacies and non sequiturs, challenging internal contradictions, etc. I also allowed my students to revise and resubmit before I gave them a final grade, so I more or less “graded” nearly every paper twice (admittedly, the second time was considerably less thorough). On average, I’d say I spent at least an additional 40 - 50 hours/week outside of the classroom grading papers. It was when I admitted to myself that I was (1) delaying the first writing assignment until later and later in the year and (2) giving far fewer essay-type assignments that I decided I was approaching burn-out and needed to find something else to do. ",
            "date": "Answered June 14, 2017",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Crystal Laplante",
                    "user_href": "/profile/Crystal-Laplante"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maxene Kupperman-Guiñals",
                "href": "/profile/Maxene-Kupperman-Guiñals"
            },
            "answer_text": "Unbeknownst to many outside the profession, a teacher’s day is not the hours in front of a classroom. There is plenty of prep work, including lesson planning, creating quizzes and tests, calling parents, and grading tests, journals, essays, papers, and homework. As an English teacher, I used to spend about 6–10 hours a week just grading papers, and that did not include monthly or semester-long assignments. My son, who is a physics teacher, spends a similar amount of time weekly, as does my daughter-in-law, who is a chemistry teacher. Some teachers spend a little less time, and some spend a bit more, but that would be about average. ",
            "date": "Answered June 9, 2017",
            "views": "23",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rich Pratt",
                    "user_href": "/profile/Rich-Pratt-5"
                },
                {
                    "user_id": "Annie Brown",
                    "user_href": "/profile/Annie-Brown-247"
                },
                {
                    "user_id": "Danielle Vidad",
                    "user_href": "/profile/Danielle-Vidad-2"
                },
                {
                    "user_id": "Jessica Keegan",
                    "user_href": "/profile/Jessica-Keegan-1"
                },
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Jan Fargo",
                    "user_href": "/profile/Jan-Fargo-1"
                },
                {
                    "user_id": "Geraldine McDonagh",
                    "user_href": "/profile/Geraldine-McDonagh-1"
                },
                {
                    "user_id": "Doug Grudzina",
                    "user_href": "/profile/Doug-Grudzina"
                },
                {
                    "user_id": "Vincent Bian",
                    "user_href": "/profile/Vincent-Bian"
                },
                {
                    "user_id": "Obert Guo",
                    "user_href": "/profile/Obert-Guo"
                },
                {
                    "user_id": "John Conway",
                    "user_href": "/profile/John-Conway-101"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Deepak-yuvaraj-2"
                },
                {
                    "user_id": "Margaret Apolline",
                    "user_href": "/profile/Margaret-Apolline-1"
                },
                {
                    "user_id": "Martin Sanchez",
                    "user_href": "/profile/Martin-Sanchez-20"
                },
                {
                    "user_id": "Riley Thompson",
                    "user_href": "/profile/Riley-Thompson-12"
                },
                {
                    "user_id": "Michael Linden",
                    "user_href": "/profile/Michael-Linden-8"
                },
                {
                    "user_id": "Leticia Abeyta",
                    "user_href": "/profile/Leticia-Abeyta"
                },
                {
                    "user_id": "Kevin Popluer",
                    "user_href": "/profile/Kevin-Popluer"
                },
                {
                    "user_id": "Bob Purcell",
                    "user_href": "/profile/Bob-Purcell-2"
                },
                {
                    "user_id": "Donny Hernandez",
                    "user_href": "/profile/Donny-Hernandez-2"
                },
                {
                    "user_id": "Ajmal Jackson-Brown",
                    "user_href": "/profile/Ajmal-Jackson-Brown-2"
                },
                {
                    "user_id": "Edith Montalvo",
                    "user_href": "/profile/Edith-Montalvo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christine Barr",
                "href": "/profile/Christine-Barr-2"
            },
            "answer_text": "As an English teacher of over 25 years, I’d say it varies. I currently teach both middle school and college, and have taught high school AP English. Essays take an enormous amount of time to grade, while sentence diagramming and Scantron tests obviously don’t take that long. College grading doesn’t take as long as middle school, as the level of education means there is less in the way of grammatical or spelling errors in need of correction, or at least there certainly should be. The most intensive grading is for AP English, as you are preparing them for a vigorous test at the end of the course. A good teacher (at least of English) is going to spend a fair amount of time grading. A poor teacher, of course, may not. You simply cannot be an effective teacher if you are not willing to give feedback which enables your students to improve. ",
            "date": "Answered June 21, 2017",
            "views": "574",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rich Pratt",
                    "user_href": "/profile/Rich-Pratt-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Ray Mancini",
                "href": "/profile/Joseph-Ray-Mancini"
            },
            "answer_text": "about 4 hours every night. That information comes from my faculty. Personally, when I was teaching my grades were based on students performance on the rubric. They had conversations in Spanish which I listened to and they had to show profiency on everything on the rubric. So, their was no assignments beyond the rubric and I graded them as the students talked. ",
            "date": "Answered June 11, 2017",
            "views": "228",
            "upvotes": " Answer requested by Ajmal Jackson-Brown"
        },
        {
            "author_info": {
                "name": "Harper Chalmers",
                "href": "/profile/Harper-Chalmers"
            },
            "answer_text": "“TWO” (as in TOO many!) I found it much more beneficial if the students corrected their own (or each other's) papers. Yes, there were students who changed wrong answers and cheated…but only themselves, as I seldomly used those scores for their final grades (which were based primarily on formal evaluations). ",
            "date": "Answered June 9, 2017",
            "views": "195",
            "upvotes": "0"
        }
    ]
}