{
    "title": "How is the SRM Amravati AP campus? - Quora",
    "tags": [
        "SRM University, Kattankulathur",
        "SRM Institute of Science and Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yeshu Singh",
                "href": "/profile/Yeshu-Singh-6"
            },
            "answer_text": "Edit. The students at SRM-AP/SRM, spam reported an account which got deleted which contained the answer to how SRM-AP actually is from the inside. However, I had taken a couple of screenshots and hence I shall copy paste and modify the answer for general public where the truth is revealed and what SRM tries to cover is exposed. Someone anonymous's answer to How is the SRM Amravati AP campus? This is my original answer. I had emailed the “campus ambassadors” regarding the questions but they did not respond to a single answer. Students at SRM AP have created multiple accounts to mark that answer as a spam even though it is the reality. They want students to join them. I had sent them the following email. I have received a rank of 10,000 in the SRMJEE and I had a couple of questions regarding this university. 1) Is it true that the first mid-term had been re conducted as most of the batch failed it? 2) What is the current Wi-Fi speed? The current speed when you test it on speedtest.net 3) What percentage is reserved for Andhra Pradesh candidates? 4) I was told that some students have left this university? Is it true? If so, why 5) Why are there only positive reviews of this university on quora and google maps? Has the university bought reviews and comments? 6) What is the actual number of international students. 7) Are there any type of water/electricity supply cuts? If yes, when will they be fully resolved by. 8) What is the current boys to girls ratio? I asked a student at SRM AP personally and they gave a response asking for anonymity as the student was scared that the management will go against that person. According to that student and his friends, here is the response I got. Yes, 90% of the batch failed the first midterm and it had to be re conducted. The students who did well did not even get a scholarship and the students who had it still retained the scholarship.It’s currently 2MBPS when tested on speedtest.netMinimum of 40% is reserved for AP candidates. Hence the diversity wouldn’t be as much2 students left for the University of Waterloo and one of them was the best programmers in SRMThe university asks it’s students to give 5 star ratings to attract students and maintain it’s reputationAround 15–20 are international students. 10 are from Africa, 5 from bangladesh and the rest from other countries.There are frequent water and electricity cuts. However the university sends an email 4 hours in advanced.In a class of 70 students, 7–8 are girlsOverall, you should avoid this. You might want to consider VIT instead. With VIT the professors are much better. And you get a semester abroad as well. EDIT: Response to Rishvanth Katragadda. Quite a seamless answer given by Rishvanth. However, the beauty of factual incorrectness and exorbitant fallacies is something which SRM AP is too used to. To respond to some of your answers. The “Exam Review Committee” as you call it, set the paper at a very appropriate level. Most of the student intakes were at ranks around 80,000 when the minimum requirement was 35,000. And mind you, some of the students did really well. Including you, as I believe.I’m sorry but what kind of a university brings down speed when “misused”. Who is the one to decide whether it is being misused or not. If a student is paying a whopping 4 Lakhs a year, the least I expect is decent WiFi which the university does not provide. Also, it is complete nonsense that it is 10Mbps. As I myself tested it to be 2Mbps.Not only according to your actual statistics but also the news, 75% of the students are from Andhra Pradesh. How do you explain that.6. The fact that the students are from Africa, Bangladesh, Nepal, Afghanistan etc does not give you the right to advertise in such a way that there are students from the western part of the world. If you want to spread your news. Instead of just providing “numbers”, mention the countries. 7. I really don’t think I need to say anything on that. A few “occasional” is what you say, but from your very own students mouths, something else comes. In conclusion, SRM’s reputation is just how it is. It’s a waste of money. I promise you, you will regret joining this University as thousands of others have. ",
            "date": "Updated July 17, 2018",
            "views": "149",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Uma Iyer",
                    "user_href": "/profile/Uma-Iyer-96"
                },
                {
                    "user_id": "Subrahmanyam Balabhadrapatruni",
                    "user_href": "/profile/Subrahmanyam-Balabhadrapatruni"
                },
                {
                    "user_id": "Alpha Hawk",
                    "user_href": "/profile/Alpha-Hawk-2"
                },
                {
                    "user_id": "Aaryan Roy",
                    "user_href": "/profile/Aaryan-Roy-11"
                },
                {
                    "user_id": "Kaivalya",
                    "user_href": "/profile/Kaivalya-15"
                },
                {
                    "user_id": "Tapan P Sahoo",
                    "user_href": "/profile/Tapan-P-Sahoo"
                },
                {
                    "user_id": "Nagendra Bhimakari",
                    "user_href": "/profile/Nagendra-Bhimakari"
                },
                {
                    "user_id": "Shilpee Shrivastava",
                    "user_href": "/profile/Shilpee-Shrivastava"
                },
                {
                    "user_id": "Tusar Tirtha Saha",
                    "user_href": "/profile/Tusar-Tirtha-Saha"
                },
                {
                    "user_id": "Praveen Surapaneni",
                    "user_href": "/profile/Praveen-Surapaneni-3"
                },
                {
                    "user_id": "Satvik Balusu",
                    "user_href": "/profile/Satvik-Balusu"
                },
                {
                    "user_id": "Simranpreet Kaur",
                    "user_href": "/profile/Simranpreet-Kaur-95"
                },
                {
                    "user_id": "Vijayakumar Solaiselvam",
                    "user_href": "/profile/Vijayakumar-Solaiselvam"
                },
                {
                    "user_id": "Sharath Chandra",
                    "user_href": "/profile/Sharath-Chandra-247"
                },
                {
                    "user_id": "Himanshu Singh",
                    "user_href": "/profile/Himanshu-Singh-2359"
                },
                {
                    "user_id": "Gaurav Kumar",
                    "user_href": "/profile/Gaurav-Kumar-5054"
                },
                {
                    "user_id": "Arpit Kushwaha",
                    "user_href": "/profile/Arpit-Kushwaha-2"
                },
                {
                    "user_id": "Patri Babu",
                    "user_href": "/profile/Patri-Babu"
                },
                {
                    "user_id": "Hardek Ailawadi",
                    "user_href": "/profile/Hardek-Ailawadi"
                },
                {
                    "user_id": "Francis Xavier",
                    "user_href": "/profile/Francis-Xavier-60"
                },
                {
                    "user_id": "Maneet Jha",
                    "user_href": "/profile/Maneet-Jha"
                },
                {
                    "user_id": "Meg",
                    "user_href": "/profile/Meg-476"
                },
                {
                    "user_id": "Harishankar H",
                    "user_href": "/profile/Harishankar-H"
                },
                {
                    "user_id": "Siddharth Chatterjee",
                    "user_href": "/profile/Siddharth-Chatterjee-14"
                },
                {
                    "user_id": "Vishal Ved",
                    "user_href": "/profile/Vishal-Ved-2"
                },
                {
                    "user_id": "Charisma Balina",
                    "user_href": "/profile/Charisma-Balina"
                },
                {
                    "user_id": "Shreyas Shivanikar",
                    "user_href": "/profile/Shreyas-Shivanikar"
                },
                {
                    "user_id": "Krishna Krish",
                    "user_href": "/profile/Krishna-Krish-222"
                },
                {
                    "user_id": "Anonymously",
                    "user_href": "/profile/Anonymously-104"
                },
                {
                    "user_id": "Ajay Sugandh",
                    "user_href": "/profile/Ajay-Sugandh"
                },
                {
                    "user_id": "Yogesh Ravi",
                    "user_href": "/profile/Yogesh-Ravi-10"
                },
                {
                    "user_id": "Saksham Singh",
                    "user_href": "/profile/Saksham-Singh-193"
                },
                {
                    "user_id": "Jayant Ch",
                    "user_href": "/profile/Jayant-Ch-1"
                },
                {
                    "user_id": "Krishna Harshith",
                    "user_href": "/profile/Krishna-Harshith"
                },
                {
                    "user_id": "Sahil Sanil",
                    "user_href": "/profile/Sahil-Sanil"
                },
                {
                    "user_id": "Simran Dhodi",
                    "user_href": "/profile/Simran-Dhodi"
                },
                {
                    "user_id": "Yogita Mutyala",
                    "user_href": "/profile/Yogita-Mutyala"
                },
                {
                    "user_id": "Adhiraj Bhagawati",
                    "user_href": "/profile/Adhiraj-Bhagawati"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Nithin-200"
                },
                {
                    "user_id": "Meena Bhatt",
                    "user_href": "/profile/Meena-Bhatt-12"
                },
                {
                    "user_id": "Rohit Kumar",
                    "user_href": "/profile/Rohit-Kumar-1573"
                },
                {
                    "user_id": "Yeshu Singh",
                    "user_href": "/profile/Yeshu-Singh-6"
                },
                {
                    "user_id": "Sarveshu Singh",
                    "user_href": "/profile/Sarveshu-Singh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amina Baba - Adam",
                "href": "/profile/Amina-Baba-Adam"
            },
            "answer_text": "Being fully aware that this question in particular would best be answered pictorially, nonetheless, as a foreign student currently pursuing my B.Tech degree at the university under question, I would indisputably give this campus a 5 star rating. Why.., one may ask? As a part of this ever growing Institution, I saw this university as it was back in September 2017, when I arrived from my home country with my other colleagues and I , starting as the very first batch of SRM AP University. Yes, please bear in mind that it's barely a year since it started functioning as a fully fledged University on it's own. Thus I can proudly say that the future of the campus in terms of infrastructure, accolades, alumni, resources and management in General is bright indeed! ...judging from what has been done and achieved so far! Coming to the present, this Campus can currently boast of the following: •A well functional Library which is frequently equipped with the necessary learning materials to facilitate our maximum learning experience. •A clean and ever improving mess facility which caters for our breakfast, lunch and dinner as well as snack time. •A well functional gym facility provided for each hostel, boys and girls. • State of the art laboratories which houses all necessary equipment for a true engineering exposure, as pertaining to each field, i. e, ECE, CSE , Mechanical, etc. •Well structured classrooms which are fully air conditioned. Each class room has an electronic Tv-like device with a broad screen for projecting class presentations and enhancing note taking as well as the traditional white boards for writing. •The school can also boast of modern washroom facilities that are cleaned and maintained on an hourly basis, if I'm not wrong. The cleaners are almost always cleaning something! •Last to mention but not least, SRM AP University Campus has one on of the neatest and well structured student rooms ever! Aesthetic wise,  and well suited for learning after school hours. Plus running pipe water is also always available for domestic purposes. Not to forget the university enabled Wi-Fi that works 24/7, anytime, anywhere, provided you're within the university's premises. With these and many others in the pipeline, I believe the ranking I gave this university is more than justified! ",
            "date": "Answered April 18, 2018",
            "views": "10",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "A Rahul",
                    "user_href": "/profile/A-Rahul-5"
                },
                {
                    "user_id": "Rithik Raghuveeran",
                    "user_href": "/profile/Rithik-Raghuveeran"
                },
                {
                    "user_id": "Tusar Tirtha Saha",
                    "user_href": "/profile/Tusar-Tirtha-Saha"
                },
                {
                    "user_id": "Arpit Kushwaha",
                    "user_href": "/profile/Arpit-Kushwaha-2"
                },
                {
                    "user_id": "Sharath Chandra",
                    "user_href": "/profile/Sharath-Chandra-247"
                },
                {
                    "user_id": "Nishchal Kaushal",
                    "user_href": "/profile/Nishchal-Kaushal"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Anony-Mous-606"
                },
                {
                    "user_id": "Satyam Pandey",
                    "user_href": "/profile/Satyam-Pandey-55"
                },
                {
                    "user_id": "Pasumarthi Sekhar",
                    "user_href": "/profile/Pasumarthi-Sekhar"
                },
                {
                    "user_id": "Meena",
                    "user_href": "/profile/Meena-232"
                },
                {
                    "user_id": "Kshtij Sharma",
                    "user_href": "/profile/Kshtij-Sharma"
                },
                {
                    "user_id": "Subhadeep Bhatta",
                    "user_href": "/profile/Subhadeep-Bhatta"
                },
                {
                    "user_id": "Apoorva Nandigama",
                    "user_href": "/profile/Apoorva-Nandigama"
                },
                {
                    "user_id": "Maneet Jha",
                    "user_href": "/profile/Maneet-Jha"
                },
                {
                    "user_id": "Mehul Pradhan",
                    "user_href": "/profile/Mehul-Pradhan-2"
                },
                {
                    "user_id": "Ajay Sugandh",
                    "user_href": "/profile/Ajay-Sugandh"
                },
                {
                    "user_id": "Rajesh Patel",
                    "user_href": "/profile/Rajesh-Patel-287"
                },
                {
                    "user_id": "Sai Teja Guduru",
                    "user_href": "/profile/Sai-Teja-Guduru"
                },
                {
                    "user_id": "Celeb Assassin",
                    "user_href": "/profile/Celeb-Assassin"
                },
                {
                    "user_id": "Meena Bhatt",
                    "user_href": "/profile/Meena-Bhatt-12"
                },
                {
                    "user_id": "Rohit Kumar",
                    "user_href": "/profile/Rohit-Kumar-1573"
                },
                {
                    "user_id": "Sarveshu Singh",
                    "user_href": "/profile/Sarveshu-Singh"
                },
                {
                    "user_id": "MC Bhatnagar",
                    "user_href": "/profile/MC-Bhatnagar"
                },
                {
                    "user_id": "Katta Thripura",
                    "user_href": "/profile/Katta-Thripura"
                },
                {
                    "user_id": "Arundhati Bandopadhyaya",
                    "user_href": "/profile/Arundhati-Bandopadhyaya"
                },
                {
                    "user_id": "Surekha Shankar",
                    "user_href": "/profile/Surekha-Shankar"
                },
                {
                    "user_id": "Mainak Chakraborty",
                    "user_href": "/profile/Mainak-Chakraborty-42"
                },
                {
                    "user_id": "Raj Kumar Singh",
                    "user_href": "/profile/Raj-Kumar-Singh-167"
                },
                {
                    "user_id": "Neelima Kamuju",
                    "user_href": "/profile/Neelima-Kamuju"
                },
                {
                    "user_id": "Deboparna Banerjee",
                    "user_href": "/profile/Deboparna-Banerjee"
                },
                {
                    "user_id": "Simran Dhodi",
                    "user_href": "/profile/Simran-Dhodi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aayusi Biswas",
                "href": "/profile/Aayusi-Biswas"
            },
            "answer_text": "As a student of SRM AMRAVATI and having spent a semester abroad in the University of California Berkeley, I guess I'm at a position to answer your question well. Infrastructure : Amaravati is now a full fledged campus with a capacity to accomodate 2500 students. The hostels are great with both AC and non AC accommodations available. The rooms are spacious and homely (twin sharing).Academic block: It has state of the art infrastructure. ( I must add that I love the chairs they have for students, comfy, mobile and cool). Classrooms are hi-tech with wifi, screens and other necessary tech.Facilities: Apart from a nice mess, they have a retail facility and a little cafe. They are adding an ATM, pharmacy and other facilities as well.Academic clubs and societies keep students engaged day long. And the wifi is amazing ( love the speed).Check out this page for more details. Infrastructure - SRM University, AP - Amaravati Apart from all this, the course used is based on the MITX material, which is really cool. Experiencing the usual Indian methodology of teaching and then the methods used in UCB, SRM AMRAVATI is the best which is an interdisciplinary (in between the two ). ",
            "date": "Answered April 20, 2018",
            "views": "72",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Camila Peck",
                    "user_href": "/profile/Camila-Peck"
                },
                {
                    "user_id": "Sruthi Vishnubhatla",
                    "user_href": "/profile/Sruthi-Vishnubhatla"
                },
                {
                    "user_id": "Felix Thomas",
                    "user_href": "/profile/Felix-Thomas-52"
                },
                {
                    "user_id": "Avinash Parsai",
                    "user_href": "/profile/Avinash-Parsai-1"
                },
                {
                    "user_id": "Arpit Kushwaha",
                    "user_href": "/profile/Arpit-Kushwaha-2"
                },
                {
                    "user_id": "Mohan Mutyala",
                    "user_href": "/profile/Mohan-Mutyala"
                },
                {
                    "user_id": "Chanchal Matania",
                    "user_href": "/profile/Chanchal-Matania"
                },
                {
                    "user_id": "Pranathi Paruchuri",
                    "user_href": "/profile/Pranathi-Paruchuri"
                },
                {
                    "user_id": "Ajay Sugandh",
                    "user_href": "/profile/Ajay-Sugandh"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Nithin-200"
                },
                {
                    "user_id": "Kirankumar Bellamkonda",
                    "user_href": "/profile/Kirankumar-Bellamkonda"
                },
                {
                    "user_id": "Rishu Kumar",
                    "user_href": "/profile/Rishu-Kumar-164"
                },
                {
                    "user_id": "Koushik Bhargav Muthe",
                    "user_href": "/profile/Koushik-Bhargav-Muthe"
                },
                {
                    "user_id": "Rohith Kattamuri",
                    "user_href": "/profile/Rohith-Kattamuri"
                },
                {
                    "user_id": "Rishvanth Katragadda",
                    "user_href": "/profile/Rishvanth-Katragadda"
                },
                {
                    "user_id": "Milind Sathe",
                    "user_href": "/profile/Milind-Sathe-2"
                },
                {
                    "user_id": "Shubham Rao",
                    "user_href": "/profile/Shubham-Rao-5"
                },
                {
                    "user_id": "Srishti Saxena",
                    "user_href": "/profile/Srishti-Saxena-25"
                },
                {
                    "user_id": "Aayusi Biswas",
                    "user_href": "/profile/Aayusi-Biswas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarani Bhattacharya",
                "href": "/profile/Sarani-Bhattacharya-2"
            },
            "answer_text": "I was a student of SRM University ktr campus and I can tell you that, if opportunity given, try to join ktr campus or if you are planning on GRE, then try to join a govt college as it will save you a lot of money for your higher studies in the future. SRM guarantees 100% placement but only in MASS recruiters like cts, tcs,infy, Wipro , etc. If you will take up cse, then many good companies will come. Otherwise, it's better to prefer another college over SRM ",
            "date": "Answered July 6, 2017",
            "views": "103",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tusar Tirtha Saha",
                    "user_href": "/profile/Tusar-Tirtha-Saha"
                },
                {
                    "user_id": "Praveen Surapaneni",
                    "user_href": "/profile/Praveen-Surapaneni-3"
                },
                {
                    "user_id": "Avinash Parsai",
                    "user_href": "/profile/Avinash-Parsai-1"
                },
                {
                    "user_id": "Arpit Kushwaha",
                    "user_href": "/profile/Arpit-Kushwaha-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashutosh Singh",
                "href": "/profile/Ashutosh-Singh-1577"
            },
            "answer_text": "If it's come to answer in one word it's marvelous. But why u should believe me because i gona give u logical answer that why srm university is marvelous. First the line up of faculty and all faculty had doctorate in respective field. Second the ground breaking Infrastructure which is designed by foreign firms by keeping in mind green srm slogan.campus have 60% of greenery. World class of hostels having all indoor and outdoor games. ",
            "date": "Answered April 2, 2019",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Praveen David",
                "href": "/profile/Praveen-David-12"
            },
            "answer_text": "SRM-KTR campus is great, but the campus coming up at Amaravati is bigger and better in every way. It is being well-planned/well-designed from the start. Looks like SRM management want to take SRM brand to the next level thru SRM-A. ",
            "date": "Answered August 25, 2017",
            "views": "564",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pritam",
                "href": "/profile/Pritam-110"
            },
            "answer_text": "First of all it's a new campus but it won't be that cool as the other campus like ktr,Rmp,vdp etc.. other are already going on and the new opened will be the first batch,less population !! ",
            "date": "Answered February 15, 2018",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anubhav Saha",
                "href": "/profile/Anubhav-Saha-11"
            },
            "answer_text": "As far…..as I know it's under construction till nw…and many facilities are missing…so at this tym it will not be a wise to take admission there ",
            "date": "Answered April 15, 2018",
            "views": "29",
            "upvotes": " Answer requested by Amit Biswas and Quora User",
            "upvoters": [
                {
                    "user_id": "Harshit Vatsa",
                    "user_href": "/profile/Harshit-Vatsa-2"
                },
                {
                    "user_id": "Anya Kamenetz",
                    "user_href": "/profile/Anya-Kamenetz"
                },
                {
                    "user_id": "Avinash Parsai",
                    "user_href": "/profile/Avinash-Parsai-1"
                },
                {
                    "user_id": "Arpit Kushwaha",
                    "user_href": "/profile/Arpit-Kushwaha-2"
                },
                {
                    "user_id": "Deepak Sharma",
                    "user_href": "/profile/Deepak-Sharma-8124"
                },
                {
                    "user_id": "Sunrays Neha",
                    "user_href": "/profile/Sunrays-Neha"
                },
                {
                    "user_id": "Jaswitha Reddy Guntaka",
                    "user_href": "/profile/Jaswitha-Reddy-Guntaka"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Nithin-200"
                },
                {
                    "user_id": "Kirankumar Bellamkonda",
                    "user_href": "/profile/Kirankumar-Bellamkonda"
                },
                {
                    "user_id": "Manoj Varma",
                    "user_href": "/profile/Manoj-Varma-80"
                },
                {
                    "user_id": "Saiprasanth Vadlamudi",
                    "user_href": "/profile/Saiprasanth-Vadlamudi"
                },
                {
                    "user_id": "Rishu Kumar",
                    "user_href": "/profile/Rishu-Kumar-164"
                },
                {
                    "user_id": "Diyanesh Rohan",
                    "user_href": "/profile/Diyanesh-Rohan-1"
                },
                {
                    "user_id": "Koushik Bhargav Muthe",
                    "user_href": "/profile/Koushik-Bhargav-Muthe"
                },
                {
                    "user_id": "Rohith Kattamuri",
                    "user_href": "/profile/Rohith-Kattamuri"
                },
                {
                    "user_id": "Rishvanth Katragadda",
                    "user_href": "/profile/Rishvanth-Katragadda"
                },
                {
                    "user_id": "Pranav TC",
                    "user_href": "/profile/Pranav-TC"
                },
                {
                    "user_id": "Shubham Rao",
                    "user_href": "/profile/Shubham-Rao-5"
                },
                {
                    "user_id": "Sanjay Gupta",
                    "user_href": "/profile/Sanjay-Gupta-1299"
                },
                {
                    "user_id": "Amina Baba - Adam",
                    "user_href": "/profile/Amina-Baba-Adam"
                }
            ]
        }
    ]
}