{
    "title": "How do we take admission in Kendriya Vidyalaya to class 11? - Quora",
    "tags": [
        "Kendriya Vidyalaya",
        "College and University Admissions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tarun Kaushik",
                "href": "/profile/Tarun-Kaushik-39"
            },
            "answer_text": "Fresh admissions would be made after accommodating all the eligible students of the same KV in the entitled stream and thereafter other KVs. Fresh admission for remaining vacancies would be made in order of merit in the sequence of categories of priority on the basis of the board results of class X. There would be no fresh admission in class XI over and above the class strength. Admissions in different streams for children seeking admission from KVs & non-KVs would be made on fulfillment of the following requirements: The cut off Grade and CGPA for admissions in Science, Commerce & Humanities streams would be as under: i. Science Stream (i) Science with Mathematics (a) A Minimum of B1 GRADE in Maths (b) A Minimum of B1 GRADE in Science (c) Average Grade point in Maths & Science taken together must be 8.5 (d) A Minimum of 8.0 CGPA (ii) Science without Maths Science without mathematics may be allowed if the student has secured B1 GRADE in Science with at least 8.0 CGPA ii. Commerce Stream. (a) A minimum of 5.4 CGPA (b) Mathematics can be offered with Commerce if the student has obtained a minimum of B1 GRADE in Mathematics. iii. Humanities Stream All students of Kendriya Vidyalayas if they are declared successful by the CBSE would be given admission. However, Humanities with mathematics can be offered if at least B1 GRADE is obtained in Mathematics. (Sometimes the minimum grade or cut off is lowered if seats are vacant.) ",
            "date": "Answered May 17, 2018",
            "views": "25",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shivi Mishra",
                    "user_href": "/profile/Shivi-Mishra-53"
                },
                {
                    "user_id": "Anushka Deshpande",
                    "user_href": "/profile/Anushka-Deshpande-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aman Kumar",
                "href": "/profile/Aman-Kumar-2356"
            },
            "answer_text": "Kendriya vidyalaya with huge campus and adorable facilities lie among the list of top public schools. Admission for new students get started from month of April. For class 1 and 11 , you will have to wait for June. Applications for are available on KV sangathan site. You should be the kid of any central or state service man. You should have good marks ( is important for good kvs) . Fill applications on time, be positive and try to fill form for good kvs near you. You can apply for more than one kvs at a time. ",
            "date": "Answered October 9, 2017",
            "views": "969",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Soham Verma",
                    "user_href": "/profile/Soham-Verma-7"
                },
                {
                    "user_id": "SHUBHANGI Singh",
                    "user_href": "/profile/SHUBHANGI-Singh-406"
                },
                {
                    "user_id": "Ashish Sharma",
                    "user_href": "/profile/Ashish-Sharma-8183"
                },
                {
                    "user_id": "Percy Stark",
                    "user_href": "/profile/Percy-Stark-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajendra Singh Rawat",
                "href": "/profile/Rajendra-Singh-Rawat-21"
            },
            "answer_text": "As. Per general rules The school was established. For the purpose of children of transferable central Govt employees.ss they have to transfer thier school now and then .they have same coriculam through out the country. If your father is a central Govt employee it's better and easy to get through however your marks to a particular course will be important. If seats are available and you are a locally placed you may get through necessary percent of marks to particular course . however if there are more candidate s for a fees seats the Father last transfers in c govt job decide the eligibility.normally Armed force. People get it easy ly ",
            "date": "Answered May 16, 2018",
            "views": "523",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rekha Sharma",
                "href": "/profile/Rekha-Sharma-1262"
            },
            "answer_text": "After the result of class ten is out, admission nd stream absolutely depends upon on your percentage as per kvs norms read it is different for non kv Students, secondly first choice in any stream is kv Students then if any seat in any of the stream left out, you may get admission fulfilling the criteria nd based on the permission from Principal ",
            "date": "Answered October 13, 2018",
            "views": "439",
            "upvotes": " Answer requested by Jagneswar Kalita"
        },
        {
            "author_info": {
                "name": "Pushpender Yadav",
                "href": "/profile/Pushpender-Yadav-40"
            },
            "answer_text": "class 11 admission for kvs are taken on the bases of merit in your class 10 if you are thinking of going into a kv then you must get good results in your class 10 cbse board this year. it must be above 80% then you are eligible for kv i hope you got your answer. ",
            "date": "Answered October 9, 2018",
            "views": "352",
            "upvotes": "0"
        }
    ]
}