{
    "title": "How to make a Gmail account anonymously - Quora",
    "tags": [
        "Email Service Providers",
        "Gmail",
        "Computer Hacking (security)",
        "Email",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mary Dingman",
                "href": "/profile/Mary-Dingman-4"
            },
            "answer_text": "How to Create an Anonymous Email Want to send anonymous emails, but don’t really know how or why? Luckily, we’re here to help!  Every day we use email to communicate with our colleagues, friends, and family. Usually, we never give privacy a second thought when writing out a quick email. But, there are times when sending an email anonymously is an absolute necessity. If the information got out it would be compromising, embarrassing, or even dangerous. Chances are, you don’t need to send 100% of your emails anonymously, but when the need arises you’ll want to know how to do it. Below you’ll learn what anonymous email is and how it works, so you can start sending your own anonymous emails. Table of contents What is Anonymous EmailHow Anonymous Email WorksAnonymous Email vs Regular EmailHow Much Does it CostHow to Create Anonymous Email AccountHow to Send Anonymous EmailOther Free AlternativesTransitioning From Current Email to Private EmailCan You Use Outlook for Anonymous Email?In ClosingWhat is Anonymous Email? In our digital world, almost every facet of our lives is out in the open. Unless you take the extra steps to protect and defend your privacy. Email is something we use every single day. We spend hours in our inboxes and often share personal information we want to keep private.  An anonymous email account is a must-have for situations like: Journalists who need to communicate privately with a sourcePeople who are concerned about privacy and feel the need to go anonymousTelling the truth, or whistleblowing, without a connection to your identityAnonymous email gives you the ability to send an email that can’t trace back to you. It won’t contain any personal identifying information. There are multiple methods of achieving this: Sending emails through a proxy server, so your location is invisible.Omitting personal information, like the identity of the user, the reply address, or the message time stampUsing fake contact information when creating a general email account to mask your identityStill, anonymous email accounts can be used for less than upstanding purposes. Like a hacker using an anonymous email address to send a malicious email containing a virus.  These emails will contain a link that’ll install a virus or malware on the user’s computer to gain sensitive information. I know you won’t do this, but there can be some negative associations built into anonymous emailing. ",
            "date": "Answered May 18, 2019",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kahn Bissau",
                "href": "/profile/Kahn-Bissau-2"
            },
            "answer_text": "Before I say anything else, it’s important to clearly state that your anonymity entirely depends on your opsec. If you follow the tips I provide here but then have poor opsec, you won’t be anonymous. It’s important to learn about opsec and related subjects before even considering yourself “anonymous”. That being said, here are a few simple tips. Use Tor - it’s one of the best tools you can use to encrypt and anonymize your connection. You could theoretically use an alternative like I2P and be just as safe, but since we’re talking about email, you probably wouldn’t be able to use I2P anyway.Don’t allow JavaScript - You can conveniently do this in the Tor Browser by setting the security bar to “safest” which would disable JavaScript. This will limit which email providers you can sign up for, but if anonymity is a concern you probably can’t risk running JavaScript. If you absolutely have to use JavaScript for a good reason, like for encrypted webmail for example, then I’d at least sandbox Tor Browser to mitigate any damage that could be done. In said scenario, keep your security settings on “Safest” and allow your providers domain in NoScript.Use a secure & anonymous operating system - In short, use Tails or Qubes + Whonix. They’re two of the best options. Using Whonix on another host operating system could also work, you’d just probably be less secure.Don’t provide identifiable information - This doesn’t just include the obvious like providing your name and such, but it includes your browser fingerprint and anything else that could identify you. Using the Tor Browser would help with the fingerprinting problem, but you also have to be careful with other identifiers such as how you type or how you use their website. Don’t type in your browser, copy and paste from a text editor, and don't stand out with your usage if possible. This also ties in to your opsec which I mentioned before.Use encryption - Encrypt your emails with PGP to prevent your provider from reading your emails and further identifying you with whatever information they can scrape together from them.Use a good provider - This should also be obvious but it has to be said. Don’t bother trying to be “anonymous” in Gmail, it just won’t happen. Use a reputable no logs provider which you can trust. And by trust I mean the bare minimum of trust, no matter which provider you chose, you should ultimately never trust them.",
            "date": "Answered February 20, 2020",
            "views": "16",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ray Tayek",
                    "user_href": "/profile/Ray-Tayek-1"
                },
                {
                    "user_id": "Dustin Murphy",
                    "user_href": "/profile/Dustin-Murphy-43"
                },
                {
                    "user_id": "Jon Litch",
                    "user_href": "/profile/Jon-Litch"
                },
                {
                    "user_id": "Neha Joshi",
                    "user_href": "/profile/Neha-Joshi-411"
                }
            ]
        }
    ]
}