{
    "title": "How to get broadband connection - Quora",
    "tags": [
        "Mobile Broadband",
        "Internet Connection",
        "Broadband"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Tenbrink",
                "href": "/profile/Steve-Tenbrink"
            },
            "answer_text": "Depending on where you live you should find out what the various ISPs will support and how you define “broadband”. Years ago broadband meant anything over 1 megabit/sec. Today it can mean anything from 10 to over 100 megabits/sec. So check with your various ISP and see which one provide the speeds you think you need. A side note: I was at a persons house last week helping them with some network problems. This person mostly just surfs the web, does email, and watches streaming video like Netflix. Normally a data rate of about 10 megabits/sec is all this person would ever need but I tested hers and found out it was 120 megabits/sec. ..way more than 10 times what she needed. This was a separate account and not and institutional connection. Lesson to take from this: only get what you need and don’t pay the extra $$ for rates you will never use. ",
            "date": "Answered December 20, 2017",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeyapaul Paul",
                "href": "/profile/Jeyapaul-Paul-4"
            },
            "answer_text": "Dear sir, To get BSNL Broadband connection on local copper cable, go to the nearest Customer service center or telephone exchange and give an application in the prescribed format along with address proof for identity card like Aadhaar card. If your locality is feasible, they will ask you to pay the deposit and make arrangements to provide the connection. In case, if you are not able to go to the BSNL office, contact the JTO or SDE concerned of your area over phone and tell your address and contact number. They will send a person along with the application form and in turn he will do the needful. If you want a BSNL FTTH connection, you can follow the above procedure or book the request ‘ON LINE’ as per the video in the following link. Remaining things will be taken care of by BSNL. http://youtu.be/vuap1XXQaaQ For BB from private operators contact their local dealer / agent. Thank you very much ",
            "date": "Answered June 7, 2020",
            "views": "25",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "MOVIE STAR",
                    "user_href": "/profile/MOVIE-STAR-44"
                },
                {
                    "user_id": "Scarlet Flurr",
                    "user_href": "/profile/Scarlet-Flurr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gaurav Bhavsar",
                "href": "/profile/Gaurav-Bhavsar-16"
            },
            "answer_text": "contact any broadband services. Ask them if they provide service at the location where you want your connection to work. Every area has companies working as broadband connection provider. If there isn’t one, you must rely on some wifi provider or mobile internet provider. If they haven’t provided connection there yet and you still want connection on that area, they charge you specially for planting wired cables at that area. That is roughly twice or thrice the original price. ",
            "date": "Answered December 2, 2018",
            "views": "806",
            "upvotes": " Answer requested by Himani Naik"
        },
        {
            "author_info": {
                "name": "Mohd. Arshad",
                "href": "/profile/Mohd-Arshad-286"
            },
            "answer_text": "First check the available providers in your area. Then ask them is your home/office is feasible or not. After that search and look the customer reviews of that Internet service provider that will help to choose a better and cheap ISP. And you can then choose the plan according to your uses. And My suggestion is never opt tikona as it is the worst ISP i have ever encountered with. All the best ",
            "date": "Answered August 10, 2019",
            "views": "579",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manthan Lal",
                "href": "/profile/Manthan-Lal"
            },
            "answer_text": "Its simple, find a nearby broadband service provider in your city or get a toll free no. from the internet, from which internet provider you want to use and there you go. . . Enjoy your internet connection. :-P ",
            "date": "Answered November 30, 2018",
            "views": "293",
            "upvotes": "0"
        }
    ]
}