{
    "title": "How many short-term course certificates are equivalent to a degree? - Quora",
    "tags": [
        "Short Term Courses",
        "Certifications",
        "Educational Courses"
    ],
    "response": [
        {
            "author_info": {
                "name": "Twinkle Verma",
                "href": "/profile/Twinkle-Verma-5"
            },
            "answer_text": "Well, When it comes to success there are no shortcuts. Here it’s the same! Avoid shortcut of doing short courses in comparison to degree courses. This is required to get some good positio in life. If you are looking for short term courses in the place of doing some degree course, you are going wrong somewhere. You definitely need to have a degree instead of certificates or LOAs of the short term courses. You can do a short term course parallel to your degree course that can be beneficial. But not doing a degree course might land you in a problem. There might be a situation where you can be placed due to certification in some course but the eligibility criteria would definitely require you to be some degree holder ( B.Tech , B.Com, BE, BCA etc.). Degree would be the first step to show your qualification and that would make you eligible to get any good job in your field. All the best! :) ",
            "date": "Answered September 10, 2017",
            "views": "864",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Twinkle Verma",
                    "user_href": "/profile/Twinkle-Verma-8"
                },
                {
                    "user_id": "Shīväm Vërmâ",
                    "user_href": "/profile/Shīväm-Vërmâ"
                },
                {
                    "user_id": "Namit Goyal",
                    "user_href": "/profile/Namit-Goyal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Solank Chakraborty",
                "href": "/profile/Solank-Chakraborty-1"
            },
            "answer_text": "MY DEAR FRIEND. i ’d give you a very honest review. i’ve completed a certificate course securing the highest in our batch. Presently also i been doing a the same. as far as the validation of short-term course is concerned, i would strongly suggest you not to replace your graduation course with certiicate or diploma holder because that would amount to 12 or post matric pass. and you’ve to have apply for only 12th pass jobs so why to axe your own feet. do your graduation as best marks as you can secure. You’ve ample time to devote for short-term courses. MORAL OF THE STORY : NO SHORT-TERM COURSE IS TANTAMOUNT TO GRADUATION DO UPVOTE IF YOU FEEL SATISFIESD GOOD LUCK REGARDS —- C.SOLANK ",
            "date": "Answered September 6, 2017",
            "views": "442",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ankita Dutta",
                    "user_href": "/profile/Ankita-Dutta-52"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vismay Kansara",
                "href": "/profile/Vismay-Kansara-1"
            },
            "answer_text": "There is no number to relate to. It solely depends on what you do in your short term course that depends. Focus on one domain and make it perfect. All the best!!! ",
            "date": "Answered September 3, 2017",
            "views": "208",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nikhil Kumar",
                "href": "/profile/Nikhil-Kumar-5054"
            },
            "answer_text": "No short term course is equivalent to degree. ",
            "date": "Answered September 6, 2017",
            "views": "137",
            "upvotes": "0"
        }
    ]
}