{
    "title": "How to force myself to go to bed early - Quora",
    "tags": [
        "Tips and Hacks for Everyday Life",
        "Sleep Habits",
        "Sleep",
        "Health",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erik Ågren",
                "href": "/profile/Erik-Ågren"
            },
            "answer_text": "You may be exhausted because of different reason, most likely due to your inability to get enough sleep. To fall asleep faster, it’s recommended to relax for about an hour before bedtime. This means that you should avoid any stimulus such as technology. It may be a cliche, but you could try reading a book before you go to sleep. Other options may be to listen to some calm music. There are plenty of options at YouTube for example. Watching TV or sitting in front of the computer, will only stimulate your brain and make it harder to wind down. This means that it’ll take longer for you to fall asleep. If you still have issues falling asleep even when following the advice above or similar, then it might be due to an excess of energy. To release energy, so to speak, you need to remain physically active during at least one period of the day. Perhaps go for a walk, run or take a swim during the day. If this is not an option during daytime, you can do this a while before bedtime. Choose what works best for you. I personally recommend swimming since it’s easy on the body and you tire fast. Swimming is the recommended option IMO if you have joint issues or trouble walking for long periods of time due to being overweight. As always, it’s important to eat regularly and avoid stimulants here as well. It might be a no-brainer, but don’t consume products containing caffeine. This includes the obvious coffee as well as tea. Eating before bedtime may affect your sleep as well. Alcohol may work to fall asleep quicker, but it will affect your REM sleep. If nothing else work, consult with your doctor for other alternatives such as sleeping pills. Though this should only be used as a last resort. Most of the time, sleeping issues can be resolved by following the above suggestions. Another useful tip if you have a lot of thoughts and they keep you up, is to simply write them down. This helps getting those thoughts out and it’s a proven method. This may or may not work for you, but it’s definitely worth trying. The recommended sleep is about 8–9 hours, but the human body can do well with 7. I wouldn’t recommend going below that. In the end it’s up to you to see what your body and mind can handle. I don’t know how old you are, but I assume you’re an adult. Then 8–9 hours should work. If you’re a teen, aim for 9 hours. The amount of sleep you need generally increases the younger you are. This is why small children generally sleep longer. If you’re having trouble finding out why you are awake late, simply check what you are doing at that moment. If you’re at the computer and the computer is in your bedroom, then it might be a good idea to move the computer to another room. Same goes for anything else really. This allows you to distance yourself and keep the bedroom exclusively as the place where you rest. Poor self-restraint/control may also be a part of the issue. If you have someone you entrust with reminding you, then ask this person to remind you of your bedtime; ask them to text or call you half an hour before. With this reminder, you should drop everything and start relax and then go to sleep. I know this myself from experience that a lot of things can interrupt your ability to sleep or get to bed in time. Some times it may be because of addiction. In such case, it can be quite hard to admit it to yourself in order to start working on the problem and finding a solution. This is also a cliche, but the first step is always admitting you have a problem. If that’s the case, there are some drastic measure you can take, but talk to a professional about this first. I’m generally not talking about physical addiction such as foods or drugs, but mainly psychological ones. A therapist can help you with these ones. For the other ones, talk to your doctor. I wish you luck and hope my advice is of any help. Cheers! ",
            "date": "Answered March 8, 2017",
            "views": "32",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jenna Rodriguez",
                    "user_href": "/profile/Jenna-Rodriguez-2"
                },
                {
                    "user_id": "Sumathi Sambandan",
                    "user_href": "/profile/Sumathi-Sambandan"
                },
                {
                    "user_id": "DrDalia Mostafa -Sáez",
                    "user_href": "/profile/DrDalia-Mostafa-Sáez"
                },
                {
                    "user_id": "Vivian Kimball",
                    "user_href": "/profile/Vivian-Kimball-1"
                },
                {
                    "user_id": "Mayank Verma",
                    "user_href": "/profile/Mayank-Verma-56"
                },
                {
                    "user_id": "Michael Hsiu",
                    "user_href": "/profile/Michael-Hsiu-1"
                },
                {
                    "user_id": "Ethan La Coursière",
                    "user_href": "/profile/Ethan-La-Coursière"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarah Brown",
                "href": "/profile/Sarah-Brown-23"
            },
            "answer_text": "You first have to ask yourself, what are you spending your evenings doing? You say that you're going to bed around 11 or 12, but it is necessary that you stay up this late? Doing so will make the process of waking up at 5:30 much, much more difficult. I would suggest developing an evening routine. When you come home, make a list, even a mental list, of what you want to get done. Put the top-order items first, and get them out of the way. That way, you won't have anything on your mind that would disturb you as you're trying to go to bed. However, once you finish all your necessary tasks, you can spend your evening having fun! But just remember that now, you have a \"bedtime.\" If you want to wake up at 5:30, your \"bedtime\" is going to have to be 9:30 or 10:00. One suggestion that has been very helpful for me is to read for 30 minutes or an hour before you turn off the lights. Rather than watching television, which can strain your eyes with exposure to the unnatural light at a time when your body is naturally suited for darkness (Is watching TV before bed a bad idea?), open up a good book and lose yourself in it. Just make sure to set a timer to make sure that you don't read past your \"bedtime\" (though 5 minutes or so wouldn't hurt, if you really want to finish the chapter!) Other things that may help you with falling asleep early: Turn on some relaxing music. I find that nature sounds, classical, and either brown or pink noise is best for this. (Rainy Mood / Free Brown Noise / Classical)Make your body warm. It's much harder to fall asleep when you're cold. Wrap yourself up in the sheets and get all snuggly :3Get a sleep mask. It sounds like a simple thing, but it has greatly improved the quality of my sleep. Blocking out all light is the key way to let your body know that it is time to get some serious slumber now. It kind of puts you into a routine. The mask goes on, and you realize, \"Oh, guess it's time for me to black out now. Here we go.\"Take a nice shower about 30 minutes to an hour before turning in to bed.Meditate for a few minutes just before sleeping - this will clear your mind and allow you to slip into a deep sleep much more easily, unperturbed by the worries and thoughts that swim through your head on a daily basis.Do something really really boring. The activity is up to you, but make sure that it's boring enough to rock you into a stupor. (just kidding, this is a last resort!)And if you're still not sleepy, or just not ready to go to bed at this point, it helps to take five minutes sitting in the dark with your eyes closed, repeating to yourself exactly why it is essential that you go to sleep now. Because you need to wake up at 5:30. And you want to be a healthily functioning human being. I'd say that those are pretty good reasons(: Best of luck with your sleeping habits! I really hope you find something that works for you :D ",
            "date": "Answered June 24, 2014",
            "views": "408",
            "upvotes": " View 66 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Evie Sampson",
                    "user_href": "/profile/Evie-Sampson-4"
                },
                {
                    "user_id": "Sumathi Sambandan",
                    "user_href": "/profile/Sumathi-Sambandan"
                },
                {
                    "user_id": "Rin Frid",
                    "user_href": "/profile/Rin-Frid"
                },
                {
                    "user_id": "D. Abd",
                    "user_href": "/profile/D-Abd"
                },
                {
                    "user_id": "Evelyn Waston",
                    "user_href": "/profile/Evelyn-Waston"
                },
                {
                    "user_id": "DrDalia Mostafa -Sáez",
                    "user_href": "/profile/DrDalia-Mostafa-Sáez"
                },
                {
                    "user_id": "Flavia Ouyang",
                    "user_href": "/profile/Flavia-Ouyang-1"
                },
                {
                    "user_id": "Isabel Colmenares",
                    "user_href": "/profile/Isabel-Colmenares-1"
                },
                {
                    "user_id": "Jeanne Ahlers",
                    "user_href": "/profile/Jeanne-Ahlers"
                },
                {
                    "user_id": "Kiran TP",
                    "user_href": "/profile/Kiran-TP-3"
                },
                {
                    "user_id": "Dervil Flanagan",
                    "user_href": "/profile/Dervil-Flanagan"
                },
                {
                    "user_id": "Mark Longhurst",
                    "user_href": "/profile/Mark-Longhurst-3"
                },
                {
                    "user_id": "Safiyyah Franklin",
                    "user_href": "/profile/Safiyyah-Franklin"
                },
                {
                    "user_id": "Lena Zell",
                    "user_href": "/profile/Lena-Zell-1"
                },
                {
                    "user_id": "Raven Sage",
                    "user_href": "/profile/Raven-Sage-3"
                },
                {
                    "user_id": "Maxim Sidko",
                    "user_href": "/profile/Maxim-Sidko"
                },
                {
                    "user_id": "Muhammad A. Musleh",
                    "user_href": "/profile/Muhammad-A-Musleh"
                },
                {
                    "user_id": "Zack Cruz",
                    "user_href": "/profile/Zack-Cruz-11"
                },
                {
                    "user_id": "Shen Hou",
                    "user_href": "/profile/Shen-Hou"
                },
                {
                    "user_id": "laughingtilly",
                    "user_href": "/profile/laughingtilly"
                },
                {
                    "user_id": "Ken Keitel",
                    "user_href": "/profile/Ken-Keitel"
                },
                {
                    "user_id": "Nick Gos",
                    "user_href": "/profile/Nick-Gos"
                },
                {
                    "user_id": "Gowtham Nayak",
                    "user_href": "/profile/Gowtham-Nayak-9"
                },
                {
                    "user_id": "Joshua Sapit",
                    "user_href": "/profile/Joshua-Sapit"
                },
                {
                    "user_id": "Mark Hoguet",
                    "user_href": "/profile/Mark-Hoguet"
                },
                {
                    "user_id": "Daniel Neumann",
                    "user_href": "/profile/Daniel-Neumann-24"
                },
                {
                    "user_id": "Rick Huang",
                    "user_href": "/profile/Rick-Huang-5"
                },
                {
                    "user_id": "Jason Franklin",
                    "user_href": "/profile/Jason-Franklin-57"
                },
                {
                    "user_id": "Ishan Purohit",
                    "user_href": "/profile/Ishan-Purohit-8"
                },
                {
                    "user_id": "Amit Roy",
                    "user_href": "/profile/Amit-Roy-93"
                },
                {
                    "user_id": "Vineetha Rohra",
                    "user_href": "/profile/Vineetha-Rohra"
                },
                {
                    "user_id": "Pritish Karmi",
                    "user_href": "/profile/Pritish-Karmi"
                },
                {
                    "user_id": "Mansi Somani",
                    "user_href": "/profile/Mansi-Somani"
                },
                {
                    "user_id": "Jacob Dale",
                    "user_href": "/profile/Jacob-Dale-5"
                },
                {
                    "user_id": "Mohita Gakhar",
                    "user_href": "/profile/Mohita-Gakhar-1"
                },
                {
                    "user_id": "Bhavini Patel",
                    "user_href": "/profile/Bhavini-Patel-19"
                },
                {
                    "user_id": "Dilip Kushwaha",
                    "user_href": "/profile/Dilip-Kushwaha"
                },
                {
                    "user_id": "Pat Shibe",
                    "user_href": "/profile/Pat-Shibe"
                },
                {
                    "user_id": "Ankur Patel",
                    "user_href": "/profile/Ankur-Patel-150"
                },
                {
                    "user_id": "Niki Chua",
                    "user_href": "/profile/Niki-Chua"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deidre Edwards",
                "href": "/profile/Deidre-Edwards-2"
            },
            "answer_text": "Hah! I am working on this very thing at the moment! Isn't it curious how we easily stray into getting to bed later and later?  My current excuse is that I enjoy being in my husband's company and he is awake the most between 7-11 pm; he sleeps most of the rest of the time. The price of being a caregiver, perhaps. But, you know, I am still in control...the only one of us two who is in control. So, what to do? Our sleep/wake hormones can get way out of whack even to the point that, though we may be walking zombies, there is that \"second wind\" that we get at night. That's the cortisol ramping up to keep us awake! Is there any hope? Yes! Get as much fresh air, sunshine, and exercise as possible during the day. This may mean taking coffee and lunch breaks out doors, walking around the building. The sunshine will help reset the day/night hormone balance, and the exercise sufficiently tires the body. After work, try to do something physical outdoors as well. If not gardening, hiking, or bike riding, take your free weights out back and spend a few minutes pumping a little iron. Switch off the electronics at least an hour before bed and switch to reading a book. When I do this consistently, truly, I start yawning almost as soon as I reach for the book! Talk about Pavlov's dogs! Also being stressed about sleeping hours makes going to bed, falling to sleep, and getting up harder. To address that, I also work on a small section of a coloring project for 5-10 minutes before getting ready for bed! Don't laugh. Applying color to paper brushes out all other thoughts and concerns. In sum, I spent at least an hour outdoors today. The sun was out, the air fresh, and I fully anticipate getting to bed earlier than I did last night. One day at a time. Let's see where this takes us! ",
            "date": "Answered February 18, 2016",
            "views": "79",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "DrDalia Mostafa -Sáez",
                    "user_href": "/profile/DrDalia-Mostafa-Sáez"
                },
                {
                    "user_id": "Amber Mae",
                    "user_href": "/profile/Amber-Mae-6"
                },
                {
                    "user_id": "Chris Petraske",
                    "user_href": "/profile/Chris-Petraske"
                },
                {
                    "user_id": "Barbara Adams",
                    "user_href": "/profile/Barbara-Adams-35"
                },
                {
                    "user_id": "Nathan Gillis",
                    "user_href": "/profile/Nathan-Gillis-1"
                },
                {
                    "user_id": "Tejas Kashyap",
                    "user_href": "/profile/Tejas-Kashyap-1"
                },
                {
                    "user_id": "Jaime Burbidge",
                    "user_href": "/profile/Jaime-Burbidge"
                },
                {
                    "user_id": "Helmi Pöllö",
                    "user_href": "/profile/Helmi-Pöllö-1"
                },
                {
                    "user_id": "Carina Cannizzaro",
                    "user_href": "/profile/Carina-Cannizzaro"
                },
                {
                    "user_id": "Himanshu Khanchandani",
                    "user_href": "/profile/Himanshu-Khanchandani-1"
                },
                {
                    "user_id": "Lionel Neighbour",
                    "user_href": "/profile/Lionel-Neighbour"
                },
                {
                    "user_id": "Avan Gev Aga",
                    "user_href": "/profile/Avan-Gev-Aga"
                }
            ]
        },
        {
            "author_info": {
                "name": "Comfort Beddings",
                "href": "/profile/Comfort-Beddings-1"
            },
            "answer_text": "5 STEPS TO GET YOURSELF TO GO TO BED EARLIER What if there were a precise scientific way to get yourself to go to bed on time, that was also practical enough to implement? Good news! There is. Follow these steps (seriously, all of them) and you’ll be getting to bed earlier before you know it. Step 1: Reduce light exposure before bed. Your retinas serve two purposes -- receiving input necessary for vision, and housing sensors that detect the rise and fall of daylight. Your body uses light to set your internal clock to a 24-hour cycle, regulated largely by the hormone melatonin. Your body produces melatonin at night, which tells your body that it’s time to go to bed. But when your retinas take in light, especially blue light (emitted by energy-efficient light bulbs and most electronic devices) this light suppresses the production of melatonin, messing up your circadian rhythm. Step 2: Make the change gradual. If you’re currently going to bed at 11 pm, don’t decide that tonight you’re going to get to bed by 9 pm. First of all, your internal clock resets at a rate of about one hour per day, and somebody systems may take even longer. But more generally, when you’re making behavioral changes, instead of trying to jump all the way to the finish line right away and then missing, you should aim to take smaller steps to build up to your bigger goal. It’s also important to give your body time to adjust as you start bumping up your bedtime. If you’re not tired enough to fall asleep after 10-15 minutes of tossing and turning, get up and do something else. One core tenet of cognitive-behavioral therapy for insomnia is stimulus control, which aims to associate the bed with sleeping, and not with stimulating behavior (like watching TV). Stimulus control principles advise that you only go to bed when you are tired, limit activities in bed to sleep and sex, and move to another room if you don’t fall asleep within 10 minutes of being in bed Step 3: Set up your environment to avoid objections. One of the biggest reasons we don’t do the things we intend to do is that we don’t plan for them appropriately. First, walk through exactly what your evening will look like in your head. Something like, “I’ll have dinner at 7 pm, then I’ll do a little more work, I’ll watch an episode of this show, brush my teeth, and go to bed by 10 pm.” Great! You’ve got a plan. But… by the time the end of the day rolls around, your attention and ego resources are already depleted, and your willpower may not be strong enough to stick to your plan. So what you’ll need to do before the time comes to put your plan into action is to think through your specific plan, and identify and rehearse potential objections. The idea is to plan around these -- to design your environment to make it less likely that you’ll get distracted and ditch your plan. Think of Ulysses binding himself to the mast in order to resist the temptation of the Sirens’ song. What can you do to resist watching TV tonight? Perhaps hide the remote, or move the TV to another room. Or even set a timer to shut off the TV at a certain time. Step 4: Set reminders for yourself to stick to your plan. Once you’ve mapped out a plan for your evening, you can make it even more actionable by setting reminders for yourself. (Remember the point above about losing track of time?) The idea here is that reminders not only alert you at the moment, but they also help you build tiny habits by creating triggers for certain behaviors. For example, you can decide, “as soon as my alarm goes off, I will cozy up on my couch and press play on Netflix. As soon as the show ends, I will brush my teeth and get into bed.” Creating triggers for each part of your sequence of events will help you succeed with each next intended behavior. Step 5: Make a public commitment. Making a public commitment to getting something done is a great way to create accountability for yourself. Because you don’t want others to see that you have failed to follow through on your commitment, you’ll make it much more likely that you will, in fact, follow through. Studies show that once we make a public commitment, we are more likely to honor it. ",
            "date": "Answered August 22, 2019",
            "views": "125",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steven Ericson",
                "href": "/profile/Steven-Ericson-1"
            },
            "answer_text": "Here is one big, simple tip that is reasonably easy to implement: we are actually more sensitive to artificial light and computer screens than we realize,  so stay completely away from screens and any brightly lit environments for 3 to 4 hours before going to bed. Living in an age of  24/7 artificial lighting interferes with the body's circadian rhythms, which were originally based around natural daylight and darkness.  Being in front of a computer screen for even five minutes is a lot like taking a cup of coffee before bed for many people.  Instead, darken all of the rooms you're in and use dim light sources like candles. Avoid full spectrum UV lights before bed, they're helpful for maintaining your rhythms during the day only. Reading will help you get drowsy, but if you read, read from a book, not a backlit screen. If you want to write or draw, do it on paper only, or use a voice recorder (don't stare at your phone, your phone has a screen with the same stimulating effect). Listening to music is also a helpful way to wind down the day. Drinking water is fine, but avoid sugary drinks and food within two hours of your target bedtime. It also helps to let the people in your life know what you're trying to accomplish so they can help to accommodate you, or at least avoid interfering with your progress. If you do need to cheat and go back on screens before bed you will destroy your progress, but you can minimize the damage by wearing filtered glasses with orange lenses that reduce the amount of light that gets through to your eyes. If you're on a radically different sleeping schedule than the one you want to adjust to it may take 4-10 days before it becomes substantially easier to consistently reach your target. In the meantime you can expect to be tired during your awake hours because your sleep schedule is in a state of flux. ",
            "date": "Answered November 1, 2015",
            "views": "43",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ananya",
                    "user_href": "/profile/Ananya-390"
                },
                {
                    "user_id": "laughingtilly",
                    "user_href": "/profile/laughingtilly"
                },
                {
                    "user_id": "Bianca Lacerda",
                    "user_href": "/profile/Bianca-Lacerda"
                },
                {
                    "user_id": "Mike Huff",
                    "user_href": "/profile/Mike-Huff-9"
                },
                {
                    "user_id": "Jeffrey Yen",
                    "user_href": "/profile/Jeffrey-Yen-2"
                },
                {
                    "user_id": "Bhanu Korremula",
                    "user_href": "/profile/Bhanu-Korremula"
                }
            ]
        },
        {
            "author_info": {
                "name": "Katie Hamre",
                "href": "/profile/Katie-Hamre"
            },
            "answer_text": "There are a few things you can try. Turn off the television, computer, iPad and put down your smartphone after 8pm. Our eyes tell our brains that the light from these devices is daylight, and that it is still daytime. So your brain emits less sleep hormone than it normally would.Take a melatonin supplement 30 minutes before you wish to fall asleep. Melatonin is the natural sleep hormone that your body emits in the late evening. If you aren't producing enough, you can supplement without side effects.Keep a pen and paper next to the bed. Often thoughts like \"I have to remember to do this tomorrow!\" will keep our brains from settling down. Writing down the thing that you don't want to forget will get it off your mind.Try focusing on your breathing to stop the thoughts from racing. Think \"in\" as you breathe in, and \"out\" as you breathe out. Your body will start to relax as your breathing gets deeper.Have your doctor perform some blood work. Often, difficulty sleeping is a symptom of an underlying problem. Make sure everything is working correctly in your body!Sometimes medications can keep you awake. Evaluate any that you are taking and see if that is a side effect.",
            "date": "Updated January 29, 2013",
            "views": "965",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ben Baert",
                    "user_href": "/profile/Ben-Baert"
                },
                {
                    "user_id": "Sanket Patel",
                    "user_href": "/profile/Sanket-Patel-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sara Stone",
                "href": "/profile/Sara-Stone-8"
            },
            "answer_text": "Aim for 8 p.m., that way the part of you that doesn't like to go to bed, get's 90 minutes of defiance time to play around.  Also, give yourself happy thoughts to think about at bedtime.  I've made some new connections in life recently whom I like very much.  One's a fella, one's a nice lady counselor type, one's an old high school friend, and one's a college buddy.  I think about them when I lay my head down.  And I try to ask God, \"What do you want to be in my life right now?\"  and leave some of the details to him.  It gives me some excitement at bedtime... some mystery and anticipation.  It's helpful to be happy at bedtime.  Then I settle in to how good it feels to go to bed.  I also am in a city where pollution is not too bad, so I can keep the patio door open at least a tiny bit, even if it's kind of cold.  That way I can also take a minute to tune into the weather and think about the whole big wide world.  I like knowing the fresh breeze will be blowing gently over me and that that big old Silver Maple will be outside my window when I awaken and so will the various evergreens in the big courtyard and there will be birds too, even when it's really cold.  Now, we all know, including you, how much better we feel if we let go of the day sooner.  Rest when it is time to rest.  When it is time to rest tonight, think: Rest and Peace and Safety and Comfort.  Think those four words and feel how good that sheet feels next to your cheek.  Yum.  Sleepy time. ",
            "date": "Answered February 18, 2016",
            "views": "21",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Molly Mullins",
                    "user_href": "/profile/Molly-Mullins"
                },
                {
                    "user_id": "Zena Higgin",
                    "user_href": "/profile/Zena-Higgin-1"
                },
                {
                    "user_id": "Alexandra Walser",
                    "user_href": "/profile/Alexandra-Walser"
                },
                {
                    "user_id": "Andy Hau",
                    "user_href": "/profile/Andy-Hau-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Esther GU",
                "href": "/profile/Esther-GU"
            },
            "answer_text": "I just overcame severe insomnia two months ago. Looking into that experience, I think it was due to the fact that I cannot go to bed early and I cannot fall in sleep. Here I would like to share on how I push myself to go to bed early. Why do you have difficulties in going to bed early? Here are two reasons I once had. First, the most important one: I was just too nervous to go to bed and I feel I have a lot of things to do. I feel blue at night when I looked backward at what I did today. I usually criticize myself like why I cannot focus on my duties etc. So I would suggest behaving yourself in the day time. Then you won’t have difficulties in going to bed because of guilty. Also, please tell yourself efficiency is the most important scale. You will complete the task better if you get enough sleep. You cannot hide your laziness in strategy with your diligence in enforcing your strategy. It is no use to be touched by “I started till 3 am T^T”. Instead, it is crucial how much you finished actually. Write a to-do list. Choose 3 most significant ones to be your task today, although you may want to finish 10 at one day. By the way, it is useful to complete important tasks which are valuable in the long term. Always chasing by deadlines is not beneficial for yourself. Second, I thought I could not fall into the sleep so I gave up. Even when I was on the bed, mobile devices killed my time. You actually take a rest even if you are not in deep sleep. So I suggest set an alarm and go directly to the bed, regardless if you can fall sleep immediately. For example, if you cannot sleep the whole night, do not be nervous. Get up at a time you wish to get up. DON’T take a nap during the daytime. Then it would be super easy to fall asleep the next day. As for electronic devices, apparently, lights from the screen would damage your sleep. In addition, they are harmful to your sights. So keep them away! Maybe you just need to change the places where you charge your phone. Move it to the corner of the room so that you cannot reach it on the bed. Hope this helps! ",
            "date": "Answered December 22, 2016",
            "views": "826",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jatin Sharma",
                "href": "/profile/Jatin-Sharma-16"
            },
            "answer_text": "Hi, I believe you are asking this question so that you can go bed early and have that 7–8 hours of good baby sleep and try to get up early. It wont happen! PS: You have to discipline yourself:) You really need to work on it! So, Before I answer your question. Let me share you my routine. Get up by 6:30 amMeditate for 30 minsHit the gym to stay fit.Prepare the content for my classes [I have 2 jobs]Go to office by 10:30 am and work till 7:30 pm [I work in IT company]8:30 pm go the class11:00 pm is my dinner12:30 am is the time I sleep.My day is full of hustle and I have not taken a day off. Most of my days are monotonous but I never had a thought of taking a break or running away from it. My energy is still the same because I try to live in the moment consciously. I just live for one day! I really don’t force myself for anything. The reason I had to tell you this is because you are getting distracted with a lot of unnecessary stuffs. Social Media has given us knowledge but it taken away our wisdom. You have prioritize things that don’t matter over things that matter. Example: Texting people late in night.Watching YouTube videos which won’t add value to your time.Thinking about something that happened on the day.Thinking about past and future!Always Remember: Past has gone and there is no future. All we have is this moment right now. Do the things that matter to you! You can sleep for 5 hours and still stay healthy. You can sleep for 9 hours and still stay sick. Remember: Learn to value your time.Learn to meditate.The moment you master it you would not have to force yourself to do anything! Thank you for reading! I hope I was able to give you the clarity to your question. If not shoot me in the comment section. Hope this helps!! If you liked this answer, say hi on: INSTAGRAM || FACEBOOK || QUORA || ",
            "date": "Answered February 14, 2019",
            "views": "38",
            "upvotes": " View 32 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jenna Rodriguez",
                    "user_href": "/profile/Jenna-Rodriguez-2"
                },
                {
                    "user_id": "Bisikwa Hadija",
                    "user_href": "/profile/Bisikwa-Hadija"
                },
                {
                    "user_id": "Devesh Gandhi",
                    "user_href": "/profile/Devesh-Gandhi-3"
                },
                {
                    "user_id": "Rin Frid",
                    "user_href": "/profile/Rin-Frid"
                },
                {
                    "user_id": "Bunmi Asuquo",
                    "user_href": "/profile/Bunmi-Asuquo"
                },
                {
                    "user_id": "Ram Chakravarti",
                    "user_href": "/profile/Ram-Chakravarti"
                },
                {
                    "user_id": "Danial Ali Shah",
                    "user_href": "/profile/Danial-Ali-Shah"
                },
                {
                    "user_id": "Alice Snow",
                    "user_href": "/profile/Alice-Snow-24"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Matt-Z-62"
                },
                {
                    "user_id": "Ravi Kalyanaraman",
                    "user_href": "/profile/Ravi-Kalyanaraman-2"
                },
                {
                    "user_id": "Maryam Malik",
                    "user_href": "/profile/Maryam-Malik-103"
                },
                {
                    "user_id": "DrDalia Mostafa -Sáez",
                    "user_href": "/profile/DrDalia-Mostafa-Sáez"
                },
                {
                    "user_id": "Ravikumar Siddaiah",
                    "user_href": "/profile/Ravikumar-Siddaiah"
                },
                {
                    "user_id": "Kiyara Shah",
                    "user_href": "/profile/Kiyara-Shah-3"
                },
                {
                    "user_id": "Ingrid Anderson",
                    "user_href": "/profile/Ingrid-Anderson-25"
                },
                {
                    "user_id": "Aditya",
                    "user_href": "/profile/Aditya-2210"
                },
                {
                    "user_id": "Monika Bhaware",
                    "user_href": "/profile/Monika-Bhaware"
                },
                {
                    "user_id": "Abhishek Banerjee",
                    "user_href": "/profile/Abhishek-Banerjee-56"
                },
                {
                    "user_id": "Anu S",
                    "user_href": "/profile/Anu-S-6"
                },
                {
                    "user_id": "Manoj Sudhagar",
                    "user_href": "/profile/Manoj-Sudhagar"
                },
                {
                    "user_id": "B.A. Delanda",
                    "user_href": "/profile/B-A-Delanda"
                },
                {
                    "user_id": "Neha N. Ghawalkar",
                    "user_href": "/profile/Neha-N-Ghawalkar"
                },
                {
                    "user_id": "Soumya Mishra",
                    "user_href": "/profile/Soumya-Mishra-219"
                },
                {
                    "user_id": "Prateek Kumar",
                    "user_href": "/profile/Prateek-Kumar-160"
                },
                {
                    "user_id": "Anshul Bhati",
                    "user_href": "/profile/Anshul-Bhati-2"
                },
                {
                    "user_id": "Praveen AK",
                    "user_href": "/profile/Praveen-AK-3"
                },
                {
                    "user_id": "Sumayya Tarannum",
                    "user_href": "/profile/Sumayya-Tarannum-1"
                },
                {
                    "user_id": "Shinu Roy",
                    "user_href": "/profile/Shinu-Roy-2"
                },
                {
                    "user_id": "Bhavya Mandaliya",
                    "user_href": "/profile/Bhavya-Mandaliya"
                },
                {
                    "user_id": "Pushpendra Kumar",
                    "user_href": "/profile/Pushpendra-Kumar-489"
                },
                {
                    "user_id": "Ramachandran Nadar",
                    "user_href": "/profile/Ramachandran-Nadar"
                },
                {
                    "user_id": "Mukesh Tiwari",
                    "user_href": "/profile/Mukesh-Tiwari-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julie Prentice",
                "href": "/profile/Julie-Prentice"
            },
            "answer_text": "This is a tough one! I have trouble sleeping some nights. And stay up late.  However, I forgive myself on these occasions. After all, does it really matter when I sleep?  So long as I receive the amount of sleep I need in any given day? I provide a link to this question for you: How do I get more out of less sleep, i.e. how can I optimize my sleep so that I feel less tired on the nights I sleep less? In terms of myself.... Exercise tires you out. However! Don't exercise at night!!!!!! Exercising right before bed will actually have an adverse effect; you will actually be less sleepy. So, choose a time of day that works for you to get some exercise. Aromatherapy can help...doing meditation can help...and, even, listening to this track can help:   ",
            "date": "Updated January 11, 2014",
            "views": "24",
            "upvotes": " View 36 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rachit Mongia",
                    "user_href": "/profile/Rachit-Mongia"
                },
                {
                    "user_id": "Niwas Udham",
                    "user_href": "/profile/Niwas-Udham"
                },
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                },
                {
                    "user_id": "Aditya Singh",
                    "user_href": "/profile/Aditya-Singh-447"
                },
                {
                    "user_id": "Amy Bowersox",
                    "user_href": "/profile/Amy-Bowersox"
                },
                {
                    "user_id": "Sanjay Vaghamshi",
                    "user_href": "/profile/Sanjay-Vaghamshi"
                },
                {
                    "user_id": "Cyndi Perlman Fink",
                    "user_href": "/profile/Cyndi-Perlman-Fink"
                },
                {
                    "user_id": "Kavya Shree M S",
                    "user_href": "/profile/Kavya-Shree-M-S"
                },
                {
                    "user_id": "Jessica Su",
                    "user_href": "/profile/Jessica-Su"
                },
                {
                    "user_id": "Achyut Bihani",
                    "user_href": "/profile/Achyut-Bihani"
                },
                {
                    "user_id": "Shailendra Kumar",
                    "user_href": "/profile/Shailendra-Kumar-7"
                },
                {
                    "user_id": "Emma De Solesimares",
                    "user_href": "/profile/Emma-De-Solesimares"
                },
                {
                    "user_id": "Christoffer Aasted",
                    "user_href": "/profile/Christoffer-Aasted"
                },
                {
                    "user_id": "Thomas Herren",
                    "user_href": "/profile/Thomas-Herren"
                },
                {
                    "user_id": "Rakesh Reddy",
                    "user_href": "/profile/Rakesh-Reddy-1"
                },
                {
                    "user_id": "Micah Boswell",
                    "user_href": "/profile/Micah-Boswell"
                },
                {
                    "user_id": "Mohamed Riyaz",
                    "user_href": "/profile/Mohamed-Riyaz"
                },
                {
                    "user_id": "Divya Sharma",
                    "user_href": "/profile/Divya-Sharma-12"
                },
                {
                    "user_id": "Triya Bhattacharya",
                    "user_href": "/profile/Triya-Bhattacharya"
                },
                {
                    "user_id": "Prakhar Ajabe",
                    "user_href": "/profile/Prakhar-Ajabe"
                },
                {
                    "user_id": "Nick Moyne",
                    "user_href": "/profile/Nick-Moyne"
                },
                {
                    "user_id": "Pritesh Kalantri",
                    "user_href": "/profile/Pritesh-Kalantri"
                },
                {
                    "user_id": "Balajiganapathi Senthilnathan",
                    "user_href": "/profile/Balajiganapathi-Senthilnathan"
                },
                {
                    "user_id": "Ankush Saxena",
                    "user_href": "/profile/Ankush-Saxena"
                },
                {
                    "user_id": "Ankur Jindal",
                    "user_href": "/profile/Ankur-Jindal"
                },
                {
                    "user_id": "Biju V. Dev",
                    "user_href": "/profile/Biju-V-Dev"
                },
                {
                    "user_id": "Rohan Bhatore",
                    "user_href": "/profile/Rohan-Bhatore"
                },
                {
                    "user_id": "Abhilash Harpale",
                    "user_href": "/profile/Abhilash-Harpale"
                },
                {
                    "user_id": "Lewis Farrell",
                    "user_href": "/profile/Lewis-Farrell"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                },
                {
                    "user_id": "Kaushik Chakraborty",
                    "user_href": "/profile/Kaushik-Chakraborty-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jenna-Xenstien"
                },
                {
                    "user_id": "Jennifer Lee",
                    "user_href": "/profile/Jennifer-Lee-142"
                },
                {
                    "user_id": "Randy Sturridge",
                    "user_href": "/profile/Randy-Sturridge"
                },
                {
                    "user_id": "Chereese Camacho",
                    "user_href": "/profile/Chereese-Camacho"
                },
                {
                    "user_id": "Sanket Patel",
                    "user_href": "/profile/Sanket-Patel-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Calvin Ho",
                "href": "/profile/Calvin-Ho-17"
            },
            "answer_text": "Have a planned ritual starting much earlier to go to bed (not the time you sleep but about 30 minutes to one hour as a test). Drink some hot camomile tea, and get a good book to read (no ebooks on iPad as the light will keep you awake). Hoping you can be sleepy drifting off to bed. Try to find an average time you need to this ritual (say you have an average of 45 minutes). Then on the next day go to bed for the same ritual 30 minutes earlier. Do this until you reach the time you want to actually fall asleep. It goes without saying don't drink too much coffee in the late afternoon so your body will be caffeine free by the time you are ready to go to bed, and drink lots of water throughout the day. I sometimes like to write everything down that is on my mind so that it clears the mind for sleep. Also I recommend using a Sleep app for your smart phone where it can wake you up at the right time so you don't feel groggy and tired. It really helps to have a better day by waking up at the right time and the app helps. ",
            "date": "Answered May 2, 2015",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Huff",
                    "user_href": "/profile/Mike-Huff-9"
                },
                {
                    "user_id": "Jeffrey Yen",
                    "user_href": "/profile/Jeffrey-Yen-2"
                },
                {
                    "user_id": "Victor Peña-Araujo",
                    "user_href": "/profile/Victor-Peña-Araujo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vinayaka Suryanarayana",
                "href": "/profile/Vinayaka-Suryanarayana"
            },
            "answer_text": "After thorough consideration, this is what worked for me. Switch OFF the WiFi router.   It worked for me. Also, with this, please try: Eating dinner early, and eating light.Stop snacking in between dinner and your sleep. Do away with themGo for a short walk after dinner  Read a book, it works 2 ways. one, your eyes feel tired after sometime, and you feel drowsy. Two, you're reading a book, ultimate entertainment, GUARANTEED  Make your bed beforehand, and put the rug/bedsheet fresh ones(maybe even sun dried ones) and enjoy the warmth :)  Make the room a little dark.The sleep waves come in at this times usually, i have noticed : 9 ~ 9:30 and if you miss that, the next one is at 12:30~ 2. Seriously. Think about it.There is an app that plays the sound of that waves, try it. It worked well for me. But then my snores woke me up. I am a light sleeper.Hope that helped. ",
            "date": "Answered July 10, 2014",
            "views": "118",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arusha",
                    "user_href": "/profile/Arusha-3"
                },
                {
                    "user_id": "Anne Nattermann",
                    "user_href": "/profile/Anne-Nattermann-1"
                },
                {
                    "user_id": "Cathie Romero",
                    "user_href": "/profile/Cathie-Romero"
                },
                {
                    "user_id": "DrDalia Mostafa -Sáez",
                    "user_href": "/profile/DrDalia-Mostafa-Sáez"
                },
                {
                    "user_id": "Abhishek Banerjee",
                    "user_href": "/profile/Abhishek-Banerjee-56"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Cbb-Hbb"
                },
                {
                    "user_id": "Ravi Anand",
                    "user_href": "/profile/Ravi-Anand-16"
                },
                {
                    "user_id": "Kyra Rooney",
                    "user_href": "/profile/Kyra-Rooney"
                },
                {
                    "user_id": "Peter Huang",
                    "user_href": "/profile/Peter-Huang-21"
                },
                {
                    "user_id": "Vivian Le",
                    "user_href": "/profile/Vivian-Le-15"
                },
                {
                    "user_id": "Krishna Kumar",
                    "user_href": "/profile/Krishna-Kumar-10926"
                },
                {
                    "user_id": "Van Thanh Bui",
                    "user_href": "/profile/Van-Thanh-Bui"
                },
                {
                    "user_id": "Navyanto Arasma",
                    "user_href": "/profile/Navyanto-Arasma"
                },
                {
                    "user_id": "Elane Ko Glessner",
                    "user_href": "/profile/Elane-Ko-Glessner"
                },
                {
                    "user_id": "Sergio Miranda",
                    "user_href": "/profile/Sergio-Miranda-8"
                },
                {
                    "user_id": "Mohammad A Nazzal",
                    "user_href": "/profile/Mohammad-A-Nazzal"
                },
                {
                    "user_id": "Cyril Hao",
                    "user_href": "/profile/Cyril-Hao"
                },
                {
                    "user_id": "Sabarish Jothi",
                    "user_href": "/profile/Sabarish-Jothi"
                },
                {
                    "user_id": "Sarah Brown",
                    "user_href": "/profile/Sarah-Brown-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Katie Hamre",
                "href": "/profile/Katie-Hamre-1"
            },
            "answer_text": "There are a few things you can try.  Turn off the television, computer, iPad and put down your smartphone after 8pm. Our eyes tell our brains that the light from these devices is daylight, and that it is still daytime. So your brain emits less sleep hormone than it normally would.Take a melatonin supplement 30 minutes before you wish to fall asleep. Melatonin is the natural sleep hormone that your body emits in the late evening. If you aren't producing enough, you can supplement without side effects.Keep a pen and paper next to the bed. Often thoughts like \"I have to remember to do this tomorrow!\" will keep our brains from settling down. Writing down the thing that you don't want to forget will get it off your mind.Try focusing on your breathing to stop the thoughts from racing. Think \"in\" as you breathe in, and \"out\" as you breathe out. Your body will start to relax as your breathing gets deeper.Have your doctor perform some blood work. Often, difficulty sleeping is a symptom of an underlying problem. Make sure everything is working correctly in your body!Sometimes medications can keep you awake. Evaluate any that you are taking and see if that is a side effect.",
            "date": "Answered January 9, 2013",
            "views": "565",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andrea Baisero",
                    "user_href": "/profile/Andrea-Baisero"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mindey XY",
                "href": "/profile/Mindey-XY"
            },
            "answer_text": "I find this effective — get a programmable timer switch and connect it to a lamp, and program it: Turn on the lamp at two times: 20:00~21:30: When you see it turn on in the evening, take some hard material to study. Some involved mathematics or convoluted history will do.5:00~10:00: When your eyes sense light in the morning, your brain will begin to wake up naturally.IMPORTANT: When you program something, it’s tempting to think “oh, now this thing will wake me up at 5:00”. Such thoughts of targetting when to get up may distract from getting a good sleep. Therefore, direct the light away from your eyes before sleep: to hell with light, I will sleep as much as I like. In other words, the lamp should be ignorable, just like the morning light is. This is so that you don’t care about anything waking you up before you yourself want to wake up. Having light away from the eyes will make yourself feel like you will be able to ignore it in the morning. Nevertheless, keep the program running, and over time, you will naturally shift towards waking earlier, sleeping earlier. ",
            "date": "Answered January 19, 2017",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Hu",
                "href": "/profile/James-Hu-2"
            },
            "answer_text": "You don't want to force anything; especially when your well-being in Life is concerned. That never turns out well for anyone. In fact, to use force may back fire against you with more vigor.  Instead, control your Time with effective activities that will train your mind and body to obey your orders.   It's all about training the mind and body to sleep and wake up whenever you want. You've conditioned your mind and body over a period of Time with specific habits that caused you to have a certain sleep schedule.  One way to break the current cycle and to replace with your earlier wake-up schedule is to integrate an exercise program during the mornings or afternoons so that your mind and body will feel the need to be rested. Otherwise, if you're like me, if i don't exercise, i'll have more than enough energy during the evenings to keep me awake all night not just thinking about things but feeling restless to move around.  ",
            "date": "Answered February 18, 2016",
            "views": "56",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jenna Rodriguez",
                    "user_href": "/profile/Jenna-Rodriguez-2"
                },
                {
                    "user_id": "Lava Kumar Bangalore(ಬೆಂಗಳೂರು ಲವ ಕುಮಾರ)",
                    "user_href": "/profile/Lava-Kumar-Bangalore-ಬೆಂಗಳೂರು-ಲವ-ಕುಮಾರ"
                },
                {
                    "user_id": "Abhishek Banerjee",
                    "user_href": "/profile/Abhishek-Banerjee-56"
                },
                {
                    "user_id": "Kiran TP",
                    "user_href": "/profile/Kiran-TP-3"
                },
                {
                    "user_id": "Raven Sage",
                    "user_href": "/profile/Raven-Sage-3"
                },
                {
                    "user_id": "Ravi Prakash",
                    "user_href": "/profile/Ravi-Prakash-1180"
                },
                {
                    "user_id": "Mayank Verma",
                    "user_href": "/profile/Mayank-Verma-56"
                },
                {
                    "user_id": "Amit Roy",
                    "user_href": "/profile/Amit-Roy-93"
                },
                {
                    "user_id": "Bianca Lacerda",
                    "user_href": "/profile/Bianca-Lacerda"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tanvir Aslam",
                "href": "/profile/Tanvir-Aslam"
            },
            "answer_text": "Here are somethings you can try: Make sure you are tired by the time you want to sleep. Workout in the evening, play some game, have sex etc. Get a hot shower an hour before you want to sleep.Keep looking at something monotonous and that might help. I make it a point to look at my ceiling fan when I have trouble sleeping and within 5-10 minutes I fall asleep.Try not to smoke, drink coffee or ingest caffeine of any kind after 5pm.Also make it a habit to sleep at a specified time regularly. Your body automatically gets attuned to that you will have a much easier time sleeping.Not advised - Get really drunk and you will have no trouble sleeping :P",
            "date": "Updated February 11, 2013",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Avinash Acharya",
                    "user_href": "/profile/Avinash-Acharya"
                },
                {
                    "user_id": "Julie Prentice",
                    "user_href": "/profile/Julie-Prentice"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sue Thomass",
                "href": "/profile/Sue-Thomass"
            },
            "answer_text": "What you want is a good night’s sleep, so if you do a few things you will be able to do that. The why people go to bed before ten p.m. needs to be realized. (look it up on line as it would be much more clearer if you do that instead of me paraphrasing) Other things like wearing blue light filtering eye wear, (again look it up on line) Finding anything that you need in the morning, before bed, will also help to provide a good nights sleep. Put any worries or concerns to rest, before going to bed. If you pray, remember to be thankful, for your many blessings, and even if you do not pray, remember to be grateful, for your many blessings before going to sleep. ",
            "date": "Answered July 2, 2019",
            "views": "77",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bhanupriya Sharma",
                "href": "/profile/Bhanupriya-Sharma-1"
            },
            "answer_text": "Chances are that you are caught up either with your cellphone/laptop/desktop/iPad/TV which prevents you to sleep early. These gadgets keep mind engaged and alert making it difficult to sleep. I suggest: 1. Reading a book - If you DON'T like reading. 2. Making your bed as comfortable as possible - think soft pillows strewn over your bed. 3. Have a cup of green tea to relax. 4. Try taking a bath around the time you want to sleep . It will definitely put you at ease. 5. Listen to some soft music on low volume until you fall into slumber. 6. Switch off the lights and you would automatically relax. 7. If you don't live alone. Politely ask  others in your family not to disturb you at that hour. 8. Snuggle in bed.Voila! Problem solved :) ",
            "date": "Answered June 24, 2014",
            "views": "27",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Camera Lorry",
                    "user_href": "/profile/Camera-Lorry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shivangi Sinha",
                "href": "/profile/Shivangi-Sinha-124"
            },
            "answer_text": "Okay now I think I am very much eligible to answer this because I go to sleep around 10–11 pm.Its not only applicable at home but also at my hostel where students hardly sleep before 2 am. First of all, please don't force yourself 😊. Relax buddy if you don't feel sleepy.No matter what don't take small naps in a day .Pledge to yourself that no matter what,you are not going to sleep even if that means you are unable to do your work properly. Just resist the sleep for some days . Do whatever you want, if you can't focus on your work due to lack of sleep, then listen to music or watch a movie or talk to your friends but not be tempted to sleep.Read books while on bedTake a walk after your dinner so that you feel tired and sleepy.Switch off the lights before going to bed because a hormone called melatonin becomes active in dark which induces sleep.Exercise everyday .Sleep at the same time every day . Your biological clock will command your body to feel sleepy at around the same time.Avoid using mobile phone while on bed.Blue lights prevent your sleep.Keep any electronic gadgets away from your bed.",
            "date": "Answered March 29, 2020",
            "views": "164",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Madhur Bajpai",
                "href": "/profile/Madhur-Bajpai"
            },
            "answer_text": "Keep waking up at 5:30 everyday without fail. First day you will sleep late and feel exhausted and will not feel like waking up early but do wake up at 5:30, do not take a nap during the afternoon. Keep doing this. You will automatically feel sleepy at the right time depending on the minimum hours of sleep that you require. It might be 10pm or 10:30pm. This is the easiest way to achieve a good \"early to rise, early to bed\" routine. You need strong will of course. ",
            "date": "Updated March 28, 2018",
            "views": "78",
            "upvotes": " View 32 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jayant Ilme",
                    "user_href": "/profile/Jayant-Ilme"
                },
                {
                    "user_id": "Arusha",
                    "user_href": "/profile/Arusha-3"
                },
                {
                    "user_id": "Skotty Dew",
                    "user_href": "/profile/Skotty-Dew"
                },
                {
                    "user_id": "Nazla Asria Ulfa",
                    "user_href": "/profile/Nazla-Asria-Ulfa-1"
                },
                {
                    "user_id": "Rick Huang",
                    "user_href": "/profile/Rick-Huang-5"
                },
                {
                    "user_id": "Dasarathy Rangarajan",
                    "user_href": "/profile/Dasarathy-Rangarajan"
                },
                {
                    "user_id": "Hazel Pan",
                    "user_href": "/profile/Hazel-Pan-5"
                },
                {
                    "user_id": "Rohit Kattamuri",
                    "user_href": "/profile/Rohit-Kattamuri-1"
                },
                {
                    "user_id": "Ahamed",
                    "user_href": "/profile/Ahamed-15"
                },
                {
                    "user_id": "Gelli Shiva",
                    "user_href": "/profile/Gelli-Shiva"
                },
                {
                    "user_id": "Peter Huang",
                    "user_href": "/profile/Peter-Huang-21"
                },
                {
                    "user_id": "Mayur Bhosale",
                    "user_href": "/profile/Mayur-Bhosale-7"
                },
                {
                    "user_id": "Mohammad Anwar Shah",
                    "user_href": "/profile/Mohammad-Anwar-Shah"
                },
                {
                    "user_id": "Niya Sharma",
                    "user_href": "/profile/Niya-Sharma-20"
                },
                {
                    "user_id": "Gert Goeman",
                    "user_href": "/profile/Gert-Goeman"
                },
                {
                    "user_id": "Henry Huynh",
                    "user_href": "/profile/Henry-Huynh-78"
                },
                {
                    "user_id": "Tatia Davitashvili",
                    "user_href": "/profile/Tatia-Davitashvili"
                },
                {
                    "user_id": "Kushal Adsod",
                    "user_href": "/profile/Kushal-Adsod"
                },
                {
                    "user_id": "Bharmal Choudhary",
                    "user_href": "/profile/Bharmal-Choudhary-1"
                },
                {
                    "user_id": "Priyaranjan Behera",
                    "user_href": "/profile/Priyaranjan-Behera-1"
                },
                {
                    "user_id": "Kewei Shang",
                    "user_href": "/profile/Kewei-Shang"
                },
                {
                    "user_id": "Naga Sandeep",
                    "user_href": "/profile/Naga-Sandeep-30"
                },
                {
                    "user_id": "Gowtam Chilamakuri",
                    "user_href": "/profile/Gowtam-Chilamakuri"
                },
                {
                    "user_id": "Dharmesh Baldha",
                    "user_href": "/profile/Dharmesh-Baldha"
                },
                {
                    "user_id": "Naveena Naganaboina",
                    "user_href": "/profile/Naveena-Naganaboina"
                },
                {
                    "user_id": "Harshal Jain",
                    "user_href": "/profile/Harshal-Jain"
                },
                {
                    "user_id": "Shriya Gupta",
                    "user_href": "/profile/Shriya-Gupta-10"
                },
                {
                    "user_id": "Preeti Raghav",
                    "user_href": "/profile/Preeti-Raghav"
                },
                {
                    "user_id": "Shreya Patil",
                    "user_href": "/profile/Shreya-Patil-1"
                },
                {
                    "user_id": "Rakhi Nuhal",
                    "user_href": "/profile/Rakhi-Nuhal"
                },
                {
                    "user_id": "Mohammed Al-Hasan",
                    "user_href": "/profile/Mohammed-Al-Hasan"
                },
                {
                    "user_id": "Rahul Bhalerao",
                    "user_href": "/profile/Rahul-Bhalerao"
                }
            ]
        },
        {
            "author_info": {
                "name": "Luis Villa",
                "href": "/profile/Luis-Villa-2"
            },
            "answer_text": "My answer may not be what you want to hear, as I hate waking up early. One of the many reasons I started my own consulting business was to set my own hours. So for the most part I don't have to get up at dawn. There's also the matter that I'm a night person. During my programming years I loved to work at night with no distractions. I was more productive  during nighttime than daytime. So,  first evaluate if you are a night person or a day person and if you can, find a job that adjusts to your way of being.  Now, regardless of when you are at your peak, yo do need to sleep a good 8 hours as an average. If you sleep less than what your body requires (and each one of us knows how much that is) you'll be tired, your immune system won't have time to make the cells needed to fight infection and repair your body, you'll be cranky and enjoy life less.  Plan a sleep-time routine based on some of the good advice I see down here, and stick to it, for at least a month, so it becomes a habit.  Good luck! ",
            "date": "Answered July 17, 2014",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Raghavendra Shenoy",
                "href": "/profile/Raghavendra-Shenoy"
            },
            "answer_text": "One thing I feel will help you is to focus on the time for waking up. Here is what I have done to help me wake up early. (This will need a 4-5 days to work. But work it will!)  Set a time you want to wake up everyday.Use an alarm, a friend or a relative(who will feel like your enemy) to help you wake up at that time.The other important thing. Sleep as soon as you feel sleepy. This may change from day to day based on how tired you are. So some days you may feel sleepy early and other days you may not feel sleepy till very late.Keep away from laptops and mobiles when you wait to fall asleep on your bed. But reading a book till you go of to sleep is ok.Ensure you get of the bed at the stipulated time in the morning no matter what the first few days.In 4-5 days this is become normal and you body clock will adjust easily.",
            "date": "Answered June 24, 2014",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Devesh Gandhi",
                    "user_href": "/profile/Devesh-Gandhi-3"
                },
                {
                    "user_id": "Varsha",
                    "user_href": "/profile/Varsha-202"
                },
                {
                    "user_id": "Parth Sharma",
                    "user_href": "/profile/Parth-Sharma"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ann Brells",
                "href": "/profile/Ann-Brells"
            },
            "answer_text": "HiI found one really good way to get sleepy quickly by accident. We got a new tv that bothered my eyes, so I ordered a pair of yellow colored glasses to cut the blue light. It solved the eye problem, but….after half an hour with them on, I couldn't stay awake! Terrible if you're watching an exciting basketball game but great if you are trying to get to sleep. However you have to block all bluelight until you are in bed with your eyes closed, or you wake again. The plain almost clear glasses for bluelight dont work as well by the way. See link for the explanation. How Blocking Blue Light at Night Helps You Sleep ",
            "date": "Answered June 23, 2019",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Claire Abdul-Azeez",
                "href": "/profile/Claire-Abdul-Azeez"
            },
            "answer_text": "Hi there, I once went through a period of trying to reset my sleeping habits and what I found worked was to focus on the waking up and let my body take care of the sleeping. I started making sure that I woke up when I wanted to (6 a.m.) everyday, no matter what and within about 10 days of doing this consistently, I would find myself easily asleep by 11, 12p.m. I didn't need to work on falling asleep at the right time once I handled waking up at the right time. Hope this helps! Get more time management tips and advice on my blog: time Archives - Organized Productivity ",
            "date": "Answered June 24, 2014",
            "views": "46",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ravi Anand",
                    "user_href": "/profile/Ravi-Anand-16"
                },
                {
                    "user_id": "Vinod Koliyat",
                    "user_href": "/profile/Vinod-Koliyat"
                },
                {
                    "user_id": "Vivian Le",
                    "user_href": "/profile/Vivian-Le-15"
                },
                {
                    "user_id": "Alexandra Walser",
                    "user_href": "/profile/Alexandra-Walser"
                },
                {
                    "user_id": "Niya Sharma",
                    "user_href": "/profile/Niya-Sharma-20"
                },
                {
                    "user_id": "Pawan A",
                    "user_href": "/profile/Pawan-A-1"
                },
                {
                    "user_id": "Bharmal Choudhary",
                    "user_href": "/profile/Bharmal-Choudhary-1"
                },
                {
                    "user_id": "Matthew Silberman",
                    "user_href": "/profile/Matthew-Silberman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chander Shivdasani",
                "href": "/profile/Chander-Shivdasani"
            },
            "answer_text": "It is well to be up before daybreak, for such habits contribute to health, wealth, and wisdom. - Aristotle To start with, dont make any dramatic changes. If you are used to sleeping at 2am, try to put your self to bed by around 1am. Do this gradually until you reach your goal time. Do the same thing when waking up. Waking up early will make you tired till the evening and will help you in sleeping early.  Do something calming before your bedtime. Listening to music and reading books are the best thing also turn off or dim out your lights an hour before you want to sleep. This will make the ambience cozy.  Always reward yourself for your discipline. This will make you stick to your routine more rigorously.  Remember, you only have to do this for a couple of weeks. Your body will  adjust itself to the schedule and you will automatically start feeling sleepy at your desired time. ",
            "date": "Answered November 8, 2012",
            "views": "12",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samir Wale",
                    "user_href": "/profile/Samir-Wale"
                },
                {
                    "user_id": "Mari Moth",
                    "user_href": "/profile/Mari-Moth-1"
                },
                {
                    "user_id": "Chereese Camacho",
                    "user_href": "/profile/Chereese-Camacho"
                },
                {
                    "user_id": "Sanket Patel",
                    "user_href": "/profile/Sanket-Patel-4"
                },
                {
                    "user_id": "Julie Prentice",
                    "user_href": "/profile/Julie-Prentice"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Urquhart",
                "href": "/profile/David-Urquhart"
            },
            "answer_text": "Keep a pad and pen beside your bed and whenever you have a thought or concern, write it down and in this way let it go, trusting that if it is on the pad, you don't need to remember it.  A personal organiser, iPhone or other electronic device (including a voice recorder) will also do the job. ",
            "date": "Answered November 9, 2012",
            "views": "13",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ravi Anand",
                    "user_href": "/profile/Ravi-Anand-16"
                },
                {
                    "user_id": "Shivangi Bansal",
                    "user_href": "/profile/Shivangi-Bansal-6"
                },
                {
                    "user_id": "Vijay Jain",
                    "user_href": "/profile/Vijay-Jain-5"
                },
                {
                    "user_id": "Sunny Arora",
                    "user_href": "/profile/Sunny-Arora-6"
                },
                {
                    "user_id": "Ray Schnitzler",
                    "user_href": "/profile/Ray-Schnitzler"
                },
                {
                    "user_id": "Hillel Gray",
                    "user_href": "/profile/Hillel-Gray"
                },
                {
                    "user_id": "Brenda Mendez",
                    "user_href": "/profile/Brenda-Mendez"
                },
                {
                    "user_id": "Myra Burger",
                    "user_href": "/profile/Myra-Burger"
                },
                {
                    "user_id": "Kate Simmons",
                    "user_href": "/profile/Kate-Simmons"
                },
                {
                    "user_id": "Karen Teoh",
                    "user_href": "/profile/Karen-Teoh"
                },
                {
                    "user_id": "Ben Duke",
                    "user_href": "/profile/Ben-Duke"
                },
                {
                    "user_id": "Jan Leadbetter",
                    "user_href": "/profile/Jan-Leadbetter"
                },
                {
                    "user_id": "Tanayaa du Soleil",
                    "user_href": "/profile/Tanayaa-du-Soleil"
                },
                {
                    "user_id": "Julie Prentice",
                    "user_href": "/profile/Julie-Prentice"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Hildebrandt",
                "href": "/profile/Michael-Hildebrandt-11"
            },
            "answer_text": "You will never win if you force yourself. This is all about creating a new habit (https://www.sleeptrust.eu/006-habits/). The process is easier that you may think in the beginning. You will need a big why in the beginning. The why will have to be emotional, not rational or you will have problems to follow through. Then you should find something that you really like with your new habit. Some kind of reward for going to bed early would be good. Be disciplined and only reward yourself if you follow through. And keep yourself accountable. You can download a cheat sheet that will help you to do so following the above link. - Take care and have a superb sleep. Michael - main page - sleeptrust ",
            "date": "Answered December 28, 2018",
            "views": "64",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anhang Zhu",
                "href": "/profile/Anhang-Zhu"
            },
            "answer_text": "When I was in college, I used to watch Brian Harvey's CS61A webcast. Not to bash on him or the class, but I found his voice super soothing. I seldom lasted more than 20 minutes in his lectures in person before falling asleep, so imagine how effective the videos must have been. Link to the videos:Computer Science 61A|Fall 2008|UC Berkeley ",
            "date": "Answered November 15, 2012",
            "views": "32",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sagar Dafle",
                    "user_href": "/profile/Sagar-Dafle"
                },
                {
                    "user_id": "Rohit Kattamuri",
                    "user_href": "/profile/Rohit-Kattamuri-1"
                },
                {
                    "user_id": "Yi Sun",
                    "user_href": "/profile/Yi-Sun-22"
                },
                {
                    "user_id": "Tam Do",
                    "user_href": "/profile/Tam-Do"
                },
                {
                    "user_id": "Colin Cahill",
                    "user_href": "/profile/Colin-Cahill"
                },
                {
                    "user_id": "Julie Prentice",
                    "user_href": "/profile/Julie-Prentice"
                },
                {
                    "user_id": "David Urquhart",
                    "user_href": "/profile/David-Urquhart"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yaseen Mirza",
                "href": "/profile/Yaseen-Mirza"
            },
            "answer_text": "What I usually do to get back on track is to have a very early dinner like as soon as I come home from work and then start reading or do anything I normally do like watch tv or browse etc. By 10 pm. I would have already spent 3 hours of whatever I was doing and I would feel tired/lazy and then slowly drift to sleep max by 11. Waking up early wouldn't be that hard for me when I slept around this time. My normal waking time is 5:30 - 6 am.  To me its just a matter of 'shifting' all my activities to an early slot in time. It works for me quite well! ",
            "date": "Answered September 17, 2015",
            "views": "843",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Toh Jia En",
                "href": "/profile/Toh-Jia-En"
            },
            "answer_text": "Well the key time to sleep is between 10 pm to 2 am. 10pm to midnight repairs your body. Midnight to 2am repairs your mind. Meditate, or if you are religious pray, in my religion praying means emptying the mind so that works. Do not use internet or TV before bed. It just stimulates your mind, so half an hour before you want to sleep you should stop. Keep a regular bedtime. ",
            "date": "Answered November 18, 2012",
            "views": "12",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rachit Mongia",
                    "user_href": "/profile/Rachit-Mongia"
                },
                {
                    "user_id": "Fay Yang",
                    "user_href": "/profile/Fay-Yang-6"
                },
                {
                    "user_id": "Camera Lorry",
                    "user_href": "/profile/Camera-Lorry"
                },
                {
                    "user_id": "Rajat Misra",
                    "user_href": "/profile/Rajat-Misra"
                },
                {
                    "user_id": "Yash Vohra",
                    "user_href": "/profile/Yash-Vohra"
                },
                {
                    "user_id": "Julie Prentice",
                    "user_href": "/profile/Julie-Prentice"
                },
                {
                    "user_id": "Kartik Raj Rewar",
                    "user_href": "/profile/Kartik-Raj-Rewar"
                },
                {
                    "user_id": "Sanket Patel",
                    "user_href": "/profile/Sanket-Patel-4"
                },
                {
                    "user_id": "Erek Brown",
                    "user_href": "/profile/Erek-Brown-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Murray",
                "href": "/profile/Mark-Murray-26"
            },
            "answer_text": "Force is a strong term. As cheesy as it may sound, create a positive mental attitude about going to bed early and waking up early.  It's truly amazing the control we have our thoughts. It takes just as much energy to believe waking up early is difficult as it does to believe waking up early is easy. To answer: 1.) Have a great mental attitude about going to bed and getting up early.2.) Set an early morning appointment that you cannot miss (running date with a friend, coffee date with a church member).3.) Just do it. This may be over simplified, but you have what it takes! ",
            "date": "Answered September 30, 2015",
            "views": "991",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adam Dehner",
                "href": "/profile/Adam-Dehner"
            },
            "answer_text": "binaural beats work for me.  You have to go to sleep with headphones on, which might bother you.  I've found that even at my most anxious, I'm asleep within 10 minutes and wake up as if I was dead.  Free Binaural Beats Presents ~ Deep Sleep- Free Binaural Beats ",
            "date": "Answered November 9, 2012",
            "views": "13",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joe Devon",
                    "user_href": "/profile/Joe-Devon"
                },
                {
                    "user_id": "Hillel Gray",
                    "user_href": "/profile/Hillel-Gray"
                },
                {
                    "user_id": "Sanket Patel",
                    "user_href": "/profile/Sanket-Patel-4"
                },
                {
                    "user_id": "David Urquhart",
                    "user_href": "/profile/David-Urquhart"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edison Keong",
                "href": "/profile/Edison-Keong"
            },
            "answer_text": "Sleep is relax mode. Hence, sleep is impossible to use force to execute it. Before going to sleep, silence all things that will interrupt you. Sit on bed and relax your body and take some slow breathing. After feel comfortable, lie down and tell yourself :”Thank you for tonight comfortable sleep”. You might try read some books. Avoid caffeine before sleep. ",
            "date": "Answered December 5, 2016",
            "views": "415",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prarthana Bhat",
                "href": "/profile/Prarthana-Bhat-2"
            },
            "answer_text": "A nice hot shower. And then porcupine tree/ Eric clapton. Haha. Oh and do some light reading. Magazines. Comics.:) ",
            "date": "Answered November 8, 2012",
            "views": "638",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eugene Sebastian",
                    "user_href": "/profile/Eugene-Sebastian"
                },
                {
                    "user_id": "Bob Bedinsky",
                    "user_href": "/profile/Bob-Bedinsky"
                },
                {
                    "user_id": "Saurabh Patel",
                    "user_href": "/profile/Saurabh-Patel-1"
                },
                {
                    "user_id": "Prateek Sharma",
                    "user_href": "/profile/Prateek-Sharma-4"
                },
                {
                    "user_id": "Vinicius Hisao Suzuki",
                    "user_href": "/profile/Vinicius-Hisao-Suzuki"
                },
                {
                    "user_id": "Sagar Kanumalla",
                    "user_href": "/profile/Sagar-Kanumalla"
                },
                {
                    "user_id": "Matt Decuir",
                    "user_href": "/profile/Matt-Decuir"
                },
                {
                    "user_id": "Yawar Quadir Amin",
                    "user_href": "/profile/Yawar-Quadir-Amin"
                },
                {
                    "user_id": "Louis Amiot",
                    "user_href": "/profile/Louis-Amiot"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Account-Deleted-1"
                },
                {
                    "user_id": "Seshank Vemuri",
                    "user_href": "/profile/Seshank-Vemuri"
                },
                {
                    "user_id": "Dariush Mersad",
                    "user_href": "/profile/Dariush-Mersad"
                },
                {
                    "user_id": "Ben Duke",
                    "user_href": "/profile/Ben-Duke"
                },
                {
                    "user_id": "Luciano Caruso",
                    "user_href": "/profile/Luciano-Caruso"
                },
                {
                    "user_id": "David Urquhart",
                    "user_href": "/profile/David-Urquhart"
                },
                {
                    "user_id": "Julie Prentice",
                    "user_href": "/profile/Julie-Prentice"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Tor",
                "href": "/profile/Mike-Tor"
            },
            "answer_text": "You can take sleep meds or pills, but I dont recommend it. One healthier way is to wake up really early so you’ll feel tired by the time it’s night time. Also, keep your room dark and turn off all electronics that you use (Anything that distracts you) Tempature can also help. Make it feel a bit cold . Anything that feels comfortable. ",
            "date": "Answered November 25, 2017",
            "views": "128",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sayed Abdul Qavvi",
                "href": "/profile/Sayed-Abdul-Qavvi"
            },
            "answer_text": "First and the most important thing set your mind!Get your self into a routine!Prepare a timetabe for your daily life!Have a healthy diet!When the clock ticks at 9:45pm prepare your self going to bed.As for waking up early in the morning here is a great method to through.I have a great experience doing this!If you wanna wake at 6am drink 1glass of water, if you wanna wake up at 5am drink 2 glasses of water and if you wanna wake up at 4am drink 3 glasses of water!And do you know why!?This will help you to wake up early in the morning as you have to go to the bathroom! I know its funny but give it a try.Truely experienced! ",
            "date": "Answered September 27, 2015",
            "views": "719",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pradip Zankar",
                "href": "/profile/Pradip-Zankar"
            },
            "answer_text": "It is easy to go to sleep earlier, if you really want to do so. Reading books is the best way for doing this. Especially, books which do not contain mind boggling words. The way which works on everyone is MEDITATION. Concentrate on single thought that I WANT TO SLEEP RIGHT NOW. It works great. Massaging oil on the head is even one of the best ways. ",
            "date": "Updated July 5, 2014",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mindy Zhou",
                "href": "/profile/Mindy-Zhou"
            },
            "answer_text": "Here are a few things I do to help myself go to sleep: 1. Drink camomile tea and turn off most of lights in the house. 2. Take melatonin. Start with 2 mg.  3. Do some night time yoga to relax yourself. (Try this 10 min yoga routine, 10 Min Beginner Yoga Stretch Routine (Great for Flexibility & Relaxation) ) 4. Master bate yourself when you go to bed since orgasm does relax your whole body and help you sleep.  Hopefully this helps.  ",
            "date": "Answered February 18, 2016",
            "views": "24",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Apoorv Reddy",
                    "user_href": "/profile/Apoorv-Reddy"
                },
                {
                    "user_id": "Mahmoud Emad",
                    "user_href": "/profile/Mahmoud-Emad"
                },
                {
                    "user_id": "Rohan Kalra",
                    "user_href": "/profile/Rohan-Kalra"
                },
                {
                    "user_id": "Arvind Srinivas",
                    "user_href": "/profile/Arvind-Srinivas"
                },
                {
                    "user_id": "Triya Bhattacharya",
                    "user_href": "/profile/Triya-Bhattacharya"
                },
                {
                    "user_id": "Myra Burger",
                    "user_href": "/profile/Myra-Burger"
                },
                {
                    "user_id": "Ankit Singh",
                    "user_href": "/profile/Ankit-Singh-4"
                },
                {
                    "user_id": "Julie Prentice",
                    "user_href": "/profile/Julie-Prentice"
                },
                {
                    "user_id": "Yash Arora",
                    "user_href": "/profile/Yash-Arora"
                },
                {
                    "user_id": "Sanket Patel",
                    "user_href": "/profile/Sanket-Patel-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hari Shankar Ramakrishnan",
                "href": "/profile/Hari-Shankar-Ramakrishnan"
            },
            "answer_text": "Stop using \"Facebook, Twitter, Google+\" after 8 PM. Ignore Blackberry, iPhone, Galaxy mail beeps after 8 PM. Make it a habit and you will definitely sleep early. ",
            "date": "Answered December 2, 2012",
            "views": "563",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tom Chambers",
                    "user_href": "/profile/Tom-Chambers-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gregory Miner Gustafson",
                "href": "/profile/Gregory-Miner-Gustafson"
            },
            "answer_text": "I let go of the day when I never want to, because I must and if sleepless take 200 mg Theanine to help relax my mind for sleep. Theanine is a non toxic non habit forming over-the-counter sleep aid that I use. I have battled with going to bed and to sleep since my young years. People called it having a “restless mind.” ",
            "date": "Answered December 29, 2018",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dreana Bossy",
                "href": "/profile/Dreana-Bossy"
            },
            "answer_text": "We all know we have to sleeep and there are ALOT of ways to sleep.  These are all the ways *Drink hot chocolate or warm milk to make yourself sleepy. *have a nice half an hour relaxing warm bath. *Avoid TV and devices before sleeping. Read a book or do colouring *Make a timetable ( so you know what time to go to bed. Sleep at about 9:30 or 10. Make your deadline to sleep at 10:15 max latest.  ",
            "date": "Answered April 21, 2016",
            "views": "711",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shimon Doodkin",
                    "user_href": "/profile/Shimon-Doodkin"
                },
                {
                    "user_id": "Eugene Sebastian",
                    "user_href": "/profile/Eugene-Sebastian"
                },
                {
                    "user_id": "Devaki Varun",
                    "user_href": "/profile/Devaki-Varun"
                },
                {
                    "user_id": "Wu Jinboo",
                    "user_href": "/profile/Wu-Jinboo"
                },
                {
                    "user_id": "Sunny Arora",
                    "user_href": "/profile/Sunny-Arora-6"
                },
                {
                    "user_id": "Sanket Patel",
                    "user_href": "/profile/Sanket-Patel-4"
                },
                {
                    "user_id": "Hans Archer",
                    "user_href": "/profile/Hans-Archer"
                },
                {
                    "user_id": "Snehashish Sinha",
                    "user_href": "/profile/Snehashish-Sinha"
                },
                {
                    "user_id": "Julie Prentice",
                    "user_href": "/profile/Julie-Prentice"
                },
                {
                    "user_id": "Klemen Korasa",
                    "user_href": "/profile/Klemen-Korasa"
                },
                {
                    "user_id": "Dianne Womersley",
                    "user_href": "/profile/Dianne-Womersley"
                },
                {
                    "user_id": "Shalin Shah",
                    "user_href": "/profile/Shalin-Shah-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ramez Emad",
                "href": "/profile/Ramez-Emad-1"
            },
            "answer_text": "You can do it gradually. Meaning that you can sleep little bit earlier than the day before that day and wake up little bit earlier. Another trick is to wake up very early in one day then you will be extremely tired, do something boring at night and go to sleep early. You will sleep instantly and it will become habit. ",
            "date": "Answered May 2, 2015",
            "views": "614",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Van Bui",
                    "user_href": "/profile/Van-Bui"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Cano",
                "href": "/profile/Joe-Cano-5"
            },
            "answer_text": "Find the time that you want to get to sleep. Two hours before I go to bed I shut off my computer, tv and leave my phone alone. I start getting ready for the next day. Eat a light snack Grab a shower Get in bed with a book ,about 1/2 hour before you want to sleep, no school books or technical books. Just easy reading. Read until you are sleepy. If you want a pattern always go to bed at the same time and wake up at the same time… Happy New Year!!! ",
            "date": "Answered December 28, 2018",
            "views": "40",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zhang Xiaolong",
                    "user_href": "/profile/Zhang-Xiaolong-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fact Vines",
                "href": "/profile/Fact-Vines"
            },
            "answer_text": "Dear- Think about Ur future….. Then think about …ud don't have a second chance to clear 12 th. Think about ur parents how much income they spend ur school fees…and how much sacrifice they did for uh Think about ur friend in future .. if they will get Good marks and uh don't so…… Then it's better uh get up early and set a goal In first uh uh face a problem but after few days u dnt feel sleep and then daily uh will get up early ",
            "date": "Answered February 8, 2019",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mo Tarifi",
                "href": "/profile/Mo-Tarifi"
            },
            "answer_text": "All you need to do is set up a pre- sleep routine as follows:1- One hour before sleep time, brush your teethes2- Turn off all the lights3- Turn off the TV and all electronics4- Read a book using a book light5- Exercise deep breathing or yoga breathing while you are reading6- in 30 to 45 minutes, you will be ready for sleeping ",
            "date": "Answered August 23, 2015",
            "views": "588",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anna Castelli",
                    "user_href": "/profile/Anna-Castelli-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Petryshyn",
                "href": "/profile/Joe-Petryshyn"
            },
            "answer_text": "In my case I had bee using my computer until 1 Am. Unfortunately when I tried to go to sleep my mind was still racing and thus I could not get 7 to 8 hours of sleep. I found out that one needs, in my case shut the PC down three hours before bed time. ",
            "date": "Answered April 21, 2018",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shanna Gangadien",
                "href": "/profile/Shanna-Gangadien"
            },
            "answer_text": "You got a lot of answers :D Make yourself really exausted. Go for a run or do something physically exausting, take a relaxing shower and even if you are not a reader, read a book with dim lights. ",
            "date": "Answered May 2, 2019",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Patricia Shoup",
                "href": "/profile/Patricia-Shoup"
            },
            "answer_text": "Just plan ahead. Get everything done by 9:30. This gives you time to read or relax. Just do it. At ten you are in bed lights off, all comfy. Now you sleep. Easy. ",
            "date": "Answered March 24, 2016",
            "views": "718",
            "upvotes": " Answer requested by Andy Hau",
            "upvoters": [
                {
                    "user_id": "Tom Ramsay",
                    "user_href": "/profile/Tom-Ramsay-3"
                },
                {
                    "user_id": "Rebecca Bhatta",
                    "user_href": "/profile/Rebecca-Bhatta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Niket Chandane",
                "href": "/profile/Niket-Chandane"
            },
            "answer_text": "Start watching Doordarshan   ",
            "date": "Answered June 25, 2014",
            "views": "430",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adi G",
                    "user_href": "/profile/Adi-G-33"
                },
                {
                    "user_id": "Ruchi Sharma",
                    "user_href": "/profile/Ruchi-Sharma-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yashvant Pole",
                "href": "/profile/Yashvant-Pole"
            },
            "answer_text": "Simply by eating a ripe banana and drinking a glass full of warm milk and I sleep like a log ! MIND OVER MATTER ! ",
            "date": "Answered January 3, 2019",
            "views": "7",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anna Castelli",
                    "user_href": "/profile/Anna-Castelli-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mika Ehm",
                "href": "/profile/Mika-Ehm"
            },
            "answer_text": "How? Just go to bed at 8PM. If 8PM is still not early for you, then 7 PM. ",
            "date": "Answered March 29, 2017",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "R Taylor",
                "href": "/profile/R-Taylor-33"
            },
            "answer_text": "Trazadone helps ",
            "date": "Answered July 18, 2018",
            "views": "41",
            "upvotes": "0"
        }
    ]
}