{
    "title": "How does it feel to study at a prestigious university like Harvard, Oxford, Cambridge, etc.? - Quora",
    "tags": [
        "Colleges and Universities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan Gordon",
                "href": "/profile/Jonathan-Gordon-23"
            },
            "answer_text": "tl;dr: speaking for Cambridge, I am thoroughly enjoying it. I chose Cambridge for my graduate degree because the research group in my area of interest is (in my opinion) the best in the world. I wasn’t really familiar with Cambridge culture or way of life before coming, I just wanted to study and conduct research with the machine learning group. I am hugely fortunate to have been able to join the group. There are so many talented people to collaborate with and learn from, the academic experience is out of this world. We have research talks almost every day from within and out of the group, and visiting researchers at the very top of the field come on a weekly basis to give talks and discuss their work. The professors are leading thinkers in the field, and it really feels like we’re (as a collective) shaping the future of ML. Its very exciting. I imagine my experience is typical of joining a large and successful research lab, and this is much more important than some arbitrary notion of prestige. Having said that, one important aspect in defining the prestige of a university is the quality of its research groups, so the top labs are more likely to be found at `prestigious’ universities (by definition, or some circular logic). The nice thing is how pleasantly surprised I’ve been by the culture here (not surprised because I expected less, just because I didn’t really know, nor think too much of, what to expect). Cambridge is a relatively small town very much dominated by the university, which is spread out all over and does not really have a central campus like other universities I am familiar with. The academic atmosphere is ever-present; from the numerous talks and events on every conceivable subject (which are open to the student body), to the unimaginable number of student societies (research, sports, debate, drinking, etc’). Even many of the bars have some kind of academic inclination (e.g., the Eagle is famous for being the site where Watson and Crick brainstormed the double-helix structure of DNA). There’s always something intellectually stimulating happening somewhere (a bike’s ride away) that will suit your interests. One of the things I like most about Cambridge is how international it is. The student body is ridiculously diverse, and it is an amazing opportunity to meet people from all around the world. I have made friends from all over the globe, engaged in their cultures, and shared with them aspects of my own culture. It is enlightening and eye-opening. Finally, the collegiate system (which is unique to OxBridge to the best of my knowledge) is outstanding. The colleges offer a sort of social, logistic, and administrative umbrella to the students. I understand they also play an academic role for undergrads, but I don’t really know so much about that. The best thing about the college system is that it provides an opportunity to create social circles that are independent of your research area. In my previous academic experiences, my social circles mainly consisted people on my own programs. This has many benefits, but also serves to generate slightly homogenous bubbles of people with similar backgrounds, interests, and perspectives. Since colleges contain students from all programs and are a big part of the social life, you have the opportunity to make friends with a broad range of academic interests. This broadens horizons and introduces a lot of variety into the types of, and perspectives in conversations that are held. Its also nice to have social circles where you can kind of disconnect from day-to-day work. In short, coming to Cambridge has been one of the best decisions of my life. It has enabled me to work with world-leading experts, build my character, give me many new perspectives, and meet a wide range of people, many of whom have become life-long friends. I strongly recommend it :) ",
            "date": "Answered December 31, 2017",
            "views": "17",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Liang Zhao",
                    "user_href": "/profile/Liang-Zhao-103"
                },
                {
                    "user_id": "S. Socratessa",
                    "user_href": "/profile/S-Socratessa"
                },
                {
                    "user_id": "Tony Thompson",
                    "user_href": "/profile/Tony-Thompson-44"
                },
                {
                    "user_id": "Milina Kosanovic",
                    "user_href": "/profile/Milina-Kosanovic"
                },
                {
                    "user_id": "Tahnee Stockhem",
                    "user_href": "/profile/Tahnee-Stockhem"
                },
                {
                    "user_id": "Robin Harville",
                    "user_href": "/profile/Robin-Harville"
                },
                {
                    "user_id": "Fred Feinberg",
                    "user_href": "/profile/Fred-Feinberg"
                },
                {
                    "user_id": "Rainer Sida Sitanggang",
                    "user_href": "/profile/Rainer-Sida-Sitanggang"
                },
                {
                    "user_id": "Ajay Kumar",
                    "user_href": "/profile/Ajay-Kumar-417"
                },
                {
                    "user_id": "Shalini Yadav",
                    "user_href": "/profile/Shalini-Yadav-23"
                },
                {
                    "user_id": "James Rampersad",
                    "user_href": "/profile/James-Rampersad-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Smith",
                "href": "/profile/Jonathan-Smith-89"
            },
            "answer_text": "Kind of special (but, at the time, I didn’t have anything else to compare it to). So the surroundings at Cambridge are pretty impressive, there’s history everywhere, there are an awful lot of clever people (and some not so clever people), there are institutions that are older than many countries, and the collegiate system’s almost designed to give you all the feels (as the young people would say). As a for example, I had a friend who (allegedly) had Sir Isaac Newton’s old rooms, my third year room was in a building named after George Mallory who may (or may not) have made it to the summit of Everest in the 1920s, and that was just a normal everyday thing. Add in that the university played first class cricket at that point (with future England batsman John Crawley starting in my second year), and you could see top class rugby union at Grange Road (although it was all amateur in those days), and you were aware that what was normal for you wasn’t normal for anyone else. And then you’ve got the Boat Race, Footlights, etc., etc. ",
            "date": "Answered December 19, 2018",
            "views": "277",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Graham Giles",
                    "user_href": "/profile/Graham-Giles"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rosalind Turner",
                "href": "/profile/Rosalind-Turner-1"
            },
            "answer_text": "I can only answer for Cambridge. Cambridge is a stunning place full of lively, intelligent people. If you get there embrace it fully. Don't waste your energy on negative thoughts of not deserving to be there as I must admit, I did. To belong to one of the most prestigious, intelligent communities in the world is an honour to be embraced - remember it's a life long experience- once matriculated you are part of the Cambridge family. Enjoy it! ",
            "date": "Answered August 19, 2017",
            "views": "629",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Drucker",
                    "user_href": "/profile/David-Drucker-3"
                },
                {
                    "user_id": "Steph Lim",
                    "user_href": "/profile/Steph-Lim-10"
                },
                {
                    "user_id": "MuhAmmad NaEem",
                    "user_href": "/profile/MuhAmmad-NaEem-198"
                }
            ]
        }
    ]
}