{
    "title": "How should I start preparing if I want to get into the United States Air Force Academy? - Quora",
    "tags": [
        "US Air Force Academy Preparation",
        "United States Air Force Academy",
        "U.S. Air Force"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Stein",
                "href": "/profile/Bill-Stein"
            },
            "answer_text": "I’m going to repeat what others have said, and add a little more. Get the best grades you can get. Work hard at school. If you can take AP or college-level classes, do that. It shows your ability to handle the academic rigor of college.Get into an ACT or SAT prep class. I know it’s a little early to be thinking about those classes, but they help. Anything to help boost your test score is helpful, and those prep classes do help.Make sure you are participating in team-level sports at your high school. If you’re not, start. About 95% of applicants who were accepted into the Academy have participated in team sports. About 80% of those had earned varsity letters in their sport. Those numbers tell you that team sports are very important in the selection process.Make sure you are participating in volunteer activities outside of your school. Volunteering with your church or in your community is another important aspect of your portfolio.Use the Air Force Academy Admissions website. Get to know that site. Read all sections of the site, even if you don’t think they pertain to you. Use the Admissions Tracker on the site to track the things you need to do. Use the Admissions Liaison Officer (ALO) Locator to find your ALO and reach out to him/her. It’s never too early to start that conversation.Research commissioning sources. Your local Congressman is usually the place to go with the best chance of success. Research what your Congressman requires for a commission. You can discuss that with your ALO as well.Ask questions! If something is unclear, ask about it before it becomes an issue.Good luck! ",
            "date": "Answered June 26, 2017",
            "views": "395",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ken McFetridge",
                    "user_href": "/profile/Ken-McFetridge"
                },
                {
                    "user_id": "J Sweeney",
                    "user_href": "/profile/J-Sweeney-14"
                },
                {
                    "user_id": "Morgan Callahan",
                    "user_href": "/profile/Morgan-Callahan-3"
                },
                {
                    "user_id": "Joe Francis",
                    "user_href": "/profile/Joe-Francis-3"
                },
                {
                    "user_id": "Christopher Bingman",
                    "user_href": "/profile/Christopher-Bingman"
                },
                {
                    "user_id": "Devon Toms",
                    "user_href": "/profile/Devon-Toms-1"
                },
                {
                    "user_id": "Ronnie Grondin",
                    "user_href": "/profile/Ronnie-Grondin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Styles",
                "href": "/profile/Justin-Styles-1"
            },
            "answer_text": "Application deadlines for USAFA are easily searchable online. Sophomore year is a good time to start planning out how to get you application together as you will need to start actually taking care of application pieces during your junior year. There are a few actionable things you can do now, however. Figure out who you will want and/or need recommendation letters from. These may be for the academy application itself, or for your application to your representatives for their nomination. Teachers and coaches make excellent options. Better yet, if you have a coach for a sport that you play in who also teaches academic classes, make sure to impress them. If they are a veteran, even better. My swim coach was a retired E9 navy seal. His letter probably gave me an edge in my application.Speaking of state representatives and their nominations, each state runs these a bit differently… and perhaps each representative. The rep’s website usually has a link for this… otherwise call their office and ask about it. Some states are very competitive. I started my application process in California where there are plenty of qualified candidates. Both senators and my congressman each had their own applications for nominations… and each was longer than the academy’s application packet. Then I moved to Oregon at the start of my senior year. Oregon does not have enough qualified applicants to the academies. There was a single two page application that went to a team that took care of all nominations for both senators and my district’s congressman. Consider writing a letter (not an e-mail) of intent to apply to USAFA to your representatives…. do that this year. It never hurts to get your name out front. A real power play would be to find a way to volunteer or do a work experience with your representatives’ office teams.Get ready physically. I was a 4 year varsity swimmer, 4 year varsity captain, and had been a league competitive swimmer since age 6. I was fast in the water. I could hike all day with a pack. I could work a 10 hour day digging ditches in red clay. I was NOT ready for the academy’s physical fitness tests. Pull ups, push ups, sit ups, standing broad/long jump, 600m sprint, 1.5 mile run… all with proper form and in large quantities/at fast speeds will be required. Failing the candidate fitness test while applying for the academy or underperforming on the physical fitness test while at the academy is a pretty bad thing. Look at what the minimums are for these tests and aim to do double of number reps for pull ups, push ups, and sit ups…. as YOUR minimum. For the running portion, use this formula for a goal: [(Maximum allowed time - maximum point scoring time)/3]+maximum point scoring time. That will give you a plenty fast time to shoot for. The standing jump… just practice it. There are probably some good things to do to train your standing broad jump skills… not my strong area. If you can max out the physical fitness tests and just not have to worry about them, your life will be easier. Practice doing the entire physical fitness test in order and exactly as it will be administered. There are trash cans at the end of the PFT course for a reason… cadets puke after taking the test on not a rare occasion. Also, the academy “grades” cadets on military (MPA), academic (GPA), and athletic (APA) performance on a 4.0 scale. Your instructors may make a crazy test that kills your GPA. MPA may as well be arbitrarily assigned and the cadet can basically only impact the score negatively. You are 100% in control of your APA. There are not a lot of things that a cadet is 100% in control of. Take it where you can.Also… get a pair of very basic combat boots. Break them in and start running in them now. Learn how to run in boots correctly… it isn’t really the same as running in “proper’ running shoes. Running 6 or so miles in BDUs, with a dummy rifle in your hands, at a pace that you don’t like (too fast, too slow, odd stride length because you are in formation), singing jodies, stopping occasionally to do push ups, flutter kicks, or other exercises, is not something most prospective cadets train for…. but it is of benefit if you take the time to do it. Just don’t be the weirdo running through your neighborhood in a combat uniform, with a rifle, singing about how “blood blood, blood makes the grass grow.”Learn to study if you don’t know how to already. I didn’t study in high school. I didn’t study in the college courses I took while in high school. I had a 4.0 GPA. My graduation GPA from USAFA was 2.51. I went in not knowing how to study because all previous school had been “too easy.” One can always study more, harder, or better. Learn to do this before getting to the Zoo.Good luck and blue skies! ",
            "date": "Answered June 26, 2017",
            "views": "409",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lucas Hale",
                    "user_href": "/profile/Lucas-Hale-9"
                },
                {
                    "user_id": "Jean Lopez",
                    "user_href": "/profile/Jean-Lopez-19"
                },
                {
                    "user_id": "Ken McFetridge",
                    "user_href": "/profile/Ken-McFetridge"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Andrew-T-113"
                },
                {
                    "user_id": "J Sweeney",
                    "user_href": "/profile/J-Sweeney-14"
                },
                {
                    "user_id": "Pranath Ram",
                    "user_href": "/profile/Pranath-Ram"
                },
                {
                    "user_id": "Ronnie Grondin",
                    "user_href": "/profile/Ronnie-Grondin"
                }
            ]
        }
    ]
}