{
    "title": "How would environmental awareness help to protect the environment? - Quora",
    "tags": [
        "Environmental Awareness"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kenny Coffin",
                "href": "/profile/Kenny-Coffin"
            },
            "answer_text": "OKay!!!! First, knowledge is power! In order to understand how to protect the environment from ones own danage, one must be aware of their position in the environment. We are all part of the eco system not above it. The water we drink has been recycled for millions of years. It’s literally dinosaur pee. If you realize that you are as significant as a dung beetle, about as equally evolved as a lemur, and as about as relevant as a pile of bones, then you will respect your place in this world. Awareness of ones place in the world places one into a understanding of ones role in the environmental sustainability model. If you have something you respect and you maintain it, upkeep it, look after it, you will be ok. If you disrespect it, abuse it, and dishonour it, you will be destroyed by it. If people are spiritual at the very least, not necessarily religious, just understanding enough to be humble enough to respect the power of nature, everyone conforms to sustainability 100%. The only people that don’t are that 1% that are arrogant, self centred, and greedy that need to be put into their place quickly and forced to do the right thing. Overall, we can fix our environment. We don’t need to give up our amenities to do it and given time, we can evolve technology to overcome the issues we face today if we can eliminate greed. ",
            "date": "Answered April 9, 2018",
            "views": "849",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christina Ellkay",
                "href": "/profile/Christina-Ellkay"
            },
            "answer_text": "Wow, what a question. This is more opinion-based than anything, although you can check around and find more facts to support it. Environmental awareness means understanding the consequences of your day-to-day actions to the environment around you. Is that product made of recycled materials? Is there a recycle place near me that will take my cans/paper/bottles/etc.? Do I really need to drive to that store, or can I walk there, bus, or wait until I’m doing other errands, to save on gas? And so on. And most importantly, does it matter if I don’t care? Yeah, it matters. A lot of ‘environmentally aware’ actions and options can save you money on electricity, heating, products and taxes. But more importantly, it does two things: (1) it reduces the pollutants we all put out by virtue of being on planet Earth. Pollutants are chemicals in the wrong place, at the wrong time, which damage humans, animals, plants, and the rest of our natural resources. (2) It reduces the use of those natural resources (water, soil, air) to the minimum, or it reminds you that you need to replace what you took. The word ‘sustainability’ gets tossed around a lot without being defined. Really, what it means is: we all get to live and thrive. Humans (which are dependent on—) ,plants (which effect the— ), microscopic animals (which clean up the), water (we need to live), air (which we and the plants breathe) all of which goes around in all the chemical cycles we’re not always aware of. And yes, you can do this economically. It just requires more planning, more connections, and more awareness. If you want to produce something that increases pollutants, increase your awareness of how to dispose of it properly. If you want to buy something that uses up resources, find someone who wants to replenish that area (at a profit! It can be done). PLANNING. Lack of awareness doesn’t shut off these processes. Or stop the effect of too much consumption, not enough clean-up. ",
            "date": "Answered February 10, 2018",
            "views": "27",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shristi Dogra",
                    "user_href": "/profile/Shristi-Dogra"
                },
                {
                    "user_id": "Planet Lofire",
                    "user_href": "/profile/Planet-Lofire"
                },
                {
                    "user_id": "Peter Chandler",
                    "user_href": "/profile/Peter-Chandler-26"
                }
            ]
        }
    ]
}