{
    "title": "How to study as well as work at the same time - Quora",
    "tags": [
        "Study Habits",
        "Time Management",
        "How-to Question",
        "Studying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bryce Christensen",
                "href": "/profile/Bryce-Christensen-1"
            },
            "answer_text": "With effort. I am not sure how else to say it.  I have experience working and going to school- I did it for 3 years of undergrad and 3 years of graduate school (with a year in between).  That spanned two different employers and a career transition (as well as a change in educational focus).  On a personal note, it also spanned the birth of 3 children. There were a lot of days when I woke up and was less than motivated to go to work.  There were days when I got off work and didn't want to go to school.  Most nights, by the time I got home, I didn't want to study. Things I did that helped compensate for the load: I took one day (in my case Sunday) all of the way off.  No work.  No school.  No homework.  I went to church, I spent time with my wife and later with my kids, and we usually went over and spent time with other people we enjoyed spending time with.I gave myself a break after I got home.  No matter how much homework I had, I usually gave myself at least an hour to decompress (which usually included eating dinner) when I first got home.  I did better on reapplying myself to my homework after a break.  Much more so if the break involved physical activity, like playing with my young children.I prioritized like crazy.  Getting things done was a priority, but getting an A on every assignment or exam was a luxury.  I learned to be very happy with Bs during my graduate school years.I looked for easy classes any time I wasn't directly interested in learning the material (which is to say, when accomplishing elective classes).I put off a lot of things.  Many household repairs waited until I graduated or at least the week or two between semesters (I also attended summer sessions most years).  We didn't travel much except one trip a year to visit my in-laws, roughly a 30 hour drive.  We didn't often go try that new restaurant or go see that new movie.But all of those compensating steps didn't make it stop being a huge amount of effort.  So just commit to finishing, then dig in and get it done. Good luck. ",
            "date": "Answered August 27, 2015",
            "views": "26",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jit Bhattacharya",
                    "user_href": "/profile/Jit-Bhattacharya-5"
                },
                {
                    "user_id": "Collin Pin",
                    "user_href": "/profile/Collin-Pin-1"
                },
                {
                    "user_id": "Aksha Khaling Rai",
                    "user_href": "/profile/Aksha-Khaling-Rai"
                },
                {
                    "user_id": "Jasper Ampeloquio",
                    "user_href": "/profile/Jasper-Ampeloquio"
                },
                {
                    "user_id": "Tushant Verma",
                    "user_href": "/profile/Tushant-Verma-6"
                },
                {
                    "user_id": "Belle Fern",
                    "user_href": "/profile/Belle-Fern"
                },
                {
                    "user_id": "Bruna Samanta",
                    "user_href": "/profile/Bruna-Samanta"
                },
                {
                    "user_id": "Nick Samoylov",
                    "user_href": "/profile/Nick-Samoylov"
                },
                {
                    "user_id": "Er Aakash Anil Walde",
                    "user_href": "/profile/Er-Aakash-Anil-Walde"
                },
                {
                    "user_id": "Frank Medallada",
                    "user_href": "/profile/Frank-Medallada"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ifeoluwa Egbetade",
                "href": "/profile/Ifeoluwa-Egbetade"
            },
            "answer_text": "Combining work and study isn't an easy task as it comes with its pros and cons. However, once the decision is taken, you can utilize the following tips to balance your work and study; - Try to inform the management at your workplace about it to avoid conflict of interests. - Have a financial backup and ensure that your loved ones support you as that emotional reinforcement cannot be ignored. - Inform your tutors that you're a working student so that they can create a flexible schedule for you. - Get your lecture timetable as early as you can for early planning. - Stick to the given schedule and ensure that you meet your set targets. - Rewarding yourself for achieving the above goals isn't also a crime. - Get one or two of your colleagues at work who can still fill in your vacuum at the workplace whenever possible. - Make friends with your classmates and figure out the dependable ones among them that can keep you posted.  - It shouldn't all be about your work and school, so spare some time to pamper yourself. - For goodness sake, kindly take a break whenever you feel overwhelmed with your studies Ifeoluwa Egbetade's answer to What do you do when you are overwhelmed by the study material you have to study for an exam?. - Get yourself a study environment that you can easily maintain. - Remember to organize yourself as well as your resource materials and don't miss out on any study group activities if you have one. - Keep your mind at rest and never forget that you've got all it takes to succeed. You can also check this link for more insights; 14 Success Precepts to Always Keep Handy Cheers. ",
            "date": "Answered March 4, 2018",
            "views": "720",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shyam Soni",
                    "user_href": "/profile/Shyam-Soni-11"
                },
                {
                    "user_id": "Dammy Akinwale",
                    "user_href": "/profile/Dammy-Akinwale"
                },
                {
                    "user_id": "Esther Ayantokun",
                    "user_href": "/profile/Esther-Ayantokun"
                },
                {
                    "user_id": "Julie Salcedo",
                    "user_href": "/profile/Julie-Salcedo-2"
                },
                {
                    "user_id": "Sachin Dukale",
                    "user_href": "/profile/Sachin-Dukale"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alejandro Perez",
                "href": "/profile/Alejandro-Perez-39"
            },
            "answer_text": "To study and work at the same time may be difficult.If you have to work, take twelve credits or less depending on the requirements to study at the institution of your choice.That study load will give you some time to work.You can also enroll in evening or in Saturday classes and work during the week.  Cconsider dividing the day to work and study as follows:    About four to six hours to sleep.    About seven to ten hours to work.    About six to eight hours to study.These times are approximate and rotational.That means that you have to accomodate all your daily needs and change the schedules to fit your purpose for each day.If your college does not require every day attendance to classes you may work out special arrangements with your professors to accomodate study and work itineraries.If your college requires every day attendance to classes, consider a free attendance university or internet accredited classes.Any way you go, keep in mind that you need to study most of your time after classes. ",
            "date": "Answered August 29, 2015",
            "views": "670",
            "upvotes": " Answer requested by Sama Salem",
            "upvoters": [
                {
                    "user_id": "Mam Mondol",
                    "user_href": "/profile/Mam-Mondol"
                },
                {
                    "user_id": "Nown Knu",
                    "user_href": "/profile/Nown-Knu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reen Aisal",
                "href": "/profile/Reen-Aisal"
            },
            "answer_text": "Work and study at same time is hard but not impossible. Its possible. When u try to manage time and work. When i studied with work. I prioritized my daily tasks and i did not slept 10 hours i just slept aprox 6 hours or sometimes 4 to 5 hrs at night. In my terms i had to study by myself i did rutine chores at daytime, socializing with family, caring of kids, meals preparing, laundry, ironing, cleaning, dishes eveything. And at night from 10pm — 2am or 3am i used to do self study. This i aplied in both bachelors plus ielts preps. Sometimes when i became sleep deprived i used morning time for revision as for example i use alrm to wake up at 4am when i was max tired n sleepy i do slept and make sure to be awake at 4am to 7am to study revise when exams came near by. Hope it helps. With family time n kids u can spare ur night time for few years u have to ruin sleeps for good grades. ",
            "date": "Answered February 28, 2020",
            "views": "322",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joel Andrews",
                    "user_href": "/profile/Joel-Andrews-3"
                },
                {
                    "user_id": "Piyush Choudhary",
                    "user_href": "/profile/Piyush-Choudhary-90"
                }
            ]
        },
        {
            "author_info": {
                "name": "SONU Gulale",
                "href": "/profile/SONU-Gulale-3"
            },
            "answer_text": " I think i am eligible to answer these one. I am a teacher as well as a p.g. student.It was little tough in initial time when i got admission in p.g because managing time was tough.In day time I do work and in evening I attain classes for p.g.Now as each semester is costing me ₹ 25000, I have to perform well both at work and at college.These because from 1source I'm earning and to other I'm paying my hard earn ₹.Now from here I'm sharing my game plan which helped me a lot in balancing my work and studies. I calculated the time which I was spending on my day to day activity.Look out for loop wholes where I was wasting my crucial time.Created a time table starting from waking up at early 4:30 am and sleeping at 11:00 pm sharpThese time table includes my exercise time, job time, meal time, study time, college time, hobby time, and much more..Holidays playes important role. As you can constructively use it to complete your work/studies.Initially it was hard to follow the time table, but as days passed things started getting better.Now I'm giving my best at work, also performing good in p.g. , as well as i am giving time to friends and family too.Now these is what I'm after following the above game plan…Work Study Image source = my gallery. ",
            "date": "Answered April 7, 2020",
            "views": "331",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kiran Kaur",
                    "user_href": "/profile/Kiran-Kaur-237"
                }
            ]
        },
        {
            "author_info": {
                "name": "Darren Lim",
                "href": "/profile/Darren-Lim-127"
            },
            "answer_text": "Well its definitely not an easy task doing both at the same time but here are some Organisational In terms of time management and scheduling, try to have a clear routine done up every Sunday. From here, this will ease the burden you will have on your life. Socially I ain’t going to lie - its going to be tough as hell socially. Try to have a small group of super close friends - you are going to need them when the going gets tough. Work done Face it. Its going to be hell if you choose to procrastinate and study your exams a week before everytime . Just be consistent and spread your work out. Cut out activities like Netflix etc. ",
            "date": "Answered March 4, 2018",
            "views": "205",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sahil Yeole",
                    "user_href": "/profile/Sahil-Yeole"
                },
                {
                    "user_id": "Adarsh Patel",
                    "user_href": "/profile/Adarsh-Patel-47"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ankur Gohane",
                "href": "/profile/Ankur-Gohane"
            },
            "answer_text": "The prime and familiar answer to this is- Time Table Time table is something which seems very childish, but is a huge point of benefit. This is very important for those who have many responsibilities. Make your time table, give suitable timing to everything you do which should include a proper rest and some relaxation time. Now, making a time table isn’t a big deal, but following the same is way too difficult than how it seems to be. Procrastination is a huge problems among people around us. The one who tackle the same has an ease to succeed! Good luck ",
            "date": "Answered June 15, 2020",
            "views": "100",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gaurav Kumar Tiwari",
                    "user_href": "/profile/Gaurav-Kumar-Tiwari-11"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/CA-Amarnath-Gupta"
                },
                {
                    "user_id": "Tushar Kachave",
                    "user_href": "/profile/Tushar-Kachave-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lavina Dhanwani",
                "href": "/profile/Lavina-Dhanwani-1"
            },
            "answer_text": "I am currently working with TUV SUD South Asia Pvt Ltd, also not to forget I am pursuing my CMA for which I must write exams twice a year. This article is not about me, it is about all those who are struggling whether they should study or work or do both? I personally believe that everything is possible, nothing is rocket science. It is just that the situation is difficult but it is not impossible, there are few tips and experience in this article which will surely help you out in this sort of situation. So very importantly, you need to ask yourself about further studies which you are planning to do. How beneficial it will be for you in terms of Knowledge, in terms of your career scope and get the information about the structure and difficulty level of your exams. If it is easy, there is no point in thinking all this. You can start working without any second thought, You can simply take one weeks off and clear the exams with flying colors. Now chances are high that these types of PROFESSIONAL Exams will be difficult, you need to give your best to crack them but that doesn’t mean you must be at home and study all the time. Life will become boring, hence it is very much advisable to go out and gain some practical knowledge. Trust me guys, I have seen people with so many degrees but no practical idea about what and how markets is doing? Few Tips about your study schedule: 1. Always plan your studies, immediately when you get to know about your syllabus, based on chapters and subject you can allocate time to each subject. 2. Stop Wasting Time, people. 3. Make the most of your weekends, because if you sacrifice some fun now, you can enjoy later without any regrets. 4. Prefer online Virtual Classes over personal tuitions. 5. Stick to the modules provided by institution. Tips about your Job/work profile/ to be employer: 1. Make sure the employer is aware about you pursuing your professional courses, it will ultimately help you only, if you are lucky enough because they will support you and groom you. 2. Never ever work or reject the offer for money, because at this stage of your life knowledge is important. 3. Discuss about the leave period with your Reporting Manager and make sure You get leaves for at least 3 Weeks. 4. While working always try to link the dots, try to relate practical procedures with your curricular. 5. Last but not the least, Be Patient!! At the end, all that matters is your thought about the situation. If you set this thing in your mind that you can do it then nobody can stop you. All the Best. ",
            "date": "Answered April 7, 2017",
            "views": "564",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Majda Aiboud",
                    "user_href": "/profile/Majda-Aiboud"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Samoylov",
                "href": "/profile/Nick-Samoylov"
            },
            "answer_text": "Not easy, especially if it lasts for years. But can be done and was done by many people. Just try not to be cornered by deadlines, so you can somewhat respond to the needs of your body. Otherwise, if your physical and/or psychological health will factor in, the challenge might start snowballing.  Start easy and be active. Respond to the job requirements unconditionally and quickly, so you do not think about it twice. Then study and do your homework also immediately - do not procrastinate. If feel energy left, do not load yourself with more other stuff, take it easy and relax or, better, do sports. Time will come when you will need to work harder, so do not stretch yourself, do things and sleep well.  And remember, it will end. Until then, no deviation from the set plan. ",
            "date": "Answered August 27, 2015",
            "views": "622",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Cat Kivett Smith",
                    "user_href": "/profile/Cat-Kivett-Smith"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Freedman",
                "href": "/profile/David-Freedman-51"
            },
            "answer_text": "You prioritize your time appropriately. When I was working on my second college degree, I had days where I worked, and then other days I went to school. On all days I would be studying unless school was out (winter or spring vacation), in which case I would still be working at my part-time job. I will also acknowledge that for the two years I was going back to school, I had a lot of seven-day work weeks because of my studies and employment. However, it was worth it in the end to get a decent job in a career I’d worked hard for, which in this case was medical transcription. ",
            "date": "Answered February 25, 2020",
            "views": "75",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joab Og",
                    "user_href": "/profile/Joab-Og"
                },
                {
                    "user_id": "Rohit Kumar",
                    "user_href": "/profile/Rohit-Kumar-1822"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gamini De Silva",
                "href": "/profile/Gamini-De-Silva-2"
            },
            "answer_text": "You have to protect your job as the first thing because continuing studies depends on affordability which might be a problem without a job. Studying involves listening, taking down notes, remembering the facts learnt, short notes, revision, answering tutes, doing practicals, discussions, computer searches, and passing the exam. Employment and studies must be separated by relaxing which includes exercises, pleasurable activities, sleep, personal activities and just relaxing. Dont take your office work home because you lose relaxation time. Do your revision and tutes without delay be prepared even to submit them next day. Identify the unimportant items from the relaxation activities and cut them down. It is not a bad idea to utilize your intermissions in the office work to quickly go through your short notes. Have a good night's sleep. ",
            "date": "Answered October 26, 2020",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Apoorva Bhaskar",
                "href": "/profile/Apoorva-Bhaskar-3"
            },
            "answer_text": "Hi, It's a common problem for CA students. I don't know what course your are pursuing and what is the nature of job you perform . So I will not be able to guide you in detail. But I can tell you my study plan when I was going to Articleship (basically internship) and I had to study for my CA FINAL exams. Here we go: Early morning wake up at 5:45 am. Get freshen up. Start studying at 6am. During initial days of this kind of schedule, I suggest you to take up some practical subject where you can keep your active in solving problems. Lateron our brains get used to the timings, then you study theory subject in the morning because memory power is high in morning time.Plan accordingly and study till 8 am or 9 am based upon your office timings.In office, we all know that not all 9 hours we will be working. We all get some break time, use mobile phones. I am not telling to cut all entertainment activities. Instead reduce it and dedicate that time to revise whatever you have studied in the morning.After you come back from office, DONT take rest. Get freshen up and start studying. If we take rest, usually we don't study. If u are sure that you can study after taking rest, then you can go ahead. Study till 9pm. Have dinner, watch some shows. Then sleep.Revision is very very important. Keep some specific time for revision every day.Entertainment is also important to keep our brain active. So reduce such activities but not Completely remove it.Sunday: Keep your most of the time for studying. If u are able to study entire day, then it's awesome. The topic which you are able to study in 3–4 days while working, you are able to cover it in the single day.Hope this content helped you. ",
            "date": "Answered August 27, 2019",
            "views": "260",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Julie Salcedo",
                    "user_href": "/profile/Julie-Salcedo-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aarti Mishra",
                "href": "/profile/Aarti-Mishra-56"
            },
            "answer_text": "Hi, Working and studying at the same time is absolutely fine. It’s all about time management If you learn this, You will able to work along with your study. You only need to understand a work profile, it is suggested to go for part time work as this will give you enough time to study at your institution and then you devote 100% at your work place too. It’s really good to earn with learn, and having experience while studying, this will lead you to know the work culture and also will help to use and understand the concepts you are studying in your institution. Thanks Aarti Tripathi ",
            "date": "Answered March 4, 2018",
            "views": "121",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Khushboo Sharma",
                    "user_href": "/profile/Khushboo-Sharma-288"
                },
                {
                    "user_id": "Om Prakash Pandey",
                    "user_href": "/profile/Om-Prakash-Pandey-1"
                },
                {
                    "user_id": "Asim 'ZigmA' Khan",
                    "user_href": "/profile/Asim-ZigmA-Khan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arzoo Chhabra",
                "href": "/profile/Arzoo-Chhabra"
            },
            "answer_text": "There are a few things I like to juggle tasks in life: Focus and make hard stops: I set out to study for specified number of hours and only focus on the problem at hand. I have been having a hard time to stop when I get really interested in the topic mostly because I design my day myself and there aren’t any hard stops. But it’s important to not get lost in the forest for trees to stay productive.Cut out social media: Deleting facebook and instagram applications have really created more space in my brain and life where I can dwell on things I am currently improvising.Keep your you time on a regular day: Packing my day with just “things to do” makes my day very productive but depletes me at the end of the day. Remember that all cerebral activities need brain power and we all have limited brain power. I meditate and work out to blow off steam.Reflect back and reward yourself: After a productive week of checking boxes in my journal, I give myself an ice-cream and a walk in the nature. This is equivalent to having a cheat day in your weight loss journey.Meal PREP: It’s important for me to eat healthy to keep myself productive. It’s vital for me to meal prep in advance to keep a sound body and mind.",
            "date": "Answered April 17, 2020",
            "views": "202",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amit Prakash Pandey",
                "href": "/profile/Amit-Prakash-Pandey-1"
            },
            "answer_text": "Time management is something tricky to take care of. But it is very easy and entertaining if you are able to do it as it takes out boredom from your life and makes your life more interesting and challenging. How you go about it, depends on how related your job and study are. If they have a lot in common, for example, someone enrolled in a technical course doing similar technical stuff at job would find it easier to manage both. But if your job has nothing similar with what you want to study then free timings are all you need to focus first. Besides, it also depends upon nature of work at job, for example, if it is a desk job, then you can manage to study in free time but if it involves too much physical activity then most probably you will be too tired to do study afterwards. Since from your question, it is not very clear about what kind of job you do, how much free time you get and what course or type of study you want to do. So I will suggest you to usual approach. Make a list of free time you get in a week. Let’s say, you get 4 hours free everyday on weekday and 6 on weekends. Then write down those number of hours in which you can sit and study properly without any disturbance and also think about some hours which you are free but you can’t sit and study ( if you commute through public mode of transport or walk to your office, this would come under this category). Then analyze your syllabus and fix some topics for each day according to available time slots. You can go for some audio/video lectures for the duration in which you commute to office by some public transport. Since, in any study, revision plays an important role; so you can keep those hours which are not that disturbance free for revision and keep continuous longer hours for making notes and reading new things. Hope that helps. Best of Luck! ",
            "date": "Answered November 5, 2017",
            "views": "417",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Makiaveli Makiaveli",
                    "user_href": "/profile/Makiaveli-Makiaveli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nell Belle",
                "href": "/profile/Nell-Belle-1"
            },
            "answer_text": "Get a big calendar or planner, start with what you cant change. Like classes, list the mandatory lessons, groups, appointments, study blocks. Look at work, is it part time, casual, are there regular shifts? If not, can you get regular shifts. It’s about having structure and routine. Look at what is left, is there enough space left for your time? Just like you should always pay yourself some of your wages, you need to have guilt free down time. And if there’s not enough time for you, change something. Whether you roster yourself ‘off’ every second Saturday and Tuesday, or Monday mornings and Friday nights, you have to give yourself a break. And say no to people, if you want to stay in bed and read a book, do it. If you want to go see a movie, do it. Pencil yourself in to your schedule. If you don’t give yourself some quiet time to relax and recharge, you wont need to balance the rest, because you’ll end getting fired from work and dropping out of school. ",
            "date": "Answered October 28, 2017",
            "views": "362",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shruthi Racherla",
                    "user_href": "/profile/Shruthi-Racherla"
                },
                {
                    "user_id": "Babli Sharma",
                    "user_href": "/profile/Babli-Sharma-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srihari Jwalapuram",
                "href": "/profile/Srihari-Jwalapuram"
            },
            "answer_text": "Time management is a time for all and all has time. Your question seems little funny. While working studying is highly possible by following few tips. Do work properly, negligence of work results work intrude on your life. So studying becomes difficult. Work at office, reading at home. Discussing about office at home or plans at home must not chalk out at office. Follow my opinions then it will be alright. Please read time management. Best time to study is when you're at home. Switch off mobile or put in airplane mode. So no disturbance will come from honey traps. ",
            "date": "Answered December 9, 2017",
            "views": "125",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jaimin Galaiya",
                    "user_href": "/profile/Jaimin-Galaiya-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin J Pitt",
                "href": "/profile/Martin-J-Pitt"
            },
            "answer_text": "Lots of full-time students have part-time jobs. Lots of people in full-time work study part time, including full degree courses. It is not advisable to attempt to work 40 hours a week on a job and 40 hours a week on studying. It is rarely practical to schedule this, and against all the regulations of universities I know, who usually set a limit of 16 hours per week (paid or not) for students who are registered as full-time. About half this would be reasonable. Note that working students sometimes get conflicts when the employer wants (needs) the student for something urgent. In my experience students who work in a family business have this especially hard. ",
            "date": "Answered July 23, 2019",
            "views": "216",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rohith",
                    "user_href": "/profile/Rohith-13"
                },
                {
                    "user_id": "Sujeet Kumar",
                    "user_href": "/profile/Sujeet-Kumar-475"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sundararajan Seshadri",
                "href": "/profile/Sundararajan-Seshadri"
            },
            "answer_text": "I am slightly confused: people worry about balance of job and life. You refer to study. Are you still a student? Do you already have a job? Assuming that you are still studying and have managed to get a job, I would suggest the following: (a) Remember Study assumes more importance and priority than the job at this stage. (b) Have a fixed time for study and if there is a spill over, do provide for it from the time allotted to job (c) Normally do not accept time-critical jobs as any extra time for the job might affect the study. However, if it becomes unavoidable, let it be a short duration one and in this case, make an exception to the above rules. The job has to finish within the time allotted. Good luck. ",
            "date": "Answered May 7, 2019",
            "views": "120",
            "upvotes": " Answer requested by Raj Nathan",
            "upvoters": [
                {
                    "user_id": "Karthick josh",
                    "user_href": "/profile/Karthick-josh-1"
                },
                {
                    "user_id": "Mandeep Man Bajimaya",
                    "user_href": "/profile/Mandeep-Man-Bajimaya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chandrashekhar Ranade",
                "href": "/profile/Chandrashekhar-Ranade"
            },
            "answer_text": "Early morning between 5 -7 or late night between 10 - 12.00 midnight I.e. for 2 1/2 hours with 10 minutes break every 30 minutes . More important is How to learn scientifically . For more information on how to study scientifically follow my answers visit my blog on http://Quora.com watch my videos titled Mind mapping Use your Head , Mind mapping 15 Oct.2017 and read my book titled Mind mapping a journey into inner space available on Kindle Store in both ebook and paperback version . ",
            "date": "Answered November 25, 2017",
            "views": "148",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Julie Salcedo",
                    "user_href": "/profile/Julie-Salcedo-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mikhail Kotykhov",
                "href": "/profile/Mikhail-Kotykhov"
            },
            "answer_text": "Thanks for the A2A. It's pretty difficult, but it is possible. My first suggestion would be to quit studying. You only need it when you are preparing for the test. Otherwise, turn your study time into a fun and enjoable activity. There is really no universal approach here - anything can be fun and enjoyable if you find it to be so. So, this is the first and the essential step - try to find a way to make your studying enjoyable. Once you add a bit of focus to it, and a self-correction of your own mistakes, this will also become productive. Consequently, you will have a reverse situation - you will enjoy learning things so much that you will find it hard to stop. And the advice here would be simple - take breaks, breath some fresh air, do a bit of simple physical exercises after 1 hour of learning and so on. ",
            "date": "Answered August 27, 2015",
            "views": "494",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nown Knu",
                    "user_href": "/profile/Nown-Knu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trevor Andrews",
                "href": "/profile/Trevor-Andrews-4"
            },
            "answer_text": "Hi Julie, This seems a common question on Quora and I am familiar with the problem having been a tutor on a University Degree “Learning at Work” Programme for 10 years. The answer is quite simple. You need to create a work plan like my “Power of 4”. There is a short video and free downloadable guide. By planning your time you will: Improve your productivityReduce ProcrastinationBe in controlGet your assignments done on time.Hope this helps  ",
            "date": "Answered March 8, 2018",
            "views": "147",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kaif Anwar",
                    "user_href": "/profile/Kaif-Anwar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Victoria Duvall",
                "href": "/profile/Victoria-Duvall-3"
            },
            "answer_text": "You have a lot on your plate. You must be very organized to continue this routine for a period of time. That means when you leave work, do not think about it until the next day. I find it helpful to sit in the morning for a few minutes and make a list of your day. Use a planner if you can. There are 168 hours in a week! Figure out how many you need to devote to work and school. Use the rest for self care. School won't last forever so you can look forward to that time. ",
            "date": "Answered August 12, 2019",
            "views": "88",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Cosgrave",
                "href": "/profile/David-Cosgrave-4"
            },
            "answer_text": "Balancing studying and work is difficult. The most important factor in managing this balance is discipline. Without knowing your daily routine or circumstances, I would advise you to schedule non negotiable study time into your day. This means that during this time you are unavailable for anything else. The big issue with work is that people are tired and when they come home they sit down to relax. It is very difficult to get motivated to study from this position. Your dedicated study time should be built into your daily routine either immediately before or after work. Then you can relax. Focus on identifying key areas of the curriculum and practice answering exam questions as much as possible. Regular study will compound your efforts over time and will reduce the stress on you immediately before the exam. Best of luck ",
            "date": "Answered March 26, 2020",
            "views": "45",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Abhishek Ghosh",
                    "user_href": "/profile/Abhishek-Ghosh-542"
                },
                {
                    "user_id": "Shipra Trivedi",
                    "user_href": "/profile/Shipra-Trivedi-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akhil Karumanchi",
                "href": "/profile/Akhil-Karumanchi-2"
            },
            "answer_text": "You can schedule like one hour before bed time or one hour after bes time. Frank answer will be, if you really need to study and get something out of it. You don't need to schedule time, because you will alredy be in&on it whenever you get some piece of time. I can add masala to this. However my frankness is not allowing me. Thank you 😌 ",
            "date": "Answered July 19, 2020",
            "views": "53",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mani Pankaj",
                "href": "/profile/Mani-Pankaj-1"
            },
            "answer_text": "Hey there Well , well perhaps it’s the most toughest thing I believe but why should you need suggestions Because you are only one who knows your schedule , none of councillor can actually help except yourself I tell you a story 1971 December India had war with Pakistan my mother a teacher ( retired in 2001) was pregnant ; there were total blackouts in the evenings she was preparing for post graduation as well along with teaching job multitasking woman in her eighth month of pregnancy ( I was about to born ) the most difficult time for woman she continued her job , sat for post graduation exams and month later gave a birth to a baby ( me off course) You got an answer I guess Best wishes ",
            "date": "Answered May 7, 2019",
            "views": "209",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Karthick josh",
                    "user_href": "/profile/Karthick-josh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reena Saxena",
                "href": "/profile/Reena-Saxena-4"
            },
            "answer_text": "Depends on the kind of study, and the kind of job that you wish to pursue/ One of the two has to be part-time.  Maybe a study course with morning classes, weekend contact classes, online certification, distance education etc. facilities.  Or maybe a part-time or flexi-time which allows you to combine the two. ",
            "date": "Answered June 1, 2015",
            "views": "441",
            "upvotes": " Answer requested by Amrinder Singh",
            "upvoters": [
                {
                    "user_id": "Cat Kivett Smith",
                    "user_href": "/profile/Cat-Kivett-Smith"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Maycroft",
                "href": "/profile/Matthew-Maycroft"
            },
            "answer_text": "It's very difficult. I am working on a Masters while also working a very demanding job. My priority goes Family, Job, Masters. So sometimes I just have to accept turning in something less than my best work for my HW since I just don't have the time. So I would say you have to prioritize your commitments and then also ask yourself where you are putting in more time for some output than you really have too. If you can get by with less effort it frees up time for an additional goal to be worked on. ",
            "date": "Answered March 2, 2017",
            "views": "128",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anamika Gupta",
                "href": "/profile/Anamika-Gupta-143"
            },
            "answer_text": "Nothing is impossible …& yes off course it's possible… We have 24 hours..if we sleep 8 hours & doing job 8 hours , after it we have another 8 hour .. & that 8 hours should be very productive…if a person studies 5- 6 everyday. It's more than sufficient…be optimistic in your life & be focused.. I'm also studying with a job…I know it's tough but it's possible..so go with the flow and do your best… ",
            "date": "Answered May 24, 2019",
            "views": "159",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abayomi Oyindamola",
                    "user_href": "/profile/Abayomi-Oyindamola"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhavin Shah",
                "href": "/profile/Bhavin-Shah-205"
            },
            "answer_text": " Hello Julie Only study in your workplace if you have the consent of your employer. Otherwise… it’s not something I would do… because  (DON’T BITE THE HAND THAT FEEDS YOU) ALSO THINK:  Good luck Bhavin ",
            "date": "Answered March 6, 2018",
            "views": "111",
            "upvotes": " Answer requested by Julie Salcedo",
            "upvoters": [
                {
                    "user_id": "Abayomi Oyindamola",
                    "user_href": "/profile/Abayomi-Oyindamola"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akshay Deshpande",
                "href": "/profile/Akshay-Deshpande-134"
            },
            "answer_text": "You just need to carefully analyse and allot time for your study and Job if both goes hand in hand smoothly well or else you need to only focus on one thing if you are alloting much time to your job or study as I prefer study first and then job so decide the priority by yourself and go ahead Thank you ",
            "date": "Answered May 6, 2019",
            "views": "42",
            "upvotes": " Answer requested by Raj Nathan"
        },
        {
            "author_info": {
                "name": "David Phillips",
                "href": "/profile/David-Phillips-491"
            },
            "answer_text": "The key to this is planning your time. Put together a daily grid which allows time for both work, and study and class time, and follow your plan. If the plan needs modification do this along the way. The old saying is, “plan your work and work your plan.” ",
            "date": "Answered October 27, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yvette Salvaris",
                "href": "/profile/Yvette-Salvaris-1"
            },
            "answer_text": "HI there, It can be struggle to find the best match and use of your time. I have seen many students either neglect their study or neglect their work and regret it . what you need to do is set aside a specific time to do your study. For example if you work 9 to 5 each day, maybe set aside an hour or so even if its to do some reading related to your study. Just think 1 hour a day can equal up to 5 hours a week!! ",
            "date": "Answered April 3, 2017",
            "views": "345",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Nitin Panchanathan",
                "href": "/profile/Nitin-Panchanathan"
            },
            "answer_text": "Its all about time management and interest. Once we get back from work, we can relax for sometime then take up what we want to study and then start to work on it. It may look at too much to do in the beginning. But slowly once we understand the concept, it may become easy. So its about managing time effectively. We can also use weekends well on studies. I have done my MBA that way. It looked impossible but I could do it with a lot of determination and interest. Once we love what are doing, we will do it no matter what. ",
            "date": "Answered May 31, 2017",
            "views": "98",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chellappanpillai S. Radhakrishnan",
                "href": "/profile/Chellappanpillai-S-Radhakrishnan"
            },
            "answer_text": "You will do it, and do it well, when it is your choice to do so. However, if you are doing it because others are forcing you to do it, you will find one hundred excuses to ditch it in the name of lack of time, pre-occupation with other priorities , and so on. Analyse your new learning from the point of view of applying it to work or home situations, or how you can solve some pressing problems of your State or the Country. You will then find the study more interesting and less boring. Go ahead, and make a success of it. ",
            "date": "Answered May 31, 2017",
            "views": "117",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Leonardo Haddad",
                "href": "/profile/Leonardo-Haddad"
            },
            "answer_text": "You will probably have to dedicate your weekends to studying. Get enough sleep. Do as much as you can in class, since your time to study at home or at the library is limited now. ",
            "date": "Answered February 25, 2020",
            "views": "35",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Luigi Morelli",
                "href": "/profile/Luigi-Morelli-1"
            },
            "answer_text": "Yes and no. If you think this answer does not make sense, look at the question and ask yourself: Learn what?Learn at what level?Learn why? (to change your job, to leverage your knowledge, for fum…?)What work do you do when you want to study?Are you on a shift (24h) job? Do you have mornings and/or evenings free?How many hours a day do you work?Is it a hard work? An office work? A non-continuative work? A temporary work?The answer changes by changing any of the previous parameters … ",
            "date": "Answered February 27, 2017",
            "views": "282",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "SCIBA - Shivay Consciousness in Bhakti Association",
                "href": "/profile/SCIBA-Shivay-Consciousness-in-Bhakti-Association"
            },
            "answer_text": " I had seen many people who do job and see TV or social media for most of the time after coming from the job at that time you can study . If this answer was useful for you then upvote this answer and follow me . Thanks. ",
            "date": "Answered March 9, 2020",
            "views": "55",
            "upvotes": " Answer requested by Rishi Choudhury"
        },
        {
            "author_info": {
                "name": "Steve Pask",
                "href": "/profile/Steve-Pask-2"
            },
            "answer_text": "This is a very personal question, not in the sense- 'Being Rude\",but ask a question that only you can solve. Students or people will answer inches same vane, we can advise you but cannot tell you.! What hours do you do? Do you do shift work? What Recreational pursuits do you do? Do you have a family to consider? I could go on with other questions but , what I am trying to put across is,\" Time\" is the Factor.How to devide your time and strict- STRICT WITH YOURSELF! ",
            "date": "Answered October 13, 2018",
            "views": "99",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Malcolm Teas",
                "href": "/profile/Malcolm-Teas"
            },
            "answer_text": "An awful lot of people work their way through school. So yes. If you’re talking about having a job and supplementing your knowledge there, then that’s a “yes” too. For pretty much any professional job you’re doing learning will be a necessity. If you’re not learning something new you’re doing it wrong. A third take: I’ve known a number of people to get a degree (bach or masters) while they’re working a full-time job. It’s a full schedule, but people do it all the time. ",
            "date": "Answered February 27, 2017",
            "views": "413",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Martin White",
                "href": "/profile/Martin-White-74"
            },
            "answer_text": "I use the memory palace and anki.This lets me study anywhere, and even when working the memory palace lets me work in my own head.As long as you genuinely understand what you are studying and not wasting time complaining about studying, it is entirely possible to do both. ",
            "date": "Answered September 20, 2017",
            "views": "113",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ilene Cummings",
                "href": "/profile/Ilene-Cummings"
            },
            "answer_text": "Commit to a schedule and stay with it. This will allow you to pace yourself. It is important not to “try and do the impossible.” ingrace, Ilene ",
            "date": "Answered June 30, 2020",
            "views": "20",
            "upvotes": " Answer requested by Sufian Twellman"
        },
        {
            "author_info": {
                "name": "Sushmita Singh",
                "href": "/profile/Sushmita-Singh-149"
            },
            "answer_text": "Early morning and evening is good for studies. Manage these timings for studies only. And also you can study in your office time, it is not compulsory that there is always work to do in the office, so when you free in your office time you can manage your studies there also. By giving your some efforts you will be able to study with your work. ",
            "date": "Answered March 9, 2018",
            "views": "92",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kayla Ann Dipilato",
                "href": "/profile/Kayla-Ann-Dipilato"
            },
            "answer_text": "I am currently a student and a marketing associate working to promote the data collection app, Conseris. Luckily, my job allows me to work remotely, but I still schedule blocks of time for work and school. ",
            "date": "Answered September 20, 2017",
            "views": "283",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vishnu Teja",
                "href": "/profile/Vishnu-Teja-199"
            },
            "answer_text": "Yes you can do it definietly i am doing a job as well as my graduation you can opt for distance education from your nearest university and study in your free time you can do that easily thanks:) ",
            "date": "Answered March 9, 2018",
            "views": "86",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cristian Luna",
                "href": "/profile/Cristian-Luna-29"
            },
            "answer_text": "Find a job that is so menial and pointless that it gives you the time to study. Such as security guard work. Or gas station cashier. One of those. ",
            "date": "Answered February 25, 2020",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "حامد Ahmed",
                "href": "/profile/حامد-Ahmed"
            },
            "answer_text": "It's basically time management, sleep management, improving your concentration at studies & productivity at work. ",
            "date": "Answered March 9, 2020",
            "views": "12",
            "upvotes": " Answer requested by Rishi Choudhury"
        },
        {
            "author_info": {
                "name": "Ben Smith",
                "href": "/profile/Ben-Smith-1476"
            },
            "answer_text": "Eat small meals drink milk and eat fruits and you can sleep less. Get up early morning and study for one hour. Don't take junk food. ",
            "date": "Answered May 2, 2019",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andre Batchelder",
                "href": "/profile/Andre-Batchelder"
            },
            "answer_text": "Study when you can work when you have to and make sure you get lots of exercise and lots and lots of sleep ",
            "date": "Answered March 4, 2018",
            "views": "15",
            "upvotes": " Answer requested by Julie Salcedo"
        },
        {
            "author_info": {
                "name": "Firdos Malik",
                "href": "/profile/Firdos-Malik-4"
            },
            "answer_text": "Yes, I can maintain balance of study and job.By making time management.and by doing part time job also. ",
            "date": "Answered May 6, 2019",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kartik Mungole",
                "href": "/profile/Kartik-Mungole"
            },
            "answer_text": "If you are interested in further studying and you also have a job in good company, than after some time you continue study with long distance study, you are go to college only for exams. ",
            "date": "Answered July 16, 2017",
            "views": "142",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Deepak Punetha",
                "href": "/profile/Deepak-Punetha-3"
            },
            "answer_text": "Simple, I have my 2 hour work rule. I used to study 2 hour, blog 2 hour, and chill rest of the time. ",
            "date": "Answered March 9, 2020",
            "views": "22",
            "upvotes": " Answer requested by Rishi Choudhury"
        },
        {
            "author_info": {
                "name": "Arvin Chang",
                "href": "/profile/Arvin-Chang"
            },
            "answer_text": "That's a pretty vague question without further details on what you are studying and what your work is. How important your studies are to you and how important is your work for your future goals. I guess in general you have to ask yourself - in 5 years, which will I prefer... if  I had studied 20% more, or worked 20% more? Good luck! ",
            "date": "Answered August 26, 2015",
            "views": "219",
            "upvotes": " Answer requested by Jessica Feng"
        },
        {
            "author_info": {
                "name": "Karthik Vrk",
                "href": "/profile/Karthik-Vrk"
            },
            "answer_text": "that's really hard to do but not impossible. it totally depends on your time management.. manage it properly u will succeed ",
            "date": "Answered July 18, 2018",
            "views": "72",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amruta Deshmukh",
                "href": "/profile/Amruta-Deshmukh-73"
            },
            "answer_text": "If u doing job for 8 hrs then try to Study atleast for 4hrs . follow syllabus of that exam and previous question papers. ",
            "date": "Answered August 22, 2019",
            "views": "34",
            "upvotes": "0"
        }
    ]
}