{
    "title": "How is CSE in BVRIT? - Quora",
    "tags": [
        "Padmasri Dr. B.V. Raju Institute of Technology",
        "Computer Engineering Education Advice",
        "Computer Science Engineering Education Advice",
        "Computer Science Engineering"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hemanth Sanka",
                "href": "/profile/Hemanth-Sanka"
            },
            "answer_text": "First of all Congratulations..!!! You got into one of the good colleges in Telangana state .Coming to the CSE group in BVRIT ,most of the good rank students who cleared their EAMCET will be opting for CSE so you can definitely be sure that you will be with the creamy layer students of the college.The professors in CSE department are very experienced and there are various labs that will get you the practical exposure of the concepts that you will be learning in your classes if you utilise them because here the environment in the campus will be student friendly and the faculty will support us with all their experience in getting close to our goals.You could also get various chanches to attend various national level conferences and workshops that will going on in the college or outside the college premises throught the year.So you can be confident enough to join this college and make out the best use of the next 4 years of your life. College life: I can bet you that you will enjoy each day over here. It is a 110 acre campus filled with a lot of greenery unlike some of the other colleges and you will not feel yourself away from home.I recommend you to personally come to the college and observe for yourself before getting into the college. There will be lot of events going on in the college throughout the year like sports fest, Technical fest and cultural fests where you will get an opportunity to taste the life of an engineering students and take my word they are the best...:) About Placements: Around 580 students got placed during the current 2015-16 into various companies and BVRIT has got a rank of 4 in the number of students who got placements in Telangana state in private colleges criteria.So this is the proof that this college is doing better than various colleges .Many internship offers are also provided to many students by different companies in 3 rd year itself. So the college you got into is very good and it is in your hands what you want to get out from the college. Once again Welcome to the family of BVRIT. ",
            "date": "Answered July 16, 2016",
            "views": "5",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shubham Singh",
                    "user_href": "/profile/Shubham-Singh-1113"
                },
                {
                    "user_id": "Abraboina Rishikesh",
                    "user_href": "/profile/Abraboina-Rishikesh"
                },
                {
                    "user_id": "Hari Priya",
                    "user_href": "/profile/Hari-Priya-1453"
                },
                {
                    "user_id": "Rãjų Ñańdâ",
                    "user_href": "/profile/Rãjų-Ñańdâ"
                },
                {
                    "user_id": "Mohammad Irfan",
                    "user_href": "/profile/Mohammad-Irfan-454"
                },
                {
                    "user_id": "Manideep Akula",
                    "user_href": "/profile/Manideep-Akula"
                },
                {
                    "user_id": "Sai Smrutik",
                    "user_href": "/profile/Sai-Smrutik"
                },
                {
                    "user_id": "Parvathi Harsha",
                    "user_href": "/profile/Parvathi-Harsha"
                },
                {
                    "user_id": "Shreya Jukareddy",
                    "user_href": "/profile/Shreya-Jukareddy"
                },
                {
                    "user_id": "Aditya Neelakantam",
                    "user_href": "/profile/Aditya-Neelakantam"
                },
                {
                    "user_id": "Jeevan Vara",
                    "user_href": "/profile/Jeevan-Vara"
                },
                {
                    "user_id": "Jayanth",
                    "user_href": "/profile/Jayanth-120"
                },
                {
                    "user_id": "Prashanth Nandaram",
                    "user_href": "/profile/Prashanth-Nandaram"
                },
                {
                    "user_id": "Pavan Kumar Pedhapudi",
                    "user_href": "/profile/Pavan-Kumar-Pedhapudi"
                },
                {
                    "user_id": "Shanmukha Vamshi Krishna",
                    "user_href": "/profile/Shanmukha-Vamshi-Krishna"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikhil Kumar Mamidala",
                "href": "/profile/Nikhil-Kumar-Mamidala"
            },
            "answer_text": "Bvrit is one of the top engineering college in Telangana,in NIRF 2017 rankings it stood in the position of 151–200 rank..The important aspect of this college is it's location which is 40–50 kms away from any corner of the city, where you are completely free from concrete jungles and traffinoises.…The moment you enter into the college you feel relaxed and focussed…And the another aspect of the college is campus placements…in our batch overall placements were 90% above,only few students were left out as they were held up with backlogs and some of them were having different plans at that time…So performance of the placements of bvrit is outstanding….As per as CSE branch is concerned it is very good …good faculty..Very supportive etc…infact in our times it was somewhat difficult to get admission in branches like ECE,CSE,EEE,MECH and the eamcet cutoff eank for open category for ECE,CSE and EEE were below 10000 ….My conclusion is you can simply close your eyes and join… ",
            "date": "Updated May 15, 2019",
            "views": "18",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abraboina Rishikesh",
                    "user_href": "/profile/Abraboina-Rishikesh"
                },
                {
                    "user_id": "Srujana Koduri",
                    "user_href": "/profile/Srujana-Koduri-3"
                },
                {
                    "user_id": "Supraja Suraj",
                    "user_href": "/profile/Supraja-Suraj"
                },
                {
                    "user_id": "Parvathi Harsha",
                    "user_href": "/profile/Parvathi-Harsha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Madhurika Kalyankar",
                "href": "/profile/Madhurika-Kalyankar"
            },
            "answer_text": "CSE is a very good discipline in our college. The facilities provided for CSE are pretty well. You will surely enjoy the environment of our college with no doubt. Coming to placements about 60+ companies visit our college mainly IT companies. Welcome to BVRIT. ",
            "date": "Answered August 20, 2016",
            "views": "2",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abraboina Rishikesh",
                    "user_href": "/profile/Abraboina-Rishikesh"
                },
                {
                    "user_id": "Parvathi Harsha",
                    "user_href": "/profile/Parvathi-Harsha"
                },
                {
                    "user_id": "Jeevan Vara",
                    "user_href": "/profile/Jeevan-Vara"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aravindh Bvrit",
                "href": "/profile/Aravindh-Bvrit"
            },
            "answer_text": "It’s good, i would always say to anyone that which ever college you study it’s same, but only thing is you need to concentrate on your studies and read well. But at end i say CSE is good in BVRIT. ",
            "date": "Answered September 26, 2016",
            "views": "687",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abraboina Rishikesh",
                    "user_href": "/profile/Abraboina-Rishikesh"
                },
                {
                    "user_id": "VIKRAM ADITYA",
                    "user_href": "/profile/VIKRAM-ADITYA-144"
                },
                {
                    "user_id": "Jeevan Vara",
                    "user_href": "/profile/Jeevan-Vara"
                }
            ]
        }
    ]
}