{
    "title": "How is college so far (class of 2022)? - Quora",
    "tags": [
        "Class of 2022",
        "The College and University Experience",
        "Higher Education",
        "Colleges and Universities",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aamer Tahseen",
                "href": "/profile/Aamer-Tahseen"
            },
            "answer_text": "It’s been a very rough start, but I’m getting situated slowly. Transitioning from a public high school to a private college, is a radical one. I’m going fo Fordham University (LC Campus), and I’m not forming there. So obviously fist off, it was very difficult to adapt commuting all the way from my house to there by train, it takes around 45 min- 1 hour to get there, and on top of that I have morning classes (I came late to course registration and I got fucked with 8:30 AM and three hour long classes). In high school, I took just a bus and it took like 20 mins to get there, now combine that with the monstrosity that is the 1 Train to South Ferry (and everybody loves that commute on a weekday morning in the rain.) Getting used to the schedule was difficult too, on Tuesdays and Fridays I have a 3 hour break between classes, and the first 2 weeks it was the most boring and soul crushing thing ever, I just sat in the lounge or took a walk at Central Park but the time still didn’t pass. And I don't have classes on Mondays and Thursdays and I just sat at home all alone with all this time on my hands. But now that the work is slowly coming in, all the free time and breaks I have is now a blessing for me to get assignments done and get ahead on some reading. Then there are the classes itself, I am taking 5 courses this semester, and anyone who went to Fordham knows of our intense core curriculum, I’m taking intro French II, Modern Euro History, a theology class called Faith and reasoning (which is the 3 hour lecture), Basic Macroeconomics, and English Composition I. All my classes are fine, interesting, and have great professors, except for the dreaded macro class, the professor is an 81 year old guy who just puts up slides with complex economics terms and graphs and doesn't explain them in simple details leaving the class confused most of the time (thank god he gives open textbook tests). And my French teacher forced us to buy the textbook from the college bookstore, and when I went to get it, it 270 fucking dollars FOR AN INTRODUCTORY FRENCH COURSE!!! Luckily my other teachers are lenient on books. Oh and the 100+ pages of reading I have to face on a weekly basis has been a nightmare for me, the language is old and complicated and within two minutes there all just letters with no meaning to me. That gets in financials, no more free metro-cards, free lunch or textbooks. It’s all on me now, and I’ve already spent hundreds within a month. So thats a big challenge I’ve had to face and will face in my next four years (and I’ve already had a lot of trouble with Fordham’s Financial Aid department). Sorry for the rant, doesn’t answer the question much, just had to get it out there. Besides all the negative things, the people here are super friendly. I’ve always been given the impression that Fordham is mostly stereotypical rich white kids who get all the perks of being residents, which is true, but the LC campus is has a diverse body students from all racial and economics backgrounds. And there are tons of Bengalis here in contrast to my high school so it’s great to be surrounded more by those of my background. I’ve already made tons of friends and joined many clubs and organizations. Also here at Fordham we have someone called a “freshman mentor” who is an upper class men who is kind of like your counselor who helps you around and takes you and your group out on outings and those have been fun so far. And almost every other week there are some kind of after school activities like game nights and other social events. Here and there you can get free food and snacks so thats cool. So the campus is very active and engaged you to socialize and make connections. As for the situation of money, there are tons of on campus jobs to go around, I applied to a few this week so hopefully I can get something good, and of course it’s prime location in NYC definitely opens to lots of oppurnities. There are lots of obstacles ahead and I need more time to adjust, but I’m liking it so far. ",
            "date": "Answered September 29, 2018",
            "views": "23",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saba Ali",
                    "user_href": "/profile/Saba-Ali-14"
                },
                {
                    "user_id": "Edi Luis",
                    "user_href": "/profile/Edi-Luis"
                },
                {
                    "user_id": "Ismael Suarez",
                    "user_href": "/profile/Ismael-Suarez-1"
                },
                {
                    "user_id": "Katy Howell",
                    "user_href": "/profile/Katy-Howell-8"
                },
                {
                    "user_id": "Maria Hossini",
                    "user_href": "/profile/Maria-Hossini-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ethan Chiu",
                "href": "/profile/Ethan-Chiu-5"
            },
            "answer_text": "It’s been a pretty amazing experience. I’ve met a fair share of people from orientation, classes, and club recruitment. I’ve met so many passionate and hard working people which has been a stark difference from my high school peers. It felt kind of intimidating at first to be surrounded by so many smart people but now it feels amazing to have deep conversations with so many people. Moreover, I feel pretty darn lucky to have 2 amazing and fun roommates considering I chose to randomly be paired with roommates. I’ve also joined an amazing club called The Berkeley Group which provides pro bono services for Bay Area non-profits. So far, I’ve been amazed at how down-to-earth and welcoming all the members are. When I had to miss one of the meetings, the Internal Vice President offered to take time out of her day to recap all the content I missed out on. Moreover, we had a retreat recently where we spent a weekend in Truckee, CA near Lake Tahoe. Overall, it was a really great experience visiting Lake Tahoe, partying, and chilling with other members. The only downside is that the coursework is pretty heavy. We are expected to read quite a lot of readings every day (sometimes 100+ pages). Another downside is that it’s pretty hard to balance everything I want to do from work, academics, exercise, and clubs. To be honest, I’ve been pretty stressed from midterms and balancing that with my other commitments. Nevertheless, it’s always helpful to be surrounded by really supportive friends who are there to listen to you rant. So, overall, it’s been a overwhelmingly positive experience with the only downside of a heavy workload. ",
            "date": "Answered September 25, 2018",
            "views": "851",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Qamar Faarah",
                    "user_href": "/profile/Qamar-Faarah"
                },
                {
                    "user_id": "Adhya Sharma",
                    "user_href": "/profile/Adhya-Sharma-5"
                },
                {
                    "user_id": "Namish Gali",
                    "user_href": "/profile/Namish-Gali-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alyssa Kryzanski",
                "href": "/profile/Alyssa-Kryzanski"
            },
            "answer_text": "Honestly, it’s going pretty great. At first, I was extremely nervous about meeting new people and actually making friends, but RPI is apparently entirely aware of the fact that about 80% of its students are at least a little bit awkward. This means that they plan what is about a week (if you go on the overnight trip) of icebreakers for incoming freshman. I ended up meeting a few good friends in that time and I also have some very chill people who hang out in my dorm lounge and sometimes watch movies at 3 AM. So, that turned out much better than expected. I also love living more or less on my own. I’ve always be a bit more independent, so it feels really good to have almost complete control over my schedule. There are just tons of things to do and I feel like I can pretty much do anything I want to if I try hard enough to fit it in my schedule. Other than that, the campus is much prettier than I expected (for some reason they show you all the ugly buildings plus empac when you go on your tour).  Also, the classes are intense but in a good way and most of the professors and faculty seem genuinely nice. There are tons of great resources at RPI and the faculty are not shy to let you know how to use them. The upperclassmen are also really nice for the most part and don’t tend to talk down to you too much just because you’re a freshman, so it’s definitely a much different atmosphere from high school. Honestly, the only problems I’ve run into with classes are communication problems. Some professors/TAs are somewhat ironically not great with technology or are just hard to understand because of accents and it can be a bit of barrier. I haven’t into any major problems, though. The only real problem I’ve been facing is a bit more personal and has less to do with school so I have a bit more stress than I might normally, but it really has mostly been good news. I feel slightly bad for being so cynical before I got to campus. ",
            "date": "Answered September 26, 2018",
            "views": "13",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tianyi Li",
                    "user_href": "/profile/Tianyi-Li-31"
                },
                {
                    "user_id": "Jordi Barceló Gómez",
                    "user_href": "/profile/Jordi-Barceló-Gómez"
                },
                {
                    "user_id": "Sharanappa Kotrappa",
                    "user_href": "/profile/Sharanappa-Kotrappa"
                },
                {
                    "user_id": "Sidharth Ramanan",
                    "user_href": "/profile/Sidharth-Ramanan"
                },
                {
                    "user_id": "Namish Gali",
                    "user_href": "/profile/Namish-Gali-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Valeria Lopez",
                "href": "/profile/Valeria-Lopez-166"
            },
            "answer_text": "Quite frankly, I’m loving it. Yeah there are pros and cons like with everything. But all in all, I’m really happy now. I’ve been in college for a few weeks now and everything (well almost everything) has been great. In my high school, despite having “friends” I felt very alone and going to school every day was torture to me. The first day moving into my dorms was quite scary. I’m a very imaginative person so I always imagined College being my place to make great friends and have just have a jolly good old time. Yet, I also hate getting disappointed, so when I realize that I’m putting my hopes too high, I tend to try to bring down my imagination. But even still, I made friends within the first few days, and I am way more content than I ever was at my old school. Of course, the differences are still jarring. I went to a very preppy high school where I was drowning in work and felt pressure everywhere I went. Now in college, I feel like I have enough time to get my work done and have fun too. There are some things I hate. I live really close to home, but decided on the dorm life because 1. I don’t drive and 2. I wanted to enjoy life on campus. I go home every weekend which is a blessing since I love and miss my family every week. But coming back on campus every Sunday is such a hassle and getting back into bed is annoying. I have 5 other roommates so having to ensure that I’m not annoying or disturbing each of them is a difficult task. (Of course, some of the roommates are my friends actually). I have also experienced more drama, but that is because I have thrown myself out there more. I talk to more people, hang out at the campus ministry in my office, so there’s bound to be more people coming up to me and asking for my number. Since I used to go to an all girl school and was usually very quiet there, I didn’t experience that. It is a very new experience with so many differences from my old school. There are times that I actually miss my old school and the tranquility. But then I remember how sad I was every day to go to school and walk around lunch alone. And then I remember that now, I always have someone to talk to, no matter who. I have engaging classes and lots of time in between and a beautiful campus to walk around. And just when I start missing home, I come right back and spend a few days with my family. I really can’t believe how happy I actually am, that I get to complain about how easy my classes are and get to stress out about someone asking me out. Yes there are times where I just want to leave. Last week in particular was hard for me on so many different levels. But all in all, everyday has a new adventure to bring. There are so many things I have yet to do, and I can’t wait what the next few years hold. I am finally content despite the obstacles that cause me anger and sadness sometimes. But I am mostly happy, which is what matters. I just hope it stays that way. ",
            "date": "Answered October 1, 2018",
            "views": "880",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Weiss",
                    "user_href": "/profile/Michael-Weiss-75"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kale Hyder",
                "href": "/profile/Kale-Hyder-1"
            },
            "answer_text": "I love a good ol’ reflection. Hopkins 2022 here.  High school wasn't the best time of my life, so I was more than ready to move across the country to start my life as a college student. Move-in and orientation (August 24–29) I said good-bye to my parents and hello to my new Hopkins family. The first few days were definitely a little awkward as most people didn’t know anyone or were just meeting their friends that they had connected with via social media over the past few months. Orientation was filled with activities to help us get to know our peers, the campus, and Baltimore. I had a decent time but was ready for classes and clubs to begin. August 30-today We are about a month in, and the grind has officially started. I have a neuroscience midterm tomorrow (which I should be studying for but I haven’t posted in the past two days) and a chemistry midterm Friday. Yes, some people are stress messes; they are freaking out because they are taking on too much. However, my classes are challenging yet manageable. I feel that if you stay up on your schoolwork and prioritize it, there’s no need to be overly stressed and pull all-nighters. That’s why I’m on Quora right now and not cramming: I’ve already put in all of the work I believe is necessary to succeed tomorrow. Right now, I have one solid go-to friend. In addition, I have a few groups that I usually study or hang out with. Friendships take time to develop, so I’m sure my relationships will deepen with time. Exciting news As of today, I am an official Hopkins admissions volunteer. This means that I will be able to lead campus tours and have coffee with and interview prospective students. I’m hoping to be a featured writer on Hopkins Insider, which is a website where current students write about their experiences as Hopkins students. If you’re interested in Hopkins, I encourage you to check out the website. Here’s the cute little envelope that had my acceptance letter for Blue Key (admissions volunteers). I’m beginning research soon. Some of my long-time followers know that a vital reason I chose Hopkins was because my doctor practices and conducts research at the Johns Hopkins Hospital. I finally had a chance to meet with him today for a doctors appointment and to discuss research. When I asked when I could start, he said to email him and let him know whenever I’m ready. He’s such a stud! I’m going to wait and see how my midterms go, and if I perform well, I will contact him and hopefully start within the next few weeks! I’m so pumped.Concluding thoughts I love it here. I wasn’t sure if I made the right choice in the beginning, but now that I am here, have so many opportunities, and have already met great people, I couldn’t be happier. —KH Tbh, I hate chem lab with a passion, though, but that’s a story for a different day. ",
            "date": "Answered September 26, 2018",
            "views": "17",
            "upvotes": " View 269 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jasmine Kaur",
                    "user_href": "/profile/Jasmine-Kaur-461"
                },
                {
                    "user_id": "Johnny Saldana",
                    "user_href": "/profile/Johnny-Saldana-1"
                },
                {
                    "user_id": "Hazel Vet",
                    "user_href": "/profile/Hazel-Vet"
                },
                {
                    "user_id": "Saanvi",
                    "user_href": "/profile/Saanvi-61"
                },
                {
                    "user_id": "Adam Ratzman",
                    "user_href": "/profile/Adam-Ratzman-2"
                },
                {
                    "user_id": "Connor Brady",
                    "user_href": "/profile/Connor-Brady-29"
                },
                {
                    "user_id": "Anindya Permata Widhi",
                    "user_href": "/profile/Anindya-Permata-Widhi"
                },
                {
                    "user_id": "Josh Rowe",
                    "user_href": "/profile/Josh-Rowe-9"
                },
                {
                    "user_id": "Ana Blaž",
                    "user_href": "/profile/Ana-Blaž"
                },
                {
                    "user_id": "Nicholas Aderhold",
                    "user_href": "/profile/Nicholas-Aderhold"
                },
                {
                    "user_id": "Eve Marden",
                    "user_href": "/profile/Eve-Marden"
                },
                {
                    "user_id": "Shoumil Guha",
                    "user_href": "/profile/Shoumil-Guha"
                },
                {
                    "user_id": "Joy Lee",
                    "user_href": "/profile/Joy-Lee-242"
                },
                {
                    "user_id": "Rahul Singh",
                    "user_href": "/profile/Rahul-Singh-6300"
                },
                {
                    "user_id": "Ramya Keerthi",
                    "user_href": "/profile/Ramya-Keerthi-2"
                },
                {
                    "user_id": "Adrian Wong",
                    "user_href": "/profile/Adrian-Wong-102"
                },
                {
                    "user_id": "Akshita Mahajan",
                    "user_href": "/profile/Akshita-Mahajan-9"
                },
                {
                    "user_id": "Emma Farnham",
                    "user_href": "/profile/Emma-Farnham"
                },
                {
                    "user_id": "Sunipa Dev",
                    "user_href": "/profile/Sunipa-Dev"
                },
                {
                    "user_id": "Sydney Gibson",
                    "user_href": "/profile/Sydney-Gibson-7"
                },
                {
                    "user_id": "Joanne Yuan",
                    "user_href": "/profile/Joanne-Yuan-1"
                },
                {
                    "user_id": "Ediel",
                    "user_href": "/profile/Ediel-1"
                },
                {
                    "user_id": "William Nicks",
                    "user_href": "/profile/William-Nicks-1"
                },
                {
                    "user_id": "Mary Sam",
                    "user_href": "/profile/Mary-Sam-20"
                },
                {
                    "user_id": "Chloe Chan",
                    "user_href": "/profile/Chloe-Chan-78"
                },
                {
                    "user_id": "Charmi Lew",
                    "user_href": "/profile/Charmi-Lew"
                },
                {
                    "user_id": "Chaithra Venkatesh",
                    "user_href": "/profile/Chaithra-Venkatesh"
                },
                {
                    "user_id": "Katy Samba",
                    "user_href": "/profile/Katy-Samba-1"
                },
                {
                    "user_id": "Kaila Thomas",
                    "user_href": "/profile/Kaila-Thomas-14"
                },
                {
                    "user_id": "Zahra Husain",
                    "user_href": "/profile/Zahra-Husain"
                },
                {
                    "user_id": "Kashvi",
                    "user_href": "/profile/Kashvi-18"
                },
                {
                    "user_id": "Preethi Subramanian",
                    "user_href": "/profile/Preethi-Subramanian-8"
                },
                {
                    "user_id": "Subham Subian",
                    "user_href": "/profile/Subham-Subian-1"
                },
                {
                    "user_id": "Kenneth Thomas",
                    "user_href": "/profile/Kenneth-Thomas"
                },
                {
                    "user_id": "Santosh Kumar",
                    "user_href": "/profile/Santosh-Kumar-4979"
                },
                {
                    "user_id": "Mithil Rajput",
                    "user_href": "/profile/Mithil-Rajput-1"
                },
                {
                    "user_id": "Matthew Gillespie",
                    "user_href": "/profile/Matthew-Gillespie-21"
                },
                {
                    "user_id": "Shamithini Nadarajah",
                    "user_href": "/profile/Shamithini-Nadarajah"
                },
                {
                    "user_id": "Ankita Vay",
                    "user_href": "/profile/Ankita-Vay"
                },
                {
                    "user_id": "Carl Helrich",
                    "user_href": "/profile/Carl-Helrich-2"
                },
                {
                    "user_id": "Saloni Mehta",
                    "user_href": "/profile/Saloni-Mehta-16"
                },
                {
                    "user_id": "Dipak Ranjan Pradhan",
                    "user_href": "/profile/Dipak-Ranjan-Pradhan"
                },
                {
                    "user_id": "Sivakami Arun",
                    "user_href": "/profile/Sivakami-Arun-1"
                },
                {
                    "user_id": "Eli Thayer",
                    "user_href": "/profile/Eli-Thayer"
                },
                {
                    "user_id": "Dawn Amber",
                    "user_href": "/profile/Dawn-Amber-5"
                },
                {
                    "user_id": "Kartiki Jain",
                    "user_href": "/profile/Kartiki-Jain"
                },
                {
                    "user_id": "Ezinne Ottih",
                    "user_href": "/profile/Ezinne-Ottih"
                },
                {
                    "user_id": "Sathish Siva",
                    "user_href": "/profile/Sathish-Siva-11"
                },
                {
                    "user_id": "Kara Hutchinson",
                    "user_href": "/profile/Kara-Hutchinson-1"
                },
                {
                    "user_id": "Lūcija Bērziņa",
                    "user_href": "/profile/Lūcija-Bērziņa"
                },
                {
                    "user_id": "Reetika singh Aswal",
                    "user_href": "/profile/Reetika-singh-Aswal"
                },
                {
                    "user_id": "Pavan Kumarapathirana",
                    "user_href": "/profile/Pavan-Kumarapathirana"
                },
                {
                    "user_id": "Vilina Langon",
                    "user_href": "/profile/Vilina-Langon"
                },
                {
                    "user_id": "Murugi Ndung’u",
                    "user_href": "/profile/Murugi-Ndung-u"
                },
                {
                    "user_id": "Mobius Person",
                    "user_href": "/profile/Mobius-Person"
                },
                {
                    "user_id": "Jessica Gibson",
                    "user_href": "/profile/Jessica-Gibson-23"
                },
                {
                    "user_id": "Lakshita Malhotra",
                    "user_href": "/profile/Lakshita-Malhotra-1"
                },
                {
                    "user_id": "Rishabh Singh Dhariwal",
                    "user_href": "/profile/Rishabh-Singh-Dhariwal"
                },
                {
                    "user_id": "Kristina Trifonova",
                    "user_href": "/profile/Kristina-Trifonova"
                },
                {
                    "user_id": "Jamie Metzger",
                    "user_href": "/profile/Jamie-Metzger-3"
                },
                {
                    "user_id": "Martina Krnjak",
                    "user_href": "/profile/Martina-Krnjak"
                },
                {
                    "user_id": "Izzy Adam",
                    "user_href": "/profile/Izzy-Adam-2"
                },
                {
                    "user_id": "Yusra Faheem",
                    "user_href": "/profile/Yusra-Faheem-2"
                },
                {
                    "user_id": "Cheryl Hood",
                    "user_href": "/profile/Cheryl-Hood-1"
                },
                {
                    "user_id": "Muskaan Mehta",
                    "user_href": "/profile/Muskaan-Mehta-6"
                },
                {
                    "user_id": "Siena Ruggeri",
                    "user_href": "/profile/Siena-Ruggeri"
                },
                {
                    "user_id": "Andre Gaytan",
                    "user_href": "/profile/Andre-Gaytan"
                },
                {
                    "user_id": "Parth Narula",
                    "user_href": "/profile/Parth-Narula-5"
                },
                {
                    "user_id": "Jake Tan",
                    "user_href": "/profile/Jake-Tan-52"
                },
                {
                    "user_id": "Carley Andrews",
                    "user_href": "/profile/Carley-Andrews-5"
                },
                {
                    "user_id": "Sarthis Idren",
                    "user_href": "/profile/Sarthis-Idren"
                },
                {
                    "user_id": "Trajon Moore",
                    "user_href": "/profile/Trajon-Moore"
                },
                {
                    "user_id": "Yamini J",
                    "user_href": "/profile/Yamini-J-10"
                },
                {
                    "user_id": "Haruna Batzorig",
                    "user_href": "/profile/Haruna-Batzorig"
                },
                {
                    "user_id": "Rylie Duggan",
                    "user_href": "/profile/Rylie-Duggan"
                },
                {
                    "user_id": "Jia Kapoor",
                    "user_href": "/profile/Jia-Kapoor-1"
                },
                {
                    "user_id": "Melissa Tarlow",
                    "user_href": "/profile/Melissa-Tarlow-1"
                },
                {
                    "user_id": "Sofia George",
                    "user_href": "/profile/Sofia-George-2"
                },
                {
                    "user_id": "Shelby McCowan",
                    "user_href": "/profile/Shelby-McCowan"
                },
                {
                    "user_id": "Namish Gali",
                    "user_href": "/profile/Namish-Gali-3"
                },
                {
                    "user_id": "Ricky Lee",
                    "user_href": "/profile/Ricky-Lee-49"
                },
                {
                    "user_id": "Stephanie Wang",
                    "user_href": "/profile/Stephanie-Wang-70"
                },
                {
                    "user_id": "Isabella Newman",
                    "user_href": "/profile/Isabella-Newman-3"
                },
                {
                    "user_id": "Ismael Suarez",
                    "user_href": "/profile/Ismael-Suarez-1"
                },
                {
                    "user_id": "Natalie Sharma",
                    "user_href": "/profile/Natalie-Sharma-6"
                },
                {
                    "user_id": "Viktor Bak",
                    "user_href": "/profile/Viktor-Bak-1"
                },
                {
                    "user_id": "Alex Wentworth",
                    "user_href": "/profile/Alex-Wentworth-1"
                },
                {
                    "user_id": "Emily Preston",
                    "user_href": "/profile/Emily-Preston-18"
                },
                {
                    "user_id": "Sai Krishna",
                    "user_href": "/profile/Sai-Krishna-2093"
                },
                {
                    "user_id": "Shiona Malini",
                    "user_href": "/profile/Shiona-Malini"
                },
                {
                    "user_id": "Vaishnavi Misra",
                    "user_href": "/profile/Vaishnavi-Misra-1"
                },
                {
                    "user_id": "Ethan Harrison",
                    "user_href": "/profile/Ethan-Harrison-22"
                },
                {
                    "user_id": "SSA",
                    "user_href": "/profile/SSA-27"
                },
                {
                    "user_id": "Irfan Hossain",
                    "user_href": "/profile/Irfan-Hossain-1"
                },
                {
                    "user_id": "Nathan Rothschild",
                    "user_href": "/profile/Nathan-Rothschild-5"
                },
                {
                    "user_id": "Jaime Martinez",
                    "user_href": "/profile/Jaime-Martinez-51"
                },
                {
                    "user_id": "Jason Nguyen",
                    "user_href": "/profile/Jason-Nguyen-322"
                },
                {
                    "user_id": "Safiyyah Franklin",
                    "user_href": "/profile/Safiyyah-Franklin"
                },
                {
                    "user_id": "Jeremy Hadfield",
                    "user_href": "/profile/Jeremy-Hadfield"
                },
                {
                    "user_id": "Mannan Mendiratta",
                    "user_href": "/profile/Mannan-Mendiratta"
                },
                {
                    "user_id": "Andi Stiener",
                    "user_href": "/profile/Andi-Stiener"
                },
                {
                    "user_id": "Naz Soysal",
                    "user_href": "/profile/Naz-Soysal"
                },
                {
                    "user_id": "Monique Cao",
                    "user_href": "/profile/Monique-Cao"
                },
                {
                    "user_id": "Reuben David",
                    "user_href": "/profile/Reuben-David-1"
                },
                {
                    "user_id": "Anant Singh Sodhi",
                    "user_href": "/profile/Anant-Singh-Sodhi"
                },
                {
                    "user_id": "Alejandro Rangel",
                    "user_href": "/profile/Alejandro-Rangel-14"
                },
                {
                    "user_id": "Elliot Reid",
                    "user_href": "/profile/Elliot-Reid-3"
                },
                {
                    "user_id": "Haram Saqib",
                    "user_href": "/profile/Haram-Saqib"
                },
                {
                    "user_id": "Sam Cantu",
                    "user_href": "/profile/Sam-Cantu-7"
                },
                {
                    "user_id": "Hallishma Lourth",
                    "user_href": "/profile/Hallishma-Lourth"
                },
                {
                    "user_id": "Kalyani",
                    "user_href": "/profile/Kalyani-130"
                },
                {
                    "user_id": "Hemelton Matlonya",
                    "user_href": "/profile/Hemelton-Matlonya"
                },
                {
                    "user_id": "Manan Vyas",
                    "user_href": "/profile/Manan-Vyas-2"
                },
                {
                    "user_id": "Misha",
                    "user_href": "/profile/Misha-134"
                },
                {
                    "user_id": "Yanna Lim",
                    "user_href": "/profile/Yanna-Lim"
                },
                {
                    "user_id": "Polina Smirnova",
                    "user_href": "/profile/Polina-Smirnova-1"
                },
                {
                    "user_id": "Jack Pazin",
                    "user_href": "/profile/Jack-Pazin"
                },
                {
                    "user_id": "Reem AbdulAziz",
                    "user_href": "/profile/Reem-AbdulAziz-4"
                },
                {
                    "user_id": "Timothée Gérard",
                    "user_href": "/profile/Timothée-Gérard"
                },
                {
                    "user_id": "Paul Matthews",
                    "user_href": "/profile/Paul-Matthews-108"
                },
                {
                    "user_id": "Sumit Yadav",
                    "user_href": "/profile/Sumit-Yadav-727"
                },
                {
                    "user_id": "Nidhi Patel",
                    "user_href": "/profile/Nidhi-Patel-1016"
                },
                {
                    "user_id": "Vanessa Saint",
                    "user_href": "/profile/Vanessa-Saint-2"
                },
                {
                    "user_id": "Saahil Mohta",
                    "user_href": "/profile/Saahil-Mohta"
                },
                {
                    "user_id": "Rahul",
                    "user_href": "/profile/Rahul-2378"
                },
                {
                    "user_id": "Aaryan Arora",
                    "user_href": "/profile/Aaryan-Arora-14"
                },
                {
                    "user_id": "Sourabh Kumar",
                    "user_href": "/profile/Sourabh-Kumar-609"
                },
                {
                    "user_id": "Gopa Bose",
                    "user_href": "/profile/Gopa-Bose-2"
                },
                {
                    "user_id": "Everett Lester",
                    "user_href": "/profile/Everett-Lester"
                },
                {
                    "user_id": "Noorhan Ibraheem",
                    "user_href": "/profile/Noorhan-Ibraheem"
                },
                {
                    "user_id": "Nishtha Sethi",
                    "user_href": "/profile/Nishtha-Sethi"
                },
                {
                    "user_id": "Annie To",
                    "user_href": "/profile/Annie-To-2"
                },
                {
                    "user_id": "Sarah Turner",
                    "user_href": "/profile/Sarah-Turner-264"
                },
                {
                    "user_id": "Mel Kasey",
                    "user_href": "/profile/Mel-Kasey"
                },
                {
                    "user_id": "Rishit Chatterjee",
                    "user_href": "/profile/Rishit-Chatterjee"
                },
                {
                    "user_id": "Prachi Sharma",
                    "user_href": "/profile/Prachi-Sharma-234"
                },
                {
                    "user_id": "Vaibhav Bhandari",
                    "user_href": "/profile/Vaibhav-Bhandari-24"
                },
                {
                    "user_id": "Ishu Jeewani",
                    "user_href": "/profile/Ishu-Jeewani"
                },
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Jess Gadget",
                    "user_href": "/profile/Jess-Gadget"
                },
                {
                    "user_id": "Aagi Tyrone",
                    "user_href": "/profile/Aagi-Tyrone"
                },
                {
                    "user_id": "Ang R",
                    "user_href": "/profile/Ang-R-19"
                },
                {
                    "user_id": "Nilaya Mairal",
                    "user_href": "/profile/Nilaya-Mairal"
                },
                {
                    "user_id": "Jyoti Khanna",
                    "user_href": "/profile/Jyoti-Khanna-13"
                },
                {
                    "user_id": "Lekhani Ray",
                    "user_href": "/profile/Lekhani-Ray"
                },
                {
                    "user_id": "Sonia Grey",
                    "user_href": "/profile/Sonia-Grey"
                },
                {
                    "user_id": "Pane Elenovski",
                    "user_href": "/profile/Pane-Elenovski"
                },
                {
                    "user_id": "Cyttney Kingsleigh",
                    "user_href": "/profile/Cyttney-Kingsleigh"
                },
                {
                    "user_id": "Gurpreet Kaur",
                    "user_href": "/profile/Gurpreet-Kaur-1423"
                },
                {
                    "user_id": "Amanda Rodrigues",
                    "user_href": "/profile/Amanda-Rodrigues-24"
                },
                {
                    "user_id": "Emory Hsieh",
                    "user_href": "/profile/Emory-Hsieh"
                },
                {
                    "user_id": "Rishav Raj",
                    "user_href": "/profile/Rishav-Raj-271"
                },
                {
                    "user_id": "Aryan Govender",
                    "user_href": "/profile/Aryan-Govender"
                },
                {
                    "user_id": "Summer Issa",
                    "user_href": "/profile/Summer-Issa-1"
                },
                {
                    "user_id": "Zack Jaffri",
                    "user_href": "/profile/Zack-Jaffri"
                },
                {
                    "user_id": "Alexander LaCazette",
                    "user_href": "/profile/Alexander-LaCazette"
                },
                {
                    "user_id": "Ottavia Paluch",
                    "user_href": "/profile/Ottavia-Paluch"
                },
                {
                    "user_id": "Harini Parthiban",
                    "user_href": "/profile/Harini-Parthiban-1"
                },
                {
                    "user_id": "Neera Bhardwaj",
                    "user_href": "/profile/Neera-Bhardwaj"
                },
                {
                    "user_id": "Grace Lui",
                    "user_href": "/profile/Grace-Lui-1"
                },
                {
                    "user_id": "Michael Koeberg",
                    "user_href": "/profile/Michael-Koeberg"
                },
                {
                    "user_id": "Tara Singhania",
                    "user_href": "/profile/Tara-Singhania-2"
                },
                {
                    "user_id": "Diana Nguyen",
                    "user_href": "/profile/Diana-Nguyen-57"
                },
                {
                    "user_id": "Will Davison",
                    "user_href": "/profile/Will-Davison-10"
                },
                {
                    "user_id": "Nidhi",
                    "user_href": "/profile/Nidhi-414"
                },
                {
                    "user_id": "Marta Esteve",
                    "user_href": "/profile/Marta-Esteve-1"
                },
                {
                    "user_id": "Riya",
                    "user_href": "/profile/Riya-650"
                },
                {
                    "user_id": "Karnika Jain",
                    "user_href": "/profile/Karnika-Jain-7"
                },
                {
                    "user_id": "Sara Rocks",
                    "user_href": "/profile/Sara-Rocks"
                },
                {
                    "user_id": "JungMin Bae",
                    "user_href": "/profile/JungMin-Bae-2"
                },
                {
                    "user_id": "Mallika Handa",
                    "user_href": "/profile/Mallika-Handa-2"
                },
                {
                    "user_id": "Shreya Pawar",
                    "user_href": "/profile/Shreya-Pawar-4"
                },
                {
                    "user_id": "Tridev Rath",
                    "user_href": "/profile/Tridev-Rath"
                },
                {
                    "user_id": "Aditi",
                    "user_href": "/profile/Aditi-220"
                },
                {
                    "user_id": "Luth Gallemaso",
                    "user_href": "/profile/Luth-Gallemaso"
                },
                {
                    "user_id": "Raditya Tantra",
                    "user_href": "/profile/Raditya-Tantra"
                },
                {
                    "user_id": "Madeleine Yan",
                    "user_href": "/profile/Madeleine-Yan"
                },
                {
                    "user_id": "Shweta Mishra",
                    "user_href": "/profile/Shweta-Mishra-21"
                },
                {
                    "user_id": "Charlotte Grey",
                    "user_href": "/profile/Charlotte-Grey-9"
                },
                {
                    "user_id": "Naman Shah",
                    "user_href": "/profile/Naman-Shah-48"
                },
                {
                    "user_id": "Dinesh Bhattarai",
                    "user_href": "/profile/Dinesh-Bhattarai-8"
                },
                {
                    "user_id": "Jelena Riljic",
                    "user_href": "/profile/Jelena-Riljic"
                },
                {
                    "user_id": "Aishika Midder",
                    "user_href": "/profile/Aishika-Midder"
                },
                {
                    "user_id": "Simran",
                    "user_href": "/profile/Simran-191"
                },
                {
                    "user_id": "Barasha Medhi",
                    "user_href": "/profile/Barasha-Medhi-2"
                },
                {
                    "user_id": "Sara Eli",
                    "user_href": "/profile/Sara-Eli-3"
                },
                {
                    "user_id": "zaynab ahmed",
                    "user_href": "/profile/zaynab-ahmed-25"
                },
                {
                    "user_id": "Ryan George",
                    "user_href": "/profile/Ryan-George-45"
                },
                {
                    "user_id": "Emmanuel Eyob",
                    "user_href": "/profile/Emmanuel-Eyob"
                },
                {
                    "user_id": "Rupa",
                    "user_href": "/profile/Rupa-82"
                },
                {
                    "user_id": "Haindvi Aitharaju",
                    "user_href": "/profile/Haindvi-Aitharaju"
                },
                {
                    "user_id": "Mary Kaiser",
                    "user_href": "/profile/Mary-Kaiser-13"
                },
                {
                    "user_id": "Kari Carney",
                    "user_href": "/profile/Kari-Carney-2"
                },
                {
                    "user_id": "Mark June",
                    "user_href": "/profile/Mark-June-2"
                },
                {
                    "user_id": "Keyon Rosen",
                    "user_href": "/profile/Keyon-Rosen"
                },
                {
                    "user_id": "Nicolas Lee",
                    "user_href": "/profile/Nicolas-Lee-9"
                },
                {
                    "user_id": "Laveesh Sharma",
                    "user_href": "/profile/Laveesh-Sharma-2"
                },
                {
                    "user_id": "Emily Ng",
                    "user_href": "/profile/Emily-Ng-22"
                },
                {
                    "user_id": "Manjiri Chavan",
                    "user_href": "/profile/Manjiri-Chavan-1"
                },
                {
                    "user_id": "Evelyn Krasnik",
                    "user_href": "/profile/Evelyn-Krasnik-1"
                },
                {
                    "user_id": "Michal Slupski",
                    "user_href": "/profile/Michal-Slupski-1"
                },
                {
                    "user_id": "David Loke",
                    "user_href": "/profile/David-Loke-1"
                },
                {
                    "user_id": "Munira Abdirahman",
                    "user_href": "/profile/Munira-Abdirahman-3"
                },
                {
                    "user_id": "Sharanappa Kotrappa",
                    "user_href": "/profile/Sharanappa-Kotrappa"
                },
                {
                    "user_id": "Ankita Menon",
                    "user_href": "/profile/Ankita-Menon-12"
                },
                {
                    "user_id": "Saanvi Balakrishan",
                    "user_href": "/profile/Saanvi-Balakrishan"
                },
                {
                    "user_id": "Preeti Tomer",
                    "user_href": "/profile/Preeti-Tomer-1"
                },
                {
                    "user_id": "Sruthilaya H",
                    "user_href": "/profile/Sruthilaya-H"
                },
                {
                    "user_id": "Navdeep Singh Bika",
                    "user_href": "/profile/Navdeep-Singh-Bika"
                },
                {
                    "user_id": "Bill Wang",
                    "user_href": "/profile/Bill-Wang-86"
                },
                {
                    "user_id": "Yugandher Ghugare",
                    "user_href": "/profile/Yugandher-Ghugare"
                },
                {
                    "user_id": "Cionne Gates",
                    "user_href": "/profile/Cionne-Gates"
                },
                {
                    "user_id": "Ritankar Sarkar",
                    "user_href": "/profile/Ritankar-Sarkar-1"
                },
                {
                    "user_id": "Fab",
                    "user_href": "/profile/Fab-114"
                },
                {
                    "user_id": "Abhishek Rajan",
                    "user_href": "/profile/Abhishek-Rajan-50"
                },
                {
                    "user_id": "Sarah Preston",
                    "user_href": "/profile/Sarah-Preston-30"
                },
                {
                    "user_id": "Tara Brebric",
                    "user_href": "/profile/Tara-Brebric"
                },
                {
                    "user_id": "Faith Taylor",
                    "user_href": "/profile/Faith-Taylor-42"
                },
                {
                    "user_id": "Deepsikha Chatterjee",
                    "user_href": "/profile/Deepsikha-Chatterjee-3"
                },
                {
                    "user_id": "Suril Shah",
                    "user_href": "/profile/Suril-Shah-22"
                },
                {
                    "user_id": "Anannya Mondal",
                    "user_href": "/profile/Anannya-Mondal-2"
                },
                {
                    "user_id": "Farhan Saif",
                    "user_href": "/profile/Farhan-Saif-8"
                },
                {
                    "user_id": "Ashwini Orpe",
                    "user_href": "/profile/Ashwini-Orpe"
                },
                {
                    "user_id": "Anvita Goyal",
                    "user_href": "/profile/Anvita-Goyal"
                },
                {
                    "user_id": "Sarnai Gantumur",
                    "user_href": "/profile/Sarnai-Gantumur"
                },
                {
                    "user_id": "Ihsaan",
                    "user_href": "/profile/Ihsaan"
                },
                {
                    "user_id": "Medini NB",
                    "user_href": "/profile/Medini-NB"
                },
                {
                    "user_id": "Alice Ren",
                    "user_href": "/profile/Alice-Ren-9"
                },
                {
                    "user_id": "Tiến Đạt",
                    "user_href": "/profile/Tiến-Đạt-16"
                },
                {
                    "user_id": "Felicia Green",
                    "user_href": "/profile/Felicia-Green-12"
                },
                {
                    "user_id": "Priyanka Kuruganti",
                    "user_href": "/profile/Priyanka-Kuruganti-1"
                },
                {
                    "user_id": "Ambica Bhatia",
                    "user_href": "/profile/Ambica-Bhatia-1"
                },
                {
                    "user_id": "Sara Girardi",
                    "user_href": "/profile/Sara-Girardi"
                },
                {
                    "user_id": "Michael Weiss",
                    "user_href": "/profile/Michael-Weiss-75"
                },
                {
                    "user_id": "Elisabeth Moore",
                    "user_href": "/profile/Elisabeth-Moore-17"
                },
                {
                    "user_id": "Alyssa Shick",
                    "user_href": "/profile/Alyssa-Shick-1"
                },
                {
                    "user_id": "Marc Wasserman",
                    "user_href": "/profile/Marc-Wasserman-3"
                },
                {
                    "user_id": "Shivani Singh",
                    "user_href": "/profile/Shivani-Singh-572"
                },
                {
                    "user_id": "Lakshay Sood",
                    "user_href": "/profile/Lakshay-Sood"
                },
                {
                    "user_id": "Arya Ravi",
                    "user_href": "/profile/Arya-Ravi-1"
                },
                {
                    "user_id": "Ann Cronin",
                    "user_href": "/profile/Ann-Cronin"
                },
                {
                    "user_id": "Ella Taylor",
                    "user_href": "/profile/Ella-Taylor-69"
                },
                {
                    "user_id": "Ayush Dhawale",
                    "user_href": "/profile/Ayush-Dhawale"
                },
                {
                    "user_id": "A. K. Lee",
                    "user_href": "/profile/A-K-Lee"
                },
                {
                    "user_id": "Karen Ghandehari",
                    "user_href": "/profile/Karen-Ghandehari"
                },
                {
                    "user_id": "Annida Aqiila",
                    "user_href": "/profile/Annida-Aqiila"
                },
                {
                    "user_id": "Elizabeth Svinkin",
                    "user_href": "/profile/Elizabeth-Svinkin-1"
                },
                {
                    "user_id": "Raha Shanehbandi",
                    "user_href": "/profile/Raha-Shanehbandi-1"
                },
                {
                    "user_id": "Hannah Watson",
                    "user_href": "/profile/Hannah-Watson-66"
                },
                {
                    "user_id": "Neha Chandani",
                    "user_href": "/profile/Neha-Chandani-2"
                },
                {
                    "user_id": "Vignesh Nalliah",
                    "user_href": "/profile/Vignesh-Nalliah-2"
                },
                {
                    "user_id": "Jordan Major",
                    "user_href": "/profile/Jordan-Major-5"
                },
                {
                    "user_id": "Tracey Anderson",
                    "user_href": "/profile/Tracey-Anderson-72"
                },
                {
                    "user_id": "Arjun Srinivasan",
                    "user_href": "/profile/Arjun-Srinivasan-23"
                },
                {
                    "user_id": "Eliza Perez",
                    "user_href": "/profile/Eliza-Perez-7"
                },
                {
                    "user_id": "Austin Vo",
                    "user_href": "/profile/Austin-Vo-1"
                },
                {
                    "user_id": "Oliver Queen",
                    "user_href": "/profile/Oliver-Queen-328"
                },
                {
                    "user_id": "Carol Rai",
                    "user_href": "/profile/Carol-Rai-1"
                },
                {
                    "user_id": "Shaheer Hashmi",
                    "user_href": "/profile/Shaheer-Hashmi-1"
                },
                {
                    "user_id": "Jahnavi Hansaria",
                    "user_href": "/profile/Jahnavi-Hansaria"
                },
                {
                    "user_id": "Rahul Thomas",
                    "user_href": "/profile/Rahul-Thomas-59"
                },
                {
                    "user_id": "Jacob Schuler",
                    "user_href": "/profile/Jacob-Schuler-3"
                },
                {
                    "user_id": "Aaron Almaguer",
                    "user_href": "/profile/Aaron-Almaguer"
                },
                {
                    "user_id": "Nhi Truong",
                    "user_href": "/profile/Nhi-Truong-18"
                },
                {
                    "user_id": "Deepshika Handigol",
                    "user_href": "/profile/Deepshika-Handigol-1"
                },
                {
                    "user_id": "Ani Alaberkyan",
                    "user_href": "/profile/Ani-Alaberkyan"
                },
                {
                    "user_id": "Kaetlyn Liddy",
                    "user_href": "/profile/Kaetlyn-Liddy"
                },
                {
                    "user_id": "Avi Singh",
                    "user_href": "/profile/Avi-Singh-197"
                },
                {
                    "user_id": "Jung Taehee 정태희",
                    "user_href": "/profile/Jung-Taehee-정태희"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Weiss",
                "href": "/profile/Michael-Weiss-75"
            },
            "answer_text": " I literally just started university last Sunday which means that the past week has been freshers week - essentially a week of partying and exploring the university (providing that's your thing, it wasn’t mine). To start off, the University of Surrey itself has been amazing, the campus is beautiful, the buildings are mostly modern and up to date and my accommodation has been excellent.  The University of Surrey - the campus itself is really nice My room, although basic, is a good size and very clean so overall I’m happy. Luckily for me, I live directly on campus meaning everything is less than 10 minutes away from me so that’s a huge plus to my accommodation.  It was clean until I moved in that is :) Throughout freshers week, we had many talks and seminars about services and departments at our disposal during our time at the University, which were fairly interesting as I knew very little about what the University had to offer (Should have researched a bit harder probably). Unfortunately, these talks were rather few and far between which meant that I had a lot of down time which, I am ashamed to admit, was spent mostly in my flat, in my room. Despite my flatmates being nice people who included me during the first few nights in playing cards, Mario Kart etc, they inevitably left to go to clubs and to party which is, for me, the antithesis of fun. I may have sat in my room watching the Office during these evenings. I have a horrible feeling I may have to socialise at University. Anyway, I begin my course properly this coming Monday which is both a relief, as I will be occupied most days, and yet it is terrifying too as my confidence in my abilities isn’t very strong despite my A-level grades. I guess it doesn’t help that I struggled to use a microscope during my lab induction, especially since I’m doing microbiology. During the induction, I was paired with a girl who had come to the UK from Cyprus, making things quite interesting. The lab itself was massive, spotless and blew everything my secondary school had to offer out of the water, making me more excited for my course.  The lab itself It also was around this time we received our lab gear which we bought online a week before we joined the university. Now, I wasn’t officially allowed to open it from its packaging due to concerns of contamination but I couldn't resist trying the lab coat on (We have to thoroughly wash them after use anyway). Basically the same lab coat that I was issued with  This will all go into action next week so yeah, I’m mostly excited to be honest. However, my Monday begins at 10am with a three hour lecture so not a great start:P I will update this once classes start and the real fun begins >:) Well, its been two weeks since I first wrote this answer and I have had a LOT of stuff going on between then and now. My course at the moment is full of lectures mostly, with a few workshops and lab sessions thrown in for good measure. I’m still getting used to the lecture style of teaching as each class holds up to 450 people while my sixth form biology class had 12 - Its a bit different to say the least. What I wasn’t prepared for however was the sheer variety of topics my modules would cover, as alongside Microbiology I have to do Biochemistry, Cell Biology and current topics in Biosciences - I didn’t sign up for this sh*t (Completely down to my ignorance though - I still love you Surrey :P) Even Microbiology is being a bitch, with organisms either having unpronounceable names or just being incomprehensible entirely. I’m gonna need to upgrade my name remembering skills if i’m going to succeed on this course. As a consequence of the module…… variety, I required an equal variety of books which cost almost as much as the degree these days.  3 of the books were given to me by my cousin when she graduated from Bristol three years earlier - The one I bought was £55 alone :( Overall I am having a great experience here despite some trip ups along the way. Like the time I failed a two hour lab practical because I left a tiny bit of liquid at the bottom of my pipette. That was not great, I’m not gonna lie. Despite that, I’m enjoying all other practicals and I’m getting used to the weird monotony of lectures - I guess we’ll see how long I can take Biochemistry though, that shit is tough :)  Nice picture of the campus that I took while walking to a lecture :) ",
            "date": "Updated March 6, 2020",
            "views": "36",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Daniel Dudgeon",
                    "user_href": "/profile/Daniel-Dudgeon"
                },
                {
                    "user_id": "Anindya Permata Widhi",
                    "user_href": "/profile/Anindya-Permata-Widhi"
                },
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Ander Camps-McCaffrey",
                    "user_href": "/profile/Ander-Camps-McCaffrey"
                },
                {
                    "user_id": "Caleb Huyser",
                    "user_href": "/profile/Caleb-Huyser"
                },
                {
                    "user_id": "Rahul Thomas",
                    "user_href": "/profile/Rahul-Thomas-59"
                },
                {
                    "user_id": "Vishnu Vardhan Reddy",
                    "user_href": "/profile/Vishnu-Vardhan-Reddy-199"
                },
                {
                    "user_id": "Laura Smith",
                    "user_href": "/profile/Laura-Smith-734"
                },
                {
                    "user_id": "Quinton Finn MacDonald",
                    "user_href": "/profile/Quinton-Finn-MacDonald"
                },
                {
                    "user_id": "Pawan Kumar",
                    "user_href": "/profile/Pawan-Kumar-8872"
                },
                {
                    "user_id": "Sarthis Idren",
                    "user_href": "/profile/Sarthis-Idren"
                },
                {
                    "user_id": "Alicia Martinez",
                    "user_href": "/profile/Alicia-Martinez-3"
                },
                {
                    "user_id": "James Carter",
                    "user_href": "/profile/James-Carter-406"
                },
                {
                    "user_id": "Jordan Major",
                    "user_href": "/profile/Jordan-Major-5"
                },
                {
                    "user_id": "Sara Rocks",
                    "user_href": "/profile/Sara-Rocks"
                },
                {
                    "user_id": "Mark June",
                    "user_href": "/profile/Mark-June-2"
                },
                {
                    "user_id": "Faareh Seehar",
                    "user_href": "/profile/Faareh-Seehar"
                },
                {
                    "user_id": "Parker Knudson",
                    "user_href": "/profile/Parker-Knudson-1"
                },
                {
                    "user_id": "Maria Hossini",
                    "user_href": "/profile/Maria-Hossini-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akow Ibrahim",
                "href": "/profile/Akow-Ibrahim"
            },
            "answer_text": "If i’m going to be honest, i’m in shambles.  The universe has been testing me a lot lately. And I mean, a lot. It all started with me being That One™️ lost freshman at orientation (thanks universe) this summer. For some odd reason (but I think we all know why), I missed the registration assembly that went over everything you need to know about registering for classes and what advisor you should go to based on your interests. When I finally realized that I was supposed to be somewhere ~important~ (due to the eerie silence around me), I booked it to the room where the assembly was held only to see it empty.  I later found out (by frantically asking those around me, being that Annoying Lost Freshman™️) that everyone went to separate lecture rooms with advisors to help them build their schedules. Because I knew I was being a bother, I was too afraid to ask what I should do next. SO, I ended up finding a computer lab on my own and tried (emphasis on tried) to build my own schedule (uh-oh #47289294319).  Since I created my own schedule, I am currently taking classes that A) i’ve already taken B) just took because there were no other classes available and C) do not help my graduation requirements in any way. The hopeful comments I played over and over in my head months before the first day of school, “College is far more better than High School!” “You will naturally attract people who are just like you!” “You will finally be learning things you want to learn!” began to seem less appealing as I 1) kind of, sort of, maybe a lot, miss the simpler days of high school 2) Still am friendless and forgot that interacting with other human beings is an important staple to keep yourself from feeling alone at all times and 3) still am confused and have no idea what it is I want to study and pursue as a career.  I mean, what do I know? I’m just a silly, lost, confused, lazy, alone freshman who hasn’t opened her eyes yet. I shouldn’t be set on feeling this way about the tOtAlLy spectacular, ~eye-opening~, dazzling years of college ahead of me. But then again, there’s part of me that thinks this is how it’ll be like for years and years and i’ll end up being the weirdo (like i’m not one already) that is hidden in a corner of the library still unsure about anything and everything hoping there’ll be that sudden twist of events waiting around the corner (i’m waiting universe!). So for now, i’ll be in my [to be continued] phase until further notice.  Here I am, typing this answer on quora dot com when I really should be studying for my upcoming midterm (and by upcoming, I mean tomorrow). So if you’ll excuse me, I have 5 chapters to binge read before my next class xx ",
            "date": "Answered September 27, 2018",
            "views": "9",
            "upvotes": " View 32 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaba Shadali",
                    "user_href": "/profile/Aaba-Shadali"
                },
                {
                    "user_id": "Mariam Asaad",
                    "user_href": "/profile/Mariam-Asaad"
                },
                {
                    "user_id": "Sarah Day",
                    "user_href": "/profile/Sarah-Day-62"
                },
                {
                    "user_id": "Douglas M Kavaguti",
                    "user_href": "/profile/Douglas-M-Kavaguti"
                },
                {
                    "user_id": "Happy Xu",
                    "user_href": "/profile/Happy-Xu-3"
                },
                {
                    "user_id": "Rosie Dela",
                    "user_href": "/profile/Rosie-Dela"
                },
                {
                    "user_id": "Oscar Guerrero",
                    "user_href": "/profile/Oscar-Guerrero-33"
                },
                {
                    "user_id": "Gavin Qiu",
                    "user_href": "/profile/Gavin-Qiu-1"
                },
                {
                    "user_id": "Asim Sheikh",
                    "user_href": "/profile/Asim-Sheikh-6"
                },
                {
                    "user_id": "Keshav Srivaths",
                    "user_href": "/profile/Keshav-Srivaths"
                },
                {
                    "user_id": "Isabella Newman",
                    "user_href": "/profile/Isabella-Newman-3"
                },
                {
                    "user_id": "Jessie Anderson",
                    "user_href": "/profile/Jessie-Anderson-32"
                },
                {
                    "user_id": "Meera Manoj",
                    "user_href": "/profile/Meera-Manoj-4"
                },
                {
                    "user_id": "Rose Sproat",
                    "user_href": "/profile/Rose-Sproat"
                },
                {
                    "user_id": "Yisroel Goodman",
                    "user_href": "/profile/Yisroel-Goodman"
                },
                {
                    "user_id": "Abyan Abdirahman",
                    "user_href": "/profile/Abyan-Abdirahman"
                },
                {
                    "user_id": "Edi Luis",
                    "user_href": "/profile/Edi-Luis"
                },
                {
                    "user_id": "Dominic Pontrelli",
                    "user_href": "/profile/Dominic-Pontrelli"
                },
                {
                    "user_id": "Emma Smith",
                    "user_href": "/profile/Emma-Smith-343"
                },
                {
                    "user_id": "Marija Krstić",
                    "user_href": "/profile/Marija-Krstić-2"
                },
                {
                    "user_id": "Laura Smith",
                    "user_href": "/profile/Laura-Smith-734"
                },
                {
                    "user_id": "Karishma K",
                    "user_href": "/profile/Karishma-K-5"
                },
                {
                    "user_id": "Brennan Ackermann",
                    "user_href": "/profile/Brennan-Ackermann"
                },
                {
                    "user_id": "Jeffrey Wong",
                    "user_href": "/profile/Jeffrey-Wong-123"
                },
                {
                    "user_id": "Reem AbdulAziz",
                    "user_href": "/profile/Reem-AbdulAziz-4"
                },
                {
                    "user_id": "Hans Vercauteren",
                    "user_href": "/profile/Hans-Vercauteren"
                },
                {
                    "user_id": "Sara Rocks",
                    "user_href": "/profile/Sara-Rocks"
                },
                {
                    "user_id": "Jordan Major",
                    "user_href": "/profile/Jordan-Major-5"
                },
                {
                    "user_id": "Aneesh Khilnani",
                    "user_href": "/profile/Aneesh-Khilnani"
                },
                {
                    "user_id": "Chands Gee",
                    "user_href": "/profile/Chands-Gee"
                },
                {
                    "user_id": "Naz Soysal",
                    "user_href": "/profile/Naz-Soysal"
                },
                {
                    "user_id": "Maria Hossini",
                    "user_href": "/profile/Maria-Hossini-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bethany Moe",
                "href": "/profile/Bethany-Moe"
            },
            "answer_text": "It’s going well! I don’t have anything to complain about, which is nice. My schedule is perfect, the classes aren’t too long, my professors are great, and I’m really enjoying it. The food is sometimes mediocre, but there are so many days with food I really like too. I did not like high school much, but I had heard so many times that college was a chance to start over. I ignored it. I didn’t think it could ever apply to me. But, it did, and now I’m enjoying school more than I have in as long as I can remember. I feel a lot more comfortable being myself which was really difficult in high school, and the difference that alone makes is incredible. I have a lot more freedom too; even though I’m still a minor and need my parents’ permission for a lot of things they can’t stop me from acting upon minor decisions. Recently a friend and I took a bus to the other side of town and were out for about 5 hours; I didn’t need to clear it with my parents first and we had a lot of fun! I think my dad is finally starting to see that I’m not really a kid anymore too, which is so nice. I’ve been planning to spend my winter vacation with friends oversees and hadn’t told him until just Sunday because I thought he would shut it down immediately. I explained how I could pay for that and have my next semester of college covered, and my tickets were booked Sunday night. It was incredible. Overall, college is great, and I’m really glad I decided to come I hope this helps! ",
            "date": "Answered October 1, 2018",
            "views": "626",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Yom",
                    "user_href": "/profile/Thomas-Yom"
                },
                {
                    "user_id": "Tika Bong Jung",
                    "user_href": "/profile/Tika-Bong-Jung"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nico van Wijk",
                "href": "/profile/Nico-van-Wijk"
            },
            "answer_text": "If I were the winged seed of a sycamore tree, then college would be a late summer tempest. The rising heat should’ve given it away, but I had been complacent in a seemingly eternal summer. Having grown all I could in the comforting branches of home, I was frozen in time, waiting for the gust to raise me. I wanted it, yet dreaded it. Anticipated it, yet feared it. And, when it struck, I didn’t know how to feel. How does one even move forward again when they’ve been stagnant for so long? When the low wind first caught me, it seemed almost pleasant. It had the exhilarating feel of a new adventure, a fresh start. I’d already pruned myself before I left, changed my appearance, shed my past self so to speak. I thought I was ready. On some levels, I was. Some levels. But, the cool winds were hiding the true tempest, a torrent of emotions and challenges familiar yet distant. My old self, buried deep, still yearned to sprout, break free the shell I had caged him in. I thought myself safe when new shores were in sight, but instead, I had simply become a stranger in a strange man’s land. It was close enough to fool me at first. I thought I’d found a tribe, a place where I could belong. I seemed to connect quickly, too quickly. Then all the little differences starting adding up. A small phrase here, a different food there. Nothing seemed to nourish my soul quite like home. I found myself slipping into old patterns of behaviour, mistakenly making myself more vulnerable than I have for quite some time before. Control is hard when the tempest’s winds still drive your fate. On the surface, I’m blossoming in this new environment. The numbers on paper all add up. Yet, something inside is still unsettled. Halfway across the world, I wonder if I am still the man who left home but a few weeks ago. I honestly don’t know anymore. I don’t think I made the wrong decision. I just need time. Time to adapt to selective pressure. To grow and evolve. Define who I’m going to be and what concessions I will dare allow myself. But for now, part of me still feels forgotten. And, as I lay my roots, I can only hope that arable soil rests beneath me. ",
            "date": "Answered September 27, 2018",
            "views": "17",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Braedyn Hutchison",
                    "user_href": "/profile/Braedyn-Hutchison"
                },
                {
                    "user_id": "Aneesh Khilnani",
                    "user_href": "/profile/Aneesh-Khilnani"
                },
                {
                    "user_id": "Jiayi Qiu",
                    "user_href": "/profile/Jiayi-Qiu-1"
                },
                {
                    "user_id": "Saad Ahmad",
                    "user_href": "/profile/Saad-Ahmad-30"
                },
                {
                    "user_id": "Tanzilur Rahaman",
                    "user_href": "/profile/Tanzilur-Rahaman"
                },
                {
                    "user_id": "Heather Crawford",
                    "user_href": "/profile/Heather-Crawford-15"
                },
                {
                    "user_id": "Jason Nguyen",
                    "user_href": "/profile/Jason-Nguyen-322"
                },
                {
                    "user_id": "James Monroe Evans",
                    "user_href": "/profile/James-Monroe-Evans"
                },
                {
                    "user_id": "Gary Amick",
                    "user_href": "/profile/Gary-Amick"
                },
                {
                    "user_id": "Jacob Schuler",
                    "user_href": "/profile/Jacob-Schuler-3"
                },
                {
                    "user_id": "Namish Gali",
                    "user_href": "/profile/Namish-Gali-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Myers",
                "href": "/profile/Aaron-Myers-13"
            },
            "answer_text": "Ah, the question that encompasses the ones we all get asked almost every day: “Where are you going to college?” and, “What’s your major?” and, “What’s your favorite class?” etc. So to cut to the chase, it’s been great! But allow me to give a bit more detail. I’m a freshman at Grove City College in rural western Pennsylvania (less than an hour from Pittsburgh). I’m majoring in Electrical Engineering with a concentration in Computer Engineering. So far, my professors have amazing. My chemistry professor is a perfect example of this—within the first three weeks of class, he memorized the names of all two hundred or so of my engineering and computer science classmates. In addition, he led two study sessions before the first exam to prepare us for it. Despite the fact that my major entails one of the most difficult courseloads, I haven’t felt overwhelmed—not because I am incredibly gifted but because my professors are dedicated to providing us with the tools we need to thrive in our new environment. Further, I am grateful that there are academically rigorous schools that will edify me in my faith. Some of my classes begin with prayer. The chapel services three times each week are blessings as well. Probably my favorite part of my experience has been my computer programming professor. He begins every class with, “It’s high noon on a [day of the week], which means it’s time for Programming I—your favorite class this semester.” He then launches into an engaging lecture full of dramatic warnings, interesting anecdotes, and a few well-timed jokes. On the social side, things are going well as well. My roommate and I get along fabulously, and I already have several circles of friends. I found a great church to attend, too.  Also, the view from my window’s not too bad, either. ",
            "date": "Answered September 23, 2018",
            "views": "12",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aishik Panja",
                    "user_href": "/profile/Aishik-Panja"
                },
                {
                    "user_id": "Moriah Myers",
                    "user_href": "/profile/Moriah-Myers"
                },
                {
                    "user_id": "Nathan Pitzer",
                    "user_href": "/profile/Nathan-Pitzer"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/YaHkoba-Shachar-BaytYaH"
                },
                {
                    "user_id": "Angelica Williams",
                    "user_href": "/profile/Angelica-Williams-40"
                },
                {
                    "user_id": "Namish Gali",
                    "user_href": "/profile/Namish-Gali-3"
                },
                {
                    "user_id": "Naz Soysal",
                    "user_href": "/profile/Naz-Soysal"
                },
                {
                    "user_id": "James Stiles",
                    "user_href": "/profile/James-Stiles-1"
                },
                {
                    "user_id": "Lydia Abedeen",
                    "user_href": "/profile/Lydia-Abedeen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chitrita Saxena",
                "href": "/profile/Chitrita-Saxena"
            },
            "answer_text": "To answer frankly… it. Is WILD. Welcome to my adventures at Georgia Tech! First of all, the campus is absolutely beautiful and amazing! It’s in the middle of Atlanta so you’d think it would be more city-like but it’s actually very green, and bright and it has its own little bubble in the city!    Here’s a cute picture I got with Buzz at the beginning of the year! He is the funniest mascot ever, and will probably mess with you if you’re just minding your own business!  Overall I love my major, Industrial Design really seems like what I want to do right now, there’s so many opportunities and so much room for growth and my professors are all keen on making us the best designers ever! It’s a LOT of work and I find myself staying up consistently to finish my projects but it’s all worth it!  College is so much different from high school and there’s so much to learn from all your professors and classmates. You have independence, but you also have to learn to manage your time, stay organized and do well in classes! Although my start has been rough on that, I’m sure that by the end of the year I’ll get the hang of it; after all, you learn more from making mistakes than being perfect from the start! Thanks for reading, Chitti ",
            "date": "Answered October 9, 2018",
            "views": "48",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nick Tetteh",
                    "user_href": "/profile/Nick-Tetteh-1"
                },
                {
                    "user_id": "Disha Luthra",
                    "user_href": "/profile/Disha-Luthra-3"
                },
                {
                    "user_id": "Mimansa Jaiswal",
                    "user_href": "/profile/Mimansa-Jaiswal"
                },
                {
                    "user_id": "Prarthana Bhat",
                    "user_href": "/profile/Prarthana-Bhat-3"
                },
                {
                    "user_id": "Jenny Deng",
                    "user_href": "/profile/Jenny-Deng-8"
                },
                {
                    "user_id": "Mark June",
                    "user_href": "/profile/Mark-June-2"
                },
                {
                    "user_id": "Justin Kelley",
                    "user_href": "/profile/Justin-Kelley-16"
                },
                {
                    "user_id": "Angelica Williams",
                    "user_href": "/profile/Angelica-Williams-40"
                },
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Rajesh Swaminathan",
                    "user_href": "/profile/Rajesh-Swaminathan-6"
                },
                {
                    "user_id": "Joel Stern",
                    "user_href": "/profile/Joel-Stern-6"
                },
                {
                    "user_id": "Abimbola Magwaza",
                    "user_href": "/profile/Abimbola-Magwaza"
                },
                {
                    "user_id": "Edi Luis",
                    "user_href": "/profile/Edi-Luis"
                },
                {
                    "user_id": "Mohamed Niyaz",
                    "user_href": "/profile/Mohamed-Niyaz-35"
                },
                {
                    "user_id": "Ryan Widjaja",
                    "user_href": "/profile/Ryan-Widjaja-5"
                },
                {
                    "user_id": "Joanne Yuan",
                    "user_href": "/profile/Joanne-Yuan-1"
                },
                {
                    "user_id": "Sundar Karra",
                    "user_href": "/profile/Sundar-Karra"
                },
                {
                    "user_id": "Abrar Zarif",
                    "user_href": "/profile/আবরার-জারিফ-Abrar-Zarif"
                },
                {
                    "user_id": "Kushagra Mudgal",
                    "user_href": "/profile/Kushagra-Mudgal"
                },
                {
                    "user_id": "Pranav Jain",
                    "user_href": "/profile/Pranav-Jain-138"
                },
                {
                    "user_id": "Sushmit Goyal",
                    "user_href": "/profile/Sushmit-Goyal-1"
                },
                {
                    "user_id": "Shivani Singh",
                    "user_href": "/profile/Shivani-Singh-572"
                },
                {
                    "user_id": "Muneeb",
                    "user_href": "/profile/Muneeb-40"
                },
                {
                    "user_id": "Syed Jaree Haider",
                    "user_href": "/profile/Syed-Jaree-Haider"
                },
                {
                    "user_id": "Iulian Crudu",
                    "user_href": "/profile/Iulian-Crudu"
                },
                {
                    "user_id": "Gianna Phan",
                    "user_href": "/profile/Gianna-Phan"
                },
                {
                    "user_id": "Jordan Major",
                    "user_href": "/profile/Jordan-Major-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tulsi Subramanian",
                "href": "/profile/Tulsi-Subramanian-1"
            },
            "answer_text": "College is absolutely, 100% insane. It’s only been a month, yet so much has happened to me that it feels like I’ve been here half my life. I could start with all the negatives: my laptop crashed and I had to buy a new one, the CS grading system is absolute ass, my legs and feet and shoulders are sore and always hurting from hours of dance team practice every week. I fight with my roommate and sometimes I can’t bring myself to do anything but curl up on our little futon and think about all the boy drama I somehow managed to accrue. But that’s life. That’s college. My new laptop came with free Beats (that are now permanently attached to my head). Coding is my therapy- I’ve found what I love to do at 17, and I’m lucky for that. So what if I’m sore? I made the dance team as a freshman! Fights are natural when you live with someone, she’s also now one of my closest friends. And between you and me, having boy drama and working through all the shit that happened over the weekend is better than staying in and being too afraid to try anything at all. I talk to my family every day and I miss them so much it hurts. I miss the hugs my mom gives me after she helps me work through my problems. I miss how my dad brings me cookies when he knows I’m upset or sad. I miss my brother sitting at the foot of my bed and reading while I do my homework. I miss my dog so, so much, and whenever they send me pictures of him I almost want to cry. I miss my friends, our inside jokes, driving to In N Out at 1 am or spending all day at the mall. But hey, look at me! I have new friends to do new things with, a different kind of family. And this is a family that will never stop growing. College is completely and utterly insane. I feel like I’ve been here for years, but it’s been hardly 5 weeks. But they are hands down and by far the best 5 weeks of my young life. Boiler up, hammer down, hail Purdue, because it’s going to be my home for the next four years and I’m going to love it. ",
            "date": "Answered September 25, 2018",
            "views": "23",
            "upvotes": " View 283 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Megan Leong",
                    "user_href": "/profile/Megan-Leong-7"
                },
                {
                    "user_id": "Kaitlyn Hughes",
                    "user_href": "/profile/Kaitlyn-Hughes-51"
                },
                {
                    "user_id": "Pranav Jayachand",
                    "user_href": "/profile/Pranav-Jayachand"
                },
                {
                    "user_id": "Divya Ghanshani",
                    "user_href": "/profile/Divya-Ghanshani"
                },
                {
                    "user_id": "Pranav Prabhu",
                    "user_href": "/profile/Pranav-Prabhu-15"
                },
                {
                    "user_id": "Ash Shankar",
                    "user_href": "/profile/Ash-Shankar"
                },
                {
                    "user_id": "Rohit Kumar",
                    "user_href": "/profile/Rohit-Kumar-5274"
                },
                {
                    "user_id": "Mrinal Chandra (मृणाल चन्द्र)",
                    "user_href": "/profile/Mrinal-Chandra-मृणाल-चन्द्र"
                },
                {
                    "user_id": "Ashley Wang",
                    "user_href": "/profile/Ashley-Wang-99"
                },
                {
                    "user_id": "Marya Yousef",
                    "user_href": "/profile/Marya-Yousef-1"
                },
                {
                    "user_id": "Señor Doggo",
                    "user_href": "/profile/Señor-Doggo"
                },
                {
                    "user_id": "Sudhanshu Ratnaparkhee",
                    "user_href": "/profile/Sudhanshu-Ratnaparkhee"
                },
                {
                    "user_id": "Aicha Barry",
                    "user_href": "/profile/Aicha-Barry"
                },
                {
                    "user_id": "Rafay Ghafoor",
                    "user_href": "/profile/Rafay-Ghafoor"
                },
                {
                    "user_id": "Sudharshan Srinivas",
                    "user_href": "/profile/Sudharshan-Srinivas-2"
                },
                {
                    "user_id": "Vidhya Ram",
                    "user_href": "/profile/Vidhya-Ram-2"
                },
                {
                    "user_id": "Barnabas Gavin Cangan",
                    "user_href": "/profile/Barnabas-Gavin-Cangan"
                },
                {
                    "user_id": "Vikesh Mirchandani",
                    "user_href": "/profile/Vikesh-Mirchandani-1"
                },
                {
                    "user_id": "Meera Manoj",
                    "user_href": "/profile/Meera-Manoj-4"
                },
                {
                    "user_id": "Mithil Rajput",
                    "user_href": "/profile/Mithil-Rajput-1"
                },
                {
                    "user_id": "Ava Lehane",
                    "user_href": "/profile/Ava-Lehane"
                },
                {
                    "user_id": "Srushti Kadam",
                    "user_href": "/profile/Srushti-Kadam-1"
                },
                {
                    "user_id": "Bhavya Thakur",
                    "user_href": "/profile/Bhavya-Thakur-41"
                },
                {
                    "user_id": "Ugonna Nwakudu",
                    "user_href": "/profile/Ugonna-Nwakudu"
                },
                {
                    "user_id": "Kintu",
                    "user_href": "/profile/Kintu"
                },
                {
                    "user_id": "Sab",
                    "user_href": "/profile/Sab-85"
                },
                {
                    "user_id": "Shweta Yadav",
                    "user_href": "/profile/Shweta-Yadav-57"
                },
                {
                    "user_id": "George Chu",
                    "user_href": "/profile/George-Chu-5"
                },
                {
                    "user_id": "Nhi Truong",
                    "user_href": "/profile/Nhi-Truong-18"
                },
                {
                    "user_id": "Aditi Kapoor",
                    "user_href": "/profile/Aditi-Kapoor-39"
                },
                {
                    "user_id": "Katie Doxtader",
                    "user_href": "/profile/Katie-Doxtader"
                },
                {
                    "user_id": "Shashank Singh",
                    "user_href": "/profile/Shashank-Singh-450"
                },
                {
                    "user_id": "Omkar Betsur",
                    "user_href": "/profile/Omkar-Betsur"
                },
                {
                    "user_id": "Piyush Bhakat",
                    "user_href": "/profile/Piyush-Bhakat"
                },
                {
                    "user_id": "Vansh",
                    "user_href": "/profile/Vansh-43"
                },
                {
                    "user_id": "Sruthy Krishnan",
                    "user_href": "/profile/Sruthy-Krishnan-1"
                },
                {
                    "user_id": "Karim Cominelli",
                    "user_href": "/profile/Karim-Cominelli"
                },
                {
                    "user_id": "Not A Cynic",
                    "user_href": "/profile/Not-A-Cynic"
                },
                {
                    "user_id": "Safiyyah Franklin",
                    "user_href": "/profile/Safiyyah-Franklin"
                },
                {
                    "user_id": "Dharun Aditya Senthilkumar",
                    "user_href": "/profile/Dharun-Aditya-Senthilkumar"
                },
                {
                    "user_id": "Rakshith Dasenahalli Lingaraju",
                    "user_href": "/profile/Rakshith-Dasenahalli-Lingaraju-1"
                },
                {
                    "user_id": "May Field",
                    "user_href": "/profile/May-Field-2"
                },
                {
                    "user_id": "Daisha Joseph",
                    "user_href": "/profile/Daisha-Joseph"
                },
                {
                    "user_id": "Manas K R",
                    "user_href": "/profile/Manas-K-R"
                },
                {
                    "user_id": "Sachin Saraff",
                    "user_href": "/profile/Sachin-Saraff"
                },
                {
                    "user_id": "Lee Bailey",
                    "user_href": "/profile/Lee-Bailey-72"
                },
                {
                    "user_id": "Abhisar Krishna",
                    "user_href": "/profile/Abhisar-Krishna"
                },
                {
                    "user_id": "Sandra Elizabeth",
                    "user_href": "/profile/Sandra-Elizabeth-37"
                },
                {
                    "user_id": "Abhyuday Singh",
                    "user_href": "/profile/अभ्युदय-सिंह-Abhyuday-Singh"
                },
                {
                    "user_id": "Luna Starling",
                    "user_href": "/profile/Luna-Starling"
                },
                {
                    "user_id": "Shiveha Verma",
                    "user_href": "/profile/Shiveha-Verma-2"
                },
                {
                    "user_id": "Neha Jogia",
                    "user_href": "/profile/Neha-Jogia"
                },
                {
                    "user_id": "Nishant Shah",
                    "user_href": "/profile/Nishant-Shah-141"
                },
                {
                    "user_id": "Anthony Neciosup",
                    "user_href": "/profile/Anthony-Neciosup"
                },
                {
                    "user_id": "Matt Prometheus",
                    "user_href": "/profile/Matt-Prometheus"
                },
                {
                    "user_id": "Will Ho",
                    "user_href": "/profile/Will-Ho-17"
                },
                {
                    "user_id": "Samantha Morse",
                    "user_href": "/profile/Samantha-Morse"
                },
                {
                    "user_id": "Laura Rampetsreiter",
                    "user_href": "/profile/Laura-Rampetsreiter-1"
                },
                {
                    "user_id": "Tyler Henderson",
                    "user_href": "/profile/Tyler-Henderson-25"
                },
                {
                    "user_id": "Aman Parekh",
                    "user_href": "/profile/Aman-Parekh"
                },
                {
                    "user_id": "Aditya",
                    "user_href": "/profile/Aditya-809"
                },
                {
                    "user_id": "Janet Clark",
                    "user_href": "/profile/Janet-Clark-31"
                },
                {
                    "user_id": "Saloni Mehta",
                    "user_href": "/profile/Saloni-Mehta-16"
                },
                {
                    "user_id": "Bonnie Nguyen",
                    "user_href": "/profile/Bonnie-Nguyen-15"
                },
                {
                    "user_id": "Matthew Yekell",
                    "user_href": "/profile/Matthew-Yekell-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Pink-Sparkle-6"
                },
                {
                    "user_id": "Aniketh Ayinala",
                    "user_href": "/profile/Aniketh-Ayinala"
                },
                {
                    "user_id": "Jenny Zhou",
                    "user_href": "/profile/Jenny-Zhou-41"
                },
                {
                    "user_id": "Harshini Chandirasekar",
                    "user_href": "/profile/Harshini-Chandirasekar"
                },
                {
                    "user_id": "Akanksha Das",
                    "user_href": "/profile/Akanksha-Das-11"
                },
                {
                    "user_id": "Lūcija Bērziņa",
                    "user_href": "/profile/Lūcija-Bērziņa"
                },
                {
                    "user_id": "M.S Subikshadevi",
                    "user_href": "/profile/M-S-Subikshadevi"
                },
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Dhanya Narayan",
                    "user_href": "/profile/Dhanya-Narayan-7"
                },
                {
                    "user_id": "Will Simpson",
                    "user_href": "/profile/Will-Simpson-33"
                },
                {
                    "user_id": "Grace White",
                    "user_href": "/profile/Grace-White-95"
                },
                {
                    "user_id": "Rahul Thomas",
                    "user_href": "/profile/Rahul-Thomas-59"
                },
                {
                    "user_id": "Muskaan Mehta",
                    "user_href": "/profile/Muskaan-Mehta-6"
                },
                {
                    "user_id": "Stephanie Wang",
                    "user_href": "/profile/Stephanie-Wang-70"
                },
                {
                    "user_id": "Sarthis Idren",
                    "user_href": "/profile/Sarthis-Idren"
                },
                {
                    "user_id": "Suman Sajnani",
                    "user_href": "/profile/Suman-Sajnani"
                },
                {
                    "user_id": "Alexi A Thomas",
                    "user_href": "/profile/Alexi-A-Thomas"
                },
                {
                    "user_id": "Ruchika Lalwani",
                    "user_href": "/profile/Ruchika-Lalwani"
                },
                {
                    "user_id": "Cade Crandall",
                    "user_href": "/profile/Cade-Crandall"
                },
                {
                    "user_id": "Umika Thakkar",
                    "user_href": "/profile/Umika-Thakkar"
                },
                {
                    "user_id": "Abhijeet Srivastava",
                    "user_href": "/profile/Abhijeet-Srivastava-84"
                },
                {
                    "user_id": "Harshit Pathak",
                    "user_href": "/profile/Harshit-Pathak-4"
                },
                {
                    "user_id": "Tara Brebric",
                    "user_href": "/profile/Tara-Brebric"
                },
                {
                    "user_id": "Reine Brown",
                    "user_href": "/profile/Reine-Brown-1"
                },
                {
                    "user_id": "Alex Phillip",
                    "user_href": "/profile/Alex-Phillip"
                },
                {
                    "user_id": "Aditya Yash Seth",
                    "user_href": "/profile/Aditya-Yash-Seth-1"
                },
                {
                    "user_id": "Raha Shanehbandi",
                    "user_href": "/profile/Raha-Shanehbandi-1"
                },
                {
                    "user_id": "Emily Zepeda",
                    "user_href": "/profile/Emily-Zepeda-4"
                },
                {
                    "user_id": "Lakshay Sood",
                    "user_href": "/profile/Lakshay-Sood"
                },
                {
                    "user_id": "Mary Kaiser",
                    "user_href": "/profile/Mary-Kaiser-13"
                },
                {
                    "user_id": "Dhrubesh Ds",
                    "user_href": "/profile/Dhrubesh-Ds"
                },
                {
                    "user_id": "Sofia Gates",
                    "user_href": "/profile/Sofia-Gates"
                },
                {
                    "user_id": "Arjun Srinivasan",
                    "user_href": "/profile/Arjun-Srinivasan-23"
                },
                {
                    "user_id": "David Ocampo",
                    "user_href": "/profile/David-Ocampo-4"
                },
                {
                    "user_id": "Dayana Saravia",
                    "user_href": "/profile/Dayana-Saravia"
                },
                {
                    "user_id": "Luna Begum",
                    "user_href": "/profile/Luna-Begum-1"
                },
                {
                    "user_id": "Mel Kasey",
                    "user_href": "/profile/Mel-Kasey"
                },
                {
                    "user_id": "Maria Hossini",
                    "user_href": "/profile/Maria-Hossini-2"
                },
                {
                    "user_id": "Benny Potter",
                    "user_href": "/profile/Benny-Potter-2"
                },
                {
                    "user_id": "Aum Jena",
                    "user_href": "/profile/Aum-Jena"
                },
                {
                    "user_id": "Sean Bryson",
                    "user_href": "/profile/Sean-Bryson-4"
                },
                {
                    "user_id": "Ambreen Kashif",
                    "user_href": "/profile/Ambreen-Kashif-7"
                },
                {
                    "user_id": "Jennifer Samaoen",
                    "user_href": "/profile/Jennifer-Samaoen"
                },
                {
                    "user_id": "Cavit Güdücü",
                    "user_href": "/profile/Cavit-Güdücü"
                },
                {
                    "user_id": "Dipak Paswan",
                    "user_href": "/profile/Dipak-Paswan"
                },
                {
                    "user_id": "Supriya Jahagirdar",
                    "user_href": "/profile/Supriya-Jahagirdar"
                },
                {
                    "user_id": "Santosh Kumar",
                    "user_href": "/profile/Santosh-Kumar-4979"
                },
                {
                    "user_id": "Amanda Louise Foo",
                    "user_href": "/profile/Amanda-Louise-Foo"
                },
                {
                    "user_id": "Akshara Raju",
                    "user_href": "/profile/Akshara-Raju-6"
                },
                {
                    "user_id": "Sim Masood",
                    "user_href": "/profile/Sim-Masood"
                },
                {
                    "user_id": "Srishtik Dutta",
                    "user_href": "/profile/Srishtik-Dutta"
                },
                {
                    "user_id": "Bavitha Das",
                    "user_href": "/profile/Bavitha-Das"
                },
                {
                    "user_id": "Thomas Liang",
                    "user_href": "/profile/Thomas-Liang-11"
                },
                {
                    "user_id": "Grace Yuan",
                    "user_href": "/profile/Grace-Yuan-16"
                },
                {
                    "user_id": "Abhi Jyoti",
                    "user_href": "/profile/Abhi-Jyoti-3"
                },
                {
                    "user_id": "Marisa Bacon",
                    "user_href": "/profile/Marisa-Bacon-2"
                },
                {
                    "user_id": "Matthew Hsu",
                    "user_href": "/profile/Matthew-Hsu-8"
                },
                {
                    "user_id": "Ila Chaubey",
                    "user_href": "/profile/Ila-Chaubey"
                },
                {
                    "user_id": "Munira Abdirahman",
                    "user_href": "/profile/Munira-Abdirahman-3"
                },
                {
                    "user_id": "Iskander Lou",
                    "user_href": "/profile/Iskander-Lou"
                },
                {
                    "user_id": "Thomas Bell",
                    "user_href": "/profile/Thomas-Bell-46"
                },
                {
                    "user_id": "Ishika Jain",
                    "user_href": "/profile/Ishika-Jain-204"
                },
                {
                    "user_id": "Bryan Cuevas",
                    "user_href": "/profile/Bryan-Cuevas-11"
                },
                {
                    "user_id": "Deepte Jaganmohan",
                    "user_href": "/profile/Deepte-Jaganmohan"
                },
                {
                    "user_id": "Aditi Ahuja",
                    "user_href": "/profile/Aditi-Ahuja-9"
                },
                {
                    "user_id": "Ellie Greyson",
                    "user_href": "/profile/Ellie-Greyson"
                },
                {
                    "user_id": "Zyeni Teloma",
                    "user_href": "/profile/Zyeni-Teloma"
                },
                {
                    "user_id": "Deepshika Handigol",
                    "user_href": "/profile/Deepshika-Handigol-1"
                },
                {
                    "user_id": "Harsh Deep",
                    "user_href": "/profile/Harsh-Deep-4"
                },
                {
                    "user_id": "Erin Mooney",
                    "user_href": "/profile/Erin-Mooney-25"
                },
                {
                    "user_id": "Sarah Woodglyn",
                    "user_href": "/profile/Sarah-Woodglyn"
                },
                {
                    "user_id": "Samantha Staltari",
                    "user_href": "/profile/Samantha-Staltari-1"
                },
                {
                    "user_id": "Kimberly Vu",
                    "user_href": "/profile/Kimberly-Vu-1"
                },
                {
                    "user_id": "Catherine Flores",
                    "user_href": "/profile/Catherine-Flores-27"
                },
                {
                    "user_id": "Nicolae Cușnir",
                    "user_href": "/profile/Nicolae-Cușnir"
                },
                {
                    "user_id": "Nitya Sunkad",
                    "user_href": "/profile/Nitya-Sunkad"
                },
                {
                    "user_id": "Samantha Greene",
                    "user_href": "/profile/Samantha-Greene-15"
                },
                {
                    "user_id": "David Kiran",
                    "user_href": "/profile/David-Kiran-2"
                },
                {
                    "user_id": "Vibhanshu Sharma",
                    "user_href": "/profile/Vibhanshu-Sharma"
                },
                {
                    "user_id": "Dayna Lui",
                    "user_href": "/profile/Dayna-Lui-1"
                },
                {
                    "user_id": "John Downe",
                    "user_href": "/profile/John-Downe-5"
                },
                {
                    "user_id": "Rochelle Pun",
                    "user_href": "/profile/Rochelle-Pun"
                },
                {
                    "user_id": "Vedant Vaidya",
                    "user_href": "/profile/Vedant-Vaidya-3"
                },
                {
                    "user_id": "Gary Amick",
                    "user_href": "/profile/Gary-Amick"
                },
                {
                    "user_id": "Daniyal Qazi",
                    "user_href": "/profile/Daniyal-Qazi-1"
                },
                {
                    "user_id": "Suleman Qamar",
                    "user_href": "/profile/Suleman-Qamar-1"
                },
                {
                    "user_id": "Ella Yu",
                    "user_href": "/profile/Ella-Yu-11"
                },
                {
                    "user_id": "Polina Smirnova",
                    "user_href": "/profile/Polina-Smirnova-1"
                },
                {
                    "user_id": "Theo Reos",
                    "user_href": "/profile/Theo-Reos"
                },
                {
                    "user_id": "Srivatsan Prakash",
                    "user_href": "/profile/Srivatsan-Prakash-1"
                },
                {
                    "user_id": "Isabella Newman",
                    "user_href": "/profile/Isabella-Newman-3"
                },
                {
                    "user_id": "Anthony Eid",
                    "user_href": "/profile/Anthony-Eid-1"
                },
                {
                    "user_id": "Ramiella Chiu",
                    "user_href": "/profile/Ramiella-Chiu"
                },
                {
                    "user_id": "Nur Al-Kodmany",
                    "user_href": "/profile/Nur-Al-Kodmany-1"
                },
                {
                    "user_id": "Stella Chen",
                    "user_href": "/profile/Stella-Chen-53"
                },
                {
                    "user_id": "Manos Broumidis",
                    "user_href": "/profile/Manos-Broumidis"
                },
                {
                    "user_id": "Ang R",
                    "user_href": "/profile/Ang-R-19"
                },
                {
                    "user_id": "Annie To",
                    "user_href": "/profile/Annie-To-2"
                },
                {
                    "user_id": "Naz Soysal",
                    "user_href": "/profile/Naz-Soysal"
                },
                {
                    "user_id": "Elizabeth Svinkin",
                    "user_href": "/profile/Elizabeth-Svinkin-1"
                },
                {
                    "user_id": "Varsha Venkat",
                    "user_href": "/profile/Varsha-Venkat-15"
                },
                {
                    "user_id": "Arjun Narayanan",
                    "user_href": "/profile/Arjun-Narayanan-13"
                },
                {
                    "user_id": "Rohan Jain",
                    "user_href": "/profile/Rohan-Jain-30"
                },
                {
                    "user_id": "Mobius Person",
                    "user_href": "/profile/Mobius-Person"
                },
                {
                    "user_id": "Elena Young",
                    "user_href": "/profile/Elena-Young-21"
                },
                {
                    "user_id": "Mary Grace Walsh",
                    "user_href": "/profile/Mary-Grace-Walsh"
                },
                {
                    "user_id": "Cholan Raje",
                    "user_href": "/profile/Cholan-Raje"
                },
                {
                    "user_id": "Krishna Adhaduk",
                    "user_href": "/profile/Krishna-Adhaduk"
                },
                {
                    "user_id": "Vaibhav Bhandari",
                    "user_href": "/profile/Vaibhav-Bhandari-24"
                },
                {
                    "user_id": "Jordan Major",
                    "user_href": "/profile/Jordan-Major-5"
                },
                {
                    "user_id": "Bethany Moe",
                    "user_href": "/profile/Bethany-Moe"
                },
                {
                    "user_id": "Amrit Balakrishnan",
                    "user_href": "/profile/Amrit-Balakrishnan"
                },
                {
                    "user_id": "Nicholas Howe",
                    "user_href": "/profile/Nicholas-Howe"
                },
                {
                    "user_id": "Rebecca Williams",
                    "user_href": "/profile/Rebecca-Williams-209"
                },
                {
                    "user_id": "Reuben David",
                    "user_href": "/profile/Reuben-David-1"
                },
                {
                    "user_id": "Mimansa Jaiswal",
                    "user_href": "/profile/Mimansa-Jaiswal"
                },
                {
                    "user_id": "Abdur Rehman Zahid",
                    "user_href": "/profile/Abdur-Rehman-Zahid"
                },
                {
                    "user_id": "Ahmed Upadhyay",
                    "user_href": "/profile/Ahmed-Upadhyay"
                },
                {
                    "user_id": "Rahul",
                    "user_href": "/profile/Rahul-2378"
                },
                {
                    "user_id": "Amit",
                    "user_href": "/profile/Amit-1157"
                },
                {
                    "user_id": "Em Onaga",
                    "user_href": "/profile/Em-Onaga"
                },
                {
                    "user_id": "Amanda Kunkel",
                    "user_href": "/profile/Amanda-Kunkel"
                },
                {
                    "user_id": "Cathrin Christo",
                    "user_href": "/profile/Cathrin-Christo"
                },
                {
                    "user_id": "Paul Van Amburg",
                    "user_href": "/profile/Paul-Van-Amburg"
                },
                {
                    "user_id": "Katy Howell",
                    "user_href": "/profile/Katy-Howell-8"
                },
                {
                    "user_id": "Saahil Mohta",
                    "user_href": "/profile/Saahil-Mohta"
                },
                {
                    "user_id": "Jeremy Ferguson",
                    "user_href": "/profile/Jeremy-Ferguson-18"
                },
                {
                    "user_id": "Ananya Vishwanath",
                    "user_href": "/profile/Ananya-Vishwanath-6"
                },
                {
                    "user_id": "Anushka",
                    "user_href": "/profile/Anushka-233"
                },
                {
                    "user_id": "Sivaranjani Rajan",
                    "user_href": "/profile/Sivaranjani-Rajan"
                },
                {
                    "user_id": "Balaji Ramasamy",
                    "user_href": "/profile/Balaji-Ramasamy-10"
                },
                {
                    "user_id": "Vishnuu Gopi",
                    "user_href": "/profile/Vishnuu-Gopi"
                },
                {
                    "user_id": "Dominic Pontrelli",
                    "user_href": "/profile/Dominic-Pontrelli"
                },
                {
                    "user_id": "Zoe HC",
                    "user_href": "/profile/Zoe-HC"
                },
                {
                    "user_id": "Lucus Zha",
                    "user_href": "/profile/Lucus-Zha"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Gregory-C-22"
                },
                {
                    "user_id": "Akanksha Lal",
                    "user_href": "/profile/Akanksha-Lal-6"
                },
                {
                    "user_id": "Abyan Abdirahman",
                    "user_href": "/profile/Abyan-Abdirahman"
                },
                {
                    "user_id": "Vera Acheamong",
                    "user_href": "/profile/Vera-Acheamong"
                },
                {
                    "user_id": "Morgan Hudson",
                    "user_href": "/profile/Morgan-Hudson-18"
                },
                {
                    "user_id": "Ryan Nasir",
                    "user_href": "/profile/Ryan-Nasir-1"
                },
                {
                    "user_id": "Somesh Rao",
                    "user_href": "/profile/Somesh-Rao"
                },
                {
                    "user_id": "Priyanka Kuruganti",
                    "user_href": "/profile/Priyanka-Kuruganti-1"
                },
                {
                    "user_id": "Vibhuti Choudhary",
                    "user_href": "/profile/Vibhuti-Choudhary"
                },
                {
                    "user_id": "Ujjval Narang",
                    "user_href": "/profile/Ujjval-Narang"
                },
                {
                    "user_id": "Camille Kamara",
                    "user_href": "/profile/Camille-Kamara"
                },
                {
                    "user_id": "Dhananjay B",
                    "user_href": "/profile/Dhananjay-B-3"
                },
                {
                    "user_id": "Yogi Gohel",
                    "user_href": "/profile/Yogi-Gohel"
                },
                {
                    "user_id": " Prasad",
                    "user_href": "/profile/Prasad-746"
                },
                {
                    "user_id": "Monique Cao",
                    "user_href": "/profile/Monique-Cao"
                },
                {
                    "user_id": "Edi Luis",
                    "user_href": "/profile/Edi-Luis"
                },
                {
                    "user_id": "Noorhan Ibraheem",
                    "user_href": "/profile/Noorhan-Ibraheem"
                },
                {
                    "user_id": "Hunter Trent McGlone (האנטר מקלון)",
                    "user_href": "/profile/Hunter-Trent-McGlone-האנטר-מקלון"
                },
                {
                    "user_id": "Radhika Desai",
                    "user_href": "/profile/Radhika-Desai-14"
                },
                {
                    "user_id": "Helena Brown",
                    "user_href": "/profile/Helena-Brown-31"
                },
                {
                    "user_id": "Anton Sandstrom",
                    "user_href": "/profile/Anton-Sandstrom"
                },
                {
                    "user_id": "Avi Singh",
                    "user_href": "/profile/Avi-Singh-197"
                },
                {
                    "user_id": "Grace Oh",
                    "user_href": "/profile/Grace-Oh-44"
                },
                {
                    "user_id": "Kenneth Chan",
                    "user_href": "/profile/Kenneth-Chan-70"
                },
                {
                    "user_id": "Karthik M",
                    "user_href": "/profile/Karthik-M-986"
                },
                {
                    "user_id": "Sumukh Balu",
                    "user_href": "/profile/Sumukh-Balu"
                },
                {
                    "user_id": "Viraj Mantri",
                    "user_href": "/profile/Viraj-Mantri"
                },
                {
                    "user_id": "Angelica Williams",
                    "user_href": "/profile/Angelica-Williams-40"
                },
                {
                    "user_id": "Venkatesh S",
                    "user_href": "/profile/Venkatesh-S-86"
                },
                {
                    "user_id": "Thomas Chilton",
                    "user_href": "/profile/Thomas-Chilton-1"
                },
                {
                    "user_id": "Paisley Blackburn",
                    "user_href": "/profile/Paisley-Blackburn-1"
                },
                {
                    "user_id": "Shreyam Mishra",
                    "user_href": "/profile/Shreyam-Mishra-1"
                },
                {
                    "user_id": "Haley Patel",
                    "user_href": "/profile/Haley-Patel-2"
                },
                {
                    "user_id": "Nishtha Malhotra",
                    "user_href": "/profile/Nishtha-Malhotra-12"
                },
                {
                    "user_id": "Jia Kapoor",
                    "user_href": "/profile/Jia-Kapoor-1"
                },
                {
                    "user_id": "Mariafernanda Gonzalez",
                    "user_href": "/profile/Mariafernanda-Gonzalez"
                },
                {
                    "user_id": "Siddhant Mody",
                    "user_href": "/profile/Siddhant-Mody-1"
                },
                {
                    "user_id": "Arun",
                    "user_href": "/profile/Arun-1721"
                },
                {
                    "user_id": "Eric Wang",
                    "user_href": "/profile/Eric-Wang-434"
                },
                {
                    "user_id": "Deepsikha Chatterjee",
                    "user_href": "/profile/Deepsikha-Chatterjee-3"
                },
                {
                    "user_id": "Aaron Myers",
                    "user_href": "/profile/Aaron-Myers-13"
                },
                {
                    "user_id": "Namish Gali",
                    "user_href": "/profile/Namish-Gali-3"
                },
                {
                    "user_id": "Heather Crawford",
                    "user_href": "/profile/Heather-Crawford-15"
                },
                {
                    "user_id": "Nilaya Mairal",
                    "user_href": "/profile/Nilaya-Mairal"
                },
                {
                    "user_id": "Kai Pinner",
                    "user_href": "/profile/Kai-Pinner"
                },
                {
                    "user_id": "Bradley Ward",
                    "user_href": "/profile/Bradley-Ward-11"
                },
                {
                    "user_id": "Saanvi Balakrishan",
                    "user_href": "/profile/Saanvi-Balakrishan"
                },
                {
                    "user_id": "Sulaiman Malik",
                    "user_href": "/profile/Sulaiman-Malik-4"
                },
                {
                    "user_id": "Swetha Muthu",
                    "user_href": "/profile/Swetha-Muthu-2"
                },
                {
                    "user_id": "Rick Fleming",
                    "user_href": "/profile/Rick-Fleming-20"
                },
                {
                    "user_id": "Monami Momotaro",
                    "user_href": "/profile/Monami-Momotaro"
                },
                {
                    "user_id": "Karishma George",
                    "user_href": "/profile/Karishma-George-1"
                },
                {
                    "user_id": "Rahini Chandrasekaran",
                    "user_href": "/profile/Rahini-Chandrasekaran"
                },
                {
                    "user_id": "Akshat Sinha (अक्षत सिन्हा)",
                    "user_href": "/profile/Akshat-Sinha-अक्षत-सिन्हा"
                },
                {
                    "user_id": "Lim Hua En",
                    "user_href": "/profile/Lim-Hua-En"
                },
                {
                    "user_id": "Sonakshi Khosla",
                    "user_href": "/profile/Sonakshi-Khosla-1"
                },
                {
                    "user_id": "Ewa Grzybowska",
                    "user_href": "/profile/Ewa-Grzybowska"
                },
                {
                    "user_id": "Tanish Dhami",
                    "user_href": "/profile/Tanish-Dhami-1"
                },
                {
                    "user_id": "Chandrika Jadon",
                    "user_href": "/profile/Chandrika-Jadon"
                },
                {
                    "user_id": "Vanya Pandey",
                    "user_href": "/profile/Vanya-Pandey-1"
                },
                {
                    "user_id": "Arya Ravi",
                    "user_href": "/profile/Arya-Ravi-1"
                },
                {
                    "user_id": "Delaney Sullivan",
                    "user_href": "/profile/Delaney-Sullivan-8"
                },
                {
                    "user_id": "Sethu Narayanan",
                    "user_href": "/profile/Sethu-Narayanan"
                },
                {
                    "user_id": "Henry Cañete",
                    "user_href": "/profile/Henry-Cañete"
                },
                {
                    "user_id": "Dev Ramaiya",
                    "user_href": "/profile/Dev-Ramaiya"
                },
                {
                    "user_id": "Marcy Buono",
                    "user_href": "/profile/Marcy-Buono"
                },
                {
                    "user_id": "Lydia Lee",
                    "user_href": "/profile/Lydia-Lee-162"
                },
                {
                    "user_id": "Ty Raj",
                    "user_href": "/profile/Ty-Raj"
                },
                {
                    "user_id": "Saara Katyal",
                    "user_href": "/profile/Saara-Katyal"
                },
                {
                    "user_id": "Charlene Maness",
                    "user_href": "/profile/Charlene-Maness"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "Konti Kandan",
                    "user_href": "/profile/Konti-Kandan"
                },
                {
                    "user_id": "Shweta Mishra",
                    "user_href": "/profile/Shweta-Mishra-21"
                },
                {
                    "user_id": "Jeffrey Lee",
                    "user_href": "/profile/Jeffrey-Lee-143"
                },
                {
                    "user_id": "Sai Anirudh",
                    "user_href": "/profile/Sai-Anirudh-14"
                },
                {
                    "user_id": "Aditya Venkatram",
                    "user_href": "/profile/Aditya-Venkatram-2"
                },
                {
                    "user_id": "Justin Chiang",
                    "user_href": "/profile/Justin-Chiang-11"
                },
                {
                    "user_id": "Mohammed Ahmed",
                    "user_href": "/profile/Mohammed-Ahmed-709"
                },
                {
                    "user_id": "Sabrina Shih",
                    "user_href": "/profile/Sabrina-Shih-2"
                },
                {
                    "user_id": "Nishanth Jayram",
                    "user_href": "/profile/Nishanth-Jayram"
                },
                {
                    "user_id": "Vishnu Vardhan Reddy",
                    "user_href": "/profile/Vishnu-Vardhan-Reddy-199"
                },
                {
                    "user_id": "Kishan Panaganti Badrinath",
                    "user_href": "/profile/Kishan-Panaganti-Badrinath"
                },
                {
                    "user_id": "Emily Preston",
                    "user_href": "/profile/Emily-Preston-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Valerie Yip",
                "href": "/profile/Valerie-Yip-5"
            },
            "answer_text": "User-11254232469424413626, I was reluctant to get back to you when you requested my answer, because UChicago starts pretty late; I was still having orientation week then. As for college, I like it quite a lot so far. I love the freedom that I have, which contrasts a lot with the conservative academic climate I used to be in. There are many many opportunities here and you can choose the ones you’re most intrigued by. Currently, I’m taking 4 courses in the quarter system (Heidegger, Emily Dickinson, Philosophical Perspectives, physics), and 3 sit-ins (a grad course on Sartre, Foucault, and Moby Dick). I also attended this temporary conference on Zhuangzi, and spoke with many professors after class. I’m a bit tired and overwhelmed, but it’s more to do with the bureaucratic annoyance of switching courses and trying to get used to a new environment. I love the courses I’m taking but one disadvantage I would list is that the Core Curriculum here is a bit restraining. Perhaps I would’ve preferred an Open Curriculum more, but I don’t think it’s a factor that would make me dislike my experience here, because I love the specificity and scope of some courses. As for extracurriculars, I’m trying to get involved in the Buddhist circle here, archery, and philosophy club. I’m not sure what else I might still want to join, given my heavy academic workload. But for now, I’m excited to talk more with my professors and classmates! Living up to its reputation, the party scene here isn’t very popular, and I don’t really partake or care that much for it. I tried going to one for free food, but it was just very claustrophobic and tiresome. The campus is also really really beautiful!       ",
            "date": "Updated October 14, 2018",
            "views": "28",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ibrahim E. Mohamed",
                    "user_href": "/profile/Ibrahim-E-Mohamed-1"
                },
                {
                    "user_id": "Callum Sutherland",
                    "user_href": "/profile/Callum-Sutherland-3"
                },
                {
                    "user_id": "Cyrus Pacht",
                    "user_href": "/profile/Cyrus-Pacht"
                },
                {
                    "user_id": "Michael Beraka",
                    "user_href": "/profile/Michael-Beraka"
                },
                {
                    "user_id": "Faruk Balcı",
                    "user_href": "/profile/Faruk-Balcı"
                },
                {
                    "user_id": "Sandra Elizabeth",
                    "user_href": "/profile/Sandra-Elizabeth-37"
                },
                {
                    "user_id": "Sumedh Khanolkar",
                    "user_href": "/profile/Sumedh-Khanolkar"
                },
                {
                    "user_id": "Mark June",
                    "user_href": "/profile/Mark-June-2"
                },
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Abrar Zarif",
                    "user_href": "/profile/আবরার-জারিফ-Abrar-Zarif"
                },
                {
                    "user_id": "Edi Luis",
                    "user_href": "/profile/Edi-Luis"
                },
                {
                    "user_id": "Noreaksey Chandarith",
                    "user_href": "/profile/Noreaksey-Chandarith"
                },
                {
                    "user_id": "Mimansa Jaiswal",
                    "user_href": "/profile/Mimansa-Jaiswal"
                },
                {
                    "user_id": "Victor Ng",
                    "user_href": "/profile/Victor-Ng-20"
                },
                {
                    "user_id": "Michelle Castro",
                    "user_href": "/profile/Michelle-Castro-9"
                },
                {
                    "user_id": "Shaheer Rahman",
                    "user_href": "/profile/Shaheer-Rahman-3"
                },
                {
                    "user_id": "Vinicio Hernandez",
                    "user_href": "/profile/Vinicio-Hernandez-5"
                },
                {
                    "user_id": "Nat Roth",
                    "user_href": "/profile/Nat-Roth-1"
                },
                {
                    "user_id": "Emmanuel-Francis Nwaolisa Ogomegbunam",
                    "user_href": "/profile/Emmanuel-Francis-Nwaolisa-Ogomegbunam"
                },
                {
                    "user_id": "Alexander Fortier",
                    "user_href": "/profile/Alexander-Fortier"
                },
                {
                    "user_id": "Noah J. Wescombe",
                    "user_href": "/profile/Noah-J-Wescombe"
                },
                {
                    "user_id": "Danny Oh",
                    "user_href": "/profile/Danny-Oh-5"
                },
                {
                    "user_id": "Kenneth Thomas",
                    "user_href": "/profile/Kenneth-Thomas"
                },
                {
                    "user_id": "Alvi Khan",
                    "user_href": "/profile/Alvi-Khan-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michelle Lin",
                "href": "/profile/Michelle-Lin-104"
            },
            "answer_text": "I love the nature and quiet atmosphere of my college. So far, it’s been okay, except for me to get used to the tiring hours of study and homework that I didn’t have in high school. In addition, I’m kind of struggling in my BIO 101 class because I didn’t do so well on the first test (it is a lecture based class). Other than that, I love all my classes and am happy that I used “rate my professor” to choose my teachers. The right teachers really make an impact on my learning interests and retention. Also, the teachers all have this mindset of wanting to help you understand the material, which makes me really happy. Other than that, I really like the fact that my college schedule has big pockets of time to do all my homework and study for tests as well as time to self learn on some things that I choose to read and take notes on. Also, the campus landscape is really nice. It’s full of all kinds of trees that I don’t know the name too, and a ton of grassy and shady areas to sit on for a lunch break or just relaxing or napping. So, so far my college experience is ok. Not too overwhelming. ",
            "date": "Answered September 22, 2018",
            "views": "518",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Namish Gali",
                    "user_href": "/profile/Namish-Gali-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kunjan Trivedi",
                "href": "/profile/Kunjan-Trivedi-9"
            },
            "answer_text": "This is actually my second year because it’s a five year program but yeah, it’s going pretty well. First year was hell. University is a step up from high school, that’s for sure. I loved Calculus I and II and Cell Bio last year. It’s more work this year, but I’m more experienced as well. I’ve found it relatively easier to prioritize between weekly assignments, and I’ll start studying for midterms soon, also throws a wrench into the equation, pardon the pun. I’m a part of our Turning Point McMaster club, so I’m happy about that. I’ve found a (small) community of likeminded liberty-loving folks, where I can more freely express conservative-libertarian values. We’re the first TP club north of the 49th parallel, so that’s a good thing. There should a TPUSA club on American college campuses, so join it. I’m also going to downtown Toronto for a hospital volunteering interview next week, and I part-time tutor, so my year is locked and loaded. If I can keep my GPA up with my increased workload, I might turn out to be a good med school applicant in about a year. Meanwhile there’s also co-op starting up for me this year, so I’ll be on the lookout for that. Thanks Namish Gali for the A2A! ",
            "date": "Answered September 22, 2018",
            "views": "14",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joey Ro",
                    "user_href": "/profile/Joey-Ro"
                },
                {
                    "user_id": "William Lawyer",
                    "user_href": "/profile/William-Lawyer-1"
                },
                {
                    "user_id": "Aditya Chhabra",
                    "user_href": "/profile/Aditya-Chhabra-45"
                },
                {
                    "user_id": "Naz Soysal",
                    "user_href": "/profile/Naz-Soysal"
                },
                {
                    "user_id": "Andrew Eusebio",
                    "user_href": "/profile/Andrew-Eusebio"
                },
                {
                    "user_id": "Chris Wilson",
                    "user_href": "/profile/Chris-Wilson-1554"
                },
                {
                    "user_id": "Cory Whidden",
                    "user_href": "/profile/Cory-Whidden"
                },
                {
                    "user_id": "Namish Gali",
                    "user_href": "/profile/Namish-Gali-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chands Gee",
                "href": "/profile/Chands-Gee"
            },
            "answer_text": "1. So many books to read. So little time.  That green Financial Accounting book has three volumes. Pictured above is the First Volume with a total of 1062 pages. The Second and Third Volumes have about 900 pages and 800 pages, respectively. This is only for the First Semester! 2. I have a hard time adapting to the dispositions of professors. Some professors are strict; some are lenient. 3. Having sleepless nights becomes a norm. On the contrary, having that day when I can sleep at night is rare, nowadays. 4. I have consumed more cups of coffee than ever before. 5. Joining organizations has been enthusiastic and fun! 6. Failing quizzes is not fun, despite tremendous amounts of time I have allotted for studying. I have passed some quizzes, but the failing marks outnumber them for now, unfortunately, which brings me to my seventh point. 7. Failing quizzes in college is normal (especially in my case), as opposed to the seemingly taboo notion teens once harbored towards failing in high school. 8. You keep wondering whether you will be able to progess to the higher years or give up instantly and stop going to college. 9. Choosing friends becomes challenging, due to the diverse atmosphere college/university or any higher education institution can offer. 10. Somebody give me functioning brain cells, please. ",
            "date": "Answered September 25, 2018",
            "views": "35",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Viktor Bak",
                    "user_href": "/profile/Viktor-Bak-1"
                },
                {
                    "user_id": "Caleb Huyser",
                    "user_href": "/profile/Caleb-Huyser"
                },
                {
                    "user_id": "Monique Cao",
                    "user_href": "/profile/Monique-Cao"
                },
                {
                    "user_id": "Agustinus Ardhito",
                    "user_href": "/profile/Agustinus-Ardhito-1"
                },
                {
                    "user_id": "Patrice C-Bradley",
                    "user_href": "/profile/Patrice-C-Bradley"
                },
                {
                    "user_id": "Shawn Merchant",
                    "user_href": "/profile/Shawn-Merchant-3"
                },
                {
                    "user_id": "Ryan Sowers",
                    "user_href": "/profile/Ryan-Sowers-7"
                },
                {
                    "user_id": "ED Zero",
                    "user_href": "/profile/ED-Zero"
                },
                {
                    "user_id": "Kai Pinner",
                    "user_href": "/profile/Kai-Pinner"
                },
                {
                    "user_id": "Kenneth Chan",
                    "user_href": "/profile/Kenneth-Chan-70"
                },
                {
                    "user_id": "Carley Andrews",
                    "user_href": "/profile/Carley-Andrews-5"
                },
                {
                    "user_id": "Edi Luis",
                    "user_href": "/profile/Edi-Luis"
                },
                {
                    "user_id": "Angelica Williams",
                    "user_href": "/profile/Angelica-Williams-40"
                },
                {
                    "user_id": "Riya Jain",
                    "user_href": "/profile/Riya-Jain-311"
                },
                {
                    "user_id": "Ibrahim Ahmed",
                    "user_href": "/profile/Ibrahim-Ahmed-336"
                },
                {
                    "user_id": "Sean Bryson",
                    "user_href": "/profile/Sean-Bryson-4"
                },
                {
                    "user_id": "Nicolas Lee",
                    "user_href": "/profile/Nicolas-Lee-9"
                },
                {
                    "user_id": "Filsen Abdusebur",
                    "user_href": "/profile/Filsen-Abdusebur"
                },
                {
                    "user_id": "Dillon Delaune",
                    "user_href": "/profile/Dillon-Delaune"
                },
                {
                    "user_id": "Rakshitha",
                    "user_href": "/profile/Rakshitha-14"
                },
                {
                    "user_id": "Delaney Sullivan",
                    "user_href": "/profile/Delaney-Sullivan-8"
                },
                {
                    "user_id": "Brennan Ackermann",
                    "user_href": "/profile/Brennan-Ackermann"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nayan Saxena",
                "href": "/profile/Nayan-Saxena"
            },
            "answer_text": "It has been both amazing and difficult ! My first month at the University of Toronto was a roller coaster ride, I’ll try to explain it with pictures :)   University kicked off with orientation/frosh week where I got the opportunity to not only meet truly amazing people but also do crazy stuff like run and cheer on the streets of Toronto. The upper year students and frosh leaders made us feel truly welcomed and special ! On September 6 lectures commenced and the work started pouring in, what fascinated me is that the professors and TA’s were very approachable and extremely qualified in their respective fields. For instance, our professor for CSC165 (Mathematical Expression for Computer Science ) has an Einstein number of three, this describes the \"collaborative distance\" between Albert Einstein and our professor as measured by authorship of research papers. I soon realised that the work-load here is immense as compared to high-school. There are multiple deadlines and micro tasks to complete each day, which all count for the final grade in that course and there are increasingly difficult Problem Sets that have to completed periodically and submitted as well. There was one question (worth 15 marks ) in our first Mathematics Problem Set which took me more than 12 days to properly solve and write down. Even though it gets stressful at times, I am enjoying the pace at which everything works here and I am thoroughly enjoying courses like MAT137(Calculus) that are introducing us to the world of formal mathematics which involves writing elegant mathematical proofs and results. I might actually switch to pure mathematics from computer science if my interest grows in that direction. The tightly knit community of people and the close friendships that I have formed over the last month have made university a wonderful experience for me. They have not only helped me cope with different issues that come along with being an international student but also made me feel comfortable and ‘at home’. I am still in the initial adjusting phase and there are many things that still need fixing on my part, like my scheduling and time management skills , which has reflected in my academic performance till now. I am currently trying my best to get back on track and become more productive :)  Even though I am very far from home, coming to University of Toronto all the way from India has definitely given me immense hope for the future and my experience so far has been amazing ! It definitely feels worth it in every sense and I am glad I took this decision. This a place with endless opportunities and the only thing stopping someone from seizing those opportunities is they themselves. I have tremendous hope for what is to come and I hope that I make the most out of my university experience in the next 4 years :) Thanks for reading such a long answer and make sure to upvote if you liked it ! ~Nayan ",
            "date": "Answered October 8, 2018",
            "views": "13",
            "upvotes": " View 138 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhakti Bhanushali",
                    "user_href": "/profile/Bhakti-Bhanushali-5"
                },
                {
                    "user_id": "Ashish Sharma",
                    "user_href": "/profile/Ashish-Sharma-3583"
                },
                {
                    "user_id": "Jerin Thomas",
                    "user_href": "/profile/Jerin-Thomas-8"
                },
                {
                    "user_id": "Prasad Kancharla",
                    "user_href": "/profile/Prasad-Kancharla-2"
                },
                {
                    "user_id": "Sachin Singh",
                    "user_href": "/profile/Sachin-Singh-1874"
                },
                {
                    "user_id": "Harish K Advani",
                    "user_href": "/profile/Harish-K-Advani"
                },
                {
                    "user_id": "Chelsea Erem",
                    "user_href": "/profile/Chelsea-Erem"
                },
                {
                    "user_id": "Jyotim Gogoi",
                    "user_href": "/profile/Jyotim-Gogoi"
                },
                {
                    "user_id": "Amol Kulshreshtha",
                    "user_href": "/profile/Amol-Kulshreshtha"
                },
                {
                    "user_id": "Shreyash Singh",
                    "user_href": "/profile/Shreyash-Singh-33"
                },
                {
                    "user_id": "Shafin Siddique",
                    "user_href": "/profile/Shafin-Siddique"
                },
                {
                    "user_id": "Yash Singhal",
                    "user_href": "/profile/Yash-Singhal-156"
                },
                {
                    "user_id": "Spandan Singh",
                    "user_href": "/profile/Spandan-Singh-9"
                },
                {
                    "user_id": "Rudrank Riyam",
                    "user_href": "/profile/Rudrank-Riyam"
                },
                {
                    "user_id": "Shreya",
                    "user_href": "/profile/Shreya-1272"
                },
                {
                    "user_id": "Lekha",
                    "user_href": "/profile/Lekha-47"
                },
                {
                    "user_id": "Shoumil Guha",
                    "user_href": "/profile/Shoumil-Guha"
                },
                {
                    "user_id": "Ambreen Kashif",
                    "user_href": "/profile/Ambreen-Kashif-7"
                },
                {
                    "user_id": "Roy Anubhav",
                    "user_href": "/profile/Roy-Anubhav"
                },
                {
                    "user_id": "Lekhani Ray",
                    "user_href": "/profile/Lekhani-Ray"
                },
                {
                    "user_id": "Anyta",
                    "user_href": "/profile/Anyta-1"
                },
                {
                    "user_id": "Prateeksha Vadali",
                    "user_href": "/profile/Prateeksha-Vadali"
                },
                {
                    "user_id": "Aman Kumar",
                    "user_href": "/profile/Aman-Kumar-2356"
                },
                {
                    "user_id": "Lathika Raghavan",
                    "user_href": "/profile/Lathika-Raghavan"
                },
                {
                    "user_id": "Sarvesh Rane",
                    "user_href": "/profile/Sarvesh-Rane-3"
                },
                {
                    "user_id": "Swathi Krishnan",
                    "user_href": "/profile/Swathi-Krishnan-29"
                },
                {
                    "user_id": "Piyush Prakash",
                    "user_href": "/profile/Piyush-Prakash-45"
                },
                {
                    "user_id": "Daniel East",
                    "user_href": "/profile/Daniel-East-4"
                },
                {
                    "user_id": "Kartik Sharma",
                    "user_href": "/profile/Kartik-Sharma-632"
                },
                {
                    "user_id": "Aakash Malviya",
                    "user_href": "/profile/Aakash-Malviya-5"
                },
                {
                    "user_id": "Disha Luthra",
                    "user_href": "/profile/Disha-Luthra-3"
                },
                {
                    "user_id": "Rahul Thomas",
                    "user_href": "/profile/Rahul-Thomas-59"
                },
                {
                    "user_id": "Manju Prasath",
                    "user_href": "/profile/Manju-Prasath"
                },
                {
                    "user_id": "Shathana K",
                    "user_href": "/profile/Shathana-K"
                },
                {
                    "user_id": "Aaditya Singh",
                    "user_href": "/profile/Aaditya-Singh-537"
                },
                {
                    "user_id": "Mayank Jha",
                    "user_href": "/profile/Mayank-Jha-38"
                },
                {
                    "user_id": "Low Kian Chong",
                    "user_href": "/profile/Low-Kian-Chong"
                },
                {
                    "user_id": "Ankita Ingty",
                    "user_href": "/profile/Ankita-Ingty"
                },
                {
                    "user_id": "Chavi Mangla",
                    "user_href": "/profile/Chavi-Mangla"
                },
                {
                    "user_id": "Aaryan Arora",
                    "user_href": "/profile/Aaryan-Arora-14"
                },
                {
                    "user_id": "Aman Jaiswal",
                    "user_href": "/profile/Aman-Jaiswal-367"
                },
                {
                    "user_id": "Tamilalagan",
                    "user_href": "/profile/Tamilalagan-2"
                },
                {
                    "user_id": "Manish Bhoir",
                    "user_href": "/profile/Manish-Bhoir-2"
                },
                {
                    "user_id": "Amous",
                    "user_href": "/profile/Amous-3"
                },
                {
                    "user_id": "Lina Ibrügger",
                    "user_href": "/profile/Lina-Ibrügger"
                },
                {
                    "user_id": "Aditi Ahuja",
                    "user_href": "/profile/Aditi-Ahuja-9"
                },
                {
                    "user_id": "Pranav Venkata",
                    "user_href": "/profile/Pranav-Venkata-2"
                },
                {
                    "user_id": "Sahil Jindal",
                    "user_href": "/profile/Sahil-Jindal-18"
                },
                {
                    "user_id": "Sahil Singh",
                    "user_href": "/profile/Sahil-Singh-367"
                },
                {
                    "user_id": "Preetham Dasari",
                    "user_href": "/profile/Preetham-Dasari"
                },
                {
                    "user_id": "Ali Khan",
                    "user_href": "/profile/Ali-Khan-5355"
                },
                {
                    "user_id": "Saugat Chaudhary",
                    "user_href": "/profile/Saugat-Chaudhary-4"
                },
                {
                    "user_id": "Kie Smith",
                    "user_href": "/profile/Kie-Smith-3"
                },
                {
                    "user_id": "Vishnu Vardhan Reddy",
                    "user_href": "/profile/Vishnu-Vardhan-Reddy-199"
                },
                {
                    "user_id": "Aman Singh",
                    "user_href": "/profile/Aman-Singh-1669"
                },
                {
                    "user_id": "Aakash",
                    "user_href": "/profile/Aakash-219"
                },
                {
                    "user_id": "Ayush Sarma",
                    "user_href": "/profile/Ayush-Sarma-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Andre-799"
                },
                {
                    "user_id": "Anshul Dalal",
                    "user_href": "/profile/Anshul-Dalal"
                },
                {
                    "user_id": "Chinmay Samant",
                    "user_href": "/profile/Chinmay-Samant-3"
                },
                {
                    "user_id": "Yagnik Banerjee",
                    "user_href": "/profile/Yagnik-Banerjee"
                },
                {
                    "user_id": "Danish Syed",
                    "user_href": "/profile/Danish-Syed-15"
                },
                {
                    "user_id": "Lakshay Goyal",
                    "user_href": "/profile/Lakshay-Goyal-8"
                },
                {
                    "user_id": "Shivani Singh",
                    "user_href": "/profile/Shivani-Singh-572"
                },
                {
                    "user_id": "Navin Kishore",
                    "user_href": "/profile/Navin-Kishore-3"
                },
                {
                    "user_id": "Santosh Kumar",
                    "user_href": "/profile/Santosh-Kumar-4979"
                },
                {
                    "user_id": "Swati Mishra",
                    "user_href": "/profile/Swati-Mishra-16"
                },
                {
                    "user_id": "Mark June",
                    "user_href": "/profile/Mark-June-2"
                },
                {
                    "user_id": "Shivam Jaiswal",
                    "user_href": "/profile/Shivam-Jaiswal-104"
                },
                {
                    "user_id": "Anshul Vaidya",
                    "user_href": "/profile/Anshul-Vaidya-5"
                },
                {
                    "user_id": "Chloe Chan",
                    "user_href": "/profile/Chloe-Chan-78"
                },
                {
                    "user_id": "Sreenath Gopalakrishnan",
                    "user_href": "/profile/Sreenath-Gopalakrishnan-6"
                },
                {
                    "user_id": "Harsh Vardhan",
                    "user_href": "/profile/Harsh-Vardhan-562"
                },
                {
                    "user_id": "Gaurav Patel",
                    "user_href": "/profile/Gaurav-Patel-364"
                },
                {
                    "user_id": "Farhan Khalifa Ibrahim",
                    "user_href": "/profile/Farhan-Khalifa-Ibrahim"
                },
                {
                    "user_id": "Ananda Sai A",
                    "user_href": "/profile/Ananda-Sai-A-1"
                },
                {
                    "user_id": "Krithika Senthil",
                    "user_href": "/profile/Krithika-Senthil-7"
                },
                {
                    "user_id": " Prasad",
                    "user_href": "/profile/Prasad-746"
                },
                {
                    "user_id": "Anupama Kannan",
                    "user_href": "/profile/Anupama-Kannan"
                },
                {
                    "user_id": "Vishnu Pratap",
                    "user_href": "/profile/Vishnu-Pratap-5"
                },
                {
                    "user_id": "Ayush Saxena (आयुष)",
                    "user_href": "/profile/Ayush-Saxena-आयुष"
                },
                {
                    "user_id": "Anurag Tangri",
                    "user_href": "/profile/Anurag-Tangri-1"
                },
                {
                    "user_id": "PS",
                    "user_href": "/profile/PS-504"
                },
                {
                    "user_id": "Karen Naikar",
                    "user_href": "/profile/Karen-Naikar"
                },
                {
                    "user_id": "Abhyuday Singh",
                    "user_href": "/profile/अभ्युदय-सिंह-Abhyuday-Singh"
                },
                {
                    "user_id": "Rishi (ऋषि)",
                    "user_href": "/profile/Rishi-ऋषि"
                },
                {
                    "user_id": "Dorjee Parsur",
                    "user_href": "/profile/Dorjee-Parsur"
                },
                {
                    "user_id": "Konduri Abhilash Reddy",
                    "user_href": "/profile/Konduri-Abhilash-Reddy"
                },
                {
                    "user_id": "Medini NB",
                    "user_href": "/profile/Medini-NB"
                },
                {
                    "user_id": "Ashish David",
                    "user_href": "/profile/Ashish-David-9"
                },
                {
                    "user_id": "Isha Uniyal",
                    "user_href": "/profile/Isha-Uniyal-3"
                },
                {
                    "user_id": "Salad Tribe",
                    "user_href": "/profile/Salad-Tribe"
                },
                {
                    "user_id": "Tanya Chandra",
                    "user_href": "/profile/Tanya-Chandra-6"
                },
                {
                    "user_id": "Jean-Luc Liu",
                    "user_href": "/profile/Jean-Luc-Liu"
                },
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Lisa Adolph",
                    "user_href": "/profile/Lisa-Adolph"
                },
                {
                    "user_id": "Syed Jaree Haider",
                    "user_href": "/profile/Syed-Jaree-Haider"
                },
                {
                    "user_id": "Abhy Mittal",
                    "user_href": "/profile/Abhy-Mittal"
                },
                {
                    "user_id": "Johan Fernandes",
                    "user_href": "/profile/Johan-Fernandes-1"
                },
                {
                    "user_id": "Tamir Ben-Eli",
                    "user_href": "/profile/Tamir-Ben-Eli"
                },
                {
                    "user_id": "Anamitra Musib",
                    "user_href": "/profile/Anamitra-Musib-1"
                },
                {
                    "user_id": "Akash Mahalik",
                    "user_href": "/profile/Akash-Mahalik"
                },
                {
                    "user_id": "Nitin Sharma",
                    "user_href": "/profile/Nitin-Sharma-840"
                },
                {
                    "user_id": "Isha Mehta",
                    "user_href": "/profile/Isha-Mehta-66"
                },
                {
                    "user_id": "Ibrahim Ahmed",
                    "user_href": "/profile/Ibrahim-Ahmed-336"
                },
                {
                    "user_id": "Omar Faruq",
                    "user_href": "/profile/Omar-Faruq-7"
                },
                {
                    "user_id": "Chris Mok",
                    "user_href": "/profile/Chris-Mok-5"
                },
                {
                    "user_id": "Aashish Chilwal",
                    "user_href": "/profile/Aashish-Chilwal"
                },
                {
                    "user_id": "Mimansa Jaiswal",
                    "user_href": "/profile/Mimansa-Jaiswal"
                },
                {
                    "user_id": "Ryan Khan",
                    "user_href": "/profile/Ryan-Khan-127"
                },
                {
                    "user_id": "Piyush Gupta",
                    "user_href": "/profile/Piyush-Gupta-404"
                },
                {
                    "user_id": "Asif Khan",
                    "user_href": "/profile/Asif-Khan-1125"
                },
                {
                    "user_id": "Udbhav Tripathi",
                    "user_href": "/profile/Udbhav-Tripathi-1"
                },
                {
                    "user_id": "Shammi Anand",
                    "user_href": "/profile/Shammi-Anand-3"
                },
                {
                    "user_id": "Naena",
                    "user_href": "/profile/Naena"
                },
                {
                    "user_id": "Priyanshu Mukherjee",
                    "user_href": "/profile/Priyanshu-Mukherjee"
                },
                {
                    "user_id": "Hari Om Sharma",
                    "user_href": "/profile/Hari-Om-Sharma-31"
                },
                {
                    "user_id": "Aayank Singhai",
                    "user_href": "/profile/Aayank-Singhai"
                },
                {
                    "user_id": "Shivam Kumar",
                    "user_href": "/profile/Shivam-Kumar-104"
                },
                {
                    "user_id": "Jordan Major",
                    "user_href": "/profile/Jordan-Major-5"
                },
                {
                    "user_id": "Jobin Raju",
                    "user_href": "/profile/Jobin-Raju-2"
                },
                {
                    "user_id": "Kanchi Lodha",
                    "user_href": "/profile/Kanchi-Lodha"
                },
                {
                    "user_id": "Adam Mitchell",
                    "user_href": "/profile/Adam-Mitchell-169"
                },
                {
                    "user_id": "Shrinidhi Achar",
                    "user_href": "/profile/Shrinidhi-Achar-2"
                },
                {
                    "user_id": "John Nates",
                    "user_href": "/profile/John-Nates"
                },
                {
                    "user_id": "Anita",
                    "user_href": "/profile/Anita-242"
                },
                {
                    "user_id": "Aarti Yadav",
                    "user_href": "/profile/Aarti-Yadav-24"
                },
                {
                    "user_id": "Chandrika Jadon",
                    "user_href": "/profile/Chandrika-Jadon"
                },
                {
                    "user_id": "Siddhant Sharma",
                    "user_href": "/profile/Siddhant-Sharma-115"
                },
                {
                    "user_id": "Wasu Sonthichai",
                    "user_href": "/profile/Wasu-Sonthichai"
                },
                {
                    "user_id": "Nick Contreras",
                    "user_href": "/profile/Nick-Contreras-10"
                },
                {
                    "user_id": "Shikhar Singh",
                    "user_href": "/profile/Shikhar-Singh-262"
                },
                {
                    "user_id": "Adhya Sharma",
                    "user_href": "/profile/Adhya-Sharma-5"
                },
                {
                    "user_id": "Nikhil Bhave",
                    "user_href": "/profile/Nikhil-Bhave-2"
                },
                {
                    "user_id": "Rahul Kumar Singh",
                    "user_href": "/profile/Rahul-Kumar-Singh-918"
                },
                {
                    "user_id": "Aaditya Sharma",
                    "user_href": "/profile/Aaditya-Sharma-30"
                },
                {
                    "user_id": "Dharun Aditya Senthilkumar",
                    "user_href": "/profile/Dharun-Aditya-Senthilkumar"
                },
                {
                    "user_id": "Omkar Deshmukh",
                    "user_href": "/profile/Omkar-Deshmukh-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Veronika Tupá",
                "href": "/profile/Veronika-Tupá"
            },
            "answer_text": "I LOVE IT! …but just a few weeks back I considered dropping out. Let me tell you what’s changed. Mid-September 2018I’m officially a college freshman. I’m double majoring in Journalism and International Relations and I have the greatest expectations about how my university studies are going to look like. Learning the secret hacks of being a good journalist, discussing all the latest events that made it to the news, listening to the best in the field, making lots of new friends and getting drunk on parties every other day… The beginning of October 2018This is awful. The classes are boring, I hate going to them, I have so much free time and I don’t know what to do with it, my high school friends are far away, everyone seems to be having a great time and here I am, thinking whether to drop out or not. I can’t do this. This is not how it was supposed to be like. This is not what I want to be doing with my life. Can I go back? The beginning of November 2018I love my life. I attend every single class I have and even some of the extra classes that the school offers for the public. I love working on my seminar papers and going to the library just for the feeling of freedom and wisdom it gives me. I have friends in all the different classes I take, I even have some friends who are in the years above me, study buddies and friends with whom I work for the school magazine - we exchange notes, tips and exam materials. I met this cute guy at a party and he seems really nice. We’re going on a date soon! I go to a party every other week, it’s fun and I like dancing. I go out with my friends every week, I love getting to know them better. I have a part-time job I love, I’m a freelance journalist! Also, I work for an NGO and it fulfils me so much! I have all the freedom in the world to do whatever I want and I love it. This is me, I’ve finally found myself. What has changed? Me. My attitude. I thought that university life comes to you naturally, all you need to do is to become a student. But nothing ever comes to you just like that, you have to be proactive. You won’t make friends by being silent and sitting in the corner. Get up, smile and introduce yourself!Everyone is just as scared and confused as you. Share your feelings, you’ll see that you are not alone.You are not taking classes because you have to. Find the classes that seem interesting to you and find something to enjoy about them. You have the freedom to leave or to be on your phone the whole time, no one cares, you should!Be nice to people and help others if you can.Find something you like doing and join a club. This is the best way to meet people.There are so many things you can do and this is the time to do them. You are young, free and you have the time to do anything, so don’t just sit back and watch, get yourself out there and enjoy it!",
            "date": "Answered November 3, 2018",
            "views": "134",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Erica Lynn",
                    "user_href": "/profile/Erica-Lynn-300"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shreyas Raj Singh",
                "href": "/profile/Shreyas-Raj-Singh"
            },
            "answer_text": "Warning- This answer contains a lot of pictures! Well, ever since I came here about 2 months ago, life has been like a roller coaster ride! So let's begin… I really wanna thank the man on the right, who picked me up from the airport and helped me settle in, when I first came here. Thank You so much Brad sir! My first time in the US, landing in Newark airport My first time outside my college building My first time in the HBS lab at UTD…that’s my roommate on the right btw My first time ever in a comic book store    The first time I saw a pickup truck A late night or early morning snack (it was 12:30 AM) with my friends at Whataburger I saw the moon at 10:30 in the morning I became an officer for a club! I went to a Game of Thrones Concert at the American Center…the place was huge!  BTW here are some pics of downtown Dallas     Now, here are some pics of my campus…         Well, that’s it! I did a lot more…but I didn’t take pictures because sometimes you just have to treasure the moment instead of taking pictures of it. -Shreyas Raj Singh ",
            "date": "Answered September 28, 2018",
            "views": "415",
            "upvotes": " View 394 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ravish Sinha",
                    "user_href": "/profile/Ravish-Sinha-6"
                },
                {
                    "user_id": "Gabriel Martí",
                    "user_href": "/profile/Gabriel-Martí"
                },
                {
                    "user_id": "Manohar J",
                    "user_href": "/profile/Manohar-J-11"
                },
                {
                    "user_id": "Tanvi Kandpile",
                    "user_href": "/profile/Tanvi-Kandpile"
                },
                {
                    "user_id": "Aman Jaiswal",
                    "user_href": "/profile/Aman-Jaiswal-367"
                },
                {
                    "user_id": "Angelina Perry",
                    "user_href": "/profile/Angelina-Perry-7"
                },
                {
                    "user_id": "Harshita Chopra",
                    "user_href": "/profile/Harshita-Chopra-8"
                },
                {
                    "user_id": "Amol Kulshreshtha",
                    "user_href": "/profile/Amol-Kulshreshtha"
                },
                {
                    "user_id": "Mihir Bhatia",
                    "user_href": "/profile/Mihir-Bhatia-8"
                },
                {
                    "user_id": "Amrik Malhans",
                    "user_href": "/profile/Amrik-Malhans"
                },
                {
                    "user_id": "Ambreen Kashif",
                    "user_href": "/profile/Ambreen-Kashif-7"
                },
                {
                    "user_id": "Marissa Meza",
                    "user_href": "/profile/Marissa-Meza-1"
                },
                {
                    "user_id": "Kushagra Sanwal",
                    "user_href": "/profile/Kushagra-Sanwal"
                },
                {
                    "user_id": "Ajeeb Muhammed Abdulla",
                    "user_href": "/profile/Ajeeb-Muhammed-Abdulla"
                },
                {
                    "user_id": "Abhijeet Anand",
                    "user_href": "/profile/Abhijeet-Anand-102"
                },
                {
                    "user_id": "Arjun Gupta",
                    "user_href": "/profile/Arjun-Gupta-64"
                },
                {
                    "user_id": "Erina",
                    "user_href": "/profile/Erina-7"
                },
                {
                    "user_id": "Kashyap Patwa",
                    "user_href": "/profile/Kashyap-Patwa"
                },
                {
                    "user_id": "Richi Mishra",
                    "user_href": "/profile/Richi-Mishra-1"
                },
                {
                    "user_id": "Sanika Kotnis",
                    "user_href": "/profile/Sanika-Kotnis"
                },
                {
                    "user_id": "Shivansh Mishra",
                    "user_href": "/profile/Shivansh-Mishra-3"
                },
                {
                    "user_id": "Kumar Swapnil",
                    "user_href": "/profile/Kumar-Swapnil-16"
                },
                {
                    "user_id": "Nivedita V",
                    "user_href": "/profile/Nivedita-V-8"
                },
                {
                    "user_id": "Abhilash Unnikrishnan",
                    "user_href": "/profile/Abhilash-Unnikrishnan-2"
                },
                {
                    "user_id": "Abdullah Mohamed",
                    "user_href": "/profile/Abdullah-Mohamed-113"
                },
                {
                    "user_id": "Nirav Kapasi",
                    "user_href": "/profile/Nirav-Kapasi"
                },
                {
                    "user_id": "Piyush Bhakat",
                    "user_href": "/profile/Piyush-Bhakat"
                },
                {
                    "user_id": "Jahnavi V",
                    "user_href": "/profile/Jahnavi-V-7"
                },
                {
                    "user_id": "Freddy Roy",
                    "user_href": "/profile/Freddy-Roy"
                },
                {
                    "user_id": "RAJ",
                    "user_href": "/profile/RAJ-2243"
                },
                {
                    "user_id": "Abhishree",
                    "user_href": "/profile/Abhishree-1"
                },
                {
                    "user_id": "Aaditya Sharma",
                    "user_href": "/profile/Aaditya-Sharma-30"
                },
                {
                    "user_id": "Aaryan Arora",
                    "user_href": "/profile/Aaryan-Arora-14"
                },
                {
                    "user_id": "Jayesh Rana",
                    "user_href": "/profile/Jayesh-Rana-18"
                },
                {
                    "user_id": "Charmi Lew",
                    "user_href": "/profile/Charmi-Lew"
                },
                {
                    "user_id": "Abhyuday Singh",
                    "user_href": "/profile/अभ्युदय-सिंह-Abhyuday-Singh"
                },
                {
                    "user_id": "Shriya Natta",
                    "user_href": "/profile/Shriya-Natta"
                },
                {
                    "user_id": "Ritu Raj",
                    "user_href": "/profile/Ritu-Raj-112"
                },
                {
                    "user_id": "Ellie Mounts",
                    "user_href": "/profile/Ellie-Mounts"
                },
                {
                    "user_id": "Deepon Datta",
                    "user_href": "/profile/Deepon-Datta"
                },
                {
                    "user_id": "Adarsh Singh",
                    "user_href": "/profile/Adarsh-Singh-35"
                },
                {
                    "user_id": "Sana Naqvi",
                    "user_href": "/profile/Sana-Naqvi-3"
                },
                {
                    "user_id": "Duraideivamani Sankararajan",
                    "user_href": "/profile/Duraideivamani-Sankararajan"
                },
                {
                    "user_id": "Lūcija Bērziņa",
                    "user_href": "/profile/Lūcija-Bērziņa"
                },
                {
                    "user_id": "Honey Antil",
                    "user_href": "/profile/Honey-Antil"
                },
                {
                    "user_id": "Allan Logun",
                    "user_href": "/profile/Allan-Logun-2"
                },
                {
                    "user_id": "Renu Mody",
                    "user_href": "/profile/Renu-Mody-1"
                },
                {
                    "user_id": "Aryan Dadheech",
                    "user_href": "/profile/Aryan-Dadheech"
                },
                {
                    "user_id": "Sreeparna Nath",
                    "user_href": "/profile/Sreeparna-Nath"
                },
                {
                    "user_id": "Rohan Purohit",
                    "user_href": "/profile/Rohan-Purohit-3"
                },
                {
                    "user_id": "Urvi Muley",
                    "user_href": "/profile/ऊर्वी-मुळे-Urvi-Muley"
                },
                {
                    "user_id": "Utkarsh Mohan",
                    "user_href": "/profile/Utkarsh-Mohan-12"
                },
                {
                    "user_id": "Shresth Mehta",
                    "user_href": "/profile/Shresth-Mehta"
                },
                {
                    "user_id": "Mridul Pandit",
                    "user_href": "/profile/Mridul-Pandit-3"
                },
                {
                    "user_id": "Prajwal",
                    "user_href": "/profile/Prajwal-81"
                },
                {
                    "user_id": "Kanu Priya",
                    "user_href": "/profile/Kanu-Priya-104"
                },
                {
                    "user_id": "Aakash Negi",
                    "user_href": "/profile/Aakash-Negi-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Z-Zozon"
                },
                {
                    "user_id": "Amit Verma",
                    "user_href": "/profile/Amit-Verma-429"
                },
                {
                    "user_id": "Varun Jadia",
                    "user_href": "/profile/Varun-Jadia"
                },
                {
                    "user_id": "Executioner",
                    "user_href": "/profile/Executioner-6"
                },
                {
                    "user_id": "Shikhar Singhal",
                    "user_href": "/profile/Shikhar-Singhal-1"
                },
                {
                    "user_id": "Alex",
                    "user_href": "/profile/Alex-9123"
                },
                {
                    "user_id": "Achraf Benmebarek",
                    "user_href": "/profile/Achraf-Benmebarek"
                },
                {
                    "user_id": "Vincent Wolf",
                    "user_href": "/profile/Vincent-Wolf-4"
                },
                {
                    "user_id": "Bram van der Hage",
                    "user_href": "/profile/Bram-van-der-Hage"
                },
                {
                    "user_id": "Aditya Narayan Sharma",
                    "user_href": "/profile/Aditya-Narayan-Sharma-3"
                },
                {
                    "user_id": "Aaditya Singh",
                    "user_href": "/profile/Aaditya-Singh-537"
                },
                {
                    "user_id": "Shreyonshi Mishra",
                    "user_href": "/profile/Shreyonshi-Mishra"
                },
                {
                    "user_id": "Thecodergeek",
                    "user_href": "/profile/Thecodergeek"
                },
                {
                    "user_id": "Daniel El Kadi",
                    "user_href": "/profile/Daniel-El-Kadi"
                },
                {
                    "user_id": "Santosh Kumar",
                    "user_href": "/profile/Santosh-Kumar-4979"
                },
                {
                    "user_id": "Momo Enn",
                    "user_href": "/profile/Momo-Enn"
                },
                {
                    "user_id": "Sourojeet Chakraborty",
                    "user_href": "/profile/Sourojeet-Chakraborty"
                },
                {
                    "user_id": "Kunal",
                    "user_href": "/profile/Kunal-89"
                },
                {
                    "user_id": "Sariha Azad",
                    "user_href": "/profile/Sariha-Azad-1"
                },
                {
                    "user_id": "Anshul Vaidya",
                    "user_href": "/profile/Anshul-Vaidya-5"
                },
                {
                    "user_id": "Sujata",
                    "user_href": "/profile/Sujata-70"
                },
                {
                    "user_id": "Nitika Ramesh",
                    "user_href": "/profile/Nitika-Ramesh"
                },
                {
                    "user_id": "Sara Juda",
                    "user_href": "/profile/Sara-Juda"
                },
                {
                    "user_id": "Salad Tribe",
                    "user_href": "/profile/Salad-Tribe"
                },
                {
                    "user_id": "Jerry Jin",
                    "user_href": "/profile/Jerry-Jin-17"
                },
                {
                    "user_id": "Aditi",
                    "user_href": "/profile/Aditi-767"
                },
                {
                    "user_id": "Suchita Sharma",
                    "user_href": "/profile/Suchita-Sharma-73"
                },
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Mansi Singh",
                    "user_href": "/profile/Mansi-Singh-216"
                },
                {
                    "user_id": "Arjun Suresh",
                    "user_href": "/profile/Arjun-Suresh-52"
                },
                {
                    "user_id": "Abhishek Shah",
                    "user_href": "/profile/Abhishek-Shah-159"
                },
                {
                    "user_id": "Alhussein Mohamed",
                    "user_href": "/profile/Alhussein-Mohamed-1"
                },
                {
                    "user_id": "Yash Patel",
                    "user_href": "/profile/Yash-Patel-124"
                },
                {
                    "user_id": "Rahul",
                    "user_href": "/profile/Rahul-2378"
                },
                {
                    "user_id": "Jay Vyas",
                    "user_href": "/profile/Jay-Vyas-42"
                },
                {
                    "user_id": "Naresh Reddy",
                    "user_href": "/profile/Naresh-Reddy-12"
                },
                {
                    "user_id": "Sanjana Verma",
                    "user_href": "/profile/Sanjana-Verma-12"
                },
                {
                    "user_id": "Nishtha Sethi",
                    "user_href": "/profile/Nishtha-Sethi"
                },
                {
                    "user_id": "Amri Nazeer",
                    "user_href": "/profile/Amri-Nazeer"
                },
                {
                    "user_id": "Nivin Vinod",
                    "user_href": "/profile/Nivin-Vinod-2"
                },
                {
                    "user_id": "Kartik Jindal",
                    "user_href": "/profile/Kartik-Jindal-12"
                },
                {
                    "user_id": "Harikrishnan Venugopal",
                    "user_href": "/profile/Harikrishnan-Venugopal-12"
                },
                {
                    "user_id": "Akhil Mudigonda",
                    "user_href": "/profile/Akhil-Mudigonda-1"
                },
                {
                    "user_id": "Manan Vyas",
                    "user_href": "/profile/Manan-Vyas-2"
                },
                {
                    "user_id": "Tejas Ravishankar",
                    "user_href": "/profile/Tejas-Ravishankar-1"
                },
                {
                    "user_id": "Sumit Yadav",
                    "user_href": "/profile/Sumit-Yadav-727"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/magotraabhishek"
                },
                {
                    "user_id": "Joselin Domingo Reynoso",
                    "user_href": "/profile/Joselin-Domingo-Reynoso"
                },
                {
                    "user_id": "Annu Yadav",
                    "user_href": "/profile/Annu-Yadav-17"
                },
                {
                    "user_id": "Bharath. M.S",
                    "user_href": "/profile/Bharath-M-S-14"
                },
                {
                    "user_id": "Karan H Baliga",
                    "user_href": "/profile/Karan-H-Baliga"
                },
                {
                    "user_id": "Aneesh Saripalli",
                    "user_href": "/profile/Aneesh-Saripalli-2"
                },
                {
                    "user_id": "Nikhil Jadhav",
                    "user_href": "/profile/निखिल-जाधव-Nikhil-Jadhav"
                },
                {
                    "user_id": "Pranali",
                    "user_href": "/profile/Pranali-70"
                },
                {
                    "user_id": "Aneesh Nair",
                    "user_href": "/profile/Aneesh-Nair-23"
                },
                {
                    "user_id": "Gokulakrishnan Thangaraj",
                    "user_href": "/profile/Gokulakrishnan-Thangaraj"
                },
                {
                    "user_id": "Vera Acheamong",
                    "user_href": "/profile/Vera-Acheamong"
                },
                {
                    "user_id": "Soumyadip Kundu",
                    "user_href": "/profile/Soumyadip-Kundu-5"
                },
                {
                    "user_id": "Sanjay Negi",
                    "user_href": "/profile/Sanjay-Negi-10"
                },
                {
                    "user_id": "Raven Choo",
                    "user_href": "/profile/Raven-Choo-1"
                },
                {
                    "user_id": "Anurag Mishra",
                    "user_href": "/profile/Anurag-Mishra-538"
                },
                {
                    "user_id": "Sriram Kuppuswamy",
                    "user_href": "/profile/Sriram-Kuppuswamy"
                },
                {
                    "user_id": "Sumanth Reddy",
                    "user_href": "/profile/Sumanth-Reddy-39"
                },
                {
                    "user_id": "Ruturaj Dhakane",
                    "user_href": "/profile/Ruturaj-Dhakane"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Esther-821"
                },
                {
                    "user_id": "Rebecca Choi",
                    "user_href": "/profile/Rebecca-Choi-20"
                },
                {
                    "user_id": "Sara Syeda",
                    "user_href": "/profile/Sara-Syeda-3"
                },
                {
                    "user_id": "Yuvraj Kadam",
                    "user_href": "/profile/Yuvraj-Kadam"
                },
                {
                    "user_id": "Anirudhan K",
                    "user_href": "/profile/Anirudhan-K-1"
                },
                {
                    "user_id": "Maya Chandran",
                    "user_href": "/profile/Maya-Chandran-8"
                },
                {
                    "user_id": "Rehan Shaikh",
                    "user_href": "/profile/Rehan-Shaikh-150"
                },
                {
                    "user_id": "Jahidul Hoq Emon",
                    "user_href": "/profile/Jahidul-Hoq-Emon"
                },
                {
                    "user_id": "Rahul Seniaray",
                    "user_href": "/profile/Rahul-Seniaray"
                },
                {
                    "user_id": "Ryan Sherman",
                    "user_href": "/profile/Ryan-Sherman-37"
                },
                {
                    "user_id": "Shreyansh Singh",
                    "user_href": "/profile/Shreyansh-Singh-274"
                },
                {
                    "user_id": "Vaishnavi Patil",
                    "user_href": "/profile/Vaishnavi-Patil-47"
                },
                {
                    "user_id": "Ninav Shaju",
                    "user_href": "/profile/Ninav-Shaju"
                },
                {
                    "user_id": "Priyanka Kuruganti",
                    "user_href": "/profile/Priyanka-Kuruganti-1"
                },
                {
                    "user_id": "Vishnu Varthan",
                    "user_href": "/profile/Vishnu-Varthan-124"
                },
                {
                    "user_id": " Prasad",
                    "user_href": "/profile/Prasad-746"
                },
                {
                    "user_id": "Farhan Rahman",
                    "user_href": "/profile/Farhan-Rahman-21"
                },
                {
                    "user_id": "Aditya",
                    "user_href": "/profile/Aditya-869"
                },
                {
                    "user_id": "Shivam Khurana",
                    "user_href": "/profile/Shivam-Khurana-3"
                },
                {
                    "user_id": "Ashutosh Shenoy",
                    "user_href": "/profile/Ashutosh-Shenoy-3"
                },
                {
                    "user_id": "Ana Bedse",
                    "user_href": "/profile/Ana-Bedse"
                },
                {
                    "user_id": "Sharmila De",
                    "user_href": "/profile/Sharmila-De"
                },
                {
                    "user_id": "Hitesh Bhandari",
                    "user_href": "/profile/Hitesh-Bhandari-30"
                },
                {
                    "user_id": "Saurabh Sharma",
                    "user_href": "/profile/Saurabh-Sharma-1364"
                },
                {
                    "user_id": "Tanmay Duragkar",
                    "user_href": "/profile/Tanmay-Duragkar"
                },
                {
                    "user_id": "Angelica Williams",
                    "user_href": "/profile/Angelica-Williams-40"
                },
                {
                    "user_id": "Adib Raed",
                    "user_href": "/profile/Adib-Raed"
                },
                {
                    "user_id": "Hamzah Imran",
                    "user_href": "/profile/Hamzah-Imran-6"
                },
                {
                    "user_id": "Vishnu Varadan",
                    "user_href": "/profile/Vishnu-Varadan"
                },
                {
                    "user_id": "Saanvi Balakrishan",
                    "user_href": "/profile/Saanvi-Balakrishan"
                },
                {
                    "user_id": "Satyajit Mohapatra",
                    "user_href": "/profile/Satyajit-Mohapatra-5"
                },
                {
                    "user_id": "Sathish Tadaka",
                    "user_href": "/profile/Sathish-Tadaka"
                },
                {
                    "user_id": "Rahul Thomas",
                    "user_href": "/profile/Rahul-Thomas-59"
                },
                {
                    "user_id": "Yanna Lim",
                    "user_href": "/profile/Yanna-Lim"
                },
                {
                    "user_id": "Debjit Konar",
                    "user_href": "/profile/Debjit-Konar"
                },
                {
                    "user_id": "Edi Luis",
                    "user_href": "/profile/Edi-Luis"
                },
                {
                    "user_id": "Aniketh Ayinala",
                    "user_href": "/profile/Aniketh-Ayinala"
                },
                {
                    "user_id": "Tanziuzzaman Sakib",
                    "user_href": "/profile/Tanziuzzaman-Sakib"
                },
                {
                    "user_id": "Anukarsh Singh",
                    "user_href": "/profile/Anukarsh-Singh"
                },
                {
                    "user_id": "Bob Gray",
                    "user_href": "/profile/Bob-Gray-30"
                },
                {
                    "user_id": "Jake George",
                    "user_href": "/profile/Jake-George-17"
                },
                {
                    "user_id": "Dhanya Narayan",
                    "user_href": "/profile/Dhanya-Narayan-7"
                },
                {
                    "user_id": "Subhadip Chakraborty",
                    "user_href": "/profile/Subhadip-Chakraborty-10"
                },
                {
                    "user_id": "Shugam Jain",
                    "user_href": "/profile/Shugam-Jain"
                },
                {
                    "user_id": "Louis Dhoore",
                    "user_href": "/profile/Louis-Dhoore"
                },
                {
                    "user_id": "Harshita Rao",
                    "user_href": "/profile/Harshita-Rao-9"
                },
                {
                    "user_id": "Jorge Polanco",
                    "user_href": "/profile/Jorge-Polanco-8"
                },
                {
                    "user_id": "Raphael Limia",
                    "user_href": "/profile/Raphael-Limia"
                },
                {
                    "user_id": "Muskaan Mehta",
                    "user_href": "/profile/Muskaan-Mehta-6"
                },
                {
                    "user_id": "Stephanie Wang",
                    "user_href": "/profile/Stephanie-Wang-70"
                },
                {
                    "user_id": "Mark June",
                    "user_href": "/profile/Mark-June-2"
                },
                {
                    "user_id": "Harsh Maru",
                    "user_href": "/profile/Harsh-Maru-2"
                },
                {
                    "user_id": "Mohammad Abdul Rahman Siddqui",
                    "user_href": "/profile/Mohammad-Abdul-Rahman-Siddqui"
                },
                {
                    "user_id": "Devanjith Fonseka",
                    "user_href": "/profile/Devanjith-Fonseka"
                },
                {
                    "user_id": "Alex Turk",
                    "user_href": "/profile/Alex-Turk"
                },
                {
                    "user_id": "Hariharan Srinivasulu",
                    "user_href": "/profile/Hariharan-Srinivasulu-1"
                },
                {
                    "user_id": "Vaishnavi Misra",
                    "user_href": "/profile/Vaishnavi-Misra-1"
                },
                {
                    "user_id": "Ulhas Dixit",
                    "user_href": "/profile/Ulhas-Dixit"
                },
                {
                    "user_id": "Areeb Ahmed",
                    "user_href": "/profile/Areeb-Ahmed-101"
                },
                {
                    "user_id": "AMLAN",
                    "user_href": "/profile/AMLAN-15"
                },
                {
                    "user_id": "Dhiraj singh",
                    "user_href": "/profile/Dhiraj-singh-111"
                },
                {
                    "user_id": "Shen V",
                    "user_href": "/profile/Shen-V"
                },
                {
                    "user_id": "Marina Hoyek",
                    "user_href": "/profile/Marina-Hoyek"
                },
                {
                    "user_id": "Saba Ali",
                    "user_href": "/profile/Saba-Ali-14"
                },
                {
                    "user_id": "Evan Luo",
                    "user_href": "/profile/Evan-Luo-5"
                },
                {
                    "user_id": "Kie Smith",
                    "user_href": "/profile/Kie-Smith-3"
                },
                {
                    "user_id": "Avneet Singh Magoo",
                    "user_href": "/profile/Avneet-Singh-Magoo"
                },
                {
                    "user_id": "Jacob Thomas",
                    "user_href": "/profile/Jacob-Thomas-505"
                },
                {
                    "user_id": "Devansh",
                    "user_href": "/profile/Devansh-43"
                },
                {
                    "user_id": "Amogh",
                    "user_href": "/profile/Amogh-59"
                },
                {
                    "user_id": "Ankit Kumar",
                    "user_href": "/profile/Ankit-Kumar-4163"
                },
                {
                    "user_id": "Mayur Shrivastava",
                    "user_href": "/profile/Mayur-Shrivastava-1"
                },
                {
                    "user_id": "James Carter",
                    "user_href": "/profile/James-Carter-406"
                },
                {
                    "user_id": "Sarika Chauhan",
                    "user_href": "/profile/Sarika-Chauhan-18"
                },
                {
                    "user_id": "Basil Asar",
                    "user_href": "/profile/Basil-Asar"
                },
                {
                    "user_id": "Sehaj Sandhu",
                    "user_href": "/profile/Sehaj-Sandhu-1"
                },
                {
                    "user_id": "Yashraj",
                    "user_href": "/profile/Yashraj-30"
                },
                {
                    "user_id": "Nikita Gorkov",
                    "user_href": "/profile/Nikita-Gorkov-1"
                },
                {
                    "user_id": "Rohan Prakash",
                    "user_href": "/profile/Rohan-Prakash-25"
                },
                {
                    "user_id": "Rajat Manekar",
                    "user_href": "/profile/Rajat-Manekar"
                },
                {
                    "user_id": "Shreyas Atre",
                    "user_href": "/profile/Shreyas-Atre-1"
                },
                {
                    "user_id": "Vishwam Khapre",
                    "user_href": "/profile/Vishwam-Khapre"
                },
                {
                    "user_id": "Lucy Liu",
                    "user_href": "/profile/Lucy-Liu-212"
                },
                {
                    "user_id": "Pranit Sunkad",
                    "user_href": "/profile/Pranit-Sunkad"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Adarsh-242"
                },
                {
                    "user_id": "Ismael Suarez",
                    "user_href": "/profile/Ismael-Suarez-1"
                },
                {
                    "user_id": "Sumit Gupta",
                    "user_href": "/profile/Sumit-Gupta-887"
                },
                {
                    "user_id": "Jay Engineer",
                    "user_href": "/profile/Jay-Engineer-2"
                },
                {
                    "user_id": "Rishi Chandrabanu",
                    "user_href": "/profile/Rishi-Chandrabanu"
                },
                {
                    "user_id": "Sam Jones",
                    "user_href": "/profile/Sam-Jones-889"
                },
                {
                    "user_id": "Tarun Khatri",
                    "user_href": "/profile/Tarun-Khatri-1"
                },
                {
                    "user_id": "Rutwik Patel",
                    "user_href": "/profile/Rutwik-Patel-3"
                },
                {
                    "user_id": "Ravi Prakash",
                    "user_href": "/profile/Ravi-Prakash-279"
                },
                {
                    "user_id": "Martin Treptow",
                    "user_href": "/profile/Martin-Treptow"
                },
                {
                    "user_id": "Shivansh Upadhyay",
                    "user_href": "/profile/Shivansh-Upadhyay-16"
                },
                {
                    "user_id": "Shiva Gupta",
                    "user_href": "/profile/Shiva-Gupta-122"
                },
                {
                    "user_id": "Prachi Singh",
                    "user_href": "/profile/Prachi-Singh-331"
                },
                {
                    "user_id": "Lakshay Sood",
                    "user_href": "/profile/Lakshay-Sood"
                },
                {
                    "user_id": "Denzell Moss",
                    "user_href": "/profile/Denzell-Moss-1"
                },
                {
                    "user_id": "Vinay Ky",
                    "user_href": "/profile/Vinay-Ky"
                },
                {
                    "user_id": "Vipesh Kumar",
                    "user_href": "/profile/Vipesh-Kumar"
                },
                {
                    "user_id": "Ethan Harrison",
                    "user_href": "/profile/Ethan-Harrison-22"
                },
                {
                    "user_id": "Sritharini",
                    "user_href": "/profile/Sritharini"
                },
                {
                    "user_id": "Anant Singh Sodhi",
                    "user_href": "/profile/Anant-Singh-Sodhi"
                },
                {
                    "user_id": "Yashaswi Siddharth",
                    "user_href": "/profile/Yashaswi-Siddharth"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shamsul-alom-10"
                },
                {
                    "user_id": "Abdullah Soomro",
                    "user_href": "/profile/Abdullah-Soomro-4"
                },
                {
                    "user_id": "Rehman Masood",
                    "user_href": "/profile/Rehman-Masood-3"
                },
                {
                    "user_id": "Kaustubh Joshi",
                    "user_href": "/profile/Kaustubh-Joshi-46"
                },
                {
                    "user_id": "Katie Lin",
                    "user_href": "/profile/Katie-Lin-29"
                },
                {
                    "user_id": "Siddharth Gupta",
                    "user_href": "/profile/Siddharth-Gupta-380"
                },
                {
                    "user_id": "Abhishek Nancherla",
                    "user_href": "/profile/Abhishek-Nancherla-1"
                },
                {
                    "user_id": "Harshit Badhwar",
                    "user_href": "/profile/Harshit-Badhwar"
                },
                {
                    "user_id": "Bibhudatt Mahapatra",
                    "user_href": "/profile/Bibhudatt-Mahapatra-1"
                },
                {
                    "user_id": "Janeth Gomez",
                    "user_href": "/profile/Janeth-Gomez-1"
                },
                {
                    "user_id": "Kausthubh Chandramouli",
                    "user_href": "/profile/Kausthubh-Chandramouli"
                },
                {
                    "user_id": "Jung Taehee 정태희",
                    "user_href": "/profile/Jung-Taehee-정태희"
                },
                {
                    "user_id": "Sumit Saboo",
                    "user_href": "/profile/Sumit-Saboo-1"
                },
                {
                    "user_id": "Shih Min Loo",
                    "user_href": "/profile/Shih-Min-Loo"
                },
                {
                    "user_id": "Yash Mohan",
                    "user_href": "/profile/Yash-Mohan-2"
                },
                {
                    "user_id": "Akash Sharma",
                    "user_href": "/profile/Akash-Sharma-1829"
                },
                {
                    "user_id": "Faridabad Ka Don",
                    "user_href": "/profile/Faridabad-Ka-Don"
                },
                {
                    "user_id": "Sankar Reddy",
                    "user_href": "/profile/Sankar-Reddy-121"
                },
                {
                    "user_id": "Nathan Mo",
                    "user_href": "/profile/Nathan-Mo-1"
                },
                {
                    "user_id": "Ananda Sai A",
                    "user_href": "/profile/Ananda-Sai-A-1"
                },
                {
                    "user_id": "Vinod",
                    "user_href": "/profile/Vinod-301"
                },
                {
                    "user_id": "Steven Ho",
                    "user_href": "/profile/Steven-Ho-38"
                },
                {
                    "user_id": "Lakhan Kadam",
                    "user_href": "/profile/Lakhan-Kadam-1"
                },
                {
                    "user_id": "Arya Tomar",
                    "user_href": "/profile/Arya-Tomar-2"
                },
                {
                    "user_id": "Utkarsh Srivastava",
                    "user_href": "/profile/Utkarsh-Srivastava-100"
                },
                {
                    "user_id": "Adewumi Adeyemi",
                    "user_href": "/profile/Adewumi-Adeyemi-1"
                },
                {
                    "user_id": "Sai Kumar",
                    "user_href": "/profile/Sai-Kumar-4511"
                },
                {
                    "user_id": "Anand Jain",
                    "user_href": "/profile/Anand-Jain-143"
                },
                {
                    "user_id": "Anurag Bhagsain",
                    "user_href": "/profile/Anurag-Bhagsain"
                },
                {
                    "user_id": "Sambhavita",
                    "user_href": "/profile/Sambhavita"
                },
                {
                    "user_id": "Deok Ju Lee",
                    "user_href": "/profile/Deok-Ju-Lee-1"
                },
                {
                    "user_id": "Harsh Vardhan",
                    "user_href": "/profile/Harsh-Vardhan-1909"
                },
                {
                    "user_id": "Tushar Mehra",
                    "user_href": "/profile/Tushar-Mehra-22"
                },
                {
                    "user_id": "Lakshya Dave",
                    "user_href": "/profile/Lakshya-Dave"
                },
                {
                    "user_id": "Amy Wijm",
                    "user_href": "/profile/Amy-Wijm"
                },
                {
                    "user_id": "Mahesh Watson",
                    "user_href": "/profile/Mahesh-Watson"
                },
                {
                    "user_id": "Gokul P",
                    "user_href": "/profile/Gokul-P-16"
                },
                {
                    "user_id": "Ravi Utsav",
                    "user_href": "/profile/Ravi-Utsav"
                },
                {
                    "user_id": "Shruti Wadhwani",
                    "user_href": "/profile/Shruti-Wadhwani-4"
                },
                {
                    "user_id": "Aniket Kulkarni",
                    "user_href": "/profile/Aniket-Kulkarni-115"
                },
                {
                    "user_id": "Patricia Crawford",
                    "user_href": "/profile/Patricia-Crawford-41"
                },
                {
                    "user_id": "Devansh Chugh(देवांश)",
                    "user_href": "/profile/Devansh-Chugh-देवांश"
                },
                {
                    "user_id": "Nandini Suri",
                    "user_href": "/profile/Nandini-Suri-2"
                },
                {
                    "user_id": "Saurabh Potdar",
                    "user_href": "/profile/Saurabh-Potdar-1"
                },
                {
                    "user_id": "Ayush Sarma",
                    "user_href": "/profile/Ayush-Sarma-1"
                },
                {
                    "user_id": "Anuraag Susarla",
                    "user_href": "/profile/Anuraag-Susarla"
                },
                {
                    "user_id": "Shivam Kumar",
                    "user_href": "/profile/Shivam-Kumar-104"
                },
                {
                    "user_id": "Tressa Patel",
                    "user_href": "/profile/Tressa-Patel"
                },
                {
                    "user_id": "Naveen Rawat",
                    "user_href": "/profile/Naveen-Rawat-44"
                },
                {
                    "user_id": "Harish S",
                    "user_href": "/profile/Harish-S-16"
                },
                {
                    "user_id": "Ryan Khan",
                    "user_href": "/profile/Ryan-Khan-127"
                },
                {
                    "user_id": "Anshuman Pattnaik",
                    "user_href": "/profile/Anshuman-Pattnaik-4"
                },
                {
                    "user_id": "Niharr Vaishnav",
                    "user_href": "/profile/Niharr-Vaishnav"
                },
                {
                    "user_id": "Naresh Kumar Chandrasekaran",
                    "user_href": "/profile/Naresh-Kumar-Chandrasekaran"
                },
                {
                    "user_id": "Pavan Kumarapathirana",
                    "user_href": "/profile/Pavan-Kumarapathirana"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ARKA-29"
                },
                {
                    "user_id": "Charu Singh",
                    "user_href": "/profile/Charu-Singh-70"
                },
                {
                    "user_id": "Neha Joshi",
                    "user_href": "/profile/Neha-Joshi-411"
                },
                {
                    "user_id": "Chandrika Jadon",
                    "user_href": "/profile/Chandrika-Jadon"
                },
                {
                    "user_id": "Rahul Kumar",
                    "user_href": "/profile/Rahul-Kumar-2073"
                },
                {
                    "user_id": "Ashutosh Kumar",
                    "user_href": "/profile/Ashutosh-Kumar-2376"
                },
                {
                    "user_id": "Priyam Das",
                    "user_href": "/profile/Priyam-Das-43"
                },
                {
                    "user_id": "Aman Khan",
                    "user_href": "/profile/Aman-Khan-1041"
                },
                {
                    "user_id": "Abhinav Kumar",
                    "user_href": "/profile/Abhinav-Kumar-1277"
                },
                {
                    "user_id": "John Nates",
                    "user_href": "/profile/John-Nates"
                },
                {
                    "user_id": "Simran D",
                    "user_href": "/profile/Simran-D-6"
                },
                {
                    "user_id": "Rinku Hasija",
                    "user_href": "/profile/Rinku-Hasija"
                },
                {
                    "user_id": "Irfan Hossain",
                    "user_href": "/profile/Irfan-Hossain-1"
                },
                {
                    "user_id": "Lydia Touchette",
                    "user_href": "/profile/Lydia-Touchette"
                },
                {
                    "user_id": "Vinay Tiwari",
                    "user_href": "/profile/Vinay-Tiwari-200"
                },
                {
                    "user_id": "Allen Alex",
                    "user_href": "/profile/Allen-Alex-26"
                },
                {
                    "user_id": "Mahesh Koshti",
                    "user_href": "/profile/Mahesh-Koshti"
                },
                {
                    "user_id": "Amanda Rodrigues",
                    "user_href": "/profile/Amanda-Rodrigues-24"
                },
                {
                    "user_id": "Gaurang",
                    "user_href": "/profile/Gaurang-19"
                },
                {
                    "user_id": "Kaustubh Shankar",
                    "user_href": "/profile/Kaustubh-Shankar"
                },
                {
                    "user_id": "Arvind Singh",
                    "user_href": "/profile/Arvind-Singh-431"
                },
                {
                    "user_id": "Narendra Manglani",
                    "user_href": "/profile/Narendra-Manglani-1"
                },
                {
                    "user_id": "Sonam Dolma",
                    "user_href": "/profile/Sonam-Dolma-2"
                },
                {
                    "user_id": "RJ Sridev Kandasamy",
                    "user_href": "/profile/RJ-Sridev-Kandasamy"
                },
                {
                    "user_id": "Nupur Padvi",
                    "user_href": "/profile/Nupur-Padvi"
                },
                {
                    "user_id": "Nithin Gigi",
                    "user_href": "/profile/Nithin-Gigi"
                },
                {
                    "user_id": "Shubham Deshwal",
                    "user_href": "/profile/Shubham-Deshwal-1"
                },
                {
                    "user_id": "Shashank Jerri",
                    "user_href": "/profile/Shashank-Jerri"
                },
                {
                    "user_id": "Thanushraam",
                    "user_href": "/profile/Thanushraam"
                },
                {
                    "user_id": "Rohit Sekar",
                    "user_href": "/profile/Rohit-Sekar-2"
                },
                {
                    "user_id": "Paritosh Gautam",
                    "user_href": "/profile/Paritosh-Gautam-3"
                },
                {
                    "user_id": "Nithyasri Prabhakaran",
                    "user_href": "/profile/Nithyasri-Prabhakaran"
                },
                {
                    "user_id": "Vanessa Saint",
                    "user_href": "/profile/Vanessa-Saint-2"
                },
                {
                    "user_id": "Bob Jones",
                    "user_href": "/profile/Bob-Jones-1065"
                },
                {
                    "user_id": "Faiz Abbas",
                    "user_href": "/profile/Faiz-Abbas-9"
                },
                {
                    "user_id": "Rajat Bansal",
                    "user_href": "/profile/Rajat-Bansal-216"
                },
                {
                    "user_id": "Neil Mathews",
                    "user_href": "/profile/Neil-Mathews-1"
                },
                {
                    "user_id": "Jaan",
                    "user_href": "/profile/Jaan-45"
                },
                {
                    "user_id": "Kanmani K",
                    "user_href": "/profile/Kanmani-K-11"
                },
                {
                    "user_id": "Dhairya Savlekar",
                    "user_href": "/profile/Dhairya-Savlekar-1"
                },
                {
                    "user_id": "Tanmoy Das",
                    "user_href": "/profile/Tanmoy-Das-21"
                },
                {
                    "user_id": "Abhineeth Mishra",
                    "user_href": "/profile/Abhineeth-Mishra-2"
                },
                {
                    "user_id": "Pratyush Kanojia",
                    "user_href": "/profile/Pratyush-Kanojia"
                },
                {
                    "user_id": "Ananya Vishwanath",
                    "user_href": "/profile/Ananya-Vishwanath-6"
                },
                {
                    "user_id": "Subhajit Mahanti",
                    "user_href": "/profile/Subhajit-Mahanti"
                },
                {
                    "user_id": "Sarthis Idren",
                    "user_href": "/profile/Sarthis-Idren"
                },
                {
                    "user_id": "Smriti Singh",
                    "user_href": "/profile/Smriti-Singh-522"
                },
                {
                    "user_id": "Jack Soren",
                    "user_href": "/profile/Jack-Soren-2"
                },
                {
                    "user_id": "Rajkumar Sankhala",
                    "user_href": "/profile/Rajkumar-Sankhala-2"
                },
                {
                    "user_id": "Kritik Kumar",
                    "user_href": "/profile/Kritik-Kumar"
                },
                {
                    "user_id": "Aliya",
                    "user_href": "/profile/Aliya-231"
                },
                {
                    "user_id": "Rushikesh Patil",
                    "user_href": "/profile/Rushikesh-Patil-353"
                },
                {
                    "user_id": "Dipto Kumar Ghosh",
                    "user_href": "/profile/Dipto-Kumar-Ghosh"
                },
                {
                    "user_id": "Muhammad Ahmed Altaf",
                    "user_href": "/profile/Muhammad-Ahmed-Altaf"
                },
                {
                    "user_id": "Kaushal Pareek",
                    "user_href": "/profile/Kaushal-Pareek"
                },
                {
                    "user_id": "Rayyan",
                    "user_href": "/profile/Rayyan-27"
                },
                {
                    "user_id": "Abhishek Bharadwaj",
                    "user_href": "/profile/Abhishek-Bharadwaj-53"
                },
                {
                    "user_id": "Archiev Kumar",
                    "user_href": "/profile/Archiev-Kumar"
                },
                {
                    "user_id": "Varun Upadhyay",
                    "user_href": "/profile/Varun-Upadhyay-20"
                },
                {
                    "user_id": "Bennett Lee Shuen Meng",
                    "user_href": "/profile/Bennett-Lee-Shuen-Meng"
                },
                {
                    "user_id": "Ridhima Narula",
                    "user_href": "/profile/Ridhima-Narula-1"
                },
                {
                    "user_id": "Rohan Rao",
                    "user_href": "/profile/Rohan-Rao-92"
                },
                {
                    "user_id": "Ashutosh Sonpal",
                    "user_href": "/profile/Ashutosh-Sonpal-1"
                },
                {
                    "user_id": "Santhosh Shanmugam",
                    "user_href": "/profile/Santhosh-Shanmugam-4"
                },
                {
                    "user_id": "Rohan Mishra",
                    "user_href": "/profile/Rohan-Mishra-112"
                },
                {
                    "user_id": "Siddhant Bhardwaj",
                    "user_href": "/profile/Siddhant-Bhardwaj-20"
                },
                {
                    "user_id": "Kanishka Singh",
                    "user_href": "/profile/Kanishka-Singh-69"
                },
                {
                    "user_id": "Prince Gbevor",
                    "user_href": "/profile/Prince-Gbevor"
                },
                {
                    "user_id": "Divyansh Singh",
                    "user_href": "/profile/Divyansh-Singh-757"
                },
                {
                    "user_id": "Asuku Usman",
                    "user_href": "/profile/Asuku-Usman"
                },
                {
                    "user_id": "Ravi Chauhan",
                    "user_href": "/profile/Ravi-Chauhan-456"
                },
                {
                    "user_id": "Brijesh Kumar",
                    "user_href": "/profile/Brijesh-Kumar-373"
                },
                {
                    "user_id": "Towhidur Rahman",
                    "user_href": "/profile/Towhidur-Rahman-5"
                },
                {
                    "user_id": "Karthik",
                    "user_href": "/profile/Karthik-872"
                },
                {
                    "user_id": "Dishanth G",
                    "user_href": "/profile/Dishanth-G"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/G-AMARESHKUMAR"
                },
                {
                    "user_id": "Raha Shanehbandi",
                    "user_href": "/profile/Raha-Shanehbandi-1"
                },
                {
                    "user_id": "Jordan Major",
                    "user_href": "/profile/Jordan-Major-5"
                },
                {
                    "user_id": "Gitesh Kumar",
                    "user_href": "/profile/Gitesh-Kumar-36"
                },
                {
                    "user_id": "Murali Mohan Chowdary",
                    "user_href": "/profile/Murali-Mohan-Chowdary-1"
                },
                {
                    "user_id": "Raghav Gupta",
                    "user_href": "/profile/Raghav-Gupta-352"
                },
                {
                    "user_id": "Shubham Goel",
                    "user_href": "/profile/Shubham-Goel-237"
                },
                {
                    "user_id": "Chetan Bansal",
                    "user_href": "/profile/Chetan-Bansal-24"
                },
                {
                    "user_id": "Piyush Prakash",
                    "user_href": "/profile/Piyush-Prakash-45"
                },
                {
                    "user_id": "Shweta Mishra",
                    "user_href": "/profile/Shweta-Mishra-21"
                },
                {
                    "user_id": "Jimmy Ivans",
                    "user_href": "/profile/Jimmy-Ivans"
                },
                {
                    "user_id": "Anjan Hazarika",
                    "user_href": "/profile/Anjan-Hazarika"
                },
                {
                    "user_id": "David Loke",
                    "user_href": "/profile/David-Loke-1"
                },
                {
                    "user_id": "Patrick Pai",
                    "user_href": "/profile/Patrick-Pai-1"
                },
                {
                    "user_id": "Chanakya Choudhary",
                    "user_href": "/profile/Chanakya-Choudhary"
                },
                {
                    "user_id": "Emmanuel Eyob",
                    "user_href": "/profile/Emmanuel-Eyob"
                },
                {
                    "user_id": "Ayan Srivastava",
                    "user_href": "/profile/Ayan-Srivastava-2"
                },
                {
                    "user_id": "Shreyas Srikanth",
                    "user_href": "/profile/Shreyas-Srikanth-2"
                },
                {
                    "user_id": "Abhitej Arora",
                    "user_href": "/profile/Abhitej-Arora"
                },
                {
                    "user_id": "Nirisha",
                    "user_href": "/profile/Nirisha"
                },
                {
                    "user_id": "Mila Govinda",
                    "user_href": "/profile/Mila-Govinda"
                },
                {
                    "user_id": "Tanmay Bhonsale",
                    "user_href": "/profile/Tanmay-Bhonsale"
                },
                {
                    "user_id": "Danish Akhtar",
                    "user_href": "/profile/Danish-Akhtar-36"
                },
                {
                    "user_id": "Kate Tostenson",
                    "user_href": "/profile/Kate-Tostenson"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shadd-Rojas"
                },
                {
                    "user_id": "Hasan Bahja",
                    "user_href": "/profile/Hasan-Bahja"
                },
                {
                    "user_id": "Medini NB",
                    "user_href": "/profile/Medini-NB"
                },
                {
                    "user_id": "Erik Barchinato",
                    "user_href": "/profile/Erik-Barchinato"
                },
                {
                    "user_id": "Andres Saez",
                    "user_href": "/profile/Andres-Saez-2"
                },
                {
                    "user_id": "Pranav Kulkarni",
                    "user_href": "/profile/Pranav-Kulkarni-17"
                },
                {
                    "user_id": "Anurag Roy",
                    "user_href": "/profile/Anurag-Roy-18"
                },
                {
                    "user_id": "Hannah Watson",
                    "user_href": "/profile/Hannah-Watson-66"
                },
                {
                    "user_id": "Harish K Advani",
                    "user_href": "/profile/Harish-K-Advani"
                },
                {
                    "user_id": "Naz Soysal",
                    "user_href": "/profile/Naz-Soysal"
                },
                {
                    "user_id": "Katrina Chan",
                    "user_href": "/profile/Katrina-Chan-16"
                },
                {
                    "user_id": "Avni Sally",
                    "user_href": "/profile/Avni-Sally"
                },
                {
                    "user_id": "Gagandeep Malik",
                    "user_href": "/profile/Gagandeep-Malik-3"
                },
                {
                    "user_id": "Namish Gali",
                    "user_href": "/profile/Namish-Gali-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tushar Kumar",
                "href": "/profile/Tushar-Kumar-460"
            },
            "answer_text": "After spending about 2 months in my college, majoring in Petroleum Engg,It is going as follows Sharing a room with a 4th year senior (people here in India assume it is tough but it isn't)Getting up 8am for own classes without anyone but alarm (I never used alarm regularly before therefore to set accordingly is also became a task)Made 5–6 decent friends (including a girl )Studies at first very seen very interesting but extra curricular is a big distraction as it is open very much for 1st year studentsAssignments are quite less and hostel is generally very quite and peaceful (unless there is a birthday celebration)Biggest job for me in this too months was to me updated with what is being taught without any help from either library and no study materiel provided to usAttendance is sickening (Every Indian college story)Participated and won 2 quizzes till now (Won Around Rs 1000)Seeing the freedom and responsibility on same track is making me sick,I was a type of care free person, by now I have to keep measure of Studies,Food on time,Basic household work and mainatince financesMet with a lot seniors and attended some guest lecturesRESULT - More confused than ever :)",
            "date": "Answered September 26, 2018",
            "views": "926",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mishkat Khan",
                    "user_href": "/profile/Mishkat-Khan-12"
                },
                {
                    "user_id": "Mousumi Nandi",
                    "user_href": "/profile/Mousumi-Nandi-5"
                },
                {
                    "user_id": "Smriti Chandra",
                    "user_href": "/profile/Smriti-Chandra-6"
                },
                {
                    "user_id": "Venkatesh S",
                    "user_href": "/profile/Venkatesh-S-86"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiara Bay",
                "href": "/profile/Kiara-Bay"
            },
            "answer_text": "I can't decide between the adjectives: hard, frustating, fun, challenging and scary. It's definitely all of them! It's hard because classes are extremely difficult to follow. I'm currently studying Anglo-American literature, Portuguese/Brasilian, Linguistics, European comparative literatures and World's history. Exams are so near and time so poor! It's frustating because being the little spoiled girl I am, I had to learn how to cook/ do the laundry and clean the house. Plus, I literally have no time to sleep. It's fun because I get to know people who come from all around the world. Also, there are so many parties or cocktails on boats.  It's challenging because I moved 16 hours away from my birthplace, my family, my boyfriend, my friends and I'm terribly homesick. Moreover, I live in Venice which is always so full of tourists and I'd like to arrive in class on time for once!   And it's scary because I'm 18, I feel so young and yet I have to work hard and build my future. ",
            "date": "Answered October 9, 2018",
            "views": "209",
            "upvotes": " View 237 Upvoters",
            "upvoters": [
                {
                    "user_id": "Addison Fidler",
                    "user_href": "/profile/Addison-Fidler-2"
                },
                {
                    "user_id": "Precious Afolabi",
                    "user_href": "/profile/Precious-Afolabi-14"
                },
                {
                    "user_id": "Eric Rodriguez",
                    "user_href": "/profile/Eric-Rodriguez-137"
                },
                {
                    "user_id": "Fanni Valisalo",
                    "user_href": "/profile/Fanni-Valisalo"
                },
                {
                    "user_id": "Ratna Kumar (Yadav)",
                    "user_href": "/profile/Ratna-Kumar-Yadav"
                },
                {
                    "user_id": "Allison Yu",
                    "user_href": "/profile/Allison-Yu-5"
                },
                {
                    "user_id": "Akideep",
                    "user_href": "/profile/Akideep"
                },
                {
                    "user_id": "Lam Yau-king (林友敬)",
                    "user_href": "/profile/Lam-Yau-king-林友敬"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/YUGAL-14"
                },
                {
                    "user_id": "Karishma Kasi",
                    "user_href": "/profile/Karishma-Kasi"
                },
                {
                    "user_id": "Hazel Vet",
                    "user_href": "/profile/Hazel-Vet"
                },
                {
                    "user_id": "Amon Elriyad",
                    "user_href": "/profile/Amon-Elriyad"
                },
                {
                    "user_id": "Riskie Dinnita",
                    "user_href": "/profile/Riskie-Dinnita"
                },
                {
                    "user_id": "Eniton Agidee",
                    "user_href": "/profile/Eniton-Agidee"
                },
                {
                    "user_id": "Disha",
                    "user_href": "/profile/Disha-348"
                },
                {
                    "user_id": "Nandini Chouhan",
                    "user_href": "/profile/Nandini-Chouhan-4"
                },
                {
                    "user_id": "Vijeta Kumari",
                    "user_href": "/profile/Vijeta-Kumari-30"
                },
                {
                    "user_id": "Lina Szczpański",
                    "user_href": "/profile/Lina-Szczpański"
                },
                {
                    "user_id": "Peace John",
                    "user_href": "/profile/Peace-John-16"
                },
                {
                    "user_id": "Kimberly Vu",
                    "user_href": "/profile/Kimberly-Vu-1"
                },
                {
                    "user_id": "Kyle Madura",
                    "user_href": "/profile/Kyle-Madura-1"
                },
                {
                    "user_id": "Sujay Srivastava",
                    "user_href": "/profile/Sujay-Srivastava-16"
                },
                {
                    "user_id": "Tajanae Eason",
                    "user_href": "/profile/Tajanae-Eason"
                },
                {
                    "user_id": "Monique Cao",
                    "user_href": "/profile/Monique-Cao"
                },
                {
                    "user_id": "Nadira Farisah",
                    "user_href": "/profile/Nadira-Farisah"
                },
                {
                    "user_id": "Anindya Permata Widhi",
                    "user_href": "/profile/Anindya-Permata-Widhi"
                },
                {
                    "user_id": "Kundan Savaliya",
                    "user_href": "/profile/Kundan-Savaliya"
                },
                {
                    "user_id": "Shyamal Patel",
                    "user_href": "/profile/Shyamal-Patel-14"
                },
                {
                    "user_id": "Hriday Bajaj",
                    "user_href": "/profile/Hriday-Bajaj"
                },
                {
                    "user_id": "Safiyyah Franklin",
                    "user_href": "/profile/Safiyyah-Franklin"
                },
                {
                    "user_id": "Tanisha Agarwal",
                    "user_href": "/profile/Tanisha-Agarwal-45"
                },
                {
                    "user_id": "Lekha",
                    "user_href": "/profile/Lekha-47"
                },
                {
                    "user_id": "Keegan Bennett",
                    "user_href": "/profile/Keegan-Bennett-4"
                },
                {
                    "user_id": "Martin Spence",
                    "user_href": "/profile/Martin-Spence-5"
                },
                {
                    "user_id": "Pareena Girish Wagle",
                    "user_href": "/profile/Pareena-Girish-Wagle"
                },
                {
                    "user_id": "Akshit Pareek",
                    "user_href": "/profile/Akshit-Pareek-1"
                },
                {
                    "user_id": "Trishla Doshi",
                    "user_href": "/profile/Trishla-Doshi-1"
                },
                {
                    "user_id": "Soham Desai",
                    "user_href": "/profile/Soham-Desai-12"
                },
                {
                    "user_id": "Jan Kapoor",
                    "user_href": "/profile/Jan-Kapoor"
                },
                {
                    "user_id": "Ishaan H. Jajodia",
                    "user_href": "/profile/Ishaan-H-Jajodia"
                },
                {
                    "user_id": "Saahhiel Saawaant",
                    "user_href": "/profile/Saahhiel-Saawaant"
                },
                {
                    "user_id": "Medini NB",
                    "user_href": "/profile/Medini-NB"
                },
                {
                    "user_id": "Sanjit Mittapalli",
                    "user_href": "/profile/Sanjit-Mittapalli"
                },
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Grace Lui",
                    "user_href": "/profile/Grace-Lui-1"
                },
                {
                    "user_id": "Jon Morris",
                    "user_href": "/profile/Jon-Morris-2"
                },
                {
                    "user_id": "Elena Young",
                    "user_href": "/profile/Elena-Young-21"
                },
                {
                    "user_id": "Xxo",
                    "user_href": "/profile/Xxo-2"
                },
                {
                    "user_id": "Sona Biju George",
                    "user_href": "/profile/Sona-Biju-George"
                },
                {
                    "user_id": "Rahul",
                    "user_href": "/profile/Rahul-2378"
                },
                {
                    "user_id": "Sidharth Ramanan",
                    "user_href": "/profile/Sidharth-Ramanan"
                },
                {
                    "user_id": "Munira Abdirahman",
                    "user_href": "/profile/Munira-Abdirahman-3"
                },
                {
                    "user_id": "Sandra Elizabeth",
                    "user_href": "/profile/Sandra-Elizabeth-37"
                },
                {
                    "user_id": "Kritika Chauhan",
                    "user_href": "/profile/Kritika-Chauhan-76"
                },
                {
                    "user_id": "Kim Boze",
                    "user_href": "/profile/Kim-Boze"
                },
                {
                    "user_id": "Shweta Chatterjee",
                    "user_href": "/profile/Shweta-Chatterjee-5"
                },
                {
                    "user_id": "Nitya Sunkad",
                    "user_href": "/profile/Nitya-Sunkad"
                },
                {
                    "user_id": "Yanna Lim",
                    "user_href": "/profile/Yanna-Lim"
                },
                {
                    "user_id": "Yumna Salman",
                    "user_href": "/profile/Yumna-Salman-3"
                },
                {
                    "user_id": "Robert Erengo",
                    "user_href": "/profile/Robert-Erengo"
                },
                {
                    "user_id": "Suryan Nair",
                    "user_href": "/profile/Suryan-Nair-1"
                },
                {
                    "user_id": "Muskaan Mehta",
                    "user_href": "/profile/Muskaan-Mehta-6"
                },
                {
                    "user_id": "Nancy Granger",
                    "user_href": "/profile/Nancy-Granger-5"
                },
                {
                    "user_id": "Amy Ahmed",
                    "user_href": "/profile/Amy-Ahmed-10"
                },
                {
                    "user_id": "Paridhi Puri",
                    "user_href": "/profile/Paridhi-Puri"
                },
                {
                    "user_id": "Faransi Al-Azdi",
                    "user_href": "/profile/Faransi-Al-Azdi"
                },
                {
                    "user_id": "Valentina Volpi",
                    "user_href": "/profile/Valentina-Volpi-1"
                },
                {
                    "user_id": "D Mukherjee",
                    "user_href": "/profile/D-Mukherjee-8"
                },
                {
                    "user_id": "Karishma Karishma",
                    "user_href": "/profile/Karishma-Karishma-11"
                },
                {
                    "user_id": "Manasa Gadiyaram",
                    "user_href": "/profile/Manasa-Gadiyaram-2"
                },
                {
                    "user_id": "Omar Zakarya",
                    "user_href": "/profile/Omar-Zakarya"
                },
                {
                    "user_id": "Angelica Williams",
                    "user_href": "/profile/Angelica-Williams-40"
                },
                {
                    "user_id": "Pranav Jain",
                    "user_href": "/profile/Pranav-Jain-138"
                },
                {
                    "user_id": "Lucus Zha",
                    "user_href": "/profile/Lucus-Zha"
                },
                {
                    "user_id": "Ankita Ingty",
                    "user_href": "/profile/Ankita-Ingty"
                },
                {
                    "user_id": "Mallika Handa",
                    "user_href": "/profile/Mallika-Handa-2"
                },
                {
                    "user_id": "Seep Gupta",
                    "user_href": "/profile/Seep-Gupta-2"
                },
                {
                    "user_id": "Haram Saqib",
                    "user_href": "/profile/Haram-Saqib"
                },
                {
                    "user_id": "Naena",
                    "user_href": "/profile/Naena"
                },
                {
                    "user_id": "Sarah Michalets",
                    "user_href": "/profile/Sarah-Michalets"
                },
                {
                    "user_id": "Jeff Xu",
                    "user_href": "/profile/Jeff-Xu-61"
                },
                {
                    "user_id": "Kirtan Gohil",
                    "user_href": "/profile/Kirtan-Gohil-1"
                },
                {
                    "user_id": "Sarthak",
                    "user_href": "/profile/Sarthak-125"
                },
                {
                    "user_id": "Nandan Nishad",
                    "user_href": "/profile/Nandan-Nishad"
                },
                {
                    "user_id": "Fia Light",
                    "user_href": "/profile/Fia-Light"
                },
                {
                    "user_id": "Andre Ng",
                    "user_href": "/profile/Andre-Ng-4"
                },
                {
                    "user_id": "Rhea Chopra",
                    "user_href": "/profile/Rhea-Chopra-6"
                },
                {
                    "user_id": "Akshara N",
                    "user_href": "/profile/Akshara-N"
                },
                {
                    "user_id": "Ninad Jadhav",
                    "user_href": "/profile/Ninad-Jadhav-13"
                },
                {
                    "user_id": "Allison Hernandez",
                    "user_href": "/profile/Allison-Hernandez-2"
                },
                {
                    "user_id": "Sarah Pechet",
                    "user_href": "/profile/Sarah-Pechet"
                },
                {
                    "user_id": "Vincent Llanas",
                    "user_href": "/profile/Vincent-Llanas-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Fatemah-al-Salem"
                },
                {
                    "user_id": "Snigdha Tiwari",
                    "user_href": "/profile/Snigdha-Tiwari-7"
                },
                {
                    "user_id": "Santosh Kumar",
                    "user_href": "/profile/Santosh-Kumar-4979"
                },
                {
                    "user_id": "Arnav Myana",
                    "user_href": "/profile/Arnav-Myana"
                },
                {
                    "user_id": "Gerard Blais",
                    "user_href": "/profile/Gerard-Blais"
                },
                {
                    "user_id": "Tom Stevenon",
                    "user_href": "/profile/Tom-Stevenon"
                },
                {
                    "user_id": "Sara Rocks",
                    "user_href": "/profile/Sara-Rocks"
                },
                {
                    "user_id": "Arax Rubenyan",
                    "user_href": "/profile/Arax-Rubenyan-1"
                },
                {
                    "user_id": "S M Dowla",
                    "user_href": "/profile/S-M-Dowla"
                },
                {
                    "user_id": "Varad Joshi",
                    "user_href": "/profile/Varad-Joshi-35"
                },
                {
                    "user_id": "Maeve",
                    "user_href": "/profile/Maeve-121"
                },
                {
                    "user_id": "Caleb Nastasi",
                    "user_href": "/profile/Caleb-Nastasi-1"
                },
                {
                    "user_id": "Parsh Jain",
                    "user_href": "/profile/Parsh-Jain-3"
                },
                {
                    "user_id": "Yusra Faheem",
                    "user_href": "/profile/Yusra-Faheem-2"
                },
                {
                    "user_id": "Nidhi",
                    "user_href": "/profile/Nidhi-414"
                },
                {
                    "user_id": "Kiara Ware",
                    "user_href": "/profile/Kiara-Ware-4"
                },
                {
                    "user_id": "Sana Naqvi",
                    "user_href": "/profile/Sana-Naqvi-3"
                },
                {
                    "user_id": "Avneet Kaur",
                    "user_href": "/profile/Avneet-Kaur-308"
                },
                {
                    "user_id": "Himanshu Khandelwal",
                    "user_href": "/profile/Himanshu-Khandelwal-72"
                },
                {
                    "user_id": "Aniket Kulkarni",
                    "user_href": "/profile/Aniket-Kulkarni-115"
                },
                {
                    "user_id": "Aditi Ahuja",
                    "user_href": "/profile/Aditi-Ahuja-9"
                },
                {
                    "user_id": "Srilakshmi",
                    "user_href": "/profile/Srilakshmi-26"
                },
                {
                    "user_id": "Aashal Kamdar",
                    "user_href": "/profile/Aashal-Kamdar"
                },
                {
                    "user_id": "Melissa Cyriac",
                    "user_href": "/profile/Melissa-Cyriac"
                },
                {
                    "user_id": "Ribbon-Chan",
                    "user_href": "/profile/Ribbon-Chan-1"
                },
                {
                    "user_id": "Connor Shaw",
                    "user_href": "/profile/Connor-Shaw-16"
                },
                {
                    "user_id": "Bonnie Nguyen",
                    "user_href": "/profile/Bonnie-Nguyen-15"
                },
                {
                    "user_id": "Nicholas Mathiassen",
                    "user_href": "/profile/Nicholas-Mathiassen"
                },
                {
                    "user_id": "Guangyuan Chen",
                    "user_href": "/profile/Guangyuan-Chen"
                },
                {
                    "user_id": "Mostafa Hassan",
                    "user_href": "/profile/Mostafa-Hassan-19"
                },
                {
                    "user_id": "Mohammed",
                    "user_href": "/profile/Mohammed-787"
                },
                {
                    "user_id": "Brendan Lin",
                    "user_href": "/profile/Brendan-Lin-4"
                },
                {
                    "user_id": "Siddhartha Palit",
                    "user_href": "/profile/Siddhartha-Palit"
                },
                {
                    "user_id": "Supakorn Asvaplungprohm",
                    "user_href": "/profile/Supakorn-Asvaplungprohm"
                },
                {
                    "user_id": "Ajit Singh",
                    "user_href": "/profile/Ajit-Singh-224"
                },
                {
                    "user_id": "Syed Jaree Haider",
                    "user_href": "/profile/Syed-Jaree-Haider"
                },
                {
                    "user_id": "Zoar Goldreich",
                    "user_href": "/profile/Zoar-Goldreich"
                },
                {
                    "user_id": "Alex T",
                    "user_href": "/profile/Alex-T-656"
                },
                {
                    "user_id": "Amit",
                    "user_href": "/profile/Amit-1157"
                },
                {
                    "user_id": "Nathan Cady",
                    "user_href": "/profile/Nathan-Cady"
                },
                {
                    "user_id": "Ray Chan",
                    "user_href": "/profile/Ray-Chan-147"
                },
                {
                    "user_id": "Phan Minh Chau",
                    "user_href": "/profile/Phan-Minh-Chau"
                },
                {
                    "user_id": "Anne",
                    "user_href": "/profile/Anne-518"
                },
                {
                    "user_id": "Samruddhi Raut",
                    "user_href": "/profile/Samruddhi-Raut-7"
                },
                {
                    "user_id": "Yessi Panda",
                    "user_href": "/profile/Yessi-Panda-1"
                },
                {
                    "user_id": "Saanvi Balakrishan",
                    "user_href": "/profile/Saanvi-Balakrishan"
                },
                {
                    "user_id": "Rene Agnes",
                    "user_href": "/profile/Rene-Agnes"
                },
                {
                    "user_id": "Sourojeet Chakraborty",
                    "user_href": "/profile/Sourojeet-Chakraborty"
                },
                {
                    "user_id": "Eian Wright",
                    "user_href": "/profile/Eian-Wright"
                },
                {
                    "user_id": "Kathy Le",
                    "user_href": "/profile/Kathy-Le-14"
                },
                {
                    "user_id": "Rhya Kat",
                    "user_href": "/profile/Rhya-Kat"
                },
                {
                    "user_id": "Sofia Espinoza",
                    "user_href": "/profile/Sofia-Espinoza-15"
                },
                {
                    "user_id": "Chloe Lin",
                    "user_href": "/profile/Chloe-Lin-43"
                },
                {
                    "user_id": "Karen Ghandehari",
                    "user_href": "/profile/Karen-Ghandehari"
                },
                {
                    "user_id": "Ananta Datta",
                    "user_href": "/profile/Ananta-Datta"
                },
                {
                    "user_id": "Sameeha Ahmed",
                    "user_href": "/profile/Sameeha-Ahmed-4"
                },
                {
                    "user_id": "Grace",
                    "user_href": "/profile/Grace-1685"
                },
                {
                    "user_id": "Annie To",
                    "user_href": "/profile/Annie-To-2"
                },
                {
                    "user_id": "Qaali Faarah",
                    "user_href": "/profile/Qaali-Faarah"
                },
                {
                    "user_id": "Michael Jordan",
                    "user_href": "/profile/Michael-Jordan-373"
                },
                {
                    "user_id": "Viktor Zhen",
                    "user_href": "/profile/Viktor-Zhen"
                },
                {
                    "user_id": "Dora Wolff",
                    "user_href": "/profile/Dora-Wolff"
                },
                {
                    "user_id": "Pranav Prabhu",
                    "user_href": "/profile/Pranav-Prabhu-15"
                },
                {
                    "user_id": "Bernie Cervantes",
                    "user_href": "/profile/Bernie-Cervantes-1"
                },
                {
                    "user_id": "Nicholas Fitzgerald",
                    "user_href": "/profile/Nicholas-Fitzgerald-11"
                },
                {
                    "user_id": "Arjun Srinivasan",
                    "user_href": "/profile/Arjun-Srinivasan-23"
                },
                {
                    "user_id": "Holly Bell",
                    "user_href": "/profile/Holly-Bell-26"
                },
                {
                    "user_id": "Waseem Malek",
                    "user_href": "/profile/Waseem-Malek"
                },
                {
                    "user_id": "Zoe HC",
                    "user_href": "/profile/Zoe-HC"
                },
                {
                    "user_id": "Prince Gbevor",
                    "user_href": "/profile/Prince-Gbevor"
                },
                {
                    "user_id": "Jenny Stonem",
                    "user_href": "/profile/Jenny-Stonem"
                },
                {
                    "user_id": "Judah Kang",
                    "user_href": "/profile/Judah-Kang"
                },
                {
                    "user_id": "Arjun Sagi",
                    "user_href": "/profile/Arjun-Sagi-1"
                },
                {
                    "user_id": "Lola Jane",
                    "user_href": "/profile/Lola-Jane-11"
                },
                {
                    "user_id": "SSA",
                    "user_href": "/profile/SSA-27"
                },
                {
                    "user_id": "Ava Gray",
                    "user_href": "/profile/Ava-Gray-12"
                },
                {
                    "user_id": "Hafiz Ansar",
                    "user_href": "/profile/Hafiz-Ansar-2"
                },
                {
                    "user_id": "Stephanie Wang",
                    "user_href": "/profile/Stephanie-Wang-70"
                },
                {
                    "user_id": "Mariah Schmidt",
                    "user_href": "/profile/Mariah-Schmidt"
                },
                {
                    "user_id": "Khadija Rehman",
                    "user_href": "/profile/Khadija-Rehman-2"
                },
                {
                    "user_id": "Harman Kaur",
                    "user_href": "/profile/Harman-Kaur-24"
                },
                {
                    "user_id": "Aditi Bose",
                    "user_href": "/profile/Aditi-Bose-13"
                },
                {
                    "user_id": "Michael Koeberg",
                    "user_href": "/profile/Michael-Koeberg"
                },
                {
                    "user_id": "Kshitij Jadhav",
                    "user_href": "/profile/Kshitij-Jadhav-3"
                },
                {
                    "user_id": "Katy O.C",
                    "user_href": "/profile/Katy-O-C"
                },
                {
                    "user_id": "Jordan Major",
                    "user_href": "/profile/Jordan-Major-5"
                },
                {
                    "user_id": "Rahul Thomas",
                    "user_href": "/profile/Rahul-Thomas-59"
                },
                {
                    "user_id": "Aanchal Chadda",
                    "user_href": "/profile/Aanchal-Chadda"
                },
                {
                    "user_id": "Avneeka Rampurtab",
                    "user_href": "/profile/Avneeka-Rampurtab"
                },
                {
                    "user_id": "Andy Zhao",
                    "user_href": "/profile/Andy-Zhao-37"
                },
                {
                    "user_id": "Christian Clarke",
                    "user_href": "/profile/Christian-Clarke-32"
                },
                {
                    "user_id": "Kasi Tsaneva",
                    "user_href": "/profile/Kasi-Tsaneva"
                },
                {
                    "user_id": "Manal Mansaray",
                    "user_href": "/profile/Manal-Mansaray"
                },
                {
                    "user_id": "Ishika",
                    "user_href": "/profile/Ishika-108"
                },
                {
                    "user_id": "Rose Golda",
                    "user_href": "/profile/Rose-Golda-1"
                },
                {
                    "user_id": "Trey Miller",
                    "user_href": "/profile/Trey-Miller-53"
                },
                {
                    "user_id": "Polina Smirnova",
                    "user_href": "/profile/Polina-Smirnova-1"
                },
                {
                    "user_id": "Parth Ashi Mohan",
                    "user_href": "/profile/Parth-Ashi-Mohan"
                },
                {
                    "user_id": "Pierce Francis",
                    "user_href": "/profile/Pierce-Francis"
                },
                {
                    "user_id": "Abhi Kar",
                    "user_href": "/profile/Abhi-Kar-5"
                },
                {
                    "user_id": "Petra Fernandes",
                    "user_href": "/profile/Petra-Fernandes"
                },
                {
                    "user_id": "Ani Martikyan",
                    "user_href": "/profile/Ani-Martikyan"
                },
                {
                    "user_id": "Sadia Khan",
                    "user_href": "/profile/Sadia-Khan-399"
                },
                {
                    "user_id": "Shahineze Chebira",
                    "user_href": "/profile/Shahineze-Chebira"
                },
                {
                    "user_id": "Abhishek Singh Rajput",
                    "user_href": "/profile/Abhishek-Singh-Rajput-83"
                },
                {
                    "user_id": "Emily Preston",
                    "user_href": "/profile/Emily-Preston-18"
                },
                {
                    "user_id": "Devansh Ved",
                    "user_href": "/profile/Devansh-Ved"
                },
                {
                    "user_id": "Shiveha Verma",
                    "user_href": "/profile/Shiveha-Verma-2"
                },
                {
                    "user_id": "Stefano Bregante",
                    "user_href": "/profile/Stefano-Bregante-1"
                },
                {
                    "user_id": "Shivani Singh",
                    "user_href": "/profile/Shivani-Singh-572"
                },
                {
                    "user_id": "Ella Hughes",
                    "user_href": "/profile/Ella-Hughes-7"
                },
                {
                    "user_id": "Ashleigh Von Trout",
                    "user_href": "/profile/Ashleigh-Von-Trout"
                },
                {
                    "user_id": "Divyanshu Shah",
                    "user_href": "/profile/Divyanshu-Shah-1"
                },
                {
                    "user_id": "Priyankan Datta",
                    "user_href": "/profile/Priyankan-Datta-1"
                },
                {
                    "user_id": "Shane Lynch",
                    "user_href": "/profile/Shane-Lynch-11"
                },
                {
                    "user_id": "Charlotte Grey",
                    "user_href": "/profile/Charlotte-Grey-9"
                },
                {
                    "user_id": "Aleeza Shah",
                    "user_href": "/profile/Aleeza-Shah-2"
                },
                {
                    "user_id": "Avitaj Mitra",
                    "user_href": "/profile/Avitaj-Mitra"
                },
                {
                    "user_id": "Iulian Crudu",
                    "user_href": "/profile/Iulian-Crudu"
                },
                {
                    "user_id": "Shreya S",
                    "user_href": "/profile/Shreya-S-83"
                },
                {
                    "user_id": "Iman El Monla",
                    "user_href": "/profile/Iman-El-Monla"
                },
                {
                    "user_id": "Manikandan A.S",
                    "user_href": "/profile/Manikandan-A-S-6"
                },
                {
                    "user_id": "Amy Zhang",
                    "user_href": "/profile/Amy-Zhang-128"
                },
                {
                    "user_id": "Ridhima Narula",
                    "user_href": "/profile/Ridhima-Narula-1"
                },
                {
                    "user_id": "Abyan Abdirahman",
                    "user_href": "/profile/Abyan-Abdirahman"
                },
                {
                    "user_id": "Dharun Aditya Senthilkumar",
                    "user_href": "/profile/Dharun-Aditya-Senthilkumar"
                },
                {
                    "user_id": "Tarun Sharma",
                    "user_href": "/profile/Tarun-Sharma-1917"
                },
                {
                    "user_id": "Lia Seymour",
                    "user_href": "/profile/Lia-Seymour"
                },
                {
                    "user_id": "Haley Patel",
                    "user_href": "/profile/Haley-Patel-2"
                },
                {
                    "user_id": "Saumitra Kapoor",
                    "user_href": "/profile/Saumitra-Kapoor-2"
                },
                {
                    "user_id": "Jean-Luc Liu",
                    "user_href": "/profile/Jean-Luc-Liu"
                },
                {
                    "user_id": "Fernanda Fonseca Torres",
                    "user_href": "/profile/Fernanda-Fonseca-Torres"
                },
                {
                    "user_id": "Yogesh Raj Sharma",
                    "user_href": "/profile/Yogesh-Raj-Sharma"
                },
                {
                    "user_id": "Abhi",
                    "user_href": "/profile/Abhi-1091"
                },
                {
                    "user_id": "Katia Hernandez",
                    "user_href": "/profile/Katia-Hernandez-13"
                },
                {
                    "user_id": "Sankalpa Fernando",
                    "user_href": "/profile/Sankalpa-Fernando"
                },
                {
                    "user_id": "Deepanshu Samariya",
                    "user_href": "/profile/Deepanshu-Samariya"
                },
                {
                    "user_id": "Kevin Anand",
                    "user_href": "/profile/Kevin-Anand-3"
                },
                {
                    "user_id": "Darshni Karunakaran",
                    "user_href": "/profile/Darshni-Karunakaran"
                },
                {
                    "user_id": "John Lee Quigley",
                    "user_href": "/profile/John-Lee-Quigley-1"
                },
                {
                    "user_id": "Engji Blickensdorfer",
                    "user_href": "/profile/Engji-Blickensdorfer"
                },
                {
                    "user_id": "Surbhi K. Upadhyayy",
                    "user_href": "/profile/Surbhi-K-Upadhyayy"
                },
                {
                    "user_id": "Dominique Reza",
                    "user_href": "/profile/Dominique-Reza"
                },
                {
                    "user_id": "Pavan Kumarapathirana",
                    "user_href": "/profile/Pavan-Kumarapathirana"
                },
                {
                    "user_id": "Sehaj Sandhu",
                    "user_href": "/profile/Sehaj-Sandhu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elijah Amirianfar",
                "href": "/profile/Elijah-Amirianfar-1"
            },
            "answer_text": "Well, I am currently in Week 0, which means classes haven’t started yet, until Thursday of Week 0, which is tomorrow. So far, it’s going okay. I did panic when I glanced at my syllabus for my classes, but today I read through it and it wasn’t that bad at all. I have been out until 1–2am every night, and I need to sleep early soon. Overall, I think I will have a good year. I just need to keep myself busy and I will get through it because when I am not busy and I’m alone, I begin to think about life and all the things I have missed from home. But so far, so good. ",
            "date": "Answered September 26, 2018",
            "views": "388",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Angelica Williams",
                    "user_href": "/profile/Angelica-Williams-40"
                }
            ]
        }
    ]
}