{
    "title": "How is aging perceived in your country? - Quora",
    "tags": [
        "Perception",
        "Longevity",
        "Senior Citizens",
        "Country Comparisons",
        "Aging",
        "Age",
        "Countries of the World"
    ],
    "response": [
        {
            "author_info": {
                "name": "Riaan Botes",
                "href": "/profile/Riaan-Botes-7"
            },
            "answer_text": "The long and short of the matter is that here, in South Africa, you have to define your own trajectory for the aging process. Access to information still remains an issue in the majority of places, especially rural areas. Health literacy remains low while non-communicable disease is an ever increasing issue for the aging population. Aging is still seen as something to be feared, but with appropriate measures to control and adapt a few lifestyle factors can significantly improve personal and societal healthy standard of living. The idea that aging is a disease is still a very prevalent concept, but I believe that the aging process is also a mental process and attitude that must be cultivated to be resilient and realistic about the road ahead. Unfortunately, health strategies in South Africa still focus of “curing” people when they are already presenting with a chronic or acute disease. Consequently, health care spending on managing disease affected life is enormous, for all age groups, however there is still a few that the aging population is a burden to society. ",
            "date": "Answered January 31, 2020",
            "views": "27",
            "upvotes": " Answer requested by Maxime Sauvaget",
            "upvoters": [
                {
                    "user_id": "Kostea Frunza",
                    "user_href": "/profile/Kostea-Frunza"
                }
            ]
        },
        {
            "author_info": {
                "name": "Josh Hill",
                "href": "/profile/Joshua-Hill-396"
            },
            "answer_text": "Very negatively, I’m afraid, in the United States. In traditional societies that remain hierarchical or were or are highly static, the elderly are treated with great honor and respect. Age in those countries is connected with wisdom and is to be deferred to. In the US, on the other hand, with its emphasis on creativity, disruption, and change, the image of the elderly person is that of a doddering fool who drowns in his soup (thank you, Mary Hartman). Youth and innovation are celebrated, while people who cross the 50-year mark experience rampant age discrimination and elderly people are the butt of jokes. We are apt to love the elderly people who are close to us — parents, grandparents — but to think of others with mild if often affectionate contempt. It’s an unfortunate consequence of a society that is highly dynamic, competitive, and chaotic rather than hierarchical. ",
            "date": "Answered January 29, 2020",
            "views": "127",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Atipic Micu",
                "href": "/profile/Atipic-Micu"
            },
            "answer_text": "It makes me sad. Ageing is a time of decrease in physical capacities, in mental and sensorial ones. Health also often deteriorates, it is an unpleasant time for most people. I hope the science will soon be able to solve ageing, it will be a great time then. But this is my view of aging, for most Romanians aging is in the nature of things (it surely is), a fatality, even a time some are looking forward to because they will cease working and live by their pension. Many Romanians also believe that aging makes you wiser and milder when, in fact, it only makes you bitter and frustrate (as I can witness daily in the old people behavior), at an age considerably past fifty, I’m already a no bias observer of that. ",
            "date": "Answered January 30, 2020",
            "views": "36",
            "upvotes": " Answer requested by Maxime Sauvaget"
        }
    ]
}