{
    "title": "How is UPES for BA economics hons? - Quora",
    "tags": [
        "University of Petroleum and Energy Studies (UPES Dehradun)",
        "Bachelor of Arts Degrees",
        "Economics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Megha Jain",
                "href": "/profile/Megha-Jain-316"
            },
            "answer_text": "Hi, UPES is a good choice for BA Economics Hons. as the program is offered with specialization in in Energy Economics. You will be exposed to core economics with various aspects of energy in order to understand and develop skills to manage challenges faced in the sector. The faculties are even more experienced and cooperative who will guide you through out the course. UPES provide sector specific understanding and knowledge to the students to make them a better professional. I have always received good feedback about UPES so i believe you can apply for it. But if you are serious about pursuing the course from UPES, make it fast as admissions are on and might close soon. For more information you can visit their website. ",
            "date": "Answered July 27, 2017",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Additi Nema",
                    "user_href": "/profile/Additi-Nema-1"
                },
                {
                    "user_id": "RAVI KIRAN Karlapalem",
                    "user_href": "/profile/RAVI-KIRAN-Karlapalem"
                },
                {
                    "user_id": "Avery Biswas",
                    "user_href": "/profile/Avery-Biswas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Darpan Jain",
                "href": "/profile/Darpan-Jain-45"
            },
            "answer_text": "Hi, BA Economic hon at UPES with specialization in Energy Economics helps the students to create professionals for the energy sector. The students are exposed to core economics with various aspects of energy in order to understand and develop skills to manage challenges faced in the sector. It focus on communication and soft skill training. At UPES they provide economic hons with specialization i.e energy economics. You can select from the following Career Prospects: Actuarial AnalystData AnalystResearch AnalystEconomistFinancial Risk AnalystForensic AccountantInvestment AnalystStatisticianStockbrokerNonprofit organizationsManagement consultantFor more details visit: http://www.upes.ac.in/upes_baee/ba-energy-economics.php Happy to help! ",
            "date": "Answered May 19, 2017",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "RAVI KIRAN Karlapalem",
                    "user_href": "/profile/RAVI-KIRAN-Karlapalem"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aby Manimala",
                "href": "/profile/Aby-Manimala"
            },
            "answer_text": "The student strength for this course is very low. But they provide coaching classes for Civil Service examination. ",
            "date": "Answered May 14, 2017",
            "views": "364",
            "upvotes": "0"
        }
    ]
}