{
    "title": "How would you teach someone to move forward with his or her life? - Quora",
    "tags": [
        "Advice for Daily Life",
        "Self-Improvement Advice",
        "Understanding Self-Improvement",
        "How-to Question",
        "Important Life Lessons",
        "Self-Improvement",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Bailey",
                "href": "/profile/David-Bailey-11"
            },
            "answer_text": "Tell a story from your life or a close friends' experience that illustrates the principle and consequences that you are trying to teach. People naturally resist others' attempts to influence or control their lives unless they have a deep relationship of trust with that person. The most effective way to teach a principle when there is either misunderstanding or resistance is to tell a story. Research has shown that animals and people experience a sympathetic neurological response when they see or hear something that triggers memories of past experience. This provides a way to have someone consider information that they might otherwise reject out of hand. The most influential stories are true and reflect first-hand experience.   For more like this, follow me and my blog Seeking Happiness. ",
            "date": "Updated March 20, 2015",
            "views": "272",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maria Luna",
                    "user_href": "/profile/Maria-Luna-8"
                },
                {
                    "user_id": "Liisa Anna Elina",
                    "user_href": "/profile/Liisa-Anna-Elina"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shena Crowe",
                "href": "/profile/Shena-Crowe"
            },
            "answer_text": "You cannot exercise anyone else's potential.   If you want to offer support and direction, two major factors here:  what are they moving forward from, and what are their incentives and motivations to do so?  And I guess I have to ask if there are challenges such as mental illness or addiction involved. If the last is true - mental or physical blocks - then those need to be dealt with first. If they are just immature, they'll have to have their own reckoning to realize they can be more in their life.  If they are moving forward from a loss, trauma, tragedy, or something weighty, carefully consider grief counseling and see above - mental and physical blocks. What are their motivations and incentives?  Is there anything that gets them moving other than their current choices? I will reiterate:   you cannot exercise someone else's potential.  You are at risk of wasting your own life if you try. ",
            "date": "Answered October 10, 2014",
            "views": "164",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jo Stone",
                    "user_href": "/profile/Jo-Stone"
                }
            ]
        }
    ]
}