{
    "title": "How much time you need to stay in Canada to get a PR? - Quora",
    "tags": [
        "Permanent Residency",
        "Visas in Canada",
        "Permanent Residency in Canada"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yatin Kumar",
                "href": "/profile/Yatin-Kumar-94"
            },
            "answer_text": "Dear, I think you are asking about maintaining your PR status, because, an eligible person can apply and obtain a Canadian PR even if he or she stays outside, say in any country around the globe. So, if you are asking about how much time you must stay in Canada to maintain your status, then there is a basic residency requirement set by the IRCC which is mandatory for every PR holder. As per the requirement, the duration is a minimum of 2 years, i.e. 730 days. Remember, you must be physically present in the country for the mentioned period within a total 5-year duration. Though, these 730 days need not be in a continuation. A lot of people also ask whether the days spent abroad is counted toward their permanent resident status or not? So, it majorly depends on the purpose of travel and with whom you travel. The time you spend outside Canada can be counted toward your status if you meet anyone the following conditions: If you are working outside the country: You must work full-time for a Canadian organization, or federal, territorial or provincial government. If you are traveling with your spouse or common-law partner: Your spouse or common-law partner must be a citizen or a PR holder working outside the country on a full-time basis for Canadian organization, or federal, territorial or provincial government If you are a dependent child and traveling with your parent: Your parent must be a citizen or a permanent resident working outside the country on a regular basis for Canadian organization, or federal, territorial or provincial government If any other pops-up in your mind with reference to your permanent residency card, expiration date, etc. you can always talk to our team of advisors at Canada PR Avenue. ",
            "date": "Answered April 9, 2020",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sathish Bommineni",
                    "user_href": "/profile/Sathish-Bommineni"
                }
            ]
        },
        {
            "author_info": {
                "name": "Komal Papneja",
                "href": "/profile/Komal-Papneja"
            },
            "answer_text": "You don’t actually need to stay in Canada to get Permanent Residence. Even outlanders can apply. To maintain your status as a permanent resident, you need to land before your COPR (Confirmation of Permanent Residence) expires, which is usually 1 year after you passed your medical. You also need to stay 2 years in Canada out of a 5-year period to maintain your PR status. To apply for citizenship, you must be present in Canada for 3 years out of five years (the rule has recently been changed from four years out of 6 years and is to be applied soon from fall onward). The number of days you need to be present in Canada in each calendar year was 183 days earlier. It might change when the rule is implemented. ",
            "date": "Answered June 26, 2017",
            "views": "231",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ralph Nicole Andalis",
                    "user_href": "/profile/Ralph-Nicole-Andalis"
                },
                {
                    "user_id": "Jojo Corleone",
                    "user_href": "/profile/Jojo-Corleone-1"
                },
                {
                    "user_id": "Aniriddha Wakchaure",
                    "user_href": "/profile/Aniriddha-Wakchaure"
                },
                {
                    "user_id": "Somesh Gyanchandani",
                    "user_href": "/profile/Somesh-Gyanchandani"
                },
                {
                    "user_id": "Sasank Samudrala",
                    "user_href": "/profile/Sasank-Samudrala"
                },
                {
                    "user_id": "Lovett Maria King",
                    "user_href": "/profile/Lovett-Maria-King"
                },
                {
                    "user_id": "Ajay Khanna",
                    "user_href": "/profile/Ajay-Khanna-72"
                },
                {
                    "user_id": "Rahul Singh",
                    "user_href": "/profile/Rahul-Singh-14567"
                },
                {
                    "user_id": "Sumayya Ansari",
                    "user_href": "/profile/Sumayya-Ansari-6"
                },
                {
                    "user_id": "Aravind Kumar",
                    "user_href": "/profile/Aravind-Kumar-110"
                },
                {
                    "user_id": "Kavita Chopra",
                    "user_href": "/profile/Kavita-Chopra-23"
                },
                {
                    "user_id": "Trupti Mali",
                    "user_href": "/profile/Trupti-Mali-4"
                },
                {
                    "user_id": "Shivam Sharma",
                    "user_href": "/profile/Shivam-Sharma-59-1"
                },
                {
                    "user_id": "Nima Houssein",
                    "user_href": "/profile/Nima-Houssein-3"
                },
                {
                    "user_id": "Zara",
                    "user_href": "/profile/Zara-196"
                },
                {
                    "user_id": "Serhat Dağlı",
                    "user_href": "/profile/Serhat-Dağlı"
                },
                {
                    "user_id": "Parminder Singh Khanduja",
                    "user_href": "/profile/Parminder-Singh-Khanduja"
                },
                {
                    "user_id": "Javeed Ali",
                    "user_href": "/profile/Javeed-Ali"
                },
                {
                    "user_id": "Guru Kalle",
                    "user_href": "/profile/Guru-Kalle"
                },
                {
                    "user_id": "Ryan Thomas",
                    "user_href": "/profile/Ryan-Thomas-69"
                },
                {
                    "user_id": "Siddy",
                    "user_href": "/profile/Siddy-14"
                },
                {
                    "user_id": "Ankita Chheda Mapara",
                    "user_href": "/profile/Ankita-Chheda-Mapara"
                },
                {
                    "user_id": "Ken Adams",
                    "user_href": "/profile/Ken-Adams-349"
                },
                {
                    "user_id": "Otto Scholl",
                    "user_href": "/profile/Otto-Scholl"
                },
                {
                    "user_id": "Sonia Belgaokar",
                    "user_href": "/profile/Sonia-Belgaokar"
                },
                {
                    "user_id": "Aseem Mohammed",
                    "user_href": "/profile/Aseem-Mohammed-4"
                },
                {
                    "user_id": "Anil",
                    "user_href": "/profile/Anil-576"
                },
                {
                    "user_id": "Rohit Bl",
                    "user_href": "/profile/Rohit-Bl"
                },
                {
                    "user_id": "Nikhil",
                    "user_href": "/profile/Nikhil-338"
                },
                {
                    "user_id": "Kashish Parikh",
                    "user_href": "/profile/Kashish-Parikh"
                },
                {
                    "user_id": "Dhammadeep Borkar",
                    "user_href": "/profile/Dhammadeep-Borkar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amit Singh",
                "href": "/profile/Amit-Singh-16626"
            },
            "answer_text": "When you apply for Permanent residence status in Canada, you are legally declaring that you want to reside and work in Canada on a permanent basis. During this time period, you can make friends, can marry and explore the vibrant country. Well, there is no need to stay in Canada to get a PR. When you apply for Canada PR from India, and get the COPR, you can move to Canada by meeting your health and character requirements. Post landing into Canada, you just need to apply for a PR Visa card that you get within a week or so. Post getting the PR Visa card in Canada, you have the freedom to live, work and study anywhere in Canada for a period of 5 years. So, there is no need to stay in Canada to get a PR as all the work is done from your home country only, as there is no such requirement. Also, you can apply for Canadian Citizenship post living in Canada for 3 years. I hope this information might be helpful! Good Luck! ",
            "date": "Answered October 26, 2020",
            "views": "62",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Temi Oye",
                "href": "/profile/Temi-Oye"
            },
            "answer_text": "You may leave as soon as you are granted entry into Canada and have completed the landing procedure for first time immigrants. Technically, you may take the next flight out from the airport without entering the city! You would need a Permanent Resident Travel Document (PRTD) to re-enter though. You can check the CIC website for more information on Travel Documents. Make sure that there is a Canadian embassy in your home country though. I am sure that the IRCC is not looking to trap new immigrants here through its immigration system. As a PR, you are free to come and go as you wish. Of course, once you receive your PR card (which takes about 60 days to process), you can enter Canada freely, without needing to apply for the PRTD. Follow my journey to Canada here - My Canadian Fling – From Lagos to Ontario with love .... ",
            "date": "Answered November 3, 2017",
            "views": "142",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vivek Nipani",
                    "user_href": "/profile/Vivek-Nipani"
                },
                {
                    "user_id": "Samantha Ndlovu",
                    "user_href": "/profile/Samantha-Ndlovu-11"
                },
                {
                    "user_id": "Asher Sayed",
                    "user_href": "/profile/Asher-Sayed"
                },
                {
                    "user_id": "Prince Rose Singh Dhillon Harman",
                    "user_href": "/profile/Prince-Rose-Singh-Dhillon-Harman"
                },
                {
                    "user_id": "Bhavin Pandya",
                    "user_href": "/profile/Bhavin-Pandya-29"
                },
                {
                    "user_id": "Abhishek Chakrabarti",
                    "user_href": "/profile/Abhishek-Chakrabarti-3"
                },
                {
                    "user_id": "Navin Kotian",
                    "user_href": "/profile/Navin-Kotian-3"
                },
                {
                    "user_id": "Reshma Asrani",
                    "user_href": "/profile/Reshma-Asrani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly Johnson",
                "href": "/profile/Kelly-Johnson-1407"
            },
            "answer_text": "Foreign nationals can get a Canadian Permanent Residence even without actually staying in the country. They can easily apply for PR from outside through the various immigration streams of Canada. However, after getting permanent residency in Canada, you must ensure that you meet certain obligations and maintain your permanent resident status. The quintessential requirement is that you stay in Canada for at least 2 years in a 5-year long period. So, you can spend 3 years outside of Canada. If for some reason you are not able to comply with this requirement, you must contact the IRCC and inform about your situation. ",
            "date": "Answered September 18, 2020",
            "views": "453",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adalia Belmonte",
                    "user_href": "/profile/Adalia-Belmonte"
                },
                {
                    "user_id": "Ceylon Perera",
                    "user_href": "/profile/Ceylon-Perera"
                },
                {
                    "user_id": "Quyen Bui",
                    "user_href": "/profile/Quyen-Bui-47"
                },
                {
                    "user_id": "Isabella Garcia",
                    "user_href": "/profile/Isabella-Garcia-10-1"
                },
                {
                    "user_id": "Aron Hank",
                    "user_href": "/profile/Aron-Hank-1"
                },
                {
                    "user_id": "Shraddha Roy",
                    "user_href": "/profile/Shraddha-Roy-28"
                },
                {
                    "user_id": "Hazel Baker",
                    "user_href": "/profile/Hazel-Baker-24"
                },
                {
                    "user_id": "Manowar Hushain",
                    "user_href": "/profile/Manowar-Hushain-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bengt Lindvall",
                "href": "/profile/Bengt-Lindvall"
            },
            "answer_text": "You cannot “stay in Canada” because you have no way of entering Canada. You may visit for a short period, but there is ABSOLUTELY NO WAY that you could even think of applying to immigrate then. You MUST apply to immigrate. That is a one to five year process. Start here: Do you want to come to Canada, or extend your stay? ",
            "date": "Answered May 24, 2018",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Everard Braganza",
                    "user_href": "/profile/Everard-Braganza"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brett Williams",
                "href": "/profile/Brett-Williams"
            },
            "answer_text": "At least two years within any five year period. How long must I stay in Canada to keep my permanent resident status? It’s a little more complicated than that depending on marital status, but that’s a good rule of thumb. Check the official Canadian government sites. ",
            "date": "Answered October 31, 2018",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zara",
                    "user_href": "/profile/Zara-196"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Crooks",
                "href": "/profile/Robert-Crooks-8"
            },
            "answer_text": "You need to get y our PR BEFORE you come to Canada. Immigrate to Canada ",
            "date": "Answered May 24, 2018",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Viola Yee",
                    "user_href": "/profile/Viola-Yee"
                }
            ]
        }
    ]
}