{
    "title": "How should I study to get better grades in high school if I don’t know how to study? - Quora",
    "tags": [
        "Grades (education)",
        "Studying Advice",
        "High School Education",
        "The High School Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Angela Hemsworth",
                "href": "/profile/Angela-Hemsworth"
            },
            "answer_text": "First of all, you have to be SMART. What you have to realize is that everyone in life expects results. Parents, professors, managers, and bosses – everyone wants you to deliver results. Hard truth I had to learn to pursue better grades is that the educational process itself doesn’t matter. Cheat the test and get an A. Cram all night, get a bunch of dumb questions and please have your C+. I studied really hard for the whole week/month/term/year! No one cares, the result is not there, catch a’ later. To get the result, I eventually concluded that I must be SMART. What does it mean?  Study like you mean it. I never treat studies haphazardly. If I’m to produce an essay or learn certain material, I roll up the sleeves, put any distractions aside and just do it. Friend calls? Will call back later. Fire in the building? Doesn’t matter, got to study. Knowledge for me, grades for teachers. Understand this and you’re good to go. Decide on your learning type. There’re “listeners,” those who's great at perceiving information by ear, e.g. in an auditorium during a lecture or while doing listening. There’re also “visuals,” those who learn best with a textbook in front of them. The more charts and diagrams to it, the better. Finally, there’re “practicals,” those who like me prefer the hands-on approach, learning in the process of doing something. Which type of learners do you belong to? Stick to it and learning the college program will become much easier. Master time-management. Juggling several tasks effectively and managing time properly is the key to securing results in college. Laziness is off the table. I’ve got myself a girlfriend, got a part-time job, got my share of partying with hommies, and I still have enough time to study. So, your argument of starting on essays at the eleventh hour is irrelevant. Don’t even want to hear of any lame excuses a lazy bone reproduces! Want to get better grades? Start from doing assigned papers at a proper time. You don’t have to “know how to study” to do that. Thank me later.  Do whatever it takes. Professors never cut me any slack, perhaps that’s why I don’t have any pink shades on my eyes. They want a great paper, I provide. How do I provide? It depends. I’m a practical guy, so when a composition is due, I consider the options. Write the thing myself or delegate to a writing service. To add the feel of completeness to a paper, I forward the texts for professional editing, where a subject-relevant writer tailors the draft to perfection. Costs me quite a dime, totally worth it though. Cheating? Please… Grow up already; you’re in college! Sleep on it. Writing essays, I found out that proofreading is rather key. To improve quality of compositions, meaning better grades, all I had to do was sleep on papers and commence proofreading the next day. With a fresh head on your shoulders, there’ll be plenty of errors and typos omitted the previous day. Trust me on that; it’s where a chasm of difference between an A+ and B paper lies. Hope you’ll find these tips useful! Some might sound beat up, but these are usually the essentials that make up the foundation of effective studying. Cheers! ",
            "date": "Answered April 17, 2018",
            "views": "65",
            "upvotes": " View 41 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lovisa Notting",
                    "user_href": "/profile/Lovisa-Notting-2"
                },
                {
                    "user_id": "HANA BEHRIC",
                    "user_href": "/profile/HANA-BEHRIC"
                },
                {
                    "user_id": "Sarah Chichlowska",
                    "user_href": "/profile/Sarah-Chichlowska"
                },
                {
                    "user_id": "Lucian Lees",
                    "user_href": "/profile/Lucian-Lees"
                },
                {
                    "user_id": "K M",
                    "user_href": "/profile/K-M-1781"
                },
                {
                    "user_id": "Sofia Wyszynsky",
                    "user_href": "/profile/Sofia-Wyszynsky"
                },
                {
                    "user_id": "Haley Nguyen",
                    "user_href": "/profile/Haley-Nguyen-47"
                },
                {
                    "user_id": "Khalid Abdi",
                    "user_href": "/profile/Khalid-Abdi-11"
                },
                {
                    "user_id": "Emmanuel Agama",
                    "user_href": "/profile/Emmanuel-Agama"
                },
                {
                    "user_id": "Ilwad Samater",
                    "user_href": "/profile/Ilwad-Samater-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Contessa Petrini",
                "href": "/profile/Contessa-Petrini-2"
            },
            "answer_text": "Learning how to study is very crucial to retention and mastery. The first thing you need to do is figure out what your learning style may be. You could be visual, auditory or hands-on. Take this quiz to tell you what your learnng style is: What's Your Learning Style? 20 Questions Then based off of them if you are Auditory learners: tend to have incredible memories for past conversations (such as jokes).have a great memory for music and lyrics.enjoy discussions, debates, and talking to others.enjoy listening to music, and sing/hum/whistle to themselves.They prefer to give oral presentations over written reports (although this also has a lot to do with confidence!).may read slowly.may have difficulty interpreting complicated graphs, maps or diagrams.Study Tips for Auditory Learners Auditory learners should try to incorporate study techniques that have them either listening to information and repeating it out loud. Ask questions All auditory learners should aim to ask questions during a lesson. Even a simple question will greatly increase information retention. This way, their teacher will put an idea into words, or paraphrase what they’ve been saying. Watch videos This is another thing that Auditory learners can do during their study periods. The Khan Academy website is a great place for this. The site currently has over 1800 videos (all produced by one very smart guy with 4 university degrees, whom Bill Gates’ professed as his favourite teacher!) predominantly science and maths focussed. YouTube is another website that has hundreds of educational videos. But be careful – it’s also one of the most powerful procrastination tools in the world! Use word association Word association can be a great way to learn facts and lines. Auditory learners make better connections when facts can be repeated out loud – especially when in a memorable fashion. Mnemonic devices are a great way to help remember facts. Repeat aloud Auditory learners can benefit from repeating information out loud to themselves. Even better than pure repetition would be to paraphrase, or pick out the main points of what they’ve just learnt and say it to themselves. Participate in discussions Unfortunately discussion groups at high school can be quite distracting, meaning they aren’t a normal part of classroom life. But you can talk to your child about what they’ve learnt today. If you don’t understand it – even better! Teaching is the best way to learn! Visual learners: loves pictures and diagrams.is good at reading maps and charts.create strong pictures in their minds when they read.like bright colours (and fashions).may have to think for a bit to process a speech or lecture.Study Tips for Visual Learners Visual Learners should try to make use of diagrams and charts while they study. This is becoming easier as there is now so much educational material put in these formats. Use highlighters Visual Learners love using highlighters. They make things bright and colourful while making the important bits stand out. When making their own notes they should develop their own highlighting system. Consistently highlighting certain types of facts in predefined colours will help Visual Learners sort out where facts sit in their heads. Use flash cards While flash cards are a fantastic learning technique for Kinaesthetic Learners, they can also be a great way for Visual Learners to study. They are particularly effective if used with diagrams or charts. E.g. What is this part of a cell called, what does it do? What does a graph that looks like this mean? Who is this, when was she born and what did she do? Replace words with symbols or initials This simple tip can help speed up the process of making study notes. It also gets Visual Learners to associate symbols with concepts, rather than words – increasing the strength of association. Finally , Kinesthetic learners: are good with their hands. They enjoy building models and putting things together (or breaking them!)are good at remembering things they’ve actually done before. E.g. cooking meals, putting together computers, jigsaw puzzles.enjoy active learning at school, such as PE and science experiments.enjoy playing sport.like adventure books and movies.become fidgety when sitting for a long period of time.do not tend to have great handwriting or spelling.Use flash cards Flash cards make kinesthetic learners turn simple recall into a game. This makes them perfect for kinesthetic learners. Simply write a question or topic suggestion on one side of a card, and the answer or a list of details they should remember on the other side. Study in short blocks Kinesthetic learners tend to have a relatively short attention span when they’re studying. But this doesn’t mean they shouldn’t be doing just as much study as everyone else. They should break their study up into shorter periods, but also take shorter breaks. Forcing a kinesthetic learner to study for an hour at a time can be counter-productive. Regular 5 minute breaks can often be all they need to help them study far more. Use plenty of examples when writing study notes Many main points and concepts can be demonstrated with examples. Kinesthetic learners tend to make better associations with the examples than just the plain facts. For example, most science concepts can be backed up with specific examples. E.g. instead of just remembering the formula, F = m × a, you can think of a cellphone being dropped from a second story balcony, and how force, mass, and acceleration are related. (The more personal or relatable to their everyday life the better) Many of the arts subjects include many examples and case studies. Try and get your child to think of these ‘situations’, not just the plain facts. Study with other people Kinesthetic learners enjoy discussion. Talking about what they’ve learnt is often a great way to consolidate what they’ve learnt. This tip is suggested with caution! This is because students often use ‘study groups’ as a way to hang out outside of school. As a parent, you could try and have a discussion with your child about what they’ve learnt. Combining this with flash cards is a perfect way for parents to contribute to their child’s study. Do something while you study Tap a pencil, squeeze a stress ball, or do something to occupy the want to do something with their hands without becoming a distraction. Just make sure that this doesn’t become a distraction itself! Citation: http://www.thestudygurus.com I hope this helps. ",
            "date": "Answered May 25, 2017",
            "views": "14",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hae Min Kim",
                    "user_href": "/profile/Hae-Min-Kim-2"
                },
                {
                    "user_id": "Shoshi Shoshi",
                    "user_href": "/profile/Shoshi-Shoshi-2"
                },
                {
                    "user_id": "Abi Vignesh",
                    "user_href": "/profile/Abi-Vignesh-4"
                },
                {
                    "user_id": "Yash Nayak",
                    "user_href": "/profile/Yash-Nayak-33"
                },
                {
                    "user_id": "Farah Shabana",
                    "user_href": "/profile/Farah-Shabana"
                },
                {
                    "user_id": "Tony George",
                    "user_href": "/profile/Tony-George-89"
                },
                {
                    "user_id": "Kimberly Vu",
                    "user_href": "/profile/Kimberly-Vu-1"
                },
                {
                    "user_id": "Elias Flowers",
                    "user_href": "/profile/Elias-Flowers-1"
                },
                {
                    "user_id": "Mikhnevich Yuliya",
                    "user_href": "/profile/Mikhnevich-Yuliya"
                },
                {
                    "user_id": "ADFood",
                    "user_href": "/profile/ADFood"
                }
            ]
        }
    ]
}