{
    "title": "How is science and technology interrelated with health, population and environment? - Quora",
    "tags": [
        "Population Health",
        "Populations",
        "The Environment",
        "Science",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ronen Acharya",
                "href": "/profile/Ronen-Acharya"
            },
            "answer_text": "Science and technology has affected all aspects. It has facilitated people to travel easily from one place to another with prior information about the places. Various machines, weapons and tools have been developed with science and technology. Men can easily perform their activities with such products. Technology has also affected health of the environment and population. With the help of such products, development of knowledge and skill of such subjects have been accelerated but there is dreadful risk of their misuse too. World War,cyber crime,excessive carbon emission are some negative aspects of science and technology. If we use the scientific knowledge and skill rationally, aspects of environment,population and health are effectively developed. It helps to fulfill the objectives of those subjects. The HPE is a value related subject. In order to change the inappropriate traditional values, they should be tested scientifically.Various information, education and communication (IEC) media necessary for this subject are based on science and technology. Use of internet, email and multimedia are related to this subject. ",
            "date": "Answered June 3, 2020",
            "views": "29",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Puja Gurung",
                    "user_href": "/profile/Puja-Gurung-99"
                },
                {
                    "user_id": "Mani Raj Syangtan",
                    "user_href": "/profile/Mani-Raj-Syangtan"
                },
                {
                    "user_id": "Neharika Acharya",
                    "user_href": "/profile/Neharika-Acharya"
                },
                {
                    "user_id": "Kamala Pandey",
                    "user_href": "/profile/Kamala-Pandey-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Soo",
                "href": "/profile/Bill-Soo"
            },
            "answer_text": "I don't have hard numbers or links on this. The following is simply my opinion. Science and technology are relatively modern developments. For most of the past 50,000 years of civilization, there was religion, dogma, ritual an tradition. These kept civilization safe but prevented growth. After the modern scientific method was developed during the Rennaisance, civil action took off. Health, as expressed as life expectancies, has increased massively. Population growth has increased to levels thought impossible before. But yes, the environment has suffered. In my view, before science mankind was blind and took careful halting steps forward. Now we can see and go running forth. Occasionally we trip. But we are no longer blind. ",
            "date": "Answered August 15, 2017",
            "views": "31",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Prabesh Man Shrestha",
                    "user_href": "/profile/Prabesh-Man-Shrestha"
                },
                {
                    "user_id": "Neelam Shrestha",
                    "user_href": "/profile/Neelam-Shrestha-20"
                },
                {
                    "user_id": "Blazing Lion",
                    "user_href": "/profile/Blazing-Lion-1"
                },
                {
                    "user_id": "Nisan Pun Magar",
                    "user_href": "/profile/Nisan-Pun-Magar"
                },
                {
                    "user_id": "Sumina Kc",
                    "user_href": "/profile/Sumina-Kc-1"
                },
                {
                    "user_id": "Mike Pogose",
                    "user_href": "/profile/Mike-Pogose"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hrair Keleshian",
                "href": "/profile/Hrair-Keleshian"
            },
            "answer_text": "Health, population and the environment are are totally dependent today on science and technology. With the industrial revolution came a population explosion and stresses on the environment we needed science and technology to solve all the problems that was being created by population growth, so you see without the sciences and technology the population health of the population and the environment will suffer and bring everything to a stand still. ",
            "date": "Answered May 3, 2019",
            "views": "13",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aruna Rai",
                    "user_href": "/profile/Aruna-Rai-51"
                },
                {
                    "user_id": "Mani Raj Syangtan",
                    "user_href": "/profile/Mani-Raj-Syangtan"
                },
                {
                    "user_id": "Boro Boro",
                    "user_href": "/profile/Boro-Boro-25"
                },
                {
                    "user_id": "Dev Chandra Tha Shrestha",
                    "user_href": "/profile/Dev-Chandra-Tha-Shrestha"
                },
                {
                    "user_id": "Neelam Shrestha",
                    "user_href": "/profile/Neelam-Shrestha-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Davita Farley",
                "href": "/profile/Davita-Farley"
            },
            "answer_text": "What sciences (health, demographics, environment, etc) are there for you to be in that doesn’t benefit from technology? Are you asking how you use science and technology? Modelling, playing what if, testing, discovery and the list goes on. ",
            "date": "Answered August 15, 2017",
            "views": "696",
            "upvotes": " Answer requested by Aryan Dwivedy"
        }
    ]
}