{
    "title": "How to know whether I can become a good teacher or not - Quora",
    "tags": [
        "Jobs and Careers in Education",
        "Education and Career Advice",
        "Teachers",
        "Teaching",
        "Character and Personality",
        "Self-Improvement",
        "Education",
        "Jobs and Careers",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rajesh Mangal",
                "href": "/profile/Rajesh-Mangal-3"
            },
            "answer_text": "It’s simple as testing any dish , if it taste better then it should be better comparatively. good teacher should be humble and knowledgeable for their scope of knowledge . a good teacher should love his or her work first of all else it will difficult to show dedication them and if dedication does not come up with their work then no child will not benefited with you efforts and you will not be appreciated and if you will not be appreciated then you will not be rewarded and will not make you happy. thanks !! ",
            "date": "Answered March 7, 2019",
            "views": "70",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashwin Suresh",
                    "user_href": "/profile/Ashwin-Suresh-68"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vaishnavi Patel",
                "href": "/profile/Vaishnavi-Patel-71"
            },
            "answer_text": "Okay! So becoming a good teacher doesn't always mean by having bulk of knowledge and degree. For becoming a good teacher one must comprise the quality of patience, humbleness and influencing command.One should not always expect to there students they should rather understand capability of the students and accordingly work on it According to me one should analysis these properties in oneself to reaveal that he/she can be a good teacher or not. Thank you ",
            "date": "Answered March 7, 2019",
            "views": "36",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashwin Suresh",
                    "user_href": "/profile/Ashwin-Suresh-68"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Thomas",
                "href": "/profile/Jack-Thomas-281"
            },
            "answer_text": "1- Do you Love the subject you want to teach? 2- Do you have immense patience? 3- Are you willing to learn something new every day? 4- Can you live on very little income? If yes to all four, Start teaching and in a decade you will know the answer to your question. ",
            "date": "Answered March 7, 2019",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohan Rao Nagoji",
                "href": "/profile/Mohan-Rao-Nagoji"
            },
            "answer_text": "Certain qualities and qualifications are needed to become a good teacher. Good knowledge of the subject, good command over the language, clarity of thought, clarity of expression, communication skills, no stage fear, capacity to make students get interested in the topic and subject taught, tactful handing of students, above all the love towards your profession. ",
            "date": "Answered March 7, 2019",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ayesha Siddiqa",
                    "user_href": "/profile/Ayesha-Siddiqa-17"
                }
            ]
        }
    ]
}