{
    "title": "How is Paavai Engineering College, Namakkal? - Quora",
    "tags": [
        "Paavai Engineering College"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nidhi Priya",
                "href": "/profile/Nidhi-Priya-131"
            },
            "answer_text": "Paavai Engineering College, Namakkal is an autonomous institute established in the year 2001. The institute is approved by the All India Council for Technical Education (AICTE), Ministry of Human Resource Development, Government of India, New Delhi. PEC is accredited by the National Assessment and Accreditation Council (NAAC) and the National Board of Accreditation (NBA). The college offers undergraduate (BE, B.Tech), and postgraduate (ME, M.Tech, MBA, MCA) courses to the students. Paavai Engineering College, Namakkal claims to have well-developed infrastructure such as library, auditorium, medical centre, etc. Paavai Engineering College, Namakkal provides a plethora of opportunities to the students to be a part of extracurricular activities through various clubs such as Fine Arts Club, Photography Club, Sports and Games Club, Trekking Club, etc. Students of PEC are placed in top-notch companies and according to the placement data released by the institute for the year 2019, it was observed that 1899 students got placed and around 63 companies visited the campus to conduct the recruitment drive. Some of the top recruiters are listed below: InfosysIIFLWiproLarson and ToubroTVSTata Consultancy ServicesTech MahindraHCLAccentureURCCSSSISCO",
            "date": "Answered June 26, 2020",
            "views": "247",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dinesh Goyal",
                    "user_href": "/profile/Dinesh-Goyal-183"
                },
                {
                    "user_id": "Rujuta Deshmukh",
                    "user_href": "/profile/Rujuta-Deshmukh-5"
                },
                {
                    "user_id": "Shanta Upadhyay",
                    "user_href": "/profile/Shanta-Upadhyay-3"
                },
                {
                    "user_id": "Prerna Goel",
                    "user_href": "/profile/Prerna-Goel-78"
                },
                {
                    "user_id": "Tirana Dasgupta",
                    "user_href": "/profile/Tirana-Dasgupta"
                },
                {
                    "user_id": "Pravesh Sharma",
                    "user_href": "/profile/Pravesh-Sharma-217"
                },
                {
                    "user_id": "Apurva Tibrewal",
                    "user_href": "/profile/Apurva-Tibrewal-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ranjani Veerakumar",
                "href": "/profile/Ranjani-Veerakumar"
            },
            "answer_text": "In simple terms AVERAGE There's no good placement record.They charge for placement training but they couldn't take classes properly. Only about how to prepare resume( in my case)Environment is good but the toilets are not clean at all. Also no purified water.They only focus on cycle test and internals and not about the engineering knowledge and management skills.Hostel food is horrible ( I'm not stayed in that hostel but my classmates told me about that)IAS academy has a good library. If you want to prepare for service exams you can consider it (separate fees)If you're in any game or sport at state or national level then there is a chance to get some fee concession.There is no experienced staff in MBA. Not industry exposure. You have to really work hard and get your job.Hope this answer will help you. ",
            "date": "Answered May 13, 2020",
            "views": "184",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Milky Vishanth",
                "href": "/profile/Milky-Vishanth"
            },
            "answer_text": "1.first of all no assured placement in reputed firm. so make sure u get a job by u r self. 2.hostel food is rated tiffen-3/10 lunch-8/10 dinner-5/10 3.motivation is high 4.u have 2 come out of u r comfort zone and take part in all the activities in order to shine 5.department rating ece-6/10 civil-5/10 cse-5/10 it-5/10 mca-6/10 mech-5/10 chemical-5/10 eee-4/10 agri-3/10 aero-3/10 mba-4/10 my personal advice before joining a college look at its placement records, beaware many colleges show fake records. ",
            "date": "Answered May 26, 2018",
            "views": "300",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "PRAVIN BALU",
                    "user_href": "/profile/PRAVIN-BALU-1"
                },
                {
                    "user_id": "S Bavan",
                    "user_href": "/profile/S-Bavan-1"
                },
                {
                    "user_id": "Aayushi Dadhich",
                    "user_href": "/profile/Aayushi-Dadhich-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "AjithKumar",
                "href": "/profile/AjithKumar-28"
            },
            "answer_text": "strict ",
            "date": "Answered December 15, 2017",
            "views": "196",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paramesh Vadivel",
                    "user_href": "/profile/Paramesh-Vadivel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhuvaneswari Kamesh",
                "href": "/profile/Bhuvaneswari-Kamesh"
            },
            "answer_text": "It's an best college which has everything inside it.we can learn out future in everyday of the college with every new experiences ",
            "date": "Answered November 4, 2017",
            "views": "194",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ranjithkumar R",
                "href": "/profile/Ranjithkumar-R-30"
            },
            "answer_text": "It is one of the best engineering college around Tamil Nadu. And it is continuously keeping first place in Anna University sports board. ",
            "date": "Answered May 23, 2020",
            "views": "95",
            "upvotes": "0"
        }
    ]
}