{
    "title": "How does COVID 19 affect your children's life? - Quora",
    "tags": [
        "19 (age)",
        "Child Development",
        "Astrology",
        "Parents",
        "COVID-19 (2019-2020)",
        "Teenagers and Teenage Years",
        "Children",
        "Parenting",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Devin Shoulders",
                "href": "/profile/Devin-Shoulders"
            },
            "answer_text": "If you’re asking “what typically happens to children infected” typically they recover from it and are fineIf you’re asking “how they catch it” the same way any other person does. Breath droplets from someone asymptomatic/sick with the disease without knowning it. It could’ve also been passed through a surface but that’s less likely.In worst case scenario, the COVID stage of it isn’t what ends up doing the damage, its the inflammatory part after its passed that has been showing up in children. It’s rare but can still happen.Overall kids typically have a high recovery rate from this. The younger you are the less likely you’ll experience severe side effects. However it’s not 0% so it’s best to try to avoid catching it at all cost",
            "date": "Answered June 13, 2020",
            "views": "95",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dion Shaw",
                "href": "/profile/Dion-Shaw-3"
            },
            "answer_text": "Children, older than a year (not infants) have a lower rate of infection. According to an article on MayoClinic’s website, children account for less than 2% of cases. If a child contracts Covid-19, the infection is generally less severe than adults. This assumes affected children have no underlying conditions like diabetes. Common symptoms in children include: FeverRunny noseCoughDiarrheaMuscle achesVomitingBabies or infants are at higher risk of serious Covid conditions. It is believed this is due to immature immune systems and smaller airways. source: How COVID-19 (coronavirus) affects babies and children ",
            "date": "Answered July 28, 2020",
            "views": "168",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Katherine Michelle",
                "href": "/profile/Katherine-Michelle-33"
            },
            "answer_text": "my child says that the masks make him feel like he is suffocating with the mask on and you are scared that all of these other people are catching it and he is afraid that he will catch it too. he is more anxious in grocery stores than he was before. our neighbor caught covid 19 and my son says he is more terrified because it is close to home. he is happy however that he is doing virtual school this year. he is saying the more that he is hearing about it the worst it is making his anxiety about the situation. ",
            "date": "Answered August 26, 2020",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bill Tate",
                "href": "/profile/Bill-Tate-12"
            },
            "answer_text": "So far they've coped very well. My 9 year old did want to go out on her bicycle but understood why I said no and she has her 2 younger brothers to play with. My 5 year old son has really impressed me by \"competing\" with his big sister while she's doing her year 5 maths and getting them correct.They recon I'm a better teacher than the ones in school because I give them really interesting assignment such as making bread from scratch.We have an enclosed garden so they can still get out into the fresh air and get some fresh air.As I normally work away through the week, they're also getting to see Dad every day while I work from home. ",
            "date": "Answered March 25, 2020",
            "views": "106",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shondra Gilliam",
                "href": "/profile/Shondra-Gilliam"
            },
            "answer_text": "What do you mean? Physically or Emotionally? Physically, it’s the same as everyone else. Although, I read that kids who were thought to have COVID, it was something similar? It wasn’t called COVID. It was during/when New York was severely affected. Emotionally, they have a hard time understanding why there’s no school, activities, etc., suddenly. Being stuck at home, not always getting enough fresh air, all the uncertainty and unanswered questions. ",
            "date": "Answered June 14, 2020",
            "views": "36",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hong Phong Le",
                    "user_href": "/profile/Hong-Phong-Le-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rebecca Elizabeth",
                "href": "/profile/Rebecca-Elizabeth-127"
            },
            "answer_text": "Seems research says children are extremely unlikely to get or transmit Covid. COVID-19 really was only a problem for the elderly and those vulnerable with underlying conditions. ",
            "date": "Answered July 27, 2020",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mathur Ramabhadra Shastry Narasimha Murthy",
                "href": "/profile/Mathur-Ramabhadra-Shastry-Narasimha-Murthy"
            },
            "answer_text": "Children are not as affected by Covid-19 as old people. However, occationally, the virus becomes lethal and mat lead to the death of infected children. The precise reasons for this are not known. Murthy ",
            "date": "Answered June 15, 2020",
            "views": "27",
            "upvotes": " Answer requested by Ardhendu Mondal"
        },
        {
            "author_info": {
                "name": "Naeem Durrani",
                "href": "/profile/Naeem-Durrani-8"
            },
            "answer_text": "Childern regeneration system is very strong than old adults. This is the reason COVID-19 mutation or replication cannot affect healthy children's host DNA cells. This means, the mortality of COVID-19 in childern are 0%. ",
            "date": "Answered June 14, 2020",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nagarajan Margasahayam",
                "href": "/profile/Nagarajan-Margasahayam"
            },
            "answer_text": "Once they recover they acquire immunity. Everything will become normal as the virus is not known to cause permanent damage to any system. ",
            "date": "Answered June 15, 2020",
            "views": "25",
            "upvotes": " Answer requested by Ardhendu Mondal"
        }
    ]
}