{
    "title": "How to design engaging and flexible learning experiences - Quora",
    "tags": [
        "Design"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jean Pak",
                "href": "/profile/Jean-Pak"
            },
            "answer_text": "If the question is about designing engaging and flexible/virtual learning experiences, there’s a few suggestions I’ve found that help: Community -there needs to be a component of community building so that learners can connect, support and engage with each other. For anyone learning a new subject matter, the experience can be frustrating, overwhelming and isolating. Therefore, a message board and or forum allows learners to reach out to each other, ask questions, and collaborate.This can be done anytime, anywhere and is great for learners to hold themselves and their fellow peers accountable.Another suggestion is to incorporate breakout groups so that learners can get to know each other in smaller numbers and makes it less intimidating for those who are introverts.Activities /Games- This is key to include and incorporate without overdoing it. For example, if you’re teaching a math lesson incorporating an online puzzle/game that tests the concepts you’re teaching is one way of incorporating interactivity. You might also think about using interactive quizzes where learners can click and hover over different hotspots, with c a video and answer a question. See this article on how MIT Professional Education discusses similar challenges.Interactivity- making sure for example that if there’s an activity that would have been done in-person like perform a procedure on a cadaver the similar effect can be achieved online. I.e. There’s a lot of simulation softwares for nursing students that help replicate procedures done in-person but now virtually. See vSim for NursingMultimedia is key - mixing up animated and talking head videos so that students are not being fed the same style. Video technology has improved so much that there’s so many different ways of incorporating media styles in a course that engages and excites learners. See Videoscribe for sample whiteboard explainer videos that can be customized for your lesson, and simulate an actual whiteboard.Most of all, have fun with designing different learning experiences. There’s no one size fits all approach and trying different things and using what works is key for the people you’re teaching. ",
            "date": "Answered April 5, 2020",
            "views": "49",
            "upvotes": "0"
        }
    ]
}