{
    "title": "How to improve my math grades in high school as a teenager - Quora",
    "tags": [
        "Grades (education)",
        "High School Education",
        "Mathematics Education",
        "The High School Experience",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Foss",
                "href": "/profile/William-Foss-3"
            },
            "answer_text": "Make sure you read questions correctly and go backwards after finding an answer to make sure it’s right. I’ve made so many stupid mistakes on test, some of it even because I’ve read my own hand-writing wrong sometimes (and this has cost me many points over the years). Do whatever homework is assigned by your math teacher- the homework is usually designed to help you, and at least in my experience the math homework I’ve received in my last two years of school have not been busy work but have actually helped. If necessary, you can even go ask your teacher for help. That is exactly what they are there for- to teach you. If you aren’t understanding a certain concept or need help, then ask them after trying to find the solution yourself (if you are unable to do so or are unsure how to reach the right answer). ",
            "date": "Answered May 19, 2017",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "OJ",
                "href": "/profile/OJ-81"
            },
            "answer_text": "Practice, practice, and practice. I can only emphasize how important and effective it really is to practice. Don't practice math problems within your comfort zone. Step out of it, and challenge yourself to overcoming the difficulties you face in math. If you are going to waste time and practice on the things you feel comfortable with i.e 1+1, its not going to take you anywhere. Google for practice papers w. mark-schemes that match your current level. The web has a wealth of info. Do the papers, then grade yourself with the corresponding mark-sheme. Oh, and please don't cheat yourself, as this really requires a great deal of self-discipline. Finally, here is a formula for success I would like to share. Hard-work + commitment + persistence = success Results take time and patience mate. You cant get what you want immediately by plucking leaves off a tree. ",
            "date": "Answered May 21, 2017",
            "views": "276",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hallam Brown",
                    "user_href": "/profile/Hallam-Brown"
                },
                {
                    "user_id": "Neha Meena",
                    "user_href": "/profile/Neha-Meena-33"
                },
                {
                    "user_id": "Manasv Chhabra",
                    "user_href": "/profile/Manasv-Chhabra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan Varner",
                "href": "/profile/Ryan-Varner-2"
            },
            "answer_text": "Alright, as with anything you must practice. although there may be only one mathematical principle used to solve problems, there's most likely “loop holes”. By this I mean that maybe you can't use your mathematical principle until you algebraically rearrange your equation/function. Practicing also helps for test day when it helps to be able to recall a particular problem that was worked similar to the one on the test. I've made plenty of mistakes due to misreading/not reading the full problem statement, so I've started to look through my tests once I finish and if I have time even rework the problems to verify my answer. If it is show your work….SHOW YOUR WORK!!!! Get that partial credit! Even if you don't have a clue what's going on, make something up that sounds kinda right and maybe you'll be closer to the right answer than you think (closer than a blank answer for sure). CAUTION: don't ‘memorize’, learn. Understand. Even if you see a problem on your homework that looks hard and dissimilar to the examples you've been given, try to work it. You'll learn more because you had to think through the process of what you did for the other problems and then learn why this particular problem had to be worked different. ",
            "date": "Answered May 19, 2017",
            "views": "223",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gina",
                    "user_href": "/profile/Gina-197"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amit Kumar",
                "href": "/profile/Amit-Kumar-4153"
            },
            "answer_text": "From a students perspective we all always think of marks and grades….and it common The best way to improve your marks is to focus on smart learning that can be done by focusing on the type of questions often asked in examination …by this u will get to know after a time that what to study and what not . By this you may score good but The question arise that once u scored well what next now the answer is u will lost interest in maths n in later college life u will sukcks in it ….so best way is to follw this pattern but not by denying the each and every comcepts of mathematics as those concepts will help you to tackle some turning points in some questions. Maths is something one must practice a lot as more u practice more u will love it . eventually u will score better just dnt panic in exams just focus n have confidence on urself….once u accept ur failure there is nothing left which will make u fearful.. ",
            "date": "Answered May 19, 2017",
            "views": "46",
            "upvotes": "0"
        }
    ]
}