{
    "title": "How was your Diwali? - Quora",
    "tags": [
        "Hindu Festivals",
        "Festivals of India",
        "Diwali (Deepaavali festival)",
        "Festivals",
        "Celebrations",
        "National Holidays and Common Celebrations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gurjit Singh Khappian Wala",
                "href": "/profile/Gurjit-Singh-Khappian-Wala"
            },
            "answer_text": "Happy belated Diwali and I had a unique experience in this Diwali. I live in Dresden (Germany) and currently doing Ph.D. in Technical University Dresden. The Diwali was on Sunday and sometimes I visit a local Gurdwara gathering on Sunday. This time the hall was full of devotees, from mostly the local Sikh community and the university students. Most students cant understand the Punjabi language in Gurdwara, being from southern Indian states. After the whole religious procession, the president of Gurdwara took the stage and mike and particularly asked students to follow all regulations of Gurdwara, but form his verbal tone, I think he was mocking against the students, e.g. je aauna hai tan aao, tusi matha nahi tekde, golak wich paise paune tan pao etc. I knew his this kind of informal tone from previous events too. So after the finish of this event, when everybody was rushing down to langer hall (for food), I just spoke to the President and just stated conversation “ Hello Sir, mzy point is , during arrival in this religious hall, I don't bow down in front of Guru Granth Sahib, because the Guru is in the opposite corner of hall, and I don't want to disturb the whole Sangat (the already sitting devotees in the hall), so I bow down in front of Guru, after the whole event, when people start leaving. “ I thought he would listen to me, but his and his companions' replies were,” You cut your beard, so you don't have right to ask. From which part of India are you? Are you from Punjab? “ One turbaned and the tall person tried to push me down and threatened like,” come down to entrance hall, we will tell you “. So the reality is organizers of Gurdwara cant take any suggestions/criticism. In the front hall, I just went to other students and said,” If I translate to you everything that they had said in Punjabi, you people will feel offended. I believe if I have some self-esteem, I must leave and never visit this place. I don't want to stay here longer for langer’s free food. “ I left that place and 2 other students joined with me because they had also already faced some dry behavior from the Gurdwara committee. Anyway, It is their place, so their rules, but I don't want to visit ever again. Mostly the people who pretend to be very religious and read /talk about Gurbani, they have no room for any new thought. In the evening, I got some calls from some more Punjabi friends and told me about the sad realities of the Gurdwara management committee, but here I am not writing about the personal life of anyone. So it was like a social experiment. ",
            "date": "Answered October 31, 2019",
            "views": "252",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sriman Dutta",
                "href": "/profile/Sriman-Dutta"
            },
            "answer_text": "First of all Happy Diwali!!! Well, I live in Kolkata and it’s quite famous regarding the colours and splendour of the fire-crackers. Bangalis had their Kali Puja, the second major festival after the Durga Puja, last day. And it is the best time of the year. All kids and youngsters are out in the streets or on their rooftops with their wonderful crackers. Here’s an account of my last evening. The preparations for the day started long back. The crackers were all bathed in sun for a couple of days. I was totally excited to burn them. Although it’s not a new thing, but we Bangalis have such madness over festivities. Anyway, it was almost 5:30 pm, all quite dark, probably dusk. My father didn’t yet return from his office. Mother was taking out the candles and pradeeps, and I was just helping her. We tried to decorate the balcony and the inner quarter.  Had a wonderful time there. The lamps and candles lined up in the balcony were looking really amazing. Father returned home at 7 pm. By this time, the other neighbours had taken their crackers up. We joined them without any further delay. However, the most unwanted hindrance came, that is, gusts of wind. Oh my God!! It was really worse. But I’m not to be laid down by that wind. All of the apartment members were on the top, and we struggled to lit a candle! After it was burnt, we took out the crackers, the phuljhuris we call it. We had a good collection to burn and spread the lights. Here’s some pictures of the glorious evening.   The view from the top looked very attractive..  Next, me and my father tried to raise the lantern( or in bengali we call it fanush), but in vain. The strong currents didn’t permit the lanterns to lift off. But we had flown several of these last year. Here’s how they look like.   Anyway, I had a great fun. Some of the crackers are still left and lots of lanterns too. Waiting eagerly for today’s evening and hoping no wind…. HAPPY DIWALI, once again…. ",
            "date": "Answered October 20, 2017",
            "views": "22",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Srinivasa Prasad",
                    "user_href": "/profile/Srinivasa-Prasad-35"
                },
                {
                    "user_id": "Vishal Sahu",
                    "user_href": "/profile/Vishal-Sahu-157"
                },
                {
                    "user_id": "Pranay Kosulkar",
                    "user_href": "/profile/Pranay-Kosulkar-1"
                }
            ]
        }
    ]
}