{
    "title": "How do gifted students in regular schools keep from becoming bored and disengaged? - Quora",
    "tags": [
        "Gifted People",
        "Middle Schools",
        "Boredom",
        "The High School Experience",
        "Intelligence",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hanna Hogg",
                "href": "/profile/Hanna-Hogg"
            },
            "answer_text": "I’m 14 and supposedly academically and musically gifted. My school works with streaming methods, so I’m in one of the two “enrichment” classes, what are already meant to extend me. However, I found that still a bit boring and was easily getting away with just completing assignments and never feeling like I was going into depth. It got to the point where I no longer felt any drive to complete anything, and quite often would leave things until 3am to make things difficult for myself. So, my mum did some research and signed me up for a college in Boston, USA. The name of this wonderful college is Berklee College of Music, and I love to study there. It keeps me completely occupied, and it’s based around my passion, music. I’m about to finish my first twelve-week course there, Music Theory 101, and will soon be progressing into Music Production Analysis. My mum also got in touch with my school, and they give me a one hour period to work on college work. My school also offers a program that is designed for gifted and talented kids, and I partake in that once a week and immensely enjoy the discussions we have there. This program also allows me to complete my college work too. Moral of the story, I’d say that gifted kids thrive when they’re presented with something that they care about. I think a common belief is that gifted kids need to be “challenged”. However, whenever I’m assigned an essay on planning a trip to the Netherlands for maths or something else “challenging”, all I feel is complete boredom and annoyance about how many hours I will need to put into that work. Gifted kids also tend to be perfectionists, and I know that I will only be happy with a grade that is above average, whether I care about the work or not. I’d highly recommend getting an external source of education for a gifted child, and support them well. Give us something that makes us work, think and something that makes us care. This is all my personal opinion, I am in no way a professional. However, all of this certainly keeps my entertained and the polar opposite of bored! ",
            "date": "Answered September 6, 2017",
            "views": "25",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "B.J.",
                    "user_href": "/profile/B-J-239"
                },
                {
                    "user_id": "Kristina Karas",
                    "user_href": "/profile/Kristina-Karas-2"
                },
                {
                    "user_id": "Neal Allan",
                    "user_href": "/profile/Neal-Allan-1"
                },
                {
                    "user_id": "Anna Kay",
                    "user_href": "/profile/Anna-Kay-28"
                },
                {
                    "user_id": "Cetera Plagmann",
                    "user_href": "/profile/Cetera-Plagmann"
                },
                {
                    "user_id": "Emma Wang",
                    "user_href": "/profile/Emma-Wang-122"
                },
                {
                    "user_id": "Iris Mae Boom",
                    "user_href": "/profile/Iris-Mae-Boom"
                },
                {
                    "user_id": "Eleni Viglaki",
                    "user_href": "/profile/Eleni-Viglaki"
                },
                {
                    "user_id": "Eru Elle",
                    "user_href": "/profile/Eru-Elle"
                },
                {
                    "user_id": "Dalia // D.M. Mayor",
                    "user_href": "/profile/Dalia-D-M-Mayor"
                },
                {
                    "user_id": "Ruxandra Dancea",
                    "user_href": "/profile/Ruxandra-Dancea"
                },
                {
                    "user_id": "Jeremy Chen",
                    "user_href": "/profile/Jeremy-Chen-33"
                },
                {
                    "user_id": "Anna Field",
                    "user_href": "/profile/Anna-Field-7"
                },
                {
                    "user_id": "Joe Walsh",
                    "user_href": "/profile/Joe-Walsh-59"
                },
                {
                    "user_id": "Willie Chalmers III",
                    "user_href": "/profile/Willie-Chalmers-III"
                },
                {
                    "user_id": "Daniel Koenig",
                    "user_href": "/profile/Daniel-Koenig-6"
                },
                {
                    "user_id": "Ezra Melchor",
                    "user_href": "/profile/Ezra-Melchor"
                },
                {
                    "user_id": "Salam Khalaf",
                    "user_href": "/profile/Salam-Khalaf"
                },
                {
                    "user_id": "Zephyr Lobo Guthrie",
                    "user_href": "/profile/Zephyr-Lobo-Guthrie"
                },
                {
                    "user_id": "Ethan Chin",
                    "user_href": "/profile/Ethan-Chin-7"
                },
                {
                    "user_id": "Sahil Sen",
                    "user_href": "/profile/Sahil-Sen-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Blood",
                "href": "/profile/Brian-Blood-3"
            },
            "answer_text": "I constantly struggle with this every day. I am always bored and disengaged in my classroom work, part of the reason why I like Quora. I try my best, but it usually just results in me doing my own thing.  Okay, so to provide some context before I get started. I am a gifted student. I have attended public school all of my life. In the second grade, I got into the gifted program. Basically, one day a week I would go to another school and take a ton of enriching classes that benefitted me. They were almost all project based. The rest of the time I would stay back at my other school.  In sixth grade, I was given the chance to jump up a year in math. I took this chance and it was great. I am now taking geometry as an 8th grader and my love for math has increased. By the time I hit middle school, the gifted program changed. Instead of taking a whole day once a week, it was a class every day. This was also beneficial and it was nice to be a bit more spread out. It was incredibly enriching and enhancing, just maybe not as much as before. By 8th grade, I wasn't able to take the program due to scheduling issues with Pre-IB classes, so the teacher comes to my English class periodically. This has been a train wreck however and not really worked out. For this reason, I have had to keep doing more and more things to keep myself busy and not bored, part of the reason why I am on Quora 8 hours a day.   Okay, so how do I keep myself busy. This is actually quite difficult and gifted students are in a weird position. They have to do all the required classwork with near perfect accuracy. This takes time, not because it is hard, but because it is time consuming. This can really annoy a gifted student because they want to focus on more enriching work, but cannot. Here are some pointers: Taking Advanced Classes does not help. I take all advance classes and am a year ahead of a lot of my gifted peers in math. Despite this, these advance classes are boring. I sit in a class with kids who are not as smart as me and it takes them longer to get things. So, don't just say \"take an advanced class\"; they are probably already in it and really, really bored.Take classes with gifted peers. Having a class with a lot of other students who are gifted makes for a great experience. They can work with each other and really challenge them to work for greater goals. If they aren't challenge and competing however, it can stop them from trying to out perform. This helps with that.Focus on their interests. This is really something that can help all students, but it is easier with Gifted students. Gifted students are incredibly passionate about their interests. If they are interested in something, they will learn all and everything about it. This makes the curriculum more rigorous and helpful to all. Focus on the arts. Classes like Spanish and Band have really helped me expand my brain. I am very technically minded, and so working other areas of it is a challenge that is incredibly beneficial. Now, these are just some of the ways teachers can help, but what about the students for themselves: Find an out. Find something you can focus all of your attention on. Mine is Quora. I can just spend time on Quora and be enriched in everything. I do Quora all the time, even at school. My philosophy is, if you want me to stop doing what I am doing, make it harder, more rigorous, and more interesting than what I am doing right now. Otherwise I will do the work in 15 minutes tomorrow morning.Find an interest. Learn all you can about this interest and go back to it when you can. I have had many interests over the years including particle physics, math, technology, Liechtenstein, and many more. Focus on the arts. Get involved in music and other extracurriculars, it will work your brain in other areas and keep you busy. Play sports. I am an athletic kid and enjoy playing sports. It gives me something I am not terribly great at and lets me focus on it. This is really all you can do. You can't change the school (as much as I would have liked to), you just have to change yourself. Do the work, but make it harder. Or, do the work fast, get an A, and then work on your own, more interesting work. It will be better for you. You don't have to sit on the sidelines and be bored. Enrich yourself. It is a daunting task, but if you are gifted, you should be up for it.  ",
            "date": "Answered February 15, 2016",
            "views": "16",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rodney Pole",
                    "user_href": "/profile/Rodney-Pole"
                },
                {
                    "user_id": "Jennie McCray",
                    "user_href": "/profile/Jennie-McCray"
                },
                {
                    "user_id": "Sameera K",
                    "user_href": "/profile/Sameera-K-20"
                },
                {
                    "user_id": "Wanda Song",
                    "user_href": "/profile/Wanda-Song"
                },
                {
                    "user_id": "Alaa Elgazar",
                    "user_href": "/profile/Alaa-Elgazar"
                },
                {
                    "user_id": "Ben Newey",
                    "user_href": "/profile/Ben-Newey"
                },
                {
                    "user_id": "Lara l Lord",
                    "user_href": "/profile/Lara-l-Lord"
                },
                {
                    "user_id": "Raihana Ali",
                    "user_href": "/profile/Raihana-Ali"
                },
                {
                    "user_id": "Suha Hussain",
                    "user_href": "/profile/Suha-Hussain"
                },
                {
                    "user_id": "Maryam Muhammad",
                    "user_href": "/profile/Maryam-Muhammad-152"
                },
                {
                    "user_id": "Rohit Dwivedula",
                    "user_href": "/profile/Rohit-Dwivedula"
                },
                {
                    "user_id": "Shulamit Widawsky",
                    "user_href": "/profile/Shulamit-Widawsky"
                },
                {
                    "user_id": "Sabrina Ali",
                    "user_href": "/profile/Sabrina-Ali-2"
                },
                {
                    "user_id": "Yash Geryani",
                    "user_href": "/profile/Yash-Geryani"
                },
                {
                    "user_id": "Melissa Hoy",
                    "user_href": "/profile/Melissa-Hoy-2"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shulamit Widawsky",
                "href": "/profile/Shulamit-Widawsky"
            },
            "answer_text": "In 2004, an excellent research study was commissioned on how best to offer acceleration for the gifted by the Belin-Blank Center at the University of Iowa, and the results were released in a multi-part publication called A Nation Deceived.  The study showed that there were many different ways to provide academic acceleration to a gifted student, including single subject acceleration, grade \"skipping,\" and early entrance to college, amongst the 21 methods of acceleration they included in their study. The study showed that for gifted students, academic acceleration could be done well, and when it was, it helped keep students engaged in their education. It was called \"A Nation Deceived\" because it also showed that kids were happier, and better off socially, when they were allowed to join older students who were learning at their level.  For a very long time, most teachers and school administrators have preached that accelerating students into classrooms where they are younger than the others, will cause them serious social problems.  This has led to many (most?) gifted students being held back academically, solely to maintain their connection to their age peers.   A follow up to the study in 2015, the Acceleration Institute of the Belin-Blank Center published a book that reviewed how successful appropriate academic acceleration has been for gifted kids who were lucky enough to be in a school that applied the findings from the original research, and incorporated them into their school policies. This is not to say that every gifted kid should skip a grade, nor that skipping grades is a panacea for solving the problems gifted kids have in regular schools.  The research showed many more ways to academically accelerate gifted students besides single grade skips.  Some kids are really only outstanding in a single subject, and they do best when allowed to move forward in that subject, without being forced to take on acceleration in all the other subjects. On the other hand, some kids will outgrow a single year skip within a couple years, and need to be skipped again, while others will outgrow a double skip, and need to be skipped again.  There are good examples of a small number of children who simply exceeded the curricula offered by their school systems by a young age, and left to go to college. There are a few programs around the U.S. which specifically accept children as young as 13 into college, and I know of a couple people who entered college at age 11. Such radical acceleration (that is what it is called in the field) does not work for everyone who can pass an academic entrance test for the much higher grades, and \"A Nation Deceived\" does not advocate that.  There are a variety of relevant aspects of a student to evaluate before deciding how to accelerate that student in the best way for them.  It is not a simple task, but there are well-researched evaluation questioners that were developed for the Nation Deceived research, and by others, to create the appropriately individualized education plan for a gifted student. There is no cookie cutter, easy fix to this problem. But the best way to fix it has been well-researched and extensively explained and documented by the Nation Deceived publications, and the follow up book A Nation Empowered. It is time for educators to stop telling parents that accelerating their children will cause them more problems than it will solve, and time for educators to actually read the research, and develop policies for their schools. Acceleration is also sometimes the least expensive way to help gifted students, because it doesn't always require any special classes be added to the school's program. There are some good gifted programs already in place, and when they work, they are  helpful.  But for some exceptionally gifted students, they will need acceleration, even within a gifted program. ",
            "date": "Answered February 13, 2016",
            "views": "13",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "C. W. Williamson",
                    "user_href": "/profile/C-W-Williamson"
                },
                {
                    "user_id": "Madsen Zimbric",
                    "user_href": "/profile/Madsen-Zimbric"
                },
                {
                    "user_id": "Jennie McCray",
                    "user_href": "/profile/Jennie-McCray"
                },
                {
                    "user_id": "Sadat Bula",
                    "user_href": "/profile/Sadat-Bula"
                },
                {
                    "user_id": "Sabrina Ali",
                    "user_href": "/profile/Sabrina-Ali-2"
                },
                {
                    "user_id": "Raihana Ali",
                    "user_href": "/profile/Raihana-Ali"
                },
                {
                    "user_id": "Josh Hill",
                    "user_href": "/profile/Joshua-Hill-396"
                },
                {
                    "user_id": "Daniil Basov",
                    "user_href": "/profile/Daniil-Basov"
                },
                {
                    "user_id": "Ilana Halupovich",
                    "user_href": "/profile/Ilana-Halupovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Boontarika Sripom",
                "href": "/profile/Boontarika-Sripom"
            },
            "answer_text": "Thank you for A2A. I was a bored student who got reprimanded for doodling on assignments in primary school, and felt unchallenged with curriculum many times in secondary and graduate school. I think having personal experience as a bored student, and working with gifted and talented students direct me to the following suggestions or thoughts: Creative options for projects (music, illustrations, role-play, illustrations) in addition to assignmentsReading lists: this is huge for me. I've asked programs for reading lists to supplement the mandatory readings for coursework, and have been met with silence. I think gifted students deserve to have their curiosities nourished by educators. Part of this comes from providing the right tools and starting points to explore: books.Open discussion times: children are naturally curious, and have questions to ask. Even if the teacher doesn't have the answers, it's nice to have a designated amount of time per day (let's say 10 minutes or more) to ask a \"question of the day\" or have individual students provide a thought to explore. Teachers can be moderators.Mentoring & tutoring: students vary in their levels of expertise on any subject. Being able to tag team and help fellow students out, or be on a list to help with difficult homework problems can support community in the classroom, as well as increase gifted students' feelings of competence and importance.Student teaching: perhaps once every other week, a student can individually, or with a group, share an interest that is relevant to coursework, or entirely different. The student can offer resources for fellow students to explore.Allow doodling & reading during downtown. Gifted kiddos may rush through assignments quickly, and need other tasks. Drawing and reading can help decrease boredom.Allow doodling during lecture. Many learners pair two forms of stimuli to process information more efficiently. Doodling while lecture indicates a creative learner who is learning. It is not disrespectful. It is another way of processing.Social group: A teacher or counselor can facilitate a social group for gifted students to meet once a week to talk about their experiences. It's something to look forward to, while creating community and developing lifelong skills.",
            "date": "Updated July 22, 2016",
            "views": "27",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ligia Fleckenstein",
                    "user_href": "/profile/Ligia-Fleckenstein"
                },
                {
                    "user_id": "Mark Benjamin",
                    "user_href": "/profile/Mark-Benjamin-74"
                },
                {
                    "user_id": "Isha Deshmukh",
                    "user_href": "/profile/Isha-Deshmukh-3"
                },
                {
                    "user_id": "Jessica Wiggins",
                    "user_href": "/profile/Jessica-Wiggins-16"
                },
                {
                    "user_id": "Raquel Buchanan-Gasio",
                    "user_href": "/profile/Raquel-Buchanan-Gasio"
                },
                {
                    "user_id": "Jennie McCray",
                    "user_href": "/profile/Jennie-McCray"
                },
                {
                    "user_id": "David Slavinski",
                    "user_href": "/profile/David-Slavinski"
                },
                {
                    "user_id": "Kleandro Koka",
                    "user_href": "/profile/Kleandro-Koka"
                },
                {
                    "user_id": "Emmi McBride",
                    "user_href": "/profile/Emmi-McBride"
                },
                {
                    "user_id": "Cynthia Murugi",
                    "user_href": "/profile/Cynthia-Murugi"
                },
                {
                    "user_id": "Olivia B",
                    "user_href": "/profile/Olivia-B-205"
                },
                {
                    "user_id": "Teija Ramos",
                    "user_href": "/profile/Teija-Ramos"
                },
                {
                    "user_id": "Devin Glazebrook",
                    "user_href": "/profile/Devin-Glazebrook"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Ketsdever",
                "href": "/profile/Nathan-Ketsdever"
            },
            "answer_text": "As someone whose mother, father, and grandfather were all teachers and who was personally in the gifted program for 4 years (my high school didn't have a gifted program, because it was a magnet high school): As a teacher: 1) Challenge them 2) Extra-credit 3) More project based learning  4) More self-directed learning 5) Goal setting/Motivational interviewing (a way of passion & identity discovery)  As a student/parent: 1) More self-understanding on the part of the student (including self-reflection) 2) More exploration of topics (ideally in fun and engaging ways) 3) Side projects 4) Extra-curriculars based on passion 5) Try to make topics real (ie vacation to historic landmarks in Boston, Philly, and elsewhere) 6) Goal setting/Motivational interviewing (a way of passion & identity discovery)  Help them explore key topics....and help them find what makes them come alive. Contests, prizes, and gamification can help. Maintaining a good relationship with the kid can also be helpful. ",
            "date": "Answered February 14, 2016",
            "views": "92",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tinashe Dube",
                    "user_href": "/profile/Tinashe-Dube-1"
                },
                {
                    "user_id": "Sabrina Ali",
                    "user_href": "/profile/Sabrina-Ali-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael McCluskey",
                "href": "/profile/Michael-McCluskey-18"
            },
            "answer_text": "Back in the late 60’s, they didn’t have schools for gifted kids. I do have an above average IQ and had ADHD which wasn’t invented then. On Monday, I would learn the lesson and had to have it repeated all week which drove me crazy. I would daydream and design things on paper during classes. I also became the class clown. I’d be drawing something and the teacher would call my name, and when I looked up she said “Can you answer the question?” To which I replied “Can you repeat the question?” which made the class erupt in laughter. Yes, I did find school to be be very boring. So much so, I’m a 6th grade dropout. They could make me go to school but couldn’t make me participate. I did learn just by being there, but I quit doing homework turned in blank tests or for fun put the right answers on the wrong questions. Except for shop classes where I got A’s and B’s I passed with D-’s so they didn’t have to deal with me the following year. ",
            "date": "Answered October 24, 2018",
            "views": "98",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Antonio Kowatsch",
                "href": "/profile/Antonio-Kowatsch"
            },
            "answer_text": "Thanks for the A2A, Sabrina. Five words: school library and good teachers. Unlike me most of my peers didn't really like going to school but I thrived on it. I've never been absent from school (with the exception of my grandma's funeral, which was held in Slovakia, so I was excused for a couple of days). The school library wasn't big but since I was such an avid reader I had the privilege to decide which books the school ordered (I'm the reason why their inventory contains so many Ken Follett novels). I've spent every recess in the library and some teachers like my math teacher in middle school gave me extra homework to keep me occupied. It was really a good thing and I was always anticipating it. Some of the material that they gave me was really challenging but I've always managed to solve the problems. One time my math teacher was genuinely surprised when I solved one of the math problems that she claimed \"I shouldn't be able to solve\". In high school I wrote an essay which I titled the advancement of mankind in the centuries to come. My teacher loved the essay so much that he literally asked me if he could keep it. As I found out afterwards he framed it and hung it on his wall.  At one point I also started tutoring other students, and let me tell you this; every student that I tutored got substantially better grades than usual (As and Bs). I think I just got very lucky. I had really good teachers and I really appreciate each and every one of them. So does Matt Damon, I suppose:  p.s. teachers are real life superheroes. ",
            "date": "Answered February 13, 2016",
            "views": "782",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Derrick Hall",
                    "user_href": "/profile/Derrick-Hall"
                },
                {
                    "user_id": "Yuki McRing",
                    "user_href": "/profile/Yuki-McRing"
                },
                {
                    "user_id": "Matt Johnson",
                    "user_href": "/profile/Matt-Johnson-8"
                },
                {
                    "user_id": "Sabrina Ali",
                    "user_href": "/profile/Sabrina-Ali-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saleem Rana",
                "href": "/profile/Saleem-Rana"
            },
            "answer_text": "I used two strategies: going within and essays. I trained myself to look as if I were engaged so that I wouldn’t attract attention, but I spent my time indulging in creative thinking. When I ran out of problems to solve, I would do this Sherlock Holmes thing, where I would try pick up clues about other people based on my observations. All the teachers loved my written reports and so I got to express my real self through them. Still, today, my worst emotion is boredom; my most painful emotion. If I’m trapped in a social situation where I’m bored or have to endure a long wait, then I feel absolutely crushed. To me boredom is worse than any other emotion. Far worse. I think this is a remnant of my childhood come back to haunt me. As a result, I usually make sure I have my smartphone with me at all times, so I can play a game of chess on the Magnus Carlsen app in an emergency—for instance, waiting in line at the Post Office. I used to have extremely boring jobs until the Internet, after which I learned how to make money online. This was probably the greatest breakthrough in my life. Today, I spend most of my day online, either working on fun, intellectually-challenging projects or learning something interesting, usually new math concepts. ",
            "date": "Answered August 24, 2018",
            "views": "299",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Colleen Farrelly",
                "href": "/profile/Colleen-Farrelly-1"
            },
            "answer_text": "For profoundly gifted students, radical acceleration (either within an area of relative strength for unevenly gifted students or across subjects for a more evenly gifted student) can be a great option. Numerous studies (Gross's longitudinal study, literature coming out of Hopkins' Study of Exceptional Talent...) show the benefits of acceleration with respect to both academics and social fit of the student. For less gifted students, differentiation, gifted pull-outs, and other enrichment can be good options, as well as a grade skip or two (subject or whole-grade). In high school, AP/IB courses and concurrent enrollment can be quite effective, as well. ",
            "date": "Answered September 5, 2017",
            "views": "786",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Al Simmons",
                    "user_href": "/profile/Al-Simmons-27"
                },
                {
                    "user_id": "Adam Denchfield",
                    "user_href": "/profile/Adam-Denchfield"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carol Baldridge",
                "href": "/profile/Carol-Baldridge"
            },
            "answer_text": "My parents always encouraged me to think for myself and not wait for someone else to prod me into doing extra work on an assignment. For instance, if a book report was due, I might include illustrations. For a history report, I'd create and include a collage or a diorama or a special hand-drawn map. Nowadays with the Internet, making an extra effort is so much easier. And the fun is in the doing of it, plus the student will learn in the process.  ",
            "date": "Updated May 9, 2016",
            "views": "13",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Duff Warren",
                    "user_href": "/profile/Duff-Warren"
                },
                {
                    "user_id": "Esther Sue",
                    "user_href": "/profile/Esther-Sue-1"
                },
                {
                    "user_id": "Yuki McRing",
                    "user_href": "/profile/Yuki-McRing"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Huma-79"
                },
                {
                    "user_id": "Morgan Mayhew",
                    "user_href": "/profile/Morgan-Mayhew"
                },
                {
                    "user_id": "Boontarika Sripom",
                    "user_href": "/profile/Boontarika-Sripom"
                },
                {
                    "user_id": "Sabrina Ali",
                    "user_href": "/profile/Sabrina-Ali-2"
                },
                {
                    "user_id": "Sam McCormack",
                    "user_href": "/profile/Sam-McCormack-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Josiah Anderson",
                "href": "/profile/Josiah-Anderson-14"
            },
            "answer_text": "Some people have really great ideas to stop becoming bored, but thanks to the school I’m in, I can’t really figure it out. The best thing I can do is stack chairs. That is all ",
            "date": "Answered October 21, 2017",
            "views": "84",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Annie To",
                    "user_href": "/profile/Annie-To-2"
                },
                {
                    "user_id": "Alanna Rogers",
                    "user_href": "/profile/Alanna-Rogers-3"
                }
            ]
        }
    ]
}