{
    "title": "How will classrooms change post-Covid? - Quora",
    "tags": [
        "Teaching Methods",
        "Classrooms",
        "Educational Technology",
        "Academia",
        "E-learning",
        "Teaching",
        "Schools",
        "Higher Education",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joe Sterbinsky",
                "href": "/profile/Joe-Sterbinsky"
            },
            "answer_text": "Every classroom will be equipped with a video camera so that students with both long term and short term illnesses will be able to view and possibly participate in class activities, live. Hopefully this will allow schools to suspend from live classrooms students who are persistently disruptive and steal learning time from well-behaved students. Charter and private schools will jump on this opportunity and use it to great advantage. I don’t think this is likely in the public schools. Reality-denying liberal teachers and their (my former) union will concoct some argument that this is a denial of rights (possibly based on racial data) and get the courts to support them and thus an opportunity to return order to classrooms will be denied - hurting the 60% of the students who want to learn andd behave. (60% is my rough estimate of the % of students that wanted to learn in my San Fernando Valley, Los Angeles public, middle school in Jan 2019.) This advancement may also get derailed by over-sensitive parents who will not want their child videotaped even through the viewers will be the students and parents of students who seem them everyday. Finally this advantage will be criticized by Democratic politicians when low achieving students from low income households fail to use it in greater degree than middle and upper income homes. Though the technology will be easily available we will be told it isn’t because it won’t be equal in quality to that from upper income families and told that is why there is a disparity rather than the real reason - students from lower income families proportionally perform worse because their work habits are proptionally less skilled because their parents or guardians either are working aand not available to model/supervise better behavior or proportionally do not have those skills sufficiently themselves. When we admit this and attend to that situation then poor kids will have a fair chance. OK, so maybe we WON’’T see this change in classrooms, but now you’ve heard both sides of the argument. ",
            "date": "Answered October 24, 2020",
            "views": "30",
            "upvotes": "0"
        }
    ]
}