{
    "title": "How does MIT calculate high school GPA? - Quora",
    "tags": [
        "Massachusetts Institute of Technology",
        "Grade Point Averages",
        "The High School Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Esther Littlefield",
                "href": "/profile/Esther-Littlefield-1"
            },
            "answer_text": "I was literally JUST at MIT on Thursday to meet with a coach for my son as a prospective candidate and we learned a few things that you might find helpful: First, MIT isn’t as concerned with overall GPA because they are aware that some schools inflate grades, weigh AP/Honors classes differently, etc. Case in point, my son may have a 95 UW average on a 100, but weighted is only 96, even though he’s taken the max on Honors/APs each allowed year - his private prep school doesn’t add much weight to these classes. Teachers are known not to give 100s, so an above-100 average is almost impossible. They also don’t allow students to take any APs in Freshman year, only allow ONE Honors class in Freshman year, three Honors classes and with rare exceptions, ONE AP class in Sophomore year, and only 3 total AP/Honors each Jr./Sr. year, with some exceptions to that rule (my son is one such exception taking 4 this year and the next). Virtually 100% of kids who graduate from his school are fully prepared to succeed in college, and many end up at some of the most competitive colleges in the country - three out of last year’s graduating class of 76 ended up at Stanford! The local public school, however, grades on a 4.0 scale, and they add .5 to each Enrichment class, 1.0 to each Honors class, and 2 to each AP class. Kids are allowed to take as many AP or Honors classes as they want and since they are on block scheduling, many kids can take twice as many APs if they are only one semester long. As a result, there are students who have close to 6.0 GPA. However, the school has an 11% in college readiness, which means 89% of the student body graduates unprepared for college. and many who end up in college drop out or flunk out by Sophomore year. Even the top 10 students of each year’s graduating class rarely make it to top colleges, although most of them do end up in Honors programs at state colleges and every few years there’s at least one Ivy League/Top 25 college acceptance. What does this all mean? That GPAs are no longer a great indicator of college preparedness due to the growing trend of grade inflation, particularly in public schools. Second, MIT looks MUCH more closely at Math/Science grades as well as Math/Science SAT/ACT and subject tests than they do GPA and overall Composite for SAT/ACT. So looking again at my son, his unweighted GPA solely looking at his STEM classes is 96, weighted to 98 (because all but two of his STEM classes have been AP/Honors), which at his school is an A+ and comes to around a 4.33 weighted. Much different than the weighted 4.0 a 96 translates to. So let’s say a B in English or in AP US History may not matter nearly as much if all the STEM classes are A and A+. THIS DOES NOT MEAN that GPA doesn’t matter. Two or more Cs or at least one D may entirely disqualify you as an applicant. What it does mean is that PARTS of your GPA are more important than others. So bottom line is, MIT is in the business of knowing what it takes for students to succeed at their school. Being a school geared toward STEM-related fields of study, they are much more concerned with students being extremely competitive in those areas and less concerned with the overall GPA. So because of this, it doesn’t matter how your school calculates their GPA because MIT will figure out what they’re’ looking for :) Just make sure the bulk of the strength of your GPA is coming from STEM classes, and that the rest of your application is equally as strong! Good luck :) ",
            "date": "Answered March 19, 2017",
            "views": "124",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Julian Yocum",
                    "user_href": "/profile/Julian-Yocum"
                },
                {
                    "user_id": "Rachel Dewitt",
                    "user_href": "/profile/Rachel-Dewitt"
                },
                {
                    "user_id": "Luc Ta",
                    "user_href": "/profile/Luc-Ta"
                },
                {
                    "user_id": "Ali Najafi",
                    "user_href": "/profile/Ali-Najafi-12"
                },
                {
                    "user_id": "Giko Njendu",
                    "user_href": "/profile/Giko-Njendu"
                },
                {
                    "user_id": "Hannah Keely",
                    "user_href": "/profile/Hannah-Keely-1"
                },
                {
                    "user_id": "Jack Kellerk",
                    "user_href": "/profile/Jack-Kellerk-1"
                },
                {
                    "user_id": "Ethan LITTLEFIELD",
                    "user_href": "/profile/Ethan-LITTLEFIELD"
                },
                {
                    "user_id": "Beccy Snell",
                    "user_href": "/profile/Beccy-Snell"
                },
                {
                    "user_id": "Manav Midha",
                    "user_href": "/profile/Manav-Midha-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Fox",
                "href": "/profile/Christopher-Fox-14"
            },
            "answer_text": "MIT publishes a lot of data on its freshman class profile. One thing they don’t publish is anything about GPA. There are high schools that have easy grading scales and those that are difficult. MIT basically understands each high school. They want to see that you challenged yourself and did well. So there is no way of comparing your averages to what MIT accepted students have. You may look at 4 pages regarding statistics at The Selection Process | MIT Admissions . ",
            "date": "Answered March 19, 2017",
            "views": "43",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Omar Ayman",
                    "user_href": "/profile/Omar-Ayman-52"
                },
                {
                    "user_id": "Umar Tahir",
                    "user_href": "/profile/Umar-Tahir"
                },
                {
                    "user_id": "Rishi Talati",
                    "user_href": "/profile/Rishi-Talati-1"
                },
                {
                    "user_id": "Manav Midha",
                    "user_href": "/profile/Manav-Midha-1"
                },
                {
                    "user_id": "Irina Kitova",
                    "user_href": "/profile/Irina-Kitova-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Irina Kitova",
                "href": "/profile/Irina-Kitova-1"
            },
            "answer_text": "MIT doesn’t post GPA data for admitted students, so there is nothing for you to compare to. Admissions Statistics | MIT Admissions Your GPA combined with SAT scores will have to show MIT that you can handle its academic workload. 3.83 unweighted GPA is fine. While GPA is important, I’d like to direct you to the bigger picture. Please read The Match Between You And MIT | MIT Admissions, What To Do In High School | MIT Admissions and Enrichment Opportunities | MIT Admissions. ",
            "date": "Answered March 19, 2017",
            "views": "36",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Manav Midha",
                    "user_href": "/profile/Manav-Midha-1"
                }
            ]
        }
    ]
}