{
    "title": "How to graduate early in highschool - Quora",
    "tags": [
        "Graduating College Early",
        "High School Education",
        "The High School Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Taylor Hall",
                "href": "/profile/Taylor-Hall-19"
            },
            "answer_text": "If you want to graduate early, it's all about the English (or other four year requirements). Complete one over the summer, and you're ready to graduate early. Use your \"electives\" to take other required classes. No need for Keyboarding when you could take an AP class, or another science. Also, consider your reasons for graduating early. Is it because you dislike your high school, the stale intellectualism of your classmates? If so, do everything you need to graduate - EXCEPT the English - and use senior year to take English and a slew of Community College classes. This helps mature your college applications a year, gets you out of the high school setting, and advances you in your college studies. Make sure to get all A's in C.C.! (Are you a \"university-only\" snob? Nowadays, the CCs are accepted by the universities, and if you're worried about what your 17-year-old classmates will joke you about, you're not ready to break the mold - stay in high school.) No Community College nearby? Then try a different strategy - plan your required classes for senior year, and free up your schedule junior year to take a lot of AP classes (or self-study AP classes). Your junior year results appear on college applications, while senior results arrived the day I attended College Freshman orientation. Score well and often junior year,  and then use senior year to clear up your high school required classes like P.E., Personal Finance, etc.   The added AP scores to your junior year makes you look like an advanced student, while not changing anything but scheduling order in your high school schedule. Don't graduate early just because you can. Your diploma will be worth less to colleges. Find ways to regain the value that you give up by graduating early - internships, or other pursuits (if a child actor graduates early, it's whatever, they have other marketable skills), or volunteering, or Community College classes. Make sure to get the math, science, and English training needed for acceptance to your intended college major. Are you trying to get away from high school AND your home? That's different. Graduating early was great for my sanity - I remember crying in September because of the freedom and love I felt from college and my roommates, compared to the ten-hour bureaucratic  days in high school and the mild but sustained abuse I suffered at home. Here are the drawbacks:Lower college acceptances - I had SATs the surpassed a college's top scores, a ton of APs, and I got rejected. My counselor inquired, and the school said it was because I was a \"junior\". Um no, I'm receiving my Advanced diploma and an IB diploma... I need to go to college somewhere next year. Fix this by staying four years (don't accelerate English), but using the fourth year as a \"gap year\" taking college classes and pursuing interests. By the way, life benefits those who practice their interests, not those who power through their classes. My pursuits are things I draw on daily in my career, while those high school and college classes aren't as useful - they provided me with trivia and advanced knowledge sets, but no real-world hustle skills. Under age - You will be 17 at freshman year (I had to fax permission slips to my parents.) 21 in the last months before you graduate.  If you aren't going to college, some workplaces may not accept you as a minor. I looked into a trade school (to fill in the \"gap year.\") They wouldn't accept me because I was 17. Child labor laws have a diploma exception, so jobs shouldn't be a problem, just training programs might feel legally they don't want to deal with you yet.  College is fun, and largely about the social experience. It's where you make most of your life-long friends, and where you learn a lot about what kind of person you want to marry (there is a quality dating pool in college - all intelligent, 18-22, single, and your job is just to sort the good characters from the not-great).  Don't shortchange yourself in this environment by speeding through it, and don't resign yourself to a lower-ranked university in exchange for getting out from high school a year early. One Benefit of Graduating Early: another year of pay. If you already know your occupation, graduating early gets you there a year earlier. My retirement accounts were started at 20, as soon as I got my first post-college job.  I will probably be able to retire about six months sooner because of my early start in the workplace. Pretty cool, I guess... ",
            "date": "Answered December 10, 2014",
            "views": "665",
            "upvotes": " View 49 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lori Merry",
                    "user_href": "/profile/Lori-Merry-1"
                },
                {
                    "user_id": "Bryan's EverydayLifeContent",
                    "user_href": "/profile/Bryans-EverydayLifeContent"
                },
                {
                    "user_id": "It’s Isabeellaa",
                    "user_href": "/profile/It-s-Isabeellaa"
                },
                {
                    "user_id": "Chloe Truong",
                    "user_href": "/profile/Chloe-Truong-4"
                },
                {
                    "user_id": "Nathan TheGOAT",
                    "user_href": "/profile/Nathan-TheGOAT-1"
                },
                {
                    "user_id": "Mikea .",
                    "user_href": "/profile/Mikea-2"
                },
                {
                    "user_id": "Juliana Navas",
                    "user_href": "/profile/Juliana-Navas-1"
                },
                {
                    "user_id": "Sofia Rangel",
                    "user_href": "/profile/Sofia-Rangel-4"
                },
                {
                    "user_id": "Soorya Bala",
                    "user_href": "/profile/Soorya-Bala-1"
                },
                {
                    "user_id": "Hannah Kim",
                    "user_href": "/profile/Hannah-Kim-254"
                },
                {
                    "user_id": "Cineus Stanleyy",
                    "user_href": "/profile/Cineus-Stanleyy"
                },
                {
                    "user_id": "Felicity Decker",
                    "user_href": "/profile/Felicity-Decker"
                },
                {
                    "user_id": "Dam Narrow",
                    "user_href": "/profile/Dam-Narrow"
                },
                {
                    "user_id": "Justin Smith",
                    "user_href": "/profile/Justin-Smith-2780"
                },
                {
                    "user_id": "Jeff Zhuo",
                    "user_href": "/profile/Jeff-Zhuo"
                },
                {
                    "user_id": "Ben Salyers",
                    "user_href": "/profile/Ben-Salyers"
                },
                {
                    "user_id": "Misty Lederman",
                    "user_href": "/profile/Misty-Lederman"
                },
                {
                    "user_id": "Burning Dragon Breaker",
                    "user_href": "/profile/Burning-Dragon-Breaker"
                },
                {
                    "user_id": "Kaleb Louden",
                    "user_href": "/profile/Kaleb-Louden-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Axel-The-Axolotl"
                },
                {
                    "user_id": "Tamacy Tudor",
                    "user_href": "/profile/Tamacy-Tudor"
                },
                {
                    "user_id": "Space Nerd",
                    "user_href": "/profile/Space-Nerd-3"
                },
                {
                    "user_id": "Amira O'Reily",
                    "user_href": "/profile/Amira-OReily"
                },
                {
                    "user_id": "Laia Catalan",
                    "user_href": "/profile/Laia-Catalan"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Bupe-1"
                },
                {
                    "user_id": "An Ng",
                    "user_href": "/profile/An-Ng-7"
                },
                {
                    "user_id": "Mariah",
                    "user_href": "/profile/Mariah-77"
                },
                {
                    "user_id": "James Elmore",
                    "user_href": "/profile/James-Elmore-18"
                },
                {
                    "user_id": "Andrew Nordstrom",
                    "user_href": "/profile/Andrew-Nordstrom"
                },
                {
                    "user_id": "Nancy McKenna",
                    "user_href": "/profile/Nancy-McKenna-1"
                },
                {
                    "user_id": "Melany Diaz",
                    "user_href": "/profile/Melany-Diaz-6"
                },
                {
                    "user_id": "Conner Boehm",
                    "user_href": "/profile/Conner-Boehm"
                },
                {
                    "user_id": "Xavier Perez",
                    "user_href": "/profile/Xavier-Perez-23"
                },
                {
                    "user_id": "Daqueria Rodgers",
                    "user_href": "/profile/Daqueria-Rodgers"
                },
                {
                    "user_id": "Kelly Zipa",
                    "user_href": "/profile/Kelly-Zipa"
                },
                {
                    "user_id": "Davida Baul",
                    "user_href": "/profile/Davida-Baul"
                },
                {
                    "user_id": "Kshitiz Kumar",
                    "user_href": "/profile/Kshitiz-Kumar-37"
                },
                {
                    "user_id": "Harmony Arun",
                    "user_href": "/profile/Harmony-Arun"
                },
                {
                    "user_id": "Laith Al-Basheer",
                    "user_href": "/profile/Laith-Al-Basheer-1"
                },
                {
                    "user_id": "Thalia Rider",
                    "user_href": "/profile/Thalia-Rider"
                },
                {
                    "user_id": "Matas Dulkė",
                    "user_href": "/profile/Matas-Dulkė"
                },
                {
                    "user_id": "Uroosa Imtiaz",
                    "user_href": "/profile/Uroosa-Imtiaz"
                },
                {
                    "user_id": "Gianna Liu-Miller",
                    "user_href": "/profile/Gianna-Liu-Miller"
                },
                {
                    "user_id": "Emily Watkins",
                    "user_href": "/profile/Emily-Watkins-13"
                },
                {
                    "user_id": "Hannah Providence",
                    "user_href": "/profile/Hannah-Providence"
                },
                {
                    "user_id": "Nadezhda Khusnullina",
                    "user_href": "/profile/Nadezhda-Khusnullina"
                },
                {
                    "user_id": "Makayla O’Brien",
                    "user_href": "/profile/Makayla-O-Brien"
                },
                {
                    "user_id": "Glenn Watson",
                    "user_href": "/profile/Glenn-Watson-2"
                },
                {
                    "user_id": "Tiffany Tillett",
                    "user_href": "/profile/Tiffany-Tillett"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reid Hammond",
                "href": "/profile/Reid-Hammond-1"
            },
            "answer_text": "This is how I did it. Ill try to keep it simple. You probably will have to be in a good place academicly in any case. I hate to say it but if your GPA is a brick in the ocean they are probably not going to let you graduate early. In my case my GPA was fine and I had fulfilled all requirements to graduate by the beginning of senior year (whatever the hell they were) so to some extent senior year was kind of a waist of time. Second is your plans for when you are out. They in my case only let me out early because I had already been accepted to college and pretty much knew what I was going to do. The bottom line was I didn't spend a semester playing Xbox and sleeping till noon. So if you know what you are doing after you are out that will help. The third thing is I was already a senior and pretty much was done anyway. If you are lower on the grade scheme it will be less likely although I have heard of Juniors graduating early though it is very rare and typically they are geniuses. One of my good friends always got out of stuff because he was doing literally graduate school level math and physics at mit. But this is very far from common. Now the 4th aspect of me getting out early is they simply did not want to have to deal with me for a entire pointless year. Me and the school did not get along in many aspects and I don't think they fancyed the notion of me being there all that time any more than I did. We had a history of seniors not being very open to staying till the very last day. One group put dead animals in the ceiling and just vanished off the face of the Earth. Anyway I think one aspect that I take the most pride in they cut me loose largley because I would have had a whole year to plan a very very large and ornate and complex senior prank. Instead I was studying at college. Good luck and keep at it ",
            "date": "Answered September 14, 2018",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jamie Renfro",
                "href": "/profile/Jamie-Renfro"
            },
            "answer_text": "You can do what I did and become homeschooled. I was able to skip a grade by doing this, and if you haven't heard much about it yet, it's perfectly legal and is really very fun! There are many advantages of taking this route. You can work at your own pace and not be hindered by the \"one size fits all\" school system that most students have to go through. If you are willing to put forth the effort in arranging your own courses, you can come away a good bit smarter than your classmates. It's a proven fact that homeschooled students tend to score higher on SAT's and other standardized tests. I believe I came out pretty well with a 1600 (give or take twenty points, can't remember exactly) on the SAT and a 3.95 GPA. Also, homeschooled students are preferred by a lot of colleges. If you have a stay-at-home parent, homeschooling is very advantageous, but even if you don't, teaching yourself from home is very rewarding and is not nearly as hard as it might sound. I had a stay-at-home mom during my high school years but still taught most of my classes to myself. On another note: there's a generalization that get passed around about homeschooled students being socially awkward -- not really true. Yeah, if you lock yourself away in your room and never socialize, you probably won't end up as much of a talker, but homeschooled students have plenty of opportunity to be around other students. First of all, you can keep hanging out with your friends from your current high school, and second of all there are local homeschool associations in most places in the U.S. (assuming you're from the U.S.) that meet and have activities such as sports, PE, specialized classes like Spanish or Biology and some stuff just for fun. And there's nothing at all wrong with being a quiet person anyway -- most of the time that's best way to be so that when you do talk people will really listen. Being homeschooled also gives you ample opportunity to discover yourself -- to find your passion and figure out exactly how you want to pursue it. It allows you to shape your own beliefs and interests more freely because peer pressure is not pressing on you as much to conform to what is \"popular\" at the time. From my experience of both public school and home school, that peer pressure is a good thing to do away with, or at least minimize (some peer pressure is good to build character). Sorry to go off on a tangent of life advice, lol. I can get carried away sometimes when I'm on Quora. But all in all, I loved my time as a homeschooled student. It's not for everybody, but if you're willing to get ahead in high school as evidenced by the question, you might want to look into this because there's a pretty good chance that it is for you. ",
            "date": "Answered December 9, 2013",
            "views": "131",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ora Galan",
                    "user_href": "/profile/Ora-Galan"
                },
                {
                    "user_id": "Ben Wass",
                    "user_href": "/profile/Ben-Wass"
                },
                {
                    "user_id": "Mikea .",
                    "user_href": "/profile/Mikea-2"
                },
                {
                    "user_id": "Mirelyy Jimenezz",
                    "user_href": "/profile/Mirelyy-Jimenezz"
                },
                {
                    "user_id": "Kristine Cousineau",
                    "user_href": "/profile/Kristine-Cousineau"
                },
                {
                    "user_id": "A Nonymous",
                    "user_href": "/profile/A-Nonymous-180"
                },
                {
                    "user_id": "Justin Smith",
                    "user_href": "/profile/Justin-Smith-2780"
                },
                {
                    "user_id": "Matthew Hachten",
                    "user_href": "/profile/Matthew-Hachten"
                },
                {
                    "user_id": "Hannah Providence",
                    "user_href": "/profile/Hannah-Providence"
                },
                {
                    "user_id": "Janet Carole",
                    "user_href": "/profile/Janet-Carole"
                },
                {
                    "user_id": "Ashley Simmons",
                    "user_href": "/profile/Ashley-Simmons-21"
                },
                {
                    "user_id": "Makayla O’Brien",
                    "user_href": "/profile/Makayla-O-Brien"
                },
                {
                    "user_id": "Jake M",
                    "user_href": "/profile/Jake-M-33"
                },
                {
                    "user_id": "Charles O'Brien",
                    "user_href": "/profile/Charles-OBrien-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thalia Rider",
                "href": "/profile/Thalia-Rider"
            },
            "answer_text": "GghHold your horses . I'm pretty sure we've all had that thought (I'm a sophomore too ) . It comes down to DO YOU HAVE YOUR CREDICTS! !!!! I cannot stress the enough (btw this is from my perspective in a northern Californian school ) OK you need a certain amount of credits to graduate school. They are called your A-G requirements. In order to earn these golden points you pass the class with a final grade with a C or better . You also can't be like “I just earn all my credits by taking art class all day “ . There are certain core classes you must take math ,English, history, science, foreign language, and pe. ( this is what we call gym class in California ) ( stand for physical education ) So the to graduate early is to get all your classes out of the way and earn all your credits . Oh you thought we were done ,but no I bet you are kid who would rather not earning the $7.25 federal minimum wage in the good ol USA. So in that case what you is look at your report card (or ask your teacher or counselor ) what the college requirements are . In most cases it will say “recommend “ but take the dam classes anyway. Just because you got all the basic class credits does not mean you can go to college so just a tip. Yes you can graduate early and go to college. ",
            "date": "Answered December 16, 2016",
            "views": "58",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andominale",
                    "user_href": "/profile/Andominale"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Girard",
                "href": "/profile/Robert-Girard-1"
            },
            "answer_text": "You have to earn the required number of credits to be graduated. Your school probably has a handbook or information on its website that will give you some clue as to how many credits you earn with each class and how many credits are needed for graduation. To be graduated early, you usually have to take extra classes or earn dual credit through a community college program or attend summer school or night school. Some schools offer online programs (beyond online classes due to Covid-19) that offer credit. Do a little research with your school’s information and find out how many credits you still need to ear and chart out a plan that you think you can realistically work. Be clear about why you want to be graduated early. Then contact your guidance counselor and let him/her help you finalize the plan. Keep in mind that the guidance counselor may spend as much time trying to talk you into staying in school. That’s why having a plan— even if it’s not complete— and your reasons in mind will help if the counselor tries to persuade you to complete the 4-years. You might be told that there’s no advantage or that most early grads don’t do anything in the extra months they earn. Be clear in your plan about the why and the what you plan to do once you are on your own. ",
            "date": "Answered September 8, 2020",
            "views": "419",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Diana Smith",
                "href": "/profile/Diana-Smith-18"
            },
            "answer_text": "Its not that hard. Check with school about dual enrollment if you just want to not be in high school classes. If you want to leave to go to a specific college, check if your state has an online public school. I know from experience FLVS - Florida Virtual School is Florida’s. I accidently graduated early ,because the classes bored me in high school so I wanted to do dual enrollment. I went to a poor high school so there wasn’t many choices. However, they would only let me take all the college classes I wanted if I took the high school classes I needed. Before I knew it, I graduated high school a year early with 60 credits. Online classes are pretty easy if you can teach your self things easily. They have modules online instead of text books. I highly recommend it if you don’t like high school. You can work at your own pace. You don’t have to be a genius but the ease of which your brain learns information will determine the time it takes to complete courses. But if you can put in the same amount of hours for regular high school as online you can graduate early. This does mean that you have to do classes during breaks. I wasn’t really sociable in high school, so I didn’t really mind just focusing on school. Some people say you’ll regret skipping traditional high school stuff and its possible ,but I didn’t. ",
            "date": "Answered July 19, 2017",
            "views": "26",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eugene Belozerov",
                    "user_href": "/profile/Eugene-Belozerov-1"
                },
                {
                    "user_id": "Jensen Caldwell",
                    "user_href": "/profile/Jensen-Caldwell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ricky Ward",
                "href": "/profile/Ricky-Ward-1"
            },
            "answer_text": "Look, I think I know what you mean exactly. Don't think you're alone. Everyone has that point in high school where they are ready to go off to college and it could be as early as the end of freshman year that they want to do this. However, think about it- is there really a point? Can you just let yourself finish high school like everyone else, take the four years. After sophomore year, you only have two years left. Just continue to do the best you can because there is really no sense in rushing it. There are VERY smart students in my school who take all AP classes and Latin and Spanish (our Latin teacher is very hard), but they aren't considering graduating early. It's really not that realistic. Trust me, I'm going into my junior year and I've seen the smartest kids graduate out their 4th year- barely anyone leaves school early like that. Especially if you want to get into an Ivy League- it's all about state and country testing such as ACT and SAT. They're looking at that more than anything else.   If you really want to, you can go to a college prep school, but that is a boarding school and you'll be away from your parents a lot- probably a lot more than you think you can handle. Also, most prep schools cost a pretty penny for admission.    My advice, don't grow faster than you have to. Just make the next three years of school even better than the first.  ",
            "date": "Answered January 22, 2016",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tyler Collie",
                    "user_href": "/profile/Tyler-Collie-2"
                },
                {
                    "user_id": "Nathan Chackerian",
                    "user_href": "/profile/Nathan-Chackerian"
                },
                {
                    "user_id": "Nastassja Holm",
                    "user_href": "/profile/Nastassja-Holm"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Farris",
                "href": "/profile/Tom-Farris-2"
            },
            "answer_text": "Preferably you are still in Middle / Jr High school, because then you can plan right from your first year in High School. I decided I wanted to graduate early and found out what summer school classes I would need and made sure I took them. Got out 6 months early, but wasn't paying as close attention to it as I thought. With only one additional class I could have made it a whole year early. Never looked back, never went back for graduation. Never regretted it. Don't think that you must use the time in a serious way. Travel if you can, overseas if you can is best. It will give you a wake up call. Don't angst too much about spelling...one of the most brilliant men I worked with was so bad at punctuation. ",
            "date": "Answered November 28, 2016",
            "views": "471",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Lee",
                "href": "/profile/Chris-Lee-235"
            },
            "answer_text": "I grew up in Canada (British Columbia) so high school was 8th grade through 12th grades, so 5 grades. It’s a little easier to graduate from high school early. I could have, I chose not to — which I’ll get into in a second. There are other reasons which I’ll also get into. Some of it is figuring out the system: for instance, for my province, it required a minimum of eleven 11th+12th grade subjects including 11th and 12th grade English, 11th grade Algebra, one 11th grade science, 11th grade and 12th grade French (Canada, remember). The rest is up to you. Some have requirements, like 12th grade English requires 11th grade English. So here’s a possibility: finish 9 subjects in 11th grade, then take 12th grade English and French in summer school. Another possibility: work really hard and get A’s in lower grades and try to do two grades of (lower grade subject) in a year — you can use summer school to do that. So in 8th grade: I finished 8th grade math in one month and spent 9 months finishing 9th grade math; I did both 8th and 9th grade French. In 9th grade, I started advancing in science. I figured out during 11th grade I could have graduated early if I had taken 12th grade English in summer school. I mentioned I didn’t do that. Sure, I did have a 4.0 GPA (11th grade), I got scholarships to local universities/colleges and decent ones. However, I wanted to go MIT, and I wanted to prepare myself for that. Other people have other reasons for not trying to graduate early — including maturity (especially emotional maturity). Another reason is that on average, an 18-year-old will be a better athlete than a 17-year-old: you have an extra year of physical development and training. ",
            "date": "Answered June 7, 2016",
            "views": "3",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashley Simmons",
                    "user_href": "/profile/Ashley-Simmons-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brittany Barrell",
                "href": "/profile/Brittany-Barrell"
            },
            "answer_text": "I'm from Canada, but I imagine it's similar other places The rules for graduating arnt just based on your year, so the good news is that it can be done. To graduate however there are some requirement, for example you must take grade 12 English. The first step then is to figure out what you need. If you have a certain idea for university check their requirements (some programs for example require one grade eleven science class). In addition there are a number of course credits you need, you can get those the traditional way or you can take them outside of school during the summer or through online correspondent courses. If your in America there may be a few other things like taking the SATs, a certain number of volunteer hours, etc. Now that that you know what you need, the trick is to go and get them. Communication is critical for this, maje your plans then talk to your councillor. Since your a good student, I think you could convince them to alter the schedule a bit, letting you take two English classes in a year, as well as confirming that they will accept correspondence courses. Get them and your parents on board. The third step is the hardest, this when you actually do the work. Its going to be a lot of work too, and it's important not to sacrifice quality for quantity. Your transcript won't directly say you skipped a year. It says when you graduated, what classes you took, and what grades you got. When i applied to university that's the only info I had to input. Graduating early is for you, it won't mean as much to anyone else, this has to be for you. ",
            "date": "Answered July 20, 2017",
            "views": "998",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amairani Yates",
                "href": "/profile/Amairani-Yates"
            },
            "answer_text": "On your first year and second year of high school, work your ass off! Study hard and try to Ace the tests. Try taking some classes that count towards college credit. (They college classes usually count for twice the credit in high school) And by your Junior year it will be like butter. Due to all those credits you build during your first and second year of high school. I wished someone had said this to me 13 years ago! I went into high school, goofing around, not really working like I knew I could, I thought it would be easy to lack and then pick it up in the final years, and I did do that. But boy was I wrong! It was one of the worse things I did. I almost didn’t graduate for my lack towards my school work. My credits, had been so little by the time I was a junior, that I had to work my ass off three times more my senior year. So I recommend to grab high school by the horns since you step foot in there and just work your ass off. If you do, you might have to go to school your senior year but only for ONE CLASS!!! But there’s a high chance you might be able to graduate early. Good luck and remember to study hard! ",
            "date": "Answered May 16, 2019",
            "views": "892",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lyla Sheikh",
                    "user_href": "/profile/Lyla-Sheikh"
                },
                {
                    "user_id": "Justin Smith",
                    "user_href": "/profile/Justin-Smith-2780"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sibylle Hechtel",
                "href": "/profile/Sibylle-Hechtel"
            },
            "answer_text": "Perhaps the most important issue to consider is - what do you want to do after you graduate. If you want to work, you may be too young for numerous jobs. If you want to go to college, consider in which colleges you’re interested, which major and what high school course work would help you for these majors. I graduated high school early, at the end of my junior year, because my situation at home was difficult. My parents were fighting, blamed it on me, and threatened to kick me out of the house. I offered to finish high school a year early, and leave in a few months. However, I really did not take course work that would have helped me in college (I attended Reed college, a tough school). In high school, I had time for only geometry, trig, and algebra 2, but not pre-calc, which I would have taken my senior year. If I’d had pre-calc (or better yet, HS calc - not offered then), it would have been very useful for my college courses. Also, I’d taken biology and chemistry, but not physics. Again, taking HS physics would have made my college course load easier. I did well in high school - in my junior year, I had the top scores, in my school of about 2,000 students, in both the math and English SAT tests, as well as a 5 on my English AP exam. (The only AP course offered at the time in my high school in California in 1969). If you can take courses at a nearby college, you may make friends there with whom you are more compatible. This could help you decide on a college major, and better prepare you for college studies. Good luck! ",
            "date": "Answered July 22, 2017",
            "views": "53",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Talia Robinson",
                    "user_href": "/profile/Talia-Robinson-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Holly Mayfield",
                "href": "/profile/Holly-Mayfield"
            },
            "answer_text": "Along with what others have posted….go to the school counselor. i am going to suggest however that instead of AP classes you take Dual-enrollment classes. These are classes offered by a university or community college and once complete give you credit for high school and college. Classes you can take this way include math, science, English, history, and in someplaces things like automotive technology. Make no mistake, these classes are college level. The professors won't care if you are really a high school student; they will expect the same quality of work as they do for college freshmen and sophomores. i recommend this because dual enrollment classes are sometimes paid for by your high school. And unlike the AP clases, they are on a semester schedule just like college. Less time stuck in class. And before you dismiss “college” please keep in mind these institutions are not just for wannabe doctors and lawyers, etc. Colleges, especially Community Colleges, offer certificate programs that train and help with licensing for police officers, fireman, radio/x-ray technicians, cosmetology, culinary arts, auto mechanics, flabatomy, nursing, home health aid, construction manager, welding, etc. ",
            "date": "Answered June 10, 2017",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adonica Monea",
                "href": "/profile/Adonica-Monea"
            },
            "answer_text": "If your school offers any 0-hour classes or after school classes, consider taking those to open up space for more classes in your schedule. Take summer school for credit advancement if you can afford it, and talk to your counselor at least once every semester to gage how you're doing in your classes and to talk about if it's reasonable to graduate early. If you can take classes online, do that. Don't take on more than you can handle, though, because failing a class means that you won't get the credit necessary to graduate. Do what you can to meet your credit requirements first, before anything. Credits are what allow you to graduate, after all. If it's too much to graduate a full year early, consider graduating a semester early. Keep in mind that graduating early just so you can be out of school is not a valid reason to graduate early. Only do it if you feel that you're capable. ",
            "date": "Answered January 16, 2015",
            "views": "958",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jan Soloven",
                "href": "/profile/Jan-Soloven"
            },
            "answer_text": "You might start by learning all of the required material (including learning that “high school” is two words). Every school has a list of graduation requirements. Study the list carefully. When you anticipate having met the graduation requirements early, discuss your plans with your dean/guidance counselor and parents. You won’t benefit from graduating early if you don’t have a good plan such as college or work. Sitting on your couch watching television every day while your friends are in school will frankly suck. ",
            "date": "Answered November 28, 2016",
            "views": "502",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Justin Smith",
                    "user_href": "/profile/Justin-Smith-2780"
                },
                {
                    "user_id": "Amira O'Reily",
                    "user_href": "/profile/Amira-OReily"
                },
                {
                    "user_id": "Tyler Collie",
                    "user_href": "/profile/Tyler-Collie-2"
                },
                {
                    "user_id": "Nastassja Holm",
                    "user_href": "/profile/Nastassja-Holm"
                },
                {
                    "user_id": "Louis Alexande",
                    "user_href": "/profile/Louis-Alexande-1"
                },
                {
                    "user_id": "Laura Hollister",
                    "user_href": "/profile/Laura-Hollister-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dianne Birzer",
                "href": "/profile/Dianne-Birzer"
            },
            "answer_text": "I answered a similar question before. I would spend a little time considering WHY you want to graduate early. I would argue that most students would be better off not graduating early. Unless you are both extremely smart and very mature you would be better served by getting as much out of high school as possible. The social learning is just as important as any classwork. I will admit there are valid reasons to graduate early but consider carefully. In many cases going away from home to college at a young age is not the best idea. ",
            "date": "Answered November 28, 2016",
            "views": "173",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bianca Gionzago",
                "href": "/profile/Bianca-Gionzago"
            },
            "answer_text": "I am in the top set for everything currently in my year out of 200 students the teachers told us we had a chance to graduate early and do our gcse’s in yr nine (grade 8) and i’m really worried about my future now just make sure it’s something you really want and if you do ADVICE You need to work really hard revise everyday but make sure you have some sort of relaxation don’t overwork yourself you still need to make sure your productive but push your limits. I recommend revise 2–3 different chapters everyday through the week (have one relax day though) and then on one day just go through everything. You should do this continuously or else there no point in doing it because there usually is no progress if the work is not continuos. ",
            "date": "Answered January 27, 2018",
            "views": "664",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Irvin L. Ortega",
                    "user_href": "/profile/Irvin-L-Ortega"
                },
                {
                    "user_id": "Maureen Sharkey",
                    "user_href": "/profile/Maureen-Sharkey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Stagliano",
                "href": "/profile/Tom-Stagliano"
            },
            "answer_text": "Just because you are a straight A student doesn’t mean that you have all of the required course work completed to get a high school diploma. Check with your guidance counselor. You may be able to sign-up for dual enrollment and take some courses at a local college and that may assist you in graduating earlier. I assume you have time for dual enrollment since it doesn’t sound like you are playing on the school’s football, ice hockey and lacrosse teams and getting recruited by Princeton or Yale. All the best. ",
            "date": "Answered July 19, 2017",
            "views": "27",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dam Narrow",
                    "user_href": "/profile/Dam-Narrow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robin Shen",
                "href": "/profile/Robin-Shen-6"
            },
            "answer_text": "Ah, this is very easy. Simply enroll in a local junior college. There is a usually a very simple placement test you take to figure out where you can start. Then, you pay the money and enroll. Let them know you are a high school student. They wont care, they just need to check a box. From that point on, you are a college student and no one will ever care about your highs chool diploma. You can transfer to a 4 year university as a transfer student and they will not care about your high school diploma or GED or whatever. I know this for a fact because I did it. ",
            "date": "Answered July 19, 2017",
            "views": "16",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chike",
                    "user_href": "/profile/Chike-2"
                },
                {
                    "user_id": "Mahesh Jethalia",
                    "user_href": "/profile/महेश-जेथलिया-Mahesh-Jethalia"
                },
                {
                    "user_id": "Mohsin Sadiq",
                    "user_href": "/profile/Mohsin-Sadiq-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Janine Rinker",
                "href": "/profile/Janine-Rinker"
            },
            "answer_text": "Students at our high school sometimes graduate a semester or a year early by taking dual enrollment courses at the local junior college.  I think the ratio is 3 college credits=0.5 HS credit.  The school district pays for their college classes during the school year.  They can actually graduate HS with an associate's degree from the college.  If you also took summer courses at the college, you could graduate sooner (maybe).   The cost would be out of pocket though.  If there isn't a junior/community college in your area, you might find out if your HS will give credit for online college courses. ",
            "date": "Answered January 24, 2016",
            "views": "585",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kris Widla",
                "href": "/profile/Kris-Widla"
            },
            "answer_text": "It really depends on where you live. In some places, there are simple ways, in some there aren’t many. In Canada (Manitoba to be more precise) there is a credit system. You get your compulsory credits and optional credits to meet the graduation requirements, and you graduate. Here you would need to take English, Math and Physical Education earlier than others, but the semester system and summer school would allow for that. There are also special language exams that would allow to challenge the course. I am not sure if this is recommended, but it would not be difficult to do high school in 3 years as opposed to regular 4 years. Here one would also have an option to go to grade 11 at University, and complete their high school, while taking some university courses. https://collegiate.uwinnipeg.ca/ ",
            "date": "Answered February 15, 2019",
            "views": "262",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "J. Rinker",
                "href": "/profile/J-Rinker"
            },
            "answer_text": "It depends on your school district. Some districts would let students graduate early if they completed all required coursework. I would suggest trying to get into dual enrollment at a local community college. We have students graduate high school with an associate’s degree through this program. I think a friend of mine graduated after 3 years and went on to some kind of high school college hybrid program. I also think he was a bit overwhelmed at first. Whether you can and whether you should are different questions, remember. ",
            "date": "Answered January 17, 2020",
            "views": "209",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Neel Kumtakar",
                "href": "/profile/Neel-Kumtakar"
            },
            "answer_text": "I honestly advise you to reconsider going out of high school early. Once you get out, you can never get in. Like you I didn’t have many friends, but the parties and the memories of prom compensated for the lack of social life I had. To graduate early, you will have to get the credits as early as possible which means taking summer and/or winter classes between breaks. ",
            "date": "Answered July 19, 2017",
            "views": "307",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kenneth Archer",
                "href": "/profile/Kenneth-Archer"
            },
            "answer_text": " Like many students do. Find out the requirements of your school district. Do not take study halls or non essential classes. If your focus is college, there should be a program to allow you to go to a local college. If not, drop out of high school, take the GED and then go to college. If you want to go to work instead. There should be a cooperative education program. Or drop out and take the GED. Passing the GED is something that many high school graduates cannot do in the first two times of taking the exams. ",
            "date": "Answered January 22, 2016",
            "views": "604",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joshua Pioch",
                    "user_href": "/profile/Joshua-Pioch"
                },
                {
                    "user_id": "David Newren",
                    "user_href": "/profile/David-Newren-1"
                },
                {
                    "user_id": "Elaine Chew",
                    "user_href": "/profile/Elaine-Chew-3"
                },
                {
                    "user_id": "Nastassja Holm",
                    "user_href": "/profile/Nastassja-Holm"
                }
            ]
        },
        {
            "author_info": {
                "name": "Megan Sorel",
                "href": "/profile/Megan-Sorel"
            },
            "answer_text": "Just set up an appointment with your school advisor/guidance counselor. Let them know your goal. Ask what requirements are needed to graduate (what classes, # of credits, etc). Ask what extra classes you can take to count towards the credits or classes you need. For example, taking college classes in the summer or during the year (they may count for more than one requirement). Basically just work with the counselor to figure out what classes you need to take and how to do so in the time you want to graduate for. Hope this helped! ",
            "date": "Answered July 5, 2017",
            "views": "38",
            "upvotes": " Answer requested by Noah Reppert",
            "upvoters": [
                {
                    "user_id": "Nadezhda Khusnullina",
                    "user_href": "/profile/Nadezhda-Khusnullina"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neil Chavanarorkrat",
                "href": "/profile/Neil-Chavanarorkrat"
            },
            "answer_text": "Very easy. Lots and lots of my friend went to college when they are just 16–17. They aren’t genius, they just understand the system. There are 2 test that would allow you to earn a HS diploma which are GED and IGCSE. GED or General ED Development was for the American educational system. The latter IGCSE or International General Certificate of Secondary Education are the British counterpart. For GED you must be at least 17 years old and IGCSE you must be below 16 years old. You are able to apply for University/College via the 2 diplomas. Some university in my country(Thailand) had a very high minimum score for applicant with GED diplomas due to the difficulty when compare to the IGCSE is much more difficult. I have a friend who goes to Oxford with IGCSE. IGCSE seems to be a very good choice for people who is too smart for school. ",
            "date": "Answered July 19, 2017",
            "views": "21",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Layla M.E",
                    "user_href": "/profile/Layla-M-E"
                },
                {
                    "user_id": "Nastassja Holm",
                    "user_href": "/profile/Nastassja-Holm"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted Falconer",
                "href": "/profile/Ted-Falconer"
            },
            "answer_text": "If you’ve fulfilled all off your high school credits for graduation. I had a twelve year old in my math classes at UCLA. He was an exception. Are you? ",
            "date": "Answered May 8, 2019",
            "views": "152",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Blakelee Brooke",
                    "user_href": "/profile/Blakelee-Brooke"
                },
                {
                    "user_id": "Becca Marius",
                    "user_href": "/profile/Becca-Marius"
                },
                {
                    "user_id": "Kim Pham",
                    "user_href": "/profile/Kim-Pham-34"
                },
                {
                    "user_id": "Erin Garmin",
                    "user_href": "/profile/Erin-Garmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Murkery Knight",
                "href": "/profile/Murkery-Knight"
            },
            "answer_text": "Dumb question that shouldn't be on Quora, but I'll give anyways. To graduate early you must work hard. You're obviously going to have to do more work in a shorter amount of time than your peers. Go to summer school, or join online school and do work. ",
            "date": "Answered June 9, 2017",
            "views": "215",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maureen Sharkey",
                "href": "/profile/Maureen-Sharkey"
            },
            "answer_text": "Graduating high school early is all about meeting the graduation requirements and getting the minimum passing grades. Your counselor can help you with this. A2A ",
            "date": "Answered November 28, 2016",
            "views": "114",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alan Zoller",
                "href": "/profile/Alan-Zoller-1"
            },
            "answer_text": "Don’t. Take all the AP classes you can to test out of as many 1st year college courses as you can. Also, if you get all A’s, you have a much better chance of getting into your “dream schools” and getting financial aid from most of them. No college cares if you graduated early, they will just compare you to the students who took the route I just described and find you lacking. ",
            "date": "Answered July 15, 2018",
            "views": "259",
            "upvotes": " Answer requested by Naru Rise",
            "upvoters": [
                {
                    "user_id": "Andrew Ageyev",
                    "user_href": "/profile/Andrew-Ageyev"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ethan Chiu",
                "href": "/profile/Ethan-Chiu-5"
            },
            "answer_text": "Well you can take the GED and receive a certificate which is equivalent to a high school diploma. Then, you can go to a local community college which will give you a clear path to a state university. Alternatively, you can cram all your graduation requirements by taking summer classes and taking a huge class load. It’s definitely very feasible to graduate within 3 years. I’ve only met 1 person who has ever graduated in 2 years and she took a lot of online classes to complement her high school classes. ",
            "date": "Answered September 8, 2017",
            "views": "251",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jacob Thayer",
                "href": "/profile/Jacob-Thayer"
            },
            "answer_text": "Enjoy high school, it's not just about the intellectual education, but the practical/social experiences. You want to enjoy and learn from those. If you're trying to go to college that young, you're going to find yourself rather retarded in terms of social skills/practical knowledge. Plus you'll be restrained by the 18/21 age limits to get into places. Relax. Enjoy it. You'll regret it if you don't. ",
            "date": "Answered December 9, 2014",
            "views": "59",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jack Wilson",
                    "user_href": "/profile/Jack-Wilson-293"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brandon Shiflet",
                "href": "/profile/Brandon-Shiflet"
            },
            "answer_text": "My school allows you to take summer classes and this speeds your classes up. So by the time you are a junior I a senior you basically have no classes and all study halls. You will technically have achieved the required amount of credits to graduate, but you still have to take state tests and the state also requires you too spend a cearyain number if days in the classroom per year per grade. So you may be able to take some extra classes over the summer, you may not. It all depends on what type of school you go too. ",
            "date": "Answered March 12, 2017",
            "views": "47",
            "upvotes": " Answer requested by Nitacki Stallings"
        },
        {
            "author_info": {
                "name": "Michael Eyes",
                "href": "/profile/Michael-Eyes-1"
            },
            "answer_text": "Yes, if you start taking dual credit early from the 9th grade and take them in summer it is possible but its very very hard, you can join a challenge high school too. It consists of only 9th and 10th grade, then switches you to a community college. ",
            "date": "Answered May 7, 2019",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jennifer Suzanne Fisher",
                "href": "/profile/Jennifer-Suzanne-Fisher"
            },
            "answer_text": "If you're academically successful then you should be able to start college and use your college hours towards your high school time. ",
            "date": "Answered January 6, 2020",
            "views": "62",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Julian Lee",
                "href": "/profile/Julian-Lee-32"
            },
            "answer_text": "CLEP, DSST - credit by examination. Start college while in highschool and you'll save yourself a ton of money and time. ",
            "date": "Answered July 22, 2017",
            "views": "213",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Kavin Thakkar",
                "href": "/profile/Kavin-Thakkar-1"
            },
            "answer_text": "This link has another link: Kavin Thakkar's answer to Should I graduate high school early? Enjoy, -Kavin Thakkar ",
            "date": "Answered June 1, 2018",
            "views": "201",
            "upvotes": " Answer requested by Naru Rise"
        },
        {
            "author_info": {
                "name": "Anthony H Popp",
                "href": "/profile/Anthony-H-Popp"
            },
            "answer_text": "It’s possible if you study real hard do extremely well on your test you can cut some time off of high school ",
            "date": "Answered November 23, 2019",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Frederick Leiserson",
                "href": "/profile/Frederick-Leiserson"
            },
            "answer_text": "You certainly can if you’re brilliant enough. My uncle who died in the war graduated M.I.T at age 20. I’ve also heard of Medical Doctors graduating Med School and practicing at age 21. I doubt either are typical though. ",
            "date": "Answered January 17, 2020",
            "views": "166",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gregg Erickson",
                "href": "/profile/Gregg-Erickson-6"
            },
            "answer_text": "No. ",
            "date": "Answered October 22, 2018",
            "views": "32",
            "upvotes": "0"
        }
    ]
}