{
    "title": "How do teachers keep track of all their kids grades? - Quora",
    "tags": [
        "Grades (education)",
        "Teachers",
        "Teaching",
        "Children"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ilona Juhanson",
                "href": "/profile/Ilona-Juhanson-1"
            },
            "answer_text": "Most Estonian schools use online systems for this. Two of these are called Ekool (literally e-school) and Stuudium. What does it look like? You have the same number and letter combination as the class (year nine would be 9, and if there are two year nines, then one would be 9A and the other 9B). If you click on that, the class list will open, you will see the students, all the previous lessons (date, homework, lesson description) as well as tests. You can set the date for the test and the system will not let you add a test if somebody else already has (it’s law: you can only have one big test per day; doesn’t apply to quizzes). In fact, it looks very similar to an MS Excel sheet. You also receive a day planner from the school (with the school logo, no less) which has pages with allocated spaces for kids’ names and slots for grades. Here’s a picture of the math class I taught this year:  As you can see, there’s the class symbol - year and letter. On top, I’ve marked the dates, so there’s a neat correspondence between grades and dates, as well as marking what was done in class - just in case I forget once I get home. Ekool and Stuudium look very similar to this. Don’t be fooled, I don’t keep their grades in my head. I’m fairly certain most schools either use online systems analogous to the two I mentioned or use pen on paper methods. ",
            "date": "Updated June 27, 2018",
            "views": "269",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Leanne Phillips",
                    "user_href": "/profile/Leanne-Phillips-9"
                },
                {
                    "user_id": "Marcy Buono",
                    "user_href": "/profile/Marcy-Buono"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thara Ravishanker",
                "href": "/profile/Thara-Ravishanker-1"
            },
            "answer_text": "I use a online grading system called Engrade for this purpose. After I finish grading work, I type the actual final grade into the online system and it is calculated accordingly. I mark pop quizzes this way too. Even better, it is free and I can track attendance as well. I even have the option to make class lists and encourage pupils to monitor progress. When I am at home, I simply open it up on my laptop along with a spreadsheet and spend about 1–2 hours simply marking work. It makes my life a lot easier. I do not have to waste time or money on unnecessary note books or pens either. Back in the day, you had to write down grades on a piece of paper or use a formalized ledger book to record grades. ",
            "date": "Answered December 6, 2018",
            "views": "97",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Thomas",
                "href": "/profile/David-Thomas-805"
            },
            "answer_text": "I used a software program called Gradebook. When the school district bought into the state’s online record keeping software, Student Information Service or SIS. Each allows a teacher to enter and weight assignments, quizzes, and tests; to print out an individual or class sheet of missing assignments; and to generate a report card. To keep track of work that had been assigned but not handed in yet, I used a checkoff sheet on a clipboard. ",
            "date": "Answered June 26, 2018",
            "views": "132",
            "upvotes": " Answer requested by Reed Harvey",
            "upvoters": [
                {
                    "user_id": "Maxene Kupperman-Guiñals",
                    "user_href": "/profile/Maxene-Kupperman-Guiñals"
                },
                {
                    "user_id": "Matt Johnson",
                    "user_href": "/profile/Matt-Johnson-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allen M. Morris",
                "href": "/profile/Allen-M-Morris"
            },
            "answer_text": "You asked how a professional educator keeps up with the students’ grades. It can eat the instructor’s lunch if a system is not set in place first. It’s the same with exams. That is, an exam that is poorly designed can take hours to grade, but this was not your question. It is best for everyone if the assignments are planned and organized. I am in email contact with all of my students. Assignments are made via email, announced in class, and turned in via email. I have used this system for years and it works. No assignments are ever lost by anyone. Being organized upfront is always the best. ",
            "date": "Answered June 22, 2018",
            "views": "147",
            "upvotes": " Answer requested by Reed Harvey",
            "upvoters": [
                {
                    "user_id": "Hafiz Ansar",
                    "user_href": "/profile/Hafiz-Ansar-2"
                },
                {
                    "user_id": "Maxene Kupperman-Guiñals",
                    "user_href": "/profile/Maxene-Kupperman-Guiñals"
                },
                {
                    "user_id": "Lucas Morales",
                    "user_href": "/profile/Lucas-Morales-11"
                },
                {
                    "user_id": "Reed Harvey",
                    "user_href": "/profile/Reed-Harvey-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hillary Sibille",
                "href": "/profile/Hillary-Sibille"
            },
            "answer_text": "A2A. When I first started teaching, we had grade books—notebooks set up a little like a ledger. Every time you grade students’ work, you write the grades in book. At the end of the marking period, you calculate the averages. Today (and for a while now), we have electronic grade books. It’s the same principle. We enter the grades every time we assess student work. The nice thing is the electronic grade book offers many options for weighting the difference pieces of work and it calculates the averages automatically. ",
            "date": "Answered June 22, 2018",
            "views": "130",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Micheal Kuznar",
                    "user_href": "/profile/Micheal-Kuznar"
                },
                {
                    "user_id": "Addison Smith",
                    "user_href": "/profile/Addison-Smith-24"
                },
                {
                    "user_id": "Maxene Kupperman-Guiñals",
                    "user_href": "/profile/Maxene-Kupperman-Guiñals"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dillon Prochnicki",
                "href": "/profile/Dillon-Prochnicki"
            },
            "answer_text": "Before they become teachers, they are given a very difficult test. Harder than the Bar exam, Medical boards, CPA, etc. They are given 130 students, each having completed 13 assignments. They must memorize all 1690 individual assignment grades in order to pass and become a teacher. If they are incapable, they have to seek another career. ",
            "date": "Answered June 25, 2018",
            "views": "96",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kathleen Listman",
                "href": "/profile/K-N-Listman-1"
            },
            "answer_text": "When I started I used a ledger, and recorded grades on it. I basically had two types: quiz daily grades, and tests/exam (exams counted twice). When I returned to teaching, I embraced the computerized grade books as these made grading so much easier. I still kept a ledger but would transfer grades to the computer spread sheet and could instantly tell the students’ grade point averages. ",
            "date": "Answered June 22, 2018",
            "views": "106",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maxene Kupperman-Guiñals",
                    "user_href": "/profile/Maxene-Kupperman-Guiñals"
                },
                {
                    "user_id": "Shelli King",
                    "user_href": "/profile/Shelli-King"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Tam",
                "href": "/profile/George-Tam-6"
            },
            "answer_text": "They keep track of grade by using software provided to them by schools. They could use free software available on the Internet. You can also keep track the traditional way of using a grade book. ",
            "date": "Answered June 22, 2018",
            "views": "33",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cat Siena",
                    "user_href": "/profile/Cat-Siena"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Mallon",
                "href": "/profile/Ken-Mallon"
            },
            "answer_text": "They enter grades into software systems. Different schools have different systems but they just enter the results and input their grading rubric. The software does the rest. Some small schools that are less sophisticated might use spreadsheets. ",
            "date": "Answered June 24, 2018",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Lascelles",
                "href": "/profile/David-Lascelles"
            },
            "answer_text": "In the absence of a decent VLE database (like ProMonitor l, which will track all grades for every student in a school or collge) Excel is your friend. Failing any IT being available you can do a lot with a grid of student names and the assignments… ",
            "date": "Answered June 24, 2018",
            "views": "138",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Emily Werbeloff",
                "href": "/profile/Emily-Werbeloff"
            },
            "answer_text": "You can buy a Teacher Record Book at Staples for about $5.00. With that, you can record attendance and test scores. ",
            "date": "Answered June 22, 2018",
            "views": "47",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Matthew Van Blaricom",
                "href": "/profile/Matthew-Van-Blaricom"
            },
            "answer_text": "Most districts have a system like powerschool. Most teachers input grades into two places. Either excel or Google sheets. ",
            "date": "Answered June 22, 2018",
            "views": "32",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Stanislava Suplatovich",
                "href": "/profile/Stanislava-Suplatovich"
            },
            "answer_text": "They have computers and databases or keep notes. ",
            "date": "Answered June 22, 2018",
            "views": "11",
            "upvotes": " Answer requested by Reed Harvey"
        },
        {
            "author_info": {
                "name": "Crystal Laplante",
                "href": "/profile/Crystal-Laplante"
            },
            "answer_text": "Plug them into an excel spreadsheet ",
            "date": "Answered June 23, 2018",
            "views": "16",
            "upvotes": " Answer requested by Reed Harvey"
        }
    ]
}