{
    "title": "How to go to bed - Quora",
    "tags": [
        "Write About Daily Routines",
        "Habits",
        "Sleep Habits",
        "Sleep"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bhupinder Nayyar",
                "href": "/profile/Bhupinder-Nayyar-1"
            },
            "answer_text": " In this technological-era people are suffering from fatigue and sleep is one of the best thing you can give to your body. Sleeping habits varies person-to-person. But what everyone can follow is these 5 actionable habits for a better sleep.  1. Drink Milk Before Going To Bed :    Drinking a glass of warm milk before bed will help you to sleep better - it's not just a tale. Dairy products are rich in the amino acid tryptophan, which helps in the production of the sleep inducing brain chemicals, serotonin and melatonin. 2. Turn Your Bedroom Into Cave :  Before going to sleep make your room dark as much as you can, and take the step by switching off the light. Sleep in complete darkness.  (Tip: you can also change your current curtains into Black colour) 3. No Phones In The Bedroom :  Your phones blue light is the biggest reason why you are still awake. So keep your phones in another room and prevent yourself from social media.  4. Exercise In Morning :   Exercising in the mornings improves blood pressure and sleep quality. People sleep significantly better and feel more alert during the day if they get at least 150 minutes of exercise a week, a new study concludes.   5. Positivity :   Don't complain and have the present opportunity to accept the things. There's always a tomorrow. If you didn't get a good night sleep today then tell yourself you will get better.  I hope these 5 simple actionable habits will make you go to bed fast and effectively.  The post was originally posted here if you need proof : How To Sleep Better In 1 hour? Let me know if these helps you by connecting me on facebook>>> Bhupinder Nayyar or follow me on Twitter >>>Bhupinder Nayyar twitter. Cheers! ",
            "date": "Answered March 12, 2016",
            "views": "362",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ajay Thakur",
                    "user_href": "/profile/Ajay-Thakur-33"
                },
                {
                    "user_id": "Irvin Alfaro",
                    "user_href": "/profile/Irvin-Alfaro"
                },
                {
                    "user_id": "Krishna Patel",
                    "user_href": "/profile/Krishna-Patel-157"
                }
            ]
        },
        {
            "author_info": {
                "name": "Janis Butevics",
                "href": "/profile/Janis-Butevics"
            },
            "answer_text": "Here is my routine. Time Machine (In my mind)For 30 minutes I go back to my day and rethink all the things happened . If something was negative in my day I change it to positve in my mind. StretchingI do it for 30 minutes. It helps to relax my muscles and body after long day. Cottage CheeseI eat it now for 5 years before bed time. Creating to do list for TomorrowIt helps me to be more productive in the next morning. 10 Power minutes for myself I start these 10 minutes with breathing exercise ( For 2 minutes), then I think about 3 things that I'm thankful for (4 minutes), and then I finish these 10 minutes with vision how I achieved my 3 goals.  After these 10 minutes I feel fresh, positive and motivated.   Go to bed! ",
            "date": "Answered March 27, 2016",
            "views": "387",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dwija Baxi",
                    "user_href": "/profile/Dwija-Baxi"
                },
                {
                    "user_id": "Evangelin Jenifer",
                    "user_href": "/profile/Evangelin-Jenifer-2"
                }
            ]
        }
    ]
}