{
    "title": "How to start preparing for NEET 2021 - Quora",
    "tags": [
        "NEET Preparation",
        "National Eligibility cum Entrance Test (NEET)",
        "Exam and Test Preparation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aakash Mishra",
                "href": "/profile/Aakash-Mishra-122"
            },
            "answer_text": "Hello, Here are 10 best ways. 1) Study planner A goal oriented study plan is necessary to keep you focused and motivated through the long journey of completing the syllabus and excelling in the concepts. Devise a monthly plan and a weekly target for each subject. The planner should also include a daily target to help you achieve the weekly goal. Keeping a tab on the daily study schedule will be a pushing factor to do more. The study planner has to be followed diligently because it allows you to put sustained effort and not get exhausted right in the beginning. This strategy demands utmost sincerity and discipline on the part of candidate. Self motivation is the prerequisite to begin the preparation for the country’s biggest medical entrance exam. Adequate time should be allotted to each section regardless of the fondness for a particular subject. Physics is most commonly considered as the most difficult subject of all and candidates tend to avoid it. However, it is necessary to understand that with due practice and clear understanding of basic concepts, a subject like Physics can be triumphed upon. 2) Clarity of Concept Most common mistake that an aspirant makes in the preparation strategy is to mug up all the concepts without having a clear understanding of the subject. Cramming up the concepts seems like an easy way through a vast syllabus such as one for NEET 2020, therefore instead going through the basics, aspirants resort to rot learning. This memorization technique might sound useful but it is not fruitful in the long run. It is essential to go through the basic concepts and have clarity of crucial topics in order to build a strong foundation on which the entire syllabus rests upon. If the basics are strong, the whole syllabus can be memorised easily. If the syllabus is completed through rot learning, there is a higher probability of forgetting it at the hour of examination. It is advisable to have a better understanding of the syllabus and basic concept in order to retain it for a longer time. 3) Clearing Doubts It goes without saying that there will be numerous doubts that will need clarification while studying for NEET. If a candidate has doubts in the syllabus then it is not a matter of worry but rather is an indication that the candidate is putting adequate effort in learning. At times doubts arising while learning might break the flow of the study. In such a case, it is advisable to seek help at the earliest to carry on with the studies. Keeping the teacher or the mentor in constant touch helps as they are instrumental in not just clearing doubts but also boosting the morale of the NEET aspirant. It is essential to discuss all the doubts and not leave it for guesswork as it can cost you marks. To crack NEET 2020 aspirants must have clarity of the concepts and resolving the doubts is imperative for that. 4) Practice makes you perfect Along with preparing for the syllabus, aspirants must try to incorporate practice session in the stud schedule. Solving previous years’ question and mock test papers are the best way to test your preparation as well as add value to the prep. Solving the question papers expands the horizon of knowledge of the type of questions that can be asked. Candidates must spend at least one hour of time-bound practice to get accustomed to the sit and solve the question paper without a break. This strategy will allow the candidates to acclimatize themselves to the exam like condition and exam day pressure. Since NEET is a pen and paper based mode examination, the candidates will be required to fill OMR answer sheets. Candidates tend to lose marks even when they know the right answer because of filling the wrong bubbles in the OMR sheet. To crack NEET with maximum marks, one should build a strategy to fill the bubbles with precision and solve the questions faster. 5) Exhaustive Revision In all the tips to crack NEET 2020, revision stands out as the main one as it helps in retaining the topics that has been learnt. Examination tries to check your ability to retain the subject knowledge in the best possible manner. Only extensive revision can ensure maximum level of retention of the subject matter learnt. Candidates can try revising by writing down the summary of concepts in their own words so as to assess the degree to which they have grasped the topic. Subjects like Physics and Chemistry have formulae and equation that has to be memorised, for such things, one can make a formulae copy that has to be revised on daily basis so that is instilled in the memory. Not just memorization, aspirants need to learn the application of all the formulae. 6) Make you own notes Studies can be made easier with making your own personalised notes of each subject and topic. The notes should be strategically arranged so that you can visit those pages again for a quick revision. Making notes is also helpful in memorising of concepts in the best possible way. Writing along with reading adds to the understanding of a particular concept. Diagrams, flowcharts, figures and tables in the NCERT text books are directly taken up by the examiner which candidate can practice in writing. This way there are greater chances of understanding and retaining the components of a diagram or a flowchart. 7) Balancing self studies and coaching A lot of aspirants take the help of coaching centres to realise their dream of becoming a doctor. The study schedule as provided in coaching centres might seem like a formidable task but it is essential to understand that the self-study is also an important component to crack NEET 2020. Aspirants must strive to balance the coaching study schedule with self study. The coaching institute might overlook your minute mistakes which you are aware of, thus it is highly recommended to identify such mistakes and work on your weak subjects and aspects of preparation to achieve maximum number of marks. Overlooking silly mistakes may cost you a MBBS seat. 8) Study space Preparation for NEET requires you to refer to various books therefore having a comfortable space where you have enough space to spread your textbooks and notes out can be beneficial. Choose a comfortable area which is far from all the distractions. A well lit corner and a comfortable chair that helps the posture should be chosen because sitting in dim light in wrong posture for long hours can affect your health and eyesight. Create an environment that works the best for you that would motivate you to sit for long hours of preparation. 9) Exam day strategy To be able to bring your A-game to the exam centre aspirants must make sure that you get everything ready well in advance of the exam. According to the rules and requirements make a checklist for the documents and items that you need to carry along with you. Plan your route and journey time a day before so that there are no surprises on the day of examination. Being late on the exam day adds to the stress and hence its best avoided. NEET has a strict dress code and rigorous frisking takes place at the exam centre. Try and reach an hour before the time of examination so as to make it easy for the exam administration to conduct the exam smoothly without any hassle. Make plans for the question paper of how you will solve the question paper and how much time should be devoted to each section to keep the focus on. 10) Break time The overwhelming pressure of board exams and NEET can be daunting which could bring down an aspirant’s spirit in such situation, it is necessary to realise that panicking and overworking will not be reap results in the long run. It is very crucial to take ample amount of rest and plan the study schedule such that there is break time at regular intervals. Break time is when one should pursue their hobbies and put a pause on the regular mugging up of concepts. Going out in the open is most advisable as it helps to rejuvenate the exhausted brain and bring fresh energy. To crack NEET, one needs to maintain their health as well. Sleeping on time, waking up early and eating a balanced diet is very instrumental in keeping you right on the path to success. If you like my answer please upvote and follow me for more updates of neet and jee. ",
            "date": "Answered June 24, 2020",
            "views": "53",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pooja Nila",
                    "user_href": "/profile/Pooja-Nila"
                },
                {
                    "user_id": "Bhramarambika",
                    "user_href": "/profile/Bhramarambika-1"
                },
                {
                    "user_id": "K.h",
                    "user_href": "/profile/K-h-1396"
                },
                {
                    "user_id": "Vijaya Karthegha",
                    "user_href": "/profile/Vijaya-Karthegha"
                },
                {
                    "user_id": "Sirulu",
                    "user_href": "/profile/Sirulu"
                },
                {
                    "user_id": "Abhijit Reddy",
                    "user_href": "/profile/Abhijit-Reddy-22"
                },
                {
                    "user_id": "NAYANSHI Gourav",
                    "user_href": "/profile/NAYANSHI-Gourav"
                },
                {
                    "user_id": "SVETLANA VERGHESE",
                    "user_href": "/profile/SVETLANA-VERGHESE"
                },
                {
                    "user_id": "Deepthi Daggolu",
                    "user_href": "/profile/Deepthi-Daggolu"
                },
                {
                    "user_id": "Fifi",
                    "user_href": "/profile/Fifi-196"
                },
                {
                    "user_id": "Mounika Vaidani",
                    "user_href": "/profile/Mounika-Vaidani-1"
                },
                {
                    "user_id": "Chandan Das",
                    "user_href": "/profile/Chandan-Das-946"
                },
                {
                    "user_id": "Komal Singh",
                    "user_href": "/profile/Komal-Singh-1698"
                },
                {
                    "user_id": "Suyash Sharma",
                    "user_href": "/profile/Suyash-Sharma-132"
                },
                {
                    "user_id": "Karishma Sharma",
                    "user_href": "/profile/Karishma-Sharma-448"
                },
                {
                    "user_id": "Masoom Patel",
                    "user_href": "/profile/Masoom-Patel-6"
                },
                {
                    "user_id": "Purna Chandrika",
                    "user_href": "/profile/Purna-Chandrika-6"
                },
                {
                    "user_id": "Ahana Chakraborty",
                    "user_href": "/profile/Ahana-Chakraborty-16"
                },
                {
                    "user_id": "Srinath Rocker",
                    "user_href": "/profile/Srinath-Rocker"
                },
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Purini Jayachithra",
                    "user_href": "/profile/Purini-Jayachithra"
                },
                {
                    "user_id": "ONLY LEGEND",
                    "user_href": "/profile/ONLY-LEGEND-2"
                },
                {
                    "user_id": "Neha Parween",
                    "user_href": "/profile/Neha-Parween-74"
                },
                {
                    "user_id": "Preeti Patnaik",
                    "user_href": "/profile/Preeti-Patnaik-22"
                },
                {
                    "user_id": "Mrityunjay Verma",
                    "user_href": "/profile/Mrityunjay-Verma-8"
                },
                {
                    "user_id": "Renuka Surla",
                    "user_href": "/profile/Renuka-Surla"
                },
                {
                    "user_id": "Sridhar Bagaluri",
                    "user_href": "/profile/Sridhar-Bagaluri-1"
                },
                {
                    "user_id": "Diksha Gangurde",
                    "user_href": "/profile/Diksha-Gangurde-8"
                },
                {
                    "user_id": "Ramesh Varan",
                    "user_href": "/profile/Ramesh-Varan-2"
                },
                {
                    "user_id": "Aaditya .",
                    "user_href": "/profile/Aaditya-136"
                },
                {
                    "user_id": "Ruhi Afsar",
                    "user_href": "/profile/Ruhi-Afsar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prasidh Dutta",
                "href": "/profile/Prasidh-Dutta"
            },
            "answer_text": "Hello Students, Festive season is going on and we already have the pandemic on our head. Many of the students have either dropped this year due to the pandemic and many were unable to attend the exam since they are stuck in containment zones or were unable to travel from native place to examination centers. It has been a devastating year for many where in some students have excelled the exam by scoring 720/720. I was a student with Altus Knowledge few years back and even I dropped one year to prepare with them. I started preparing from 11 th class with a different coaching center and my results were just below okay but not satisfactory to what I really wanted. I had my believes and got to study with a great venture and was able to crack the exam attaining more than what I was even expecting. Coming to how you should start preparing for the exam in October 2020 for NEET 2021 or any examination, lets divide the entire thing by SWOT analysis (Strength, Weakness, Opportunity and Threats) Strengths: Strengths in particular to examinations are your internal factors and capabilities which you can further enhance and utilize towards your examination goals. To simplify, let’s say I have the following Strengths: · Quick learner · Topic oriented learning · Theory to Practical/Numerical propagation · Ability to study for long periods · Focus It can vary from student to student or person to person. The whole idea of listing out such attributes is to self-realize what you can do and what potential lies in you. Many students learn differently, some learn each topic in sequence as per the syllabus, some learn as per what topics have been in the examination and have been asked most of the times. The difference in both the students is that one is spending almost same amount of time on each topic and the other one has prioritize his/her time as per the number of times each topic has been asked. Both has their pros and cons and going in detail will make this a debatable topic here. The whole idea of me discussing the entire thing is just to highlight how you and your strengths can give you that extra push by which you will be able to score more. Likewise, ability to Study for long periods will also vary, some students like to refresh themselves after every interval of time and some like to study and maintain the rhythm for at-least 4-5 hours in one go. The moment you utilize what your strengths are, you will be able to plan your day and weeks how you will have to study. Here the coaching institution’s role also come into existence where-in they can help you make the most of it, dealing with more experienced faculties on day to day basis and making your time productive. Altus knowledge helped me to do so, the study material they provided and the facility of offline classes and lectures helped me to study as per my schedule not in the time what coaching institute operates. Weaknesses: This is the most critical factor in any planning and most likely people always fail in realizing what their weaknesses are and what affect them the most. Listing out the weaknesses can help you overcome some and avoid the remaining in order to excel in the examination. Listing out some of the common weaknesses here: · Social/Personal life · Addiction to Smart phones or Internet · Health issues · Lack of focus on studies · No proper day planning The first two weaknesses lie in everyone and the motive is to realize and eliminate those factors which can ultimately affect your studies. Eliminating does not meaning completely removing or getting off from social media or cutting your personal/friend circle, is only to limit to an extent that it is not affecting the time you study. Like if I am studying for my examination, I clear my mind and do not think anything else rather than my dreams of attaining a good score. Health issues is also a critical factor which cannot be ignored at any cost. Stress and inner health should be taken care of as it can easily make or ruin your entire career. Mental peace and health is also needed because it doesn’t matter if you study for 9 hours a day and you have lost your focus and your health is deteriorating, you will not be able to gasp any of it moreover your time will be lost. Many of the students do not realize it and are mostly affected by it. Studying in with Altus was a great experience for me, their guidance and structure is planned in a way and is flexible as per your day planning and preferences as well. This is the best thing about an offline/online coaching institute which is also the future now after the pandemic came into existence. But they have been doing it since many years. Going out for studies bring in 100’s of factors which can easily divert your mind and the level of focus will never be there on each day. Opportunities: This is the most interesting part of any analysis. Opportunities are something which has to be grabbed as soon as possible because they have a time frame and limited availability, just like a shopping sale – limited stocks and limited time. Comparing it with the examination and how you should be planning your day and time – opportunities for a student would be: · Time Utilization · Taking Mock examinations · Studying in a planned module · Studying the right thing and in a right way at the right time Time is the most precious thing we have in any preparation, wasting 1 hour may not sound a big thing but wasting 1 hour each day in 365 days can make a huge difference. Similarly studying for 1 extra hour or that 10 extra numericals each day may not sound like a big thing in a small period but you will witness the change on the long go. Getting hold of your 24 hours of every day is the most crucial thing in life and the one who does can achieve anything. Mock examinations or test series or a complete set of examination is the best thing to grab later in your preparation. Such exams can make you realize where you have been lacking and where you are good. Such realizations will help you work on your weakness and strengthen your strengths. Altus knowledge offers a great collection of test series questionnaires and full length examination papers conducted throughout the year and are available at a reasonable price as well. Not sure about the current prices but at my time they were very decent. Planned module and studying the right thing in a right way at the right time may sound catchy but I will simplify it for you. Let’s say you have a great understanding on Organic Chemistry and you enjoy studying it. Many of us what do is, we underestimate it and take questions based on Organic Chemistry lightly and ultimate what happens in the examination is that we know what the topic is and even from which book it has been asked, but since we did not practice and revise it, you are unable to re-collect and solve the question during the exam. Neglecting any topic whether you are weak at it or strong, can lower your score by at least 10 marks and this make a hell lot of change during selections of colleges. Altus offers a rank booster program which has such sets of questions which are most likely to be asked in the examination, they do it by probability of each question to be repeated and they are able to crack it by at least 70% which is a great thing to do. Studying those questions, a month before examination can make huge changes and raise your entire score by at least 30-50 marks. Which actually did happen for me two years back. Threats: Many of us will get confuse between threats and weaknesses as they may sound similar but they are different. Weaknesses are your personal traits and threats are most likely those external factors which can affect your preparation planning. Some of them are: · Extra-ordinary questions or question asked in an examination which you may not find in any text book · A complex numerical which can take long time to solve · A very basic questions which we mostly ignore to give attention There could be different other factors as well such as any mishap or loss which can affect the student mentally. Complex calculations and the time you spend on each questions to solve is the key to attain more marks and attempt more number of questions. Altus helped me a lot with this and I will be always thankful to their faculty for making such tricks and tips in which you can solve a 5-minute question in less than a minute. Obviously it is not a hack or cheat, it is done by practicing more and more, and by using a different approach and method to a question which is an un-conventional way which you will not find anywhere. They have also showed some examples on their YouTube channel. Moreover, we all are humans and are tend to make mistakes, what is best we can do is make the most of it and try to avoid such factors. I hope this analysis will help you and can also be used to make and analyze any plan in the future. Good Luck for NEET 2021. ",
            "date": "Answered October 29, 2020",
            "views": "290",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Madhu Patel",
                    "user_href": "/profile/Madhu-Patel-165"
                },
                {
                    "user_id": "Krishna Ji",
                    "user_href": "/profile/Krishna-Ji-44"
                },
                {
                    "user_id": "Drjeyasakthy Prabakar",
                    "user_href": "/profile/Drjeyasakthy-Prabakar"
                },
                {
                    "user_id": "Atharv Rao",
                    "user_href": "/profile/Atharv-Rao-1"
                },
                {
                    "user_id": "Ravi Kiran",
                    "user_href": "/profile/Ravi-Kiran-3823"
                },
                {
                    "user_id": "Arun Gokul",
                    "user_href": "/profile/Arun-Gokul-28"
                },
                {
                    "user_id": "Shital",
                    "user_href": "/profile/Shital-67"
                },
                {
                    "user_id": "Royal Ronak",
                    "user_href": "/profile/Royal-Ronak-1"
                },
                {
                    "user_id": "Bhramarambika",
                    "user_href": "/profile/Bhramarambika-1"
                },
                {
                    "user_id": "Rushikesh Naik",
                    "user_href": "/profile/Rushikesh-Naik-13"
                },
                {
                    "user_id": "Mili Mazumder",
                    "user_href": "/profile/Mili-Mazumder-1"
                },
                {
                    "user_id": "Mahi Sharma",
                    "user_href": "/profile/Mahi-Sharma-607"
                },
                {
                    "user_id": "Sindhu Venkatesh",
                    "user_href": "/profile/Sindhu-Venkatesh-27"
                },
                {
                    "user_id": "Jahanavi Gupta",
                    "user_href": "/profile/Jahanavi-Gupta-5"
                },
                {
                    "user_id": "Sarvjit Kaur Nitu",
                    "user_href": "/profile/Sarvjit-Kaur-Nitu"
                },
                {
                    "user_id": "Karuna Kumari",
                    "user_href": "/profile/Karuna-Kumari-134"
                },
                {
                    "user_id": "Shubicshaa Shree",
                    "user_href": "/profile/Shubicshaa-Shree"
                },
                {
                    "user_id": "Sunainaa Murmu",
                    "user_href": "/profile/Sunainaa-Murmu"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Rahmat-Alam-Official"
                },
                {
                    "user_id": "Gayathri Senthilkumar",
                    "user_href": "/profile/Gayathri-Senthilkumar-17"
                },
                {
                    "user_id": "Chanchal Jangid",
                    "user_href": "/profile/Chanchal-Jangid-9"
                },
                {
                    "user_id": "Malathi Ganesh",
                    "user_href": "/profile/Malathi-Ganesh-1"
                },
                {
                    "user_id": "Jat Jat",
                    "user_href": "/profile/Jat-Jat-52"
                },
                {
                    "user_id": "Anju Chinnu",
                    "user_href": "/profile/Anju-Chinnu-3"
                },
                {
                    "user_id": "Akriti Kash",
                    "user_href": "/profile/Akriti-Kash"
                },
                {
                    "user_id": "Sushant Halagali",
                    "user_href": "/profile/Sushant-Halagali"
                },
                {
                    "user_id": "Shivani Negi",
                    "user_href": "/profile/Shivani-Negi-101"
                },
                {
                    "user_id": "Gagana",
                    "user_href": "/profile/Gagana-18"
                },
                {
                    "user_id": "Ritul Pargaie",
                    "user_href": "/profile/Ritul-Pargaie-14"
                },
                {
                    "user_id": "Shama Praveen",
                    "user_href": "/profile/Shama-Praveen-2"
                },
                {
                    "user_id": "Ayushi Bhagat",
                    "user_href": "/profile/Ayushi-Bhagat-14"
                },
                {
                    "user_id": "Nancy Negi",
                    "user_href": "/profile/Nancy-Negi-5"
                },
                {
                    "user_id": "Shanmukha Ratna",
                    "user_href": "/profile/Shanmukha-Ratna"
                },
                {
                    "user_id": "Mukul Dadheech",
                    "user_href": "/profile/Mukul-Dadheech"
                }
            ]
        },
        {
            "author_info": {
                "name": "Varsha Kumari",
                "href": "/profile/Varsha-Kumari-263"
            },
            "answer_text": "If you are a medical aspirant then NEET is undoubtedly the most important exam for you. Beginning the preparation for NEET 2021 right now gives you sufficient time to be ready for the exam. With this amount of time left, you can start from the very basics and cover each and every topic in detail. All you need to do is follow the right strategy for preparation. Complete Preparation Guide for NEET 2021 If you are anxious to prepare for NEET 2021 and want to clear it with a good score, you can follow the strategy given below. 1. Know your syllabus and exam pattern First of all, you must know all about the NEET 2021 exam pattern and its syllabus. An insight of the syllabus and pattern can help you plan your preparation in a better manner. Exam pattern · Duration of exam: 3 hours · Number of questions: 180 · Type of questions: Objective type · Total marks: 720 · Marking scheme: 4 marks will be given for each correct answer · Negative marking: 1 mark will be deducted for each incorrect answer Syllabus The syllabus for NEET will comprise of the topics from the subject of Physics, Chemistry and Biology of standard 11th and 12th. Some of the important topics from these subjects that must not be ignored under any condition are mentioned below: · Physics: Optics, Thermodynamics, Electronic Devices, Current Electricity, Electromagnetic Induction, Dual Nature of Matter and Radiation, Magnetic Effect of Current & Magnetism, Motion of System of Particles and Rigid Body etc · Chemistry: Coordination Compounds, Thermodynamics, Equilibrium, Solutions, Alcohols, Phenols and Ethers, Aldehydes, Ketones and Carboxylic Acids, etc · Biology: Human Physiology, Genetics and Evolution, Diversity of Living Organisms, Cell: Structure and Function, Biology and Human Welfare, Reproduction, Plant Physiology, etc 2. Study material After you are well familiarized with the exam syllabus and pattern, you need to collect study material. Collecting study material not means gathering more and more books, but choosing a few selective books that are completely reliable. NCERT books of class 11th and 12th are the most important source of study and must be included in your study material without fail. Some of the best books that you can refer for NEET preparation are listed below: · Physics: Objective Physics by DC Pandey and Physics by HC Verma · Chemistry: Organic Chemistry by Morrison, Inorganic Chemistry by JD Lee and Physical Chemistry by KL Chugh · Biology: Dinesh Objective Biology and Trueman Elementary Biology 3. Make a timetable A timetable is considered quite important to manage your time and maintain a consistency in your studies. Before you start preparing for the exam, it is better if you make a timetable. It is not a compulsory thing to do but is certainly a good thing. It will also help you in checking if you are distracting from your studies. If you are not able to follow the timetable that clearly means that you are wasting your time somewhere else. In this way, you can keep a check on yourself, that’ it. 4. Start your preparation Know that you have collected the study material, the only thing left to do is start studying. You must begin your preparation by covering the basic and then forwarding towards the complex topics. If your basics are clear, you can tackle any kind of problems you face in the exam. Direct jumping to the complex topics can confuse you as all the complex topics are only the advanced form of the basics that you study. And since you are not in a hurry to appear for the exam, it is better if you climb the ladder step by step, without skipping. 5. Preparing notes Make sure that you prepare notes of every topic that you study. Highlight the important topics in your notes. Preparing notes can help you in getting a better grasp on what you study. It’s also better to create notes as you can go through the important points as many times you want without turning the whole book. Notes come in real handy at the time of revision. 6. Start practicing After you clear all your basics and start with the advanced topics, you can also start practicing side by side. If you have a timetable, you might need to revise that including a certain amount of time for practice. For practice, you can solve the previous years’ sample papers available online or otherwise. Practice can help you in finding your strong and weak points, the field that needs more focus and those which you have mastered completely. 7. Revise regularly Study, practice and revise- You can consider these three as an effective preparation mantra. Revision is as equally important as studying and practicing. The syllabus is vast and when you start proceeding towards your study, there are fair chances that you might start forgetting the topics you have studied in the past. By proper revision, you can save yourself from completely forgetting those topics. Therefore, revision on a regular basis is strongly recommended to keep everything fresh and new in your mind. 8. Others important points · Keep distractions away from you as far as possible. TV, phone and social media are the biggest enemy of a person who is preparing for an exam as competitive as NEET. · Self-study and group study both are equally important. While from self-study you can completely be honest with yourself, what you know and what you don’t know, group study is very helpful in clearing any doubts you have in your mind. Try to do both if possible. · Taking care of your health is very important. Without a healthy body, you cannot have a healthy mind. So do not skip your meals for the sake of study and do not deprive yourself of proper sleep. ",
            "date": "Answered December 10, 2018",
            "views": "206",
            "upvotes": " View 100 Upvoters ",
            "upvoters": [
                {
                    "user_id": "SHIVESH Singh",
                    "user_href": "/profile/SHIVESH-Singh-59"
                },
                {
                    "user_id": "Purna Chandrika",
                    "user_href": "/profile/Purna-Chandrika-6"
                },
                {
                    "user_id": "Ananya Borgohain",
                    "user_href": "/profile/Ananya-Borgohain-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samiksha Lende",
                "href": "/profile/Samiksha-Lende-2"
            },
            "answer_text": "The strategy need not to be very tough. You just have to compete your daily studies regularly. Means if you have joined any coaching you must finish your reading, understanding ,notes taking and question solving of what is taught in coaching before your next day class. That's the only key to suceess. Pre reading of topics taught is also very necessary to understand the teaching more precisely. Neet exam requires a consistent efforts. Dont get distracted with social media.Keep definite time for it. Offer it as a reward after completing your studies to yourself. This will boost your interest in studies. Make a schedule for your studies for each day.... From waking up to sleeping... Wake up at 6am ,fininish your daily rituals and get to your studies by 6.30am.. Make small shifts. Many of you feel sleepy in morning, but this is the Time when our brain is empty(no useless thoughts) so we can memorize easily. Give preference to physics in morning which is a tough subject and requires more concentration. (6.30–8.00am) both theory and problem solving. Take a healthy and light breakfast (8.00–8.20am) Then move to bio learning and understanding theory (8.20–10.00).During bio reading try highlighting Imp points, or note down Imp points this will help in your revisions. Then chemistry(10–11.45 am) revise class notes or solve question. Learn inorganic portion. Then get ready for coaching and have a Lunch. Don't waste your time in coaching in gossiping with your friends during small breaks between two lectures. Try to revise your old topic using your notes. Get involved in the class by asking your doubts to your teacher, doubt clearing is very important to solve different mcqs. Try to secure good rank in class test. This will boost your confidence. After coaching, you can take small break or a nap to energize yourself.Then again go back to your studies. Complete your class work in shifts as I said earlier. Take dinner around 8.30pm Go to bed by 11.45pm,as you require complete sleep of 6hours. So that's it...... All the best !! Edit 1: u can follow me here for Neet study material Neet ug Notes ",
            "date": "Updated September 24, 2020",
            "views": "37",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tamanna Panda",
                    "user_href": "/profile/Tamanna-Panda-4"
                },
                {
                    "user_id": "Bhramarambika",
                    "user_href": "/profile/Bhramarambika-1"
                },
                {
                    "user_id": "Shagun Gupta",
                    "user_href": "/profile/Shagun-Gupta-245"
                },
                {
                    "user_id": "Ritul Pargaie",
                    "user_href": "/profile/Ritul-Pargaie-14"
                },
                {
                    "user_id": "Sanjana Walke",
                    "user_href": "/profile/Sanjana-Walke-3"
                },
                {
                    "user_id": "Gayathri Senthilkumar",
                    "user_href": "/profile/Gayathri-Senthilkumar-17"
                },
                {
                    "user_id": "Saraswathi Nathan",
                    "user_href": "/profile/Saraswathi-Nathan"
                },
                {
                    "user_id": "Jahanvi Sharma",
                    "user_href": "/profile/Jahanvi-Sharma-105"
                },
                {
                    "user_id": "Karishma Sharma",
                    "user_href": "/profile/Karishma-Sharma-448"
                },
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Preeti Patnaik",
                    "user_href": "/profile/Preeti-Patnaik-22"
                },
                {
                    "user_id": "Rajlaxmi",
                    "user_href": "/profile/Rajlaxmi-7"
                },
                {
                    "user_id": "Rajesh Sharma",
                    "user_href": "/profile/Rajesh-Sharma-241-1"
                },
                {
                    "user_id": "Bhagirath Prasad",
                    "user_href": "/profile/Bhagirath-Prasad-15"
                },
                {
                    "user_id": "ALWIN MARIA",
                    "user_href": "/profile/ALWIN-MARIA-2"
                },
                {
                    "user_id": "Siril Mercy",
                    "user_href": "/profile/Siril-Mercy"
                },
                {
                    "user_id": "Prajakta Mane",
                    "user_href": "/profile/Prajakta-Mane-86"
                },
                {
                    "user_id": "Priti Verma",
                    "user_href": "/profile/Priti-Verma-110"
                },
                {
                    "user_id": "Anubhav Pohekar",
                    "user_href": "/profile/Anubhav-Pohekar"
                },
                {
                    "user_id": "Sandy",
                    "user_href": "/profile/Sandy-616"
                },
                {
                    "user_id": "Aster Valdez",
                    "user_href": "/profile/Aster-Valdez"
                },
                {
                    "user_id": "Lalini Paul",
                    "user_href": "/profile/Lalini-Paul"
                },
                {
                    "user_id": "BALORDA VENKATALAKSHMI",
                    "user_href": "/profile/BALORDA-VENKATALAKSHMI"
                },
                {
                    "user_id": "Varinda Jayani",
                    "user_href": "/profile/Varinda-Jayani"
                },
                {
                    "user_id": "Chitralekha Samal",
                    "user_href": "/profile/Chitralekha-Samal"
                },
                {
                    "user_id": "Simran Kamal",
                    "user_href": "/profile/Simran-Kamal-9"
                },
                {
                    "user_id": "Janhvi",
                    "user_href": "/profile/Janhvi-37"
                },
                {
                    "user_id": "Nishith Patel",
                    "user_href": "/profile/Nishith-Patel-56"
                },
                {
                    "user_id": "Sonali Sobha Routray",
                    "user_href": "/profile/Sonali-Sobha-Routray"
                },
                {
                    "user_id": "Nova Craft",
                    "user_href": "/profile/Nova-Craft-1"
                },
                {
                    "user_id": "Sayak Gupta",
                    "user_href": "/profile/Sayak-Gupta-10"
                },
                {
                    "user_id": "Kavita Chaubey",
                    "user_href": "/profile/Kavita-Chaubey-6"
                },
                {
                    "user_id": "Choudhary Sourabh",
                    "user_href": "/profile/Choudhary-Sourabh-1"
                },
                {
                    "user_id": "Lan Ngam",
                    "user_href": "/profile/Lan-Ngam"
                },
                {
                    "user_id": "Gayatree S Wagh",
                    "user_href": "/profile/Gayatree-S-Wagh"
                },
                {
                    "user_id": "Ujwal Soddi",
                    "user_href": "/profile/Ujwal-Soddi"
                },
                {
                    "user_id": "Rupali Patel",
                    "user_href": "/profile/Rupali-Patel-71"
                },
                {
                    "user_id": "Nisha Kumari",
                    "user_href": "/profile/Nisha-Kumari-1544"
                },
                {
                    "user_id": "Mahathi Pemma",
                    "user_href": "/profile/Mahathi-Pemma"
                },
                {
                    "user_id": "Diksha Gangurde",
                    "user_href": "/profile/Diksha-Gangurde-8"
                },
                {
                    "user_id": "Sourav Mohanty",
                    "user_href": "/profile/Sourav-Mohanty-20"
                },
                {
                    "user_id": "Amlan J Gogoi",
                    "user_href": "/profile/Amlan-J-Gogoi"
                },
                {
                    "user_id": "Bidya Bijayinee",
                    "user_href": "/profile/Bidya-Bijayinee"
                },
                {
                    "user_id": "Najayan Lama",
                    "user_href": "/profile/Najayan-Lama"
                },
                {
                    "user_id": "Neha Banerjee",
                    "user_href": "/profile/Neha-Banerjee-33"
                },
                {
                    "user_id": "Smily",
                    "user_href": "/profile/Smily-37"
                },
                {
                    "user_id": "Yashfeen Irshad",
                    "user_href": "/profile/Yashfeen-Irshad-2"
                },
                {
                    "user_id": "Nyasa Singh",
                    "user_href": "/profile/Nyasa-Singh-9"
                },
                {
                    "user_id": "Lomas Prasad Lomas Prasad",
                    "user_href": "/profile/Lomas-Prasad-Lomas-Prasad"
                },
                {
                    "user_id": "S.Vishal Kumar",
                    "user_href": "/profile/S-Vishal-Kumar"
                },
                {
                    "user_id": "Alan Albert",
                    "user_href": "/profile/Alan-Albert-21"
                },
                {
                    "user_id": "Arya Shibu",
                    "user_href": "/profile/Arya-Shibu"
                },
                {
                    "user_id": "Chanchala Khandagale",
                    "user_href": "/profile/Chanchala-Khandagale"
                },
                {
                    "user_id": "Maruthi Macha",
                    "user_href": "/profile/Maruthi-Macha"
                },
                {
                    "user_id": "Karthik Naidu",
                    "user_href": "/profile/Karthik-Naidu-129"
                },
                {
                    "user_id": "Vasu Gwalleen",
                    "user_href": "/profile/Vasu-Gwalleen"
                },
                {
                    "user_id": "Maanya Setia",
                    "user_href": "/profile/Maanya-Setia"
                },
                {
                    "user_id": "Pushkar Aggarwal",
                    "user_href": "/profile/Pushkar-Aggarwal-7"
                },
                {
                    "user_id": "Muddala Keerthi",
                    "user_href": "/profile/Muddala-Keerthi"
                },
                {
                    "user_id": "L Ralte",
                    "user_href": "/profile/L-Ralte-3"
                },
                {
                    "user_id": "Hardik Arya",
                    "user_href": "/profile/Hardik-Arya-7"
                },
                {
                    "user_id": "Devanand Shaji",
                    "user_href": "/profile/Devanand-Shaji"
                },
                {
                    "user_id": "Kainat Noor",
                    "user_href": "/profile/Kainat-Noor-22"
                },
                {
                    "user_id": "Kashish Thakur",
                    "user_href": "/profile/Kashish-Thakur-64"
                },
                {
                    "user_id": "Shamsul Hoda",
                    "user_href": "/profile/Shamsul-Hoda-11"
                },
                {
                    "user_id": "Annamma Varghese",
                    "user_href": "/profile/Annamma-Varghese-20"
                },
                {
                    "user_id": "Vikendra Tiwari",
                    "user_href": "/profile/Vikendra-Tiwari-1"
                },
                {
                    "user_id": "Saptaparna Basu",
                    "user_href": "/profile/Saptaparna-Basu-2"
                },
                {
                    "user_id": "Bindu Hariprakash",
                    "user_href": "/profile/Bindu-Hariprakash"
                },
                {
                    "user_id": "Shivangisoumya Choudhary",
                    "user_href": "/profile/Shivangisoumya-Choudhary"
                },
                {
                    "user_id": "Vishwash Rukwal",
                    "user_href": "/profile/Vishwash-Rukwal-1"
                },
                {
                    "user_id": "Anusha Rajesh",
                    "user_href": "/profile/Anusha-Rajesh-26"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SrimaShruthi-M"
                },
                {
                    "user_id": "Pooja Sahu",
                    "user_href": "/profile/Pooja-Sahu-124"
                },
                {
                    "user_id": "Ezhilarasisampu Sampathcm",
                    "user_href": "/profile/Ezhilarasisampu-Sampathcm"
                },
                {
                    "user_id": "Shivangi Gupta",
                    "user_href": "/profile/Shivangi-Gupta-859"
                },
                {
                    "user_id": "Ishrath Jabeen",
                    "user_href": "/profile/Ishrath-Jabeen-12"
                },
                {
                    "user_id": "Sharan Shetty",
                    "user_href": "/profile/Sharan-Shetty-35"
                },
                {
                    "user_id": "Gagana",
                    "user_href": "/profile/Gagana-18"
                },
                {
                    "user_id": "Ritika Singh",
                    "user_href": "/profile/Ritika-Singh-845"
                },
                {
                    "user_id": "Jinu Shahna",
                    "user_href": "/profile/Jinu-Shahna"
                },
                {
                    "user_id": "Ankit",
                    "user_href": "/profile/Ankit-959"
                },
                {
                    "user_id": "Pratik Rayghol",
                    "user_href": "/profile/Pratik-Rayghol-1"
                },
                {
                    "user_id": "Arushi Sharma",
                    "user_href": "/profile/Arushi-Sharma-340"
                },
                {
                    "user_id": "Pakhee Sinha",
                    "user_href": "/profile/Pakhee-Sinha"
                },
                {
                    "user_id": "Trina Mukherjee",
                    "user_href": "/profile/Trina-Mukherjee-18"
                },
                {
                    "user_id": "Ojaswita Patil",
                    "user_href": "/profile/Ojaswita-Patil-1"
                },
                {
                    "user_id": "Haritha BG",
                    "user_href": "/profile/Haritha-BG"
                },
                {
                    "user_id": "Shivam Mane",
                    "user_href": "/profile/Shivam-Mane-10"
                },
                {
                    "user_id": "Ishika Saloni",
                    "user_href": "/profile/Ishika-Saloni"
                },
                {
                    "user_id": "Babul Deb",
                    "user_href": "/profile/Babul-Deb-6"
                },
                {
                    "user_id": "Shivansh",
                    "user_href": "/profile/Shivansh-71"
                },
                {
                    "user_id": "Sanjana Padhi",
                    "user_href": "/profile/Sanjana-Padhi-2"
                },
                {
                    "user_id": "Alka Shukla",
                    "user_href": "/profile/Alka-Shukla-49"
                },
                {
                    "user_id": "Dr Sumya Darshan Dutta",
                    "user_href": "/profile/Dr-Sumya-Darshan-Dutta"
                },
                {
                    "user_id": "Dawood Dav",
                    "user_href": "/profile/Dawood-Dav"
                },
                {
                    "user_id": "Shivam Bhardwaj",
                    "user_href": "/profile/Shivam-Bhardwaj-363"
                },
                {
                    "user_id": "Lakshay Vaid",
                    "user_href": "/profile/Lakshay-Vaid-5"
                },
                {
                    "user_id": "Sunil Puri",
                    "user_href": "/profile/Sunil-Puri-64"
                },
                {
                    "user_id": "Jayesh Sarvaliya",
                    "user_href": "/profile/Jayesh-Sarvaliya-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ramakrishnan Shetty",
                "href": "/profile/Ramakrishnan-Shetty"
            },
            "answer_text": "Hi everyone, hope you guys are also following distance and taking measures to stay safe in the pandemic. NEET 2021 will certainly will more tough in the coming future, many students might have to not applied this year considering the current situation where it can be a task for them to prepare sitting at home. However, there is a lot you can do now and begin with your preparation for next year. Things to plan inhand before starting: 1. Aim high and succeed : In order to get 600+ in NEET exam, aim for atleast 650-700 and prepare accordingly. In order to compete with 5% of population of India who applies for NEET every year, you need to be a step ahead of them. 2. Stay Updated: Get in touch with faculties who follow the examination trend and are deeply examining the changes. They are certainly the best guiders for who you can help you to aim at the bull’s eye. 3. Working Hard pays off: This is very obvious that you will be required to study at least 10-12 hours a day. This doesn’t mean that you have to stick yourself to your study table or room. Plan your day and maintain a good regime as well. A good healthy mind is a key to success. 4. Offline or Online Coaching: You cannot succeed on your own, some do but not everyone. This comes at a price but if you are aware, you will be investing in a positive way. Look for the best of best, take reviews from past student’s who have already cleared with these coaching like Aakash, Allen, Resonance or Altus Knowledge if you have heard about them. Many coaching institutes are there but everyone has their own perks and dis-advantages. 5. Test Series: Self assessment is critical to realize where you stand and how you have to improve or maintain. Take assessments on a regular basis even if you have excelled in a particular subject doesn’t mean that you can neglect it. Try to score evenly in each assessment you take and accordingly you will realize if scoring 600 and above is possible for you with your current preparation methods. 6. Rank Boosters: Not sure if everyone is aware of these, Altus knowledge is offering such a thing as per my knowledge. They release it late in January usually and have a set of critical questions which you might expect in the coming exam. They do this by probability- questions which are most likely to appear in the exam in the respective year. Only an expert faculty can predict this and you can look for reviews for them. 7. Internet: Online study can be time taking but if you are not wasting your time on useless links and only reading which is required, it can benefit you. Never restrict yourself to books, they are the best source but study pattern needs to change with time and helps in eliminating boredom as well. Being a faculty, I am open to discuss such things, would love to hear and talk more- feel free to comment or reach me if required. ",
            "date": "Answered July 30, 2020",
            "views": "55",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shagun Gupta",
                    "user_href": "/profile/Shagun-Gupta-245"
                },
                {
                    "user_id": "Anjali Mudgal",
                    "user_href": "/profile/Anjali-Mudgal-17"
                },
                {
                    "user_id": "Jaanvi Singh",
                    "user_href": "/profile/Jaanvi-Singh-47"
                },
                {
                    "user_id": "Vaibhav Arora",
                    "user_href": "/profile/Vaibhav-Arora-387"
                },
                {
                    "user_id": "Manas Prabhu",
                    "user_href": "/profile/Manas-Prabhu-2"
                },
                {
                    "user_id": "Pooja",
                    "user_href": "/profile/Pooja-2047"
                },
                {
                    "user_id": "Subadhra Devanathan",
                    "user_href": "/profile/Subadhra-Devanathan"
                },
                {
                    "user_id": "Gagana",
                    "user_href": "/profile/Gagana-18"
                },
                {
                    "user_id": "Shama Praveen",
                    "user_href": "/profile/Shama-Praveen-2"
                },
                {
                    "user_id": "Reva .D",
                    "user_href": "/profile/Reva-D-3"
                },
                {
                    "user_id": "Shivam Sinha",
                    "user_href": "/profile/Shivam-Sinha-349"
                },
                {
                    "user_id": "Rupam Roy",
                    "user_href": "/profile/Rupam-Roy-187"
                },
                {
                    "user_id": "Me Me",
                    "user_href": "/profile/Me-Me-2515"
                },
                {
                    "user_id": "Being Human",
                    "user_href": "/profile/Being-Human-295"
                },
                {
                    "user_id": "Kartik Kumar",
                    "user_href": "/profile/Kartik-Kumar-272"
                },
                {
                    "user_id": "Mukul Dadheech",
                    "user_href": "/profile/Mukul-Dadheech"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shashwat Jaiswal",
                "href": "/profile/Shashwat-Jaiswal-22"
            },
            "answer_text": "Welcome 11thies to this preparatory phase which will act as an entry point to one of the most elite and noble profession on this planet. The reason why I am writing this answer for 11th standard only is because in my preparatory phase I realised that these students are the one’s with a potential to be at top most position in NEET exam or any other entrance exam due to their energetic attitude, absence of fear of failure and most important fresh minds in which our traditional education system is filling up data like a complete mess without any logics or interconnections. So young minds let’s begin…!! 1st is Serious Mindset I know everyone says that 11th is a rest year in which you can make time for hobbies or roaming with friends showing effects of hormones in short instant gratification things which make you think that wow my life is so cool. I didn’t say that you should not enjoy your life but not at the cost of your future and if you really want to know then let me clearly tell you yearly fees of AIIMS Delhi is 2500 rupees whereas of DY Patil is 25 lacs so you could imagine of a difference and competition is getting fierce year by year every year almost there is increase of 2 lacs of student appearing for exams this year 13 lac student gave the exam for 70k seat out of which only top 10k are of relatively good college and congrats we are in India so reservation also has its crucial role in it so young man this is not as easy as it appears to be even there is competition for that 25 lacs per annum college if you don't have score even they would not take you and Kota factory is the name I think every one might have heard where more than 1 lac students are preparing for the same exam with all their life. Relax..!! I am not scaring you I am just telling you gravity of things that it really matters a lot because I know in 11th students don’t realise things even I also didn’t but later when I have to pay for it then time had already escaped. No one expects you to become nerd and only study for this exam and leave everything else obviously other things are also equally important because somewhere it is also shaping your personality The only thing expected from you is just give some time on regular basis (concept of ALD-IASD a long discipline in a single direction) with a new and correct way of studying which I am going to mention later in this answer 2nd is Strategy Which consist of planning and working on it. Without action no plan works and the biggest problem which we all face is we plan a lot but when it comes to action for initial few days we do work but then we start procrastinating (power of entropy) so what I mean to say is that plan your tasks which are practical not hypothetical that I will complete these chapters in these days and then ending up at same level so always plan task weekly and then do a little daily some day you can study more and some day less so ultimately it can get managed. 3rd is Sources See concepts are same only thing on which things depend is how it is presented to you some teachers make easy things complex while some do opposite so try to decode concepts on your own and then take help from teachers or online sources. For physics conceptually HC Verma is the only book one can get. People misunderstood this book due to its high level questions but its theory is really good and concepts become crystal clear. For chemistry NCERT is conceptually good but Allen modules or any other comprehensive source would be good. For biology everyone regard NCERT as bible even I do but it also requires extension which is best provided in McGraw Hill book of biology or if you follow any module just see it’s authenticity. See I know you guys are in school and reading standard books at school level is something that would not be possible for you.best option would be of good teachers who are knowledge oriented not marks follow them. 4th is Methodologies For which I guess a separate answer is needed if enough request comes I will try to elaborate it. Still few basic principles i would like to mention- 1st Go for 5K for any topic you are going to study that is kya, kyu, kaha, kab, kaise the most important one is kyu because it will tell you about significance of what you are studying in real world. 2nd be honest with your studies see i will not hesitate to say that we Indians are corrupt at all individual levels and so are at studying level too we just mug up things and follow the traditional marks culture only few want to question “why” only few have enough curiosity to figure out things simply well that is separate part i will discuss afterwards. Don’t move forward in your study till the concept enters your brain. 5th is Prioritisation I know due to perceived benefits you might be stuck in belief that fun is top most priority roaming with friends, parties, girls everything seems to be damn attractive i am not saying that you don’t enjoy school life but in a balanced way where you are self aware that your career and life is the most important thing. you can also plan your stuff according to Eisenhower box  6th is Self assessment If you don’t test yourself you won’t be able to realise whether you are growing or not so plan you tests on regular intervals may be after fixed time of 2-3 weeks or after completion of any portion of your syllabus. Take help from your parents if alone you are not able to follow it. Also remember that while being in school you are going through subjective pattern of your academics whereas NEET is purely objective, conceptually you are not going to face any problem but speed with accuracy is the demand of objective pattern so seperate work need to be done for that purpose also. And the last one is LEARNING ATTITUDE which is not only for preparatory phase but also for life. I know maximum people will follow it for few days or weeks but those who enjoy learning and knows the vastness of science would never feel he is doing something under burden so try to enjoy science because everything has a logic and almost everything is interconnected all you need is to work on it. The answer is not completed it’s a journey if some serious students come along I would love to be a part of this beautiful journey and hope so this little soul could be a part of a good cause. ",
            "date": "Updated February 6, 2020",
            "views": "408",
            "upvotes": " View 116 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sanjana Walke",
                    "user_href": "/profile/Sanjana-Walke-3"
                },
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Aster Valdez",
                    "user_href": "/profile/Aster-Valdez"
                },
                {
                    "user_id": "Smily",
                    "user_href": "/profile/Smily-37"
                },
                {
                    "user_id": "Chhaya Gupta",
                    "user_href": "/profile/Chhaya-Gupta-126"
                },
                {
                    "user_id": "SrïßhTî GãUr",
                    "user_href": "/profile/SrïßhTî-GãUr"
                },
                {
                    "user_id": "Aditi Rana",
                    "user_href": "/profile/Aditi-Rana-123"
                },
                {
                    "user_id": "Vishwash Rukwal",
                    "user_href": "/profile/Vishwash-Rukwal-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashish Yaduvanshi",
                "href": "/profile/Ashish-Yaduvanshi-27"
            },
            "answer_text": "How to prepare for NEET 2020 and 2021? Tip 1: The major mistake that most students make is they think they will study everything in tuition or coaching. Instead, their first priority should be paying attention in class, you need to understand everything, and then leave extra learning to self-studies /tuition/coaching. Syllabus of class 11 and 12 is a huge jump for many students from class 10. So every bit of knowledge you gain from various places is valuable. Tip 2: The most important thing to cover in the NEET syllabus is NCERT books of class 11 and 12 physics, chemistry, biology. These are the most ideal textbooks in most boards. However, if NCERT is not in your board, then you can refer to board prescribed books for board exams and but NCERT is must for NEET preparation. Tip 3: You have to create a preparation strategy and should follow it sincerely. If you will follow the strategies sincerely, nobody can stop you from achieving success. These strategies are: Strategies To Prepare for NEET Create a timetable that should be followed daily: Your time table that you follow every day is dependent on your activities of the day and your sleeping habits.If you have the ability to wake up early, then you can wake up around 4:30 in the morning and can study for at least one hour before going to school.Then you might be coming back from school around 2 PM.After that, you would eat and take rest until around 4 PM.After that anyhow you have to take out time to study for two hours.Since physical activity is also very essential, you can go out and carry out some physical activities that would help you in maintaining your health.After you come back, start studying again for another three hours at least.If you have the habit of waking up late and sleeping late, then you can shift your morning’s one hour study time to night.With this time table, you can easily study for at least 6 hours every day yourself.Later on, when your school ends, it is very obvious that you can put in more hours of self-studies. If you choose to go to coaching/tuition then it will become more hectic to take out time for self studies. Choose the option of such a coaching which is not too far from your home so that travel time is eliminated. Figure out your monthly goals: To start with, you should study all the things that have been taught in school. Whenever you complete a topic, practice its important questions and MCQs. There are around 59 topics in NEET syllabus. So, the best method to cover all the topics is by dividing the number of chapters by the number of days you have left with for the preparation. It should not matter to you if it comes out to be 2 chapters in a day, then please make sure that you actually cover 2 chapters a day. This way you can set your monthly goals. Self-assessment is essential: “Taking a shot in light is better than a shot in the dark”. By self assessment you will get to know about your strengths and weaknesses. The best way to know about your strengths and weaknesses are by solving MCQs and taking mock tests. After completing every chapter, solve its important questions and MCQs. After completing syllabus take several mock tests and solve past year papers. These are the most important key to strengthen yourself. Try to convert your weaknesses into strengths: Once you know all about your weaknesses, immediately seek the help of a teacher or a mentor or any who is expert in that particular topic. Usually the problem lies in grabbing the concepts. Once that is clear, you can solve the questions in a better way. Continuous practice is the major key NEET 2020-21 Exam Pattern Candidates must check below NEET 2020-21 Exam Pattern before starting the exam preparation: Exam Mode: NEET 2020-21 exam will be conducted through offline (pen-paper based) mode.Questions Type: Question paper will contain objective type of questions.Medium: The question paper will be available in English, Hindi, Marathi, Gujarati, Bengali, Oriya, Assamese, Telugu, Tamil, Urdu and Kannada Languages.No of questions: There will be total 180 questions in the paper.Total Marks: The paper will be total of 720 marks.Duration: The exam will be conducted for 3 hours.Marking Scheme: Each correct answer will award 4 marks.Negative Marking: 1 mark will be deducted for every wrong answer.Marks distribution: Subjects No. of Questions Marks Physics 45 180 Chemistry 45 180 Biology (Botany or Zoology) 90 (45 each) 360 Total 180 720 Syllabus for NEET 2020-21: The syllabus os an important aspect as it tells about what are the topics that the candidates have to follow to prepare for the exam. Physics syllabus of class 11th: Physical world and measurementKinematicsLaws of MotionWork, Energy, and PowerMotion of System of Particles and Rigid BodyGravitationProperties of Bulk MatterThermodynamicsBehaviour of Perfect Gas and Kinetic TheoryOscillations and WavesPhysics syllabus of Class 12th: ElectrostaticsCurrent ElectricityMagnetic Effects of Current and MagnetismElectromagnetic Induction and Alternating CurrentsElectromagnetic WavesOpticsDual Nature of Matter and RadiationAtoms and NucleiElectronic DevicesChemistry syllabus of class 11th: Some Basic Concepts of ChemistryStructure of AtomClassification of Elements and Periodicity in PropertiesChemical Bonding and Molecular StructureStates of Matter: Gases and LiquidsThermodynamicsEquilibriumRedox ReactionsHydrogens-Block Element (Alkali and Alkaline earth metals)Some p-Block ElementsOrganic Chemistry- Some Basic Principles and TechniquesHydrocarbonsEnvironmental ChemistryChemistry syllabus of class 12th: Solid StateSolutionsElectrochemistryChemical KineticsSurface ChemistryGeneral Principles and Processes of Isolation of Elementsp- Block Elementsd and f Block ElementsCoordination CompoundsHaloalkanes and HaloarenesAlcohols, Phenols and EthersAldehydes, Ketones and Carboxylic AcidsOrganic Compounds Containing NitrogenBiomoleculesPolymersChemistry in Everyday LifeBiology syllabus of class 11th: Diversity in Living WorldStructural Organisation in Animals and PlantsCell Structure and FunctionPlant PhysiologyHuman physiologyBiology syllabus of class 12th: ReproductionGenetics and EvolutionBiology and Human WelfareBiotechnology and Its ApplicationsEcology and environment",
            "date": "Answered September 22, 2019",
            "views": "105",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rupam Roy",
                    "user_href": "/profile/Rupam-Roy-187"
                },
                {
                    "user_id": "Ruruu",
                    "user_href": "/profile/Ruruu-1"
                },
                {
                    "user_id": "Karishma Sharma",
                    "user_href": "/profile/Karishma-Sharma-448"
                },
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Rajlaxmi",
                    "user_href": "/profile/Rajlaxmi-7"
                },
                {
                    "user_id": "Half Moon",
                    "user_href": "/profile/Half-Moon-30"
                },
                {
                    "user_id": "Anshika Sharma",
                    "user_href": "/profile/Anshika-Sharma-270"
                },
                {
                    "user_id": "Aster Valdez",
                    "user_href": "/profile/Aster-Valdez"
                },
                {
                    "user_id": "Bhabani Prasad Banerjee",
                    "user_href": "/profile/Bhabani-Prasad-Banerjee"
                },
                {
                    "user_id": "Nishi Kumari",
                    "user_href": "/profile/Nishi-Kumari-76"
                },
                {
                    "user_id": "Aditi Bhattacharjee",
                    "user_href": "/profile/Aditi-Bhattacharjee-14"
                },
                {
                    "user_id": "SHIVESH Singh",
                    "user_href": "/profile/SHIVESH-Singh-59"
                },
                {
                    "user_id": "Smily",
                    "user_href": "/profile/Smily-37"
                },
                {
                    "user_id": "Bittu And Mouma",
                    "user_href": "/profile/Bittu-And-Mouma"
                },
                {
                    "user_id": "Raghupathi Bellary",
                    "user_href": "/profile/Raghupathi-Bellary"
                },
                {
                    "user_id": "Manas Prabhu",
                    "user_href": "/profile/Manas-Prabhu-2"
                },
                {
                    "user_id": "Harinee Javaji",
                    "user_href": "/profile/Harinee-Javaji"
                },
                {
                    "user_id": "Jäïsmëëñ",
                    "user_href": "/profile/Jäïsmëëñ"
                },
                {
                    "user_id": "Dreamerᕦ( ͡° ͜ʖ ͡°)ᕤ",
                    "user_href": "/profile/Dreamerᕦ-͡-͜ʖ-͡-ᕤ"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ajay Mohan",
                "href": "/profile/Ajay-Mohan-22"
            },
            "answer_text": "If you are preparing for NEET 2021, you have plenty of time for preparation so, start your preparation now. First of all you should start from the physics basics , like introduction portion and basic mathematics. After completing the calculus and vectors you should start kinematics and then you move slowly in physics. For neet preparation according to my experience H.C. Verma is an excellent book for physics and it helps to make the theoritical base . While you are reading or studying make some notes simultaneously and clear all your concepts by practicing and learning .For practicing you can do from D.C. Pandey but, don’t forget the NCERT. You can also solve solve OBJECTIVE NCERT PHYSICS GEAR UP this is your physics strategy. Finally, you can also practice from 32 years of NEET PHYSICS. Follow it thoroughly. For chemistry you should start from NCERT from some basic concepts of chemistry. And then move to another chapter structure of atom .It’s Important to makes notes side by side. There are lots of formulae in chemistry write and learn them thoroughly. Concepts of every chapter should be properly understood. For organic chemistry, practice from SELECTED PROBLEMS FROM ORGANIC CHEMISTRY, For Inorganic Chemistry, NCERT is enough, N. AVASTHI for physical chemistry. Then, solve the previous years questions papers and do monthly and weekly revision. For Biology, only NCERT is enough, read NCERT numbers of times and make your base stronger because many questions comes from ncert. So that, you read the ncert line by line. Many questions are interlinked to the other concepts of the ncert therefore you read ncert 25–30 times. Don’t forget to make notes. Watch online videos and lectures, it become more helpful for NEET 2020 examination, Read Theory of NCERT, Do Previous Year Question papers and practice a lot. ALL THE BEST :) ",
            "date": "Answered August 20, 2019",
            "views": "97",
            "upvotes": " View 56 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bharath Nagarajan",
                    "user_href": "/profile/Bharath-Nagarajan-13"
                },
                {
                    "user_id": "Sirulu",
                    "user_href": "/profile/Sirulu"
                },
                {
                    "user_id": "Sweety Singh",
                    "user_href": "/profile/Sweety-Singh-339"
                },
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Fenne",
                    "user_href": "/profile/Fenne-7"
                },
                {
                    "user_id": "Kamala Nathan",
                    "user_href": "/profile/Kamala-Nathan-13"
                },
                {
                    "user_id": "Neeti",
                    "user_href": "/profile/Neeti-78"
                },
                {
                    "user_id": "Sowmi Dasarathan",
                    "user_href": "/profile/Sowmi-Dasarathan"
                },
                {
                    "user_id": "Palak Bais",
                    "user_href": "/profile/Palak-Bais-1"
                },
                {
                    "user_id": "Kiran Khuntia",
                    "user_href": "/profile/Kiran-Khuntia-6"
                },
                {
                    "user_id": "Medha",
                    "user_href": "/profile/Medha-100"
                },
                {
                    "user_id": "Kusuma Reddy",
                    "user_href": "/profile/Kusuma-Reddy-35"
                },
                {
                    "user_id": "Deekshant Agrahari",
                    "user_href": "/profile/Deekshant-Agrahari"
                },
                {
                    "user_id": "Jeetu Rao",
                    "user_href": "/profile/Jeetu-Rao-1"
                },
                {
                    "user_id": "Amruta Yadav",
                    "user_href": "/profile/Amruta-Yadav-37"
                },
                {
                    "user_id": "Laxmi Kesarwani",
                    "user_href": "/profile/Laxmi-Kesarwani"
                },
                {
                    "user_id": "Jeevesh Nigam",
                    "user_href": "/profile/Jeevesh-Nigam"
                },
                {
                    "user_id": "Rashmi Rekha Dash",
                    "user_href": "/profile/Rashmi-Rekha-Dash-3"
                },
                {
                    "user_id": "Lan Ngam",
                    "user_href": "/profile/Lan-Ngam"
                },
                {
                    "user_id": "Saloni Gupta",
                    "user_href": "/profile/Saloni-Gupta-770"
                },
                {
                    "user_id": "Om Shrestha",
                    "user_href": "/profile/Om-Shrestha-54"
                },
                {
                    "user_id": "Shanmukha Sreemani",
                    "user_href": "/profile/Shanmukha-Sreemani"
                },
                {
                    "user_id": "Amlan J Gogoi",
                    "user_href": "/profile/Amlan-J-Gogoi"
                },
                {
                    "user_id": "PRIYANSHU KUMAR",
                    "user_href": "/profile/PRIYANSHU-KUMAR-887"
                },
                {
                    "user_id": "Nitin Tewatia",
                    "user_href": "/profile/Nitin-Tewatia-4"
                },
                {
                    "user_id": "Smily",
                    "user_href": "/profile/Smily-37"
                },
                {
                    "user_id": "Irfaz Azad",
                    "user_href": "/profile/Irfaz-Azad"
                },
                {
                    "user_id": "Student",
                    "user_href": "/profile/Student-569"
                },
                {
                    "user_id": "Heena Shaikh",
                    "user_href": "/profile/Heena-Shaikh-736"
                },
                {
                    "user_id": "Satarupa Rai",
                    "user_href": "/profile/Satarupa-Rai"
                },
                {
                    "user_id": "Ananya Sanal",
                    "user_href": "/profile/Ananya-Sanal"
                },
                {
                    "user_id": "Vasu Gwalleen",
                    "user_href": "/profile/Vasu-Gwalleen"
                },
                {
                    "user_id": "Shubhankar Chakroborty",
                    "user_href": "/profile/Shubhankar-Chakroborty-1"
                },
                {
                    "user_id": "Nikhil Lahre",
                    "user_href": "/profile/Nikhil-Lahre"
                },
                {
                    "user_id": "Bhavna Gaur Shah",
                    "user_href": "/profile/Bhavna-Gaur-Shah"
                },
                {
                    "user_id": "Vishal Khatana",
                    "user_href": "/profile/Vishal-Khatana-3"
                },
                {
                    "user_id": "Mahima Bandyopadhya",
                    "user_href": "/profile/Mahima-Bandyopadhya-1"
                },
                {
                    "user_id": "Kushagra Rawat",
                    "user_href": "/profile/Kushagra-Rawat-9"
                },
                {
                    "user_id": "Ishita Gadgil",
                    "user_href": "/profile/Ishita-Gadgil"
                },
                {
                    "user_id": "Deepshikha Sola",
                    "user_href": "/profile/Deepshikha-Sola"
                },
                {
                    "user_id": "Mubharak Mubharak",
                    "user_href": "/profile/Mubharak-Mubharak-2"
                },
                {
                    "user_id": "Varshini Patel",
                    "user_href": "/profile/Varshini-Patel"
                },
                {
                    "user_id": "Harinee Javaji",
                    "user_href": "/profile/Harinee-Javaji"
                },
                {
                    "user_id": "Mohit Singh",
                    "user_href": "/profile/Mohit-Singh-4485"
                },
                {
                    "user_id": "Asmitha",
                    "user_href": "/profile/Asmitha-13"
                },
                {
                    "user_id": "Varun Srivastava",
                    "user_href": "/profile/Varun-Srivastava-134"
                },
                {
                    "user_id": "Saurav Kumar Sajal",
                    "user_href": "/profile/Saurav-Kumar-Sajal"
                },
                {
                    "user_id": "Tanisha Rajput",
                    "user_href": "/profile/Tanisha-Rajput-27"
                },
                {
                    "user_id": "Madhuban",
                    "user_href": "/profile/Madhuban-2"
                },
                {
                    "user_id": "Swara Pimple",
                    "user_href": "/profile/Swara-Pimple-2"
                },
                {
                    "user_id": "Nilesh Pandey",
                    "user_href": "/profile/Nilesh-Pandey-35"
                },
                {
                    "user_id": "Shantha Shetty",
                    "user_href": "/profile/Shantha-Shetty-7"
                },
                {
                    "user_id": "Mohammed Anwar Zahoor",
                    "user_href": "/profile/Mohammed-Anwar-Zahoor"
                },
                {
                    "user_id": "Anne Sparks",
                    "user_href": "/profile/Anne-Sparks-4"
                },
                {
                    "user_id": "Neeta Dinesh",
                    "user_href": "/profile/Neeta-Dinesh"
                },
                {
                    "user_id": "Mohit Mehra",
                    "user_href": "/profile/Mohit-Mehra-77"
                },
                {
                    "user_id": "Dibya Rashmi Naik",
                    "user_href": "/profile/Dibya-Rashmi-Naik"
                },
                {
                    "user_id": "Sonu Kkw",
                    "user_href": "/profile/Sonu-Kkw"
                },
                {
                    "user_id": "Abilash Garlapati",
                    "user_href": "/profile/Abilash-Garlapati"
                },
                {
                    "user_id": "Joseph Jacob",
                    "user_href": "/profile/Joseph-Jacob-42"
                },
                {
                    "user_id": "Anjali Srivastava",
                    "user_href": "/profile/Anjali-Srivastava-393"
                },
                {
                    "user_id": "Rahul Yadav",
                    "user_href": "/profile/Rahul-Yadav-3351"
                },
                {
                    "user_id": "Anshuman Mahapatro",
                    "user_href": "/profile/Anshuman-Mahapatro-3"
                },
                {
                    "user_id": "Shabana Shabu",
                    "user_href": "/profile/Shabana-Shabu-7"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/C0dy-Fort"
                },
                {
                    "user_id": "Sudhanshu Sharma",
                    "user_href": "/profile/Sudhanshu-Sharma-654"
                },
                {
                    "user_id": "Pari Grover",
                    "user_href": "/profile/Pari-Grover-1"
                },
                {
                    "user_id": "Happy Soul",
                    "user_href": "/profile/Happy-Soul-157"
                },
                {
                    "user_id": "Syed Iliyas",
                    "user_href": "/profile/Syed-Iliyas"
                },
                {
                    "user_id": "Priyanshi Singh",
                    "user_href": "/profile/Priyanshi-Singh-362"
                },
                {
                    "user_id": "Alam",
                    "user_href": "/profile/Alam-101"
                },
                {
                    "user_id": "Manika Kuiry",
                    "user_href": "/profile/Manika-Kuiry"
                },
                {
                    "user_id": "Shahna Majeed",
                    "user_href": "/profile/Shahna-Majeed-2"
                },
                {
                    "user_id": "Jayakumar Annalath",
                    "user_href": "/profile/Jayakumar-Annalath"
                },
                {
                    "user_id": "S.Aritha Aritha",
                    "user_href": "/profile/S-Aritha-Aritha"
                },
                {
                    "user_id": "Kritika Passi",
                    "user_href": "/profile/Kritika-Passi"
                },
                {
                    "user_id": "Mee Singh",
                    "user_href": "/profile/Mee-Singh"
                },
                {
                    "user_id": "Seema Seema",
                    "user_href": "/profile/Seema-Seema-288"
                },
                {
                    "user_id": "Supriya Karandikar",
                    "user_href": "/profile/Supriya-Karandikar-1"
                },
                {
                    "user_id": "Dharshana .c",
                    "user_href": "/profile/Dharshana-c"
                },
                {
                    "user_id": "Ranjan Singh",
                    "user_href": "/profile/Ranjan-Singh-1052"
                },
                {
                    "user_id": "Bhavya Rai",
                    "user_href": "/profile/Bhavya-Rai-18"
                },
                {
                    "user_id": "Aliza Khan",
                    "user_href": "/profile/Aliza-Khan-212"
                },
                {
                    "user_id": "Rishita Maurya",
                    "user_href": "/profile/Rishita-Maurya-2"
                },
                {
                    "user_id": "ZedFix",
                    "user_href": "/profile/ZedFix"
                },
                {
                    "user_id": "Neelam Verma",
                    "user_href": "/profile/Neelam-Verma-157"
                },
                {
                    "user_id": "Ajay Kumar",
                    "user_href": "/profile/Ajay-Kumar-23666"
                },
                {
                    "user_id": "Our Pet Club Anushka Chauhan",
                    "user_href": "/profile/Our-Pet-Club-Anushka-Chauhan"
                },
                {
                    "user_id": "Pranith Gowda",
                    "user_href": "/profile/Pranith-Gowda"
                },
                {
                    "user_id": "Aelin Dorian",
                    "user_href": "/profile/Aelin-Dorian-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/InfiniteSoul-1"
                },
                {
                    "user_id": "Digvijay Sadolkar",
                    "user_href": "/profile/Digvijay-Sadolkar"
                },
                {
                    "user_id": "Vaisakh Vs",
                    "user_href": "/profile/Vaisakh-Vs-11"
                },
                {
                    "user_id": "Bhavani Reddy",
                    "user_href": "/profile/Bhavani-Reddy-116"
                },
                {
                    "user_id": "Aniket",
                    "user_href": "/profile/Aniket-349"
                },
                {
                    "user_id": "Sadan Shukla",
                    "user_href": "/profile/Sadan-Shukla"
                },
                {
                    "user_id": "Mohit Asija",
                    "user_href": "/profile/Mohit-Asija-12"
                },
                {
                    "user_id": "Anupam Raj",
                    "user_href": "/profile/Anupam-Raj-101"
                },
                {
                    "user_id": "Nishu Dharmale",
                    "user_href": "/profile/Nishu-Dharmale"
                },
                {
                    "user_id": "Manoj Maheshuni",
                    "user_href": "/profile/Manoj-Maheshuni-1"
                },
                {
                    "user_id": "Baljeet Kaur",
                    "user_href": "/profile/Baljeet-Kaur-207"
                },
                {
                    "user_id": "Pragya Chaudhry",
                    "user_href": "/profile/Pragya-Chaudhry"
                },
                {
                    "user_id": "Sajid Shaikh",
                    "user_href": "/profile/Sajid-Shaikh-151"
                },
                {
                    "user_id": "Sp Valliappan",
                    "user_href": "/profile/Sp-Valliappan"
                },
                {
                    "user_id": "Reena Singh",
                    "user_href": "/profile/Reena-Singh-451"
                },
                {
                    "user_id": "Priyanshu Yadav",
                    "user_href": "/profile/Priyanshu-Yadav-173"
                },
                {
                    "user_id": "Aastha Parashar",
                    "user_href": "/profile/Aastha-Parashar-5"
                },
                {
                    "user_id": "Bhagylaxmi Nayak",
                    "user_href": "/profile/Bhagylaxmi-Nayak"
                },
                {
                    "user_id": "Priyanshu Raj",
                    "user_href": "/profile/Priyanshu-Raj-300"
                },
                {
                    "user_id": "Kanak Sharma",
                    "user_href": "/profile/Kanak-Sharma-217"
                },
                {
                    "user_id": "Lets Explore",
                    "user_href": "/profile/Lets-Explore-9"
                },
                {
                    "user_id": "Sindhu Jaiswal",
                    "user_href": "/profile/Sindhu-Jaiswal-1"
                },
                {
                    "user_id": "Taras Mandi",
                    "user_href": "/profile/Taras-Mandi"
                },
                {
                    "user_id": "Praveen Gc",
                    "user_href": "/profile/Praveen-Gc-3"
                },
                {
                    "user_id": "Megha Shakya",
                    "user_href": "/profile/Megha-Shakya-12"
                },
                {
                    "user_id": "Krishnendu Bhattacharyya",
                    "user_href": "/profile/Krishnendu-Bhattacharyya-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harry Fox",
                "href": "/profile/Harry-Fox-87"
            },
            "answer_text": "National Eligibility cum Entrance Test (NEET) is a national medical entrance exam conducted every year for the admission to MBBS, BDS, AYUSH, BVSc, and AH degree programmes. NEET is an exam with not only a difficult academic curriculum but also involves rigorous verification of students’ diligence, hard work and passion towards medicine. Candidates who wish to pursue a medical career in the country are required to sit for the National Eligibility cum Entrance Test conducted by National Testing Agency (NTA). With a limited number of seats and fierce competition, it becomes essential for candidates to come up with the best preparation strategy for NEET 2021. To help students prepare for NEET 2021, here is a short guide that tells you how to prepare for NEET 2021. This article will help students to understand the exam and have a crisp strategy to ace NEET 2021. The preparation tips for NEET 2021 discussed here are clear, concise, tried, and tested. To begin your preparation of NEET 2021, divide your NEET 2021 preparation strategy as per the below given four mantras: UnderstandStudyPractiseRevise NEET 2021 preparation tip 1: Understanding the syllabus, and exam pattern Before beginning the NEET 2021 preparation, it is important to have a comprehensive knowledge of the syllabus, exam pattern, and weightage. Some pointers here are: Syllabus of NEET includes 180 questions in total which are segregated into three parts as Biology, Chemistry, and PhysicsBiology section consists of 90 questions in total, whereas Chemistry and Physics consist of 45 questions each respectively. The maximum marks awarded are 720 which are further divided into three parts as 360 in Biology, 180 in Chemistry, and 180 in Physics.4 marks are awarded for every correct answer and 1 mark is deducted for wrong answers.Set a target score of at least 650. After getting through with the exam pattern, start understanding the syllabus.Check the topics in all three subjects and mark your strongest area with a green pencil and weak area with a red pencil. This will help you segregate the syllabus into two parts and you will be able to know how far you are from your target score.Also, make a list of topics proceeding from highest weightage to the lowest weightage followed by biology, then chemistry and physics. By this, you will be able to cover more syllabus in less time.You are done with the first level. Knowledge of the syllabus, exam pattern and weightage will help you formulate a strategy for NEET 2021 preparation tips.NEET 2021 preparation tip 2: Start studying Making a plan is easy but its execution is what requires strength. Know your most effective hours and start your NEET 2021 preparation in those hours. In order to prepare for NEET 2021, it is important to study for at least 12 hours per day. Having a 650+ in your NEET 2021 requires you to devote 50 per cent of your time in a day to study. Begin with Biology and one other subject simultaneously. Start studying your strongest topics with the most weightage. This way you will cover more topics in less time.Read NCERT line by line. Mark important facts with a highlighter and make notes simultaneously. After completing NCERT, start reading extra study material available in the form of books, and preparation websites. Also, make notes from these references.For Biology, learn diagrams by heart to understand a topic. Pictures help you retain the information more effectively. Diagrams are an important factor for NEET 2021 preparation.For physics, solve as many questions as you can. Additionally, create a chapter-wise formula sheet that comprises all formulas and laws discussed in the chapter.For chemistry, learn diagrams and chemical equations by heart. After completing every chapter, create a sheet for chemical equations and formulas to be used in solving the questions.NEET 2021 preparation tip 3: Practise questions No emphasis is enough to showcase how important practising questions is for your NEET 2021 preparation. Some guidelines for this are Practise as many questions as possible for all three subjects. This will help you understand the type of questions asked from each topic and you will know how far you stand from your target score.Practising vaguely won’t be much effective. Make timed sessions and try to solve a certain amount of questions in a fixed time. This will help you overcome the time constraint.Also, make a test log and note down all the questions that were attempted wrong. This way, you will know your weak points and working on them will be easy.Take as many tests as possible. It is not necessary for the test to be full-length. You can take chapter-wise tests within a limited amount of time.Try to solve previous years question papers within a certain period of time. Solving previous years papers is a good way of practising chapters/topics.NEET 2021 preparation tip 4: Revision is important All the study and hard work would be of no use if there is no revision. Revising chapters you have already covered will not only help you retain the information but also find new points that remained unnoticed previously. Also, during a few days before the exam, it would not be possible for you to study all the chapters from scratch. Hence, the practise of revision will help you cover all the topics in time. Start revising way before NEET 2021. Include revision slots in your time table beforehand. Make revision your habit from the beginning of the NEET 2021 preparation. Some important preparation tips for NEET 2021 Divide you study time into small portions of 1 to 2 hours each. Take small breaks. This will help you in concentrating effectively.While making notes, don’t make long sentences. Keep them short. This way, you would be able to memorise them fast. Use abbreviations while making notes.NEET examines your basics. Keep your basics strong. Solving complex problems requires you to have strong fundamentals. Do not skip a topic because it seems hard. Read it as many times as required.Cover every part of NCERT thoroughly. Most of the questions asked in the exam can be found in NCERT.Don’t neglect eleventh class topics. Keep revising them with the same intensity as twelfth class topics.Coaching classes and school classes will help in studying the topics. But self-study holds the ultimate power. Always remember, nothing can replace self-study. Having a complete grasp of topics is only possible through self-study.Invest your break time into something productive such as music, art, or any sports activities. This will increase your productivity and concentration.Take tests regularly. Your test scores will work as a constant reminder for your target score.Maintain test logs. These logs not only help you supervise your scores but also point out the areas you need to work on.Revise the questions from your test logs every time before appearing for the next practice test.Take proper sleep of 7-8 hours. Compromising with sleep will result in lack of concentration and will affect your retaining power.Stay healthy. Health is important in times of preparation. Stay hydrated and take nutritious food. Don’t take the stress.All the best! ",
            "date": "Answered October 16, 2020",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shama Praveen",
                    "user_href": "/profile/Shama-Praveen-2"
                },
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Smily",
                    "user_href": "/profile/Smily-37"
                },
                {
                    "user_id": "Jiya Singh",
                    "user_href": "/profile/Jiya-Singh-234"
                },
                {
                    "user_id": "Hardik Arya",
                    "user_href": "/profile/Hardik-Arya-7"
                },
                {
                    "user_id": "Vishwash Rukwal",
                    "user_href": "/profile/Vishwash-Rukwal-1"
                },
                {
                    "user_id": "Jayam V",
                    "user_href": "/profile/Jayam-V-2"
                },
                {
                    "user_id": "Leezy D",
                    "user_href": "/profile/Leezy-D"
                },
                {
                    "user_id": "Pritam Paul",
                    "user_href": "/profile/Pritam-Paul-238"
                },
                {
                    "user_id": "Dharshana .c",
                    "user_href": "/profile/Dharshana-c"
                },
                {
                    "user_id": "Pooja Sahu",
                    "user_href": "/profile/Pooja-Sahu-124"
                },
                {
                    "user_id": "Swakshi Kumar",
                    "user_href": "/profile/Swakshi-Kumar"
                },
                {
                    "user_id": "Pragya Chaudhry",
                    "user_href": "/profile/Pragya-Chaudhry"
                },
                {
                    "user_id": "Shabana Shabu",
                    "user_href": "/profile/Shabana-Shabu-7"
                },
                {
                    "user_id": "Anusree Majumder",
                    "user_href": "/profile/Anusree-Majumder"
                },
                {
                    "user_id": "Komal Thakur",
                    "user_href": "/profile/Komal-Thakur-251"
                },
                {
                    "user_id": "Sristi Mishra",
                    "user_href": "/profile/Sristi-Mishra-6"
                },
                {
                    "user_id": "Vijay Ram",
                    "user_href": "/profile/Vijay-Ram-131"
                },
                {
                    "user_id": "Lekshmi Manju",
                    "user_href": "/profile/Lekshmi-Manju"
                },
                {
                    "user_id": "Kiran Ratthor",
                    "user_href": "/profile/Kiran-Ratthor"
                },
                {
                    "user_id": "Ezhilarasisampu Sampathcm",
                    "user_href": "/profile/Ezhilarasisampu-Sampathcm"
                },
                {
                    "user_id": "Shivani Negi",
                    "user_href": "/profile/Shivani-Negi-101"
                }
            ]
        },
        {
            "author_info": {
                "name": "Swarna Priya",
                "href": "/profile/Swarna-Priya-40"
            },
            "answer_text": "The principle adage ought to be 'Start as right on time as perhaps In this futile daily existence, there is no shorcut and substitution of time.. The additional time you commit to considers, the better outcomes would be.. I will share my procedure of accomplishing AIR of 4.5k with just exclusively 8months of study Join an instructing Institute like dbmci if you haven't as of now In the event that you as of now have the notes,join test arrangement, but,stick to it truly in light of the fact that in classes you have a timetable and an objective to finish which frequently lingers behind in test arrangement.. That push ought to be your exertion Attempt to comprehend the points, hold whatever the instructors state.. Regularly 1 line of note pad means 4–5lines of data in our psyche on the off chance that we listen mindfully and comprehend Adhere to a calendar, frequently we may not coordinate for the significant subjects, don't fear, regardless of whether you spread 40%, spread that completely Attempt to connect various subjects, same points in physiology, pathology, medication whenever read along with relationship, maintenance will be better It would be ideal if you and kindly don't burn through much time on cellphone.. You feel like not considering, go out, eat, shop or watch a film, yet don't remain at home looking through telephone, that wouldn't revive you Avoid contrary individuals and don't lose trust.. Have faith in hardwork and do your part, rest God will deal with.. Genuine hardwork won't get unrewarded, be sure of that I am a normal student who had no presentation of instructing prior and no readiness, yet figured out how to get what I wanted with just those long periods of arrangement alongside shopping, going out, and not settling on my rest ",
            "date": "Answered July 6, 2020",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sanjana Walke",
                    "user_href": "/profile/Sanjana-Walke-3"
                },
                {
                    "user_id": "Mitali Saxena",
                    "user_href": "/profile/Mitali-Saxena-16"
                },
                {
                    "user_id": "Ruruu",
                    "user_href": "/profile/Ruruu-1"
                },
                {
                    "user_id": "Karishma Sharma",
                    "user_href": "/profile/Karishma-Sharma-448"
                },
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Rajlaxmi",
                    "user_href": "/profile/Rajlaxmi-7"
                },
                {
                    "user_id": "BALORDA VENKATALAKSHMI",
                    "user_href": "/profile/BALORDA-VENKATALAKSHMI"
                },
                {
                    "user_id": "Pooja S",
                    "user_href": "/profile/Pooja-S-562"
                },
                {
                    "user_id": "Smily",
                    "user_href": "/profile/Smily-37"
                },
                {
                    "user_id": "Sunil Khan",
                    "user_href": "/profile/Sunil-Khan-43"
                },
                {
                    "user_id": "Priyanka Sahu",
                    "user_href": "/profile/Priyanka-Sahu-496"
                },
                {
                    "user_id": "Mahima Bandyopadhya",
                    "user_href": "/profile/Mahima-Bandyopadhya-1"
                },
                {
                    "user_id": "Mubharak Mubharak",
                    "user_href": "/profile/Mubharak-Mubharak-2"
                },
                {
                    "user_id": "Vishwash Rukwal",
                    "user_href": "/profile/Vishwash-Rukwal-1"
                },
                {
                    "user_id": "Rajesh Das",
                    "user_href": "/profile/Rajesh-Das-419"
                },
                {
                    "user_id": "Anusha Rajesh",
                    "user_href": "/profile/Anusha-Rajesh-26"
                },
                {
                    "user_id": "Yash Raaj Ram",
                    "user_href": "/profile/Yash-Raaj-Ram"
                },
                {
                    "user_id": "Arpit Banerjee",
                    "user_href": "/profile/Arpit-Banerjee-5"
                },
                {
                    "user_id": "Mansi Maheshwari",
                    "user_href": "/profile/Mansi-Maheshwari-27"
                },
                {
                    "user_id": "Raveena Meena",
                    "user_href": "/profile/Raveena-Meena-14"
                },
                {
                    "user_id": "Sajid Rahmani",
                    "user_href": "/profile/Sajid-Rahmani-1"
                },
                {
                    "user_id": "Praveesh Shetty",
                    "user_href": "/profile/Praveesh-Shetty"
                },
                {
                    "user_id": "Baljeet Kaur",
                    "user_href": "/profile/Baljeet-Kaur-207"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/RENEE-PRINCY"
                },
                {
                    "user_id": "Ritu Jha",
                    "user_href": "/profile/Ritu-Jha-52"
                },
                {
                    "user_id": "Amir Athar",
                    "user_href": "/profile/Amir-Athar"
                },
                {
                    "user_id": "Ajay Kumar",
                    "user_href": "/profile/Ajay-Kumar-23666"
                },
                {
                    "user_id": "Kavita Rawal",
                    "user_href": "/profile/Kavita-Rawal-8"
                },
                {
                    "user_id": "Uday Kotkar",
                    "user_href": "/profile/Uday-Kotkar-1"
                },
                {
                    "user_id": "Sangita Jadhav",
                    "user_href": "/profile/Sangita-Jadhav-17"
                },
                {
                    "user_id": "Sam Smith",
                    "user_href": "/profile/Sam-Smith-3229"
                },
                {
                    "user_id": "Carlyn Deori",
                    "user_href": "/profile/Carlyn-Deori-1"
                },
                {
                    "user_id": "Vaishali Singh Senger",
                    "user_href": "/profile/Vaishali-Singh-Senger"
                },
                {
                    "user_id": "Yogesh Joshi",
                    "user_href": "/profile/Yogesh-Joshi-300"
                },
                {
                    "user_id": "Vedika Bhatt",
                    "user_href": "/profile/Vedika-Bhatt-3"
                },
                {
                    "user_id": "Deeksha Bhattacharyya",
                    "user_href": "/profile/Deeksha-Bhattacharyya"
                },
                {
                    "user_id": "Noob Dawg",
                    "user_href": "/profile/Noob-Dawg"
                },
                {
                    "user_id": "TamannA",
                    "user_href": "/profile/TamannA-172"
                },
                {
                    "user_id": "Navaneeth Anil",
                    "user_href": "/profile/Navaneeth-Anil-4"
                },
                {
                    "user_id": "Lakshana",
                    "user_href": "/profile/Lakshana-23"
                },
                {
                    "user_id": "Rubbaiya Sultana",
                    "user_href": "/profile/Rubbaiya-Sultana-1"
                },
                {
                    "user_id": "Ishrath Jabeen",
                    "user_href": "/profile/Ishrath-Jabeen-12"
                },
                {
                    "user_id": "Prerna Sharma",
                    "user_href": "/profile/Prerna-Sharma-818"
                },
                {
                    "user_id": "Sindhu Jaiswal",
                    "user_href": "/profile/Sindhu-Jaiswal-1"
                },
                {
                    "user_id": "Naveen Nishchal Pathak",
                    "user_href": "/profile/Naveen-Nishchal-Pathak"
                },
                {
                    "user_id": "Maira Zainab",
                    "user_href": "/profile/Maira-Zainab-2"
                },
                {
                    "user_id": "Keshav Vatsa",
                    "user_href": "/profile/Keshav-Vatsa"
                },
                {
                    "user_id": "Aditya Raj",
                    "user_href": "/profile/Aditya-Raj-1830"
                },
                {
                    "user_id": "Vishwajeet Singh Chouhan",
                    "user_href": "/profile/Vishwajeet-Singh-Chouhan-4"
                },
                {
                    "user_id": "Mrinalini Nair",
                    "user_href": "/profile/Mrinalini-Nair-3"
                },
                {
                    "user_id": "Somya Kumari",
                    "user_href": "/profile/Somya-Kumari-30"
                },
                {
                    "user_id": "Kritika Verma",
                    "user_href": "/profile/Kritika-Verma-135"
                },
                {
                    "user_id": "Dharmendra Chauhan",
                    "user_href": "/profile/Dharmendra-Chauhan-6"
                },
                {
                    "user_id": "Aayush Mishra",
                    "user_href": "/profile/Aayush-Mishra-134"
                },
                {
                    "user_id": "Aastha Arunika",
                    "user_href": "/profile/Aastha-Arunika-1"
                },
                {
                    "user_id": "Bʜᴀɴᴜ Pʀᴀᴛᴀᴘ Sɪɴɢʜ.",
                    "user_href": "/profile/Bʜᴀɴᴜ-Pʀᴀᴛᴀᴘ-Sɪɴɢʜ"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajesh Saharan",
                "href": "/profile/Rajesh-Saharan"
            },
            "answer_text": "Yes, you can crack NEET 2021 if you start studying right now from scratch. You can complete the syllabus in time if you focus on strengthening concepts, working on your weaker areas, problem solving, practice tests and revision. Here are some tips to crack NEET exam in the remaining time. Read from NCERT and NEET study material. Avoid using multiple reference books and material in your preparation.While studying, try to grasp the main concept very clearly. Objective questions (MCQs) test your concept thoroughly. You need consistent practice to improve speed and accuracy.Make notes of important terms, formulas, reactions, mistakes while solving problems, etc. Include your own shortcuts and tricks.Keep revising what you learn during the preparation.See the trend of NEET past year papers. While solving questions, apply the tricks (mostly taught by your coaching teachers).Prepare an exam strategy and stick to it during mock tests and NEET exam.Always analyse your test and find out mistakes that are happening, correct those mistakes and don’t repeat them in the upcoming tests.On the exam day, pick up the questions based on your strengths. Do not let any question eat up your time. Skip the question as soon as you are nowhere close to the answer. Come back to these questions after you finished the whole paper once.Stay positive. There will be times when you would find it difficult to understand and manage things. Do not give up.Hope it helps. ",
            "date": "Answered August 11, 2020",
            "views": "967",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shama Praveen",
                    "user_href": "/profile/Shama-Praveen-2"
                },
                {
                    "user_id": "Urmila Ghosh",
                    "user_href": "/profile/Urmila-Ghosh-4"
                },
                {
                    "user_id": "Shruthishree Selvaraj",
                    "user_href": "/profile/Shruthishree-Selvaraj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mani Gupta",
                "href": "/profile/Mani-Gupta-66"
            },
            "answer_text": "To all those who are preparing for NEET 2021 There is just 7 months ahead of you So here are just few preparation tips : To the 12 studying students kindly try to revise your 11th portions along with 12th Try to at least cover all important and weightage topics of 11th along with 12th syllabus before December you can join NEETshala 2021 Score Booster program for weekly plan and Test. Solve Mcq’s of all chapters from a particular book and mark the ones you have gone wrong and after finishing completing the chapters solve the mcq in which you went wrong and mcq practice available free at NEETshala app. Try to solve at least 50 questions per day from physics and chemistry and 100 question in biology . To repeaters: Mark your weaker and stronger topics first Try to rectify your mistakes and where you went wrong as early as possible Try to complete your weaker topics by learning concepts and solving questions and get strong and confident in those topics And the topics in which your strong just glance the theory or concept and solve questions till u feel you can easily handle the topic To know your weak areas join NEETshala program where you will get proper analysis of your weak area and take customised Test based on your weaker portion. And for biology first you have to complete revising only NCERT for 2 times then later you can add on some extra points which you get while solving mcq’s and pyq’s Try to solve at least 50 questions per day from physics and chemistry and 100 question in biology Solve Mcq’s of all chapters from a particular book and mark the ones you have gone wrong and after finishing completing the chapters solve the mcq in which you went wrong Regular part tests must be taken in order to analyse your preparation and always try to solve the whole paper along with solutions once you complete giving the test And note the question in which you are going wrong or leaving and note them in a separate notebook because those are the topics r questions you are not able to solve ",
            "date": "Answered September 17, 2020",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dilip Gangaramani",
                "href": "/profile/Dilip-Gangaramani-1"
            },
            "answer_text": " Thanks for A2A If you are preparing for NEET 2021 exam, then you have a whole year at your disposal to study. And leveraging to your favor is what can create the entire difference. Considering that you have taken a break from the exam or currently preparing for the exam, you can smoothly touch through each of the aspects and make it through the NEET 2021 exam with ease. Here are a few tips and tricks for NEET 2021 exam preparation: Give equal focus on every subject:This is extremely important when you are preparing for NEET 2021 exams. This includes giving equal focus to every subject whether it is NEET Physics, NEET Chemistry or NEET Biology. Giving only one subject more important than another one will cause an imbalance in learning and hence each one should be given equal preference. Thus, set a strategic timetable which balances the study process. Choose appropriate study materialBooks are yet another important aspect when it comes to preparing for the exams. Herein not only is one required to be well abreast with the textbook data but also with other course material used as reference resources for practice. If you wish to make the sail to competitive exams an easy one, ensure to be abreast with the NCERT books on which is the entire NEET syllabus is based. In addition to this, also refer to other NEET exam study materials that offer a comprehensive platform for previous year papers, an ample amount of MCQ and solutions for one to assess their preparation can prove to be beneficial for NEET exam preparation. Complete the easy topics firstWhile one usually opts for clearing difficult topics. However, it is always better to clear easier ones prior to opting for difficult questions. This will be helpful in two ways - You can be confident that you have completed some of the topics In case you realize you are confused about any aspect in the easy topics as well it will help in the future. Optional: These points listed below aren’t compulsory but can be utilized if you deem to increase your scores in the exam: Join Coaching ClassesWhen it comes to NEET exams, there are numerous coaching classes who offer NEET coaching for aspirants who wish to enroll in MBBS or BDS courses. Coaching classes offer students additional guidance and hands-on preparation to crack the examination. ",
            "date": "Answered October 21, 2019",
            "views": "31",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sanjana Walke",
                    "user_href": "/profile/Sanjana-Walke-3"
                },
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Tanisha Mittal",
                    "user_href": "/profile/Tanisha-Mittal-42"
                },
                {
                    "user_id": "Aditi Bhattacharjee",
                    "user_href": "/profile/Aditi-Bhattacharjee-14"
                },
                {
                    "user_id": "Fatima Azher",
                    "user_href": "/profile/Fatima-Azher-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harshita Gupta Wscube",
                "href": "/profile/Harshita-Gupta-Wscube"
            },
            "answer_text": "NEET 2021 Study Plan and Preparation Tips Identify your most efficient hours by studying at various times during a day like early morning, day, or already dark. These hours will offer you the simplest output. you've got to completely focused on your preparation. Get obviate any distractions that affect your studies.Separate your investigation meetings into 30 mins or 45 mins or 60 mins meetings (in light of what amount of time you'll focus) at that point require brief breaks of 5 mins, 10 mins, 15 mins respectively. Small mental breaks will actually assist you to stay focused on your task.Make sure your goals are clear (they are often short ones like finishing a subject or a chapter), and your plans are well thought out, and most significantly, that you simply have a schedule for each day during your preparation. If you miss out on your schedule at some point, structure for it the next day. Achieve your goals for the week as you planned.NEET tests your basics. Without this ground step, you can't rise high. Be really thorough with the concepts. you'll use NCERT or a training study material for understanding theory and solving problems.Read NCERT line by line. Examples, summary, diagrams are vital for NEET. Use Mnemonics to recollect difficult words, phrases, and statements.If you're unable to find out a subject or concept, read the idea again and again till you get the texture of the subject. Learn topics and solve questions that are within the NEET syllabus. Don’t go far into something which isn't required.Think of alternative ways of solving problems. After solving an issue, refer to the answer to seek out if there's a far better thanks to solving the question.”Give regular tests to enhance speed, accuracy, and time management skills.Make short notes for all subjects. you'll write formulas of physics, short tricks, reactions of chemistry, samples of biology, important dates and years of ecology, etc in order that you'll revise them briefly time in an organized way.If you're taking coaching, make class notes, and review them every day after the category. If you've got any questions or doubts, ask your teacher within the next class. Do all the homework and assignments on time. invite help if you would like it.Start revising early. Include specific revision squeeze your preparation schedule. Don’t procrastinate the revision time for a brand spanking new study. Make flow charts, diagrams, tables, posters, post-its, etc. and stick them wherever possible and have a look at them repeatedly. Write your silly mistakes during a diary and revise from it before every test.Take care of your health, both physical and mental. Sleep peacefully for 7-8 hours. Don’t overthink.",
            "date": "Answered October 14, 2020",
            "views": "496",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ruhani Singh",
                    "user_href": "/profile/Ruhani-Singh-13"
                },
                {
                    "user_id": "Vedanti Bawankar",
                    "user_href": "/profile/Vedanti-Bawankar"
                },
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Sanjana Walke",
                    "user_href": "/profile/Sanjana-Walke-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saloni Thakur",
                "href": "/profile/Saloni-Thakur-5"
            },
            "answer_text": "Hello, I'm glad you're beginning early. Actually, it's better to begin early as it leaves you with ample amount of time to practice in the later stages. Also, I would suggest you to go for smart learning as beginning early has it one big drawback that is loss of motivation midway. You need interactive learning sessions thus. Not going for any coaching class is absolutely fine as these days they just manage to eat up your time, money and energy. Although preparation for NEET is no easy task. And it's always easier said than done. So I hope you pay attention to the extreme details. Just remember and make sure you follow a specific pattern for studying throughout. To avoid the loss of motivation midway, continue studying in interactive ways for small small stretches. I would highly recommend the video lectures by M-learning India. If you inspect the current situation closely, I firmly opine that those are one of the finest videos for NEET. You can just watch those videos for about 5/6 hours daily according to your convenience. They are designed specifically by keeping NEET in mind and are conducted by extremely dedicated and experienced professionals. With an experience of more than 20 years, the video lectures will definitely benefit you to the most. You can easily access them through your internet. You can also download the app for the access to the offline content. It is available on the Google play store under the name M-learning India video streaming app. There are many test series out there to provide the students with a good hand at practice. It makes sure to cover up all the necessary topics that need to be covered in order to ace up the examination. Also, the doubts you posses are soon rectified under the doubt solving sessions. This definitely gives you an upper edge over your counterparts. I honestly suggest you to download their app now, they won't disappoint you. Thank you! ",
            "date": "Answered May 15, 2018",
            "views": "73",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Roshni Jha",
                    "user_href": "/profile/Roshni-Jha-33"
                },
                {
                    "user_id": "Anubhav Pohekar",
                    "user_href": "/profile/Anubhav-Pohekar"
                },
                {
                    "user_id": "Sourav Pal",
                    "user_href": "/profile/Sourav-Pal-119"
                },
                {
                    "user_id": "Prabhavathi M N",
                    "user_href": "/profile/Prabhavathi-M-N-2"
                },
                {
                    "user_id": "Prithwis Das",
                    "user_href": "/profile/Prithwis-Das-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manisha Gupta",
                "href": "/profile/Manisha-Gupta-225"
            },
            "answer_text": "Hello, Books are helpful to complete your syllabus but you can not practice or analyze your performance. To score well in exam, Only books are not enough. Here are some preparation books, You can prefer for NEET Entrance Exams. Physics Books NCERT Physics Class XI & Class XII Concepts of Physics by H. C. Verma Objective Physics By DC Pandey Fundamentals of Physics by Halliday, Resnick and Walker Chemistry Books NCERT Chemistry textbooks for Class XI and XII Physical Chemistry by OP Tandon ABC of Chemistry for Classes 11 and 12 by Modern Concise Inorganic Chemistry by JD Lee Dinesh Chemistry Guide Biology Books NCERT Chemistry textbooks for Class XI and XII Physical Chemistry by OP Tandon ABC of Chemistry for Classes 11 and 12 by Modern You can also prefer Careers360 NEET 2021 Knockout Preparation Package. This package contains the features- Video E-lecturer, Smart Study Material with 5000+ Concepts Videos, 5000+ Concepts, Most Asked Concepts, Most Difficult Concepts, Chapter wise questions & Answers Etc., Mock test Series- Chapter Wise, Subject wise, Full Mock test, Faculty Support, performance Analyze Etc. Good Luck! ",
            "date": "Answered June 5, 2020",
            "views": "512",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abhinab Sharma",
                    "user_href": "/profile/Abhinab-Sharma-10"
                },
                {
                    "user_id": "Golden Hamster",
                    "user_href": "/profile/Golden-Hamster-1"
                },
                {
                    "user_id": "Jiten Garg",
                    "user_href": "/profile/Jiten-Garg-5"
                },
                {
                    "user_id": "Mukul Dadheech",
                    "user_href": "/profile/Mukul-Dadheech"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rishi Shakya",
                "href": "/profile/Rishi-Shakya-6"
            },
            "answer_text": "You have ample amount of time, you can start with 4–5 hours a day Quality study. Clear all your doubts and concepts chapterwise. Make a schedule of studying where you study for 6 days and 7th day for revision that you did whole week. Firstly analyse Previous Year Question papers and get to know in what chapters you need detailed study and which chapters you can study just formulae specially for Physics. Biology : Full NCERT line by line make notes in short learn all Examples. Chemistry: Physical - Equilibrium and Electro from NCERT only. Rest tricks and techniques from any Good teacher notes. If you are at kanpur get KK Sir Notes ( i will try to make it available soon) Organic- Only NCERT Inorganic - NCERT is sufficient. Physics: Akash Module (Repeaters) is sufficient. You can go for other Notes by any Good teacher who teaches in short and is conceptual. Remember a thing you need not to do PhD on any topic but you are expected to have learning and understanding of basic concepts that are prescribed in Syllabus (Download it from NTA website and keep it with you and keep watching what you are learning). If you want to follow something online follow Khan Academy English lectures only, on Youtube and app. Keep your resources confined. One book has enough power to get you selected in any Exam but u have to complete it thoroughly and revise as many times as possible to polish yourself. Dont change books in this coarse of preparation. Dont follow too many books. Read only that stuff that you are sure you would be able to cover during revision. ",
            "date": "Answered January 10, 2020",
            "views": "21",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Pritam Paul",
                    "user_href": "/profile/Pritam-Paul-238"
                },
                {
                    "user_id": "Sharan Shetty",
                    "user_href": "/profile/Sharan-Shetty-35"
                },
                {
                    "user_id": "Chitra Kulkarni",
                    "user_href": "/profile/Chitra-Kulkarni-17"
                },
                {
                    "user_id": "Vinod Upadhyay",
                    "user_href": "/profile/Vinod-Upadhyay-51"
                },
                {
                    "user_id": "Vijay Karnam",
                    "user_href": "/profile/Vijay-Karnam"
                },
                {
                    "user_id": "Priyanka Sharma",
                    "user_href": "/profile/Priyanka-Sharma-2000"
                }
            ]
        },
        {
            "author_info": {
                "name": "Subodh Beniwal",
                "href": "/profile/Subodh-Beniwal-1"
            },
            "answer_text": "The one thing I want to advice for all those who are going to give NEET in 2021 is that in this lockdown period utilise this time very efficiently. Build you basis integration, differentiation, algorithms and graphs concept as almost all students who are in medical stream with maths as not an additional subject founds Physics as the most challenging subject and it is only due to lack of basic maths concept. Secondly I want to suggest that start to focus on NCERT especially Biology, focus on each detail and memorise all the diagrams in NCERT and practice a lot. Try practice paper or take any institute test series to check your preparation. For chemistry (Organic and Inorganic) focus only on NCERT. Revise and practice all the named reactions in NCERT. For physical you can try problems from another books, I will suggest Balaji publications books. For physics your concepts matter a lot if your concepts are crystal clear then you can easily solve the problems of NEET paper as they don't ask you a typical problems they just want to check your basic understanding. For practice you can refer to some good publications book like HC Verma and DC Pandey. At last be patient and continuously practice and revise things. Best of luck for your exam ! Thanks for reading:) ",
            "date": "Answered June 24, 2020",
            "views": "332",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "AryaKrishna Chevar",
                    "user_href": "/profile/AryaKrishna-Chevar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikhil Bhardwaj",
                "href": "/profile/Nikhil-Bhardwaj-20"
            },
            "answer_text": "Thanks for A2A If you really want to be a doctor then you will need to work hard. It is not a easy exam lakhs of people give the exam every year and very few of them get selected. You should assume that you don't have any reservation quota and have to do everything on your own. And put as much efforts in achieving your goal as you can . Then as you are in 11 start preparing as soon as possible. Make very small notes as you study the chapter and keep them with you . Practice makes a man perfect so practice as many MCQ as you can . Revise the topics time to time . Ask doubts from your teachers, make your concepts crystal clear and learn from your teachers the application of concept in physics and chemistry . Practice more and more problems . Learn the facts of inorganic chemistry the exception etc organic reactions and formula . As you have your board exams in 12 then prepare well beforehand as soon as you finish your 11 class revise every topic before the onset of 12 class and in 12 revise and practice the mcq and concepts side by side. After your boards start revising 11 again and then followed by 12 class syllabus . Then the previous year question papers are only left which you should practice in the limited time of 3 hours. Some books which i recommend for the preparation are Physics - Dc pandey , Hc verma , Ncert and Ncert exemplarChemistry- Ncert & Ncert Exemplar , mtg ncert at your fingertipsBiology - Ncert and Ncert exemplar, Mtg Ncert at your fingertipsMake sure you spend some time with friends and family daily for refreshing your mind. You can listen to some music or play outdoor sports but please avoid usage of social media and games like PUBG . Decide if you want a chicken dinner or a government seat . :P ",
            "date": "Answered August 7, 2019",
            "views": "24",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Vishwash Rukwal",
                    "user_href": "/profile/Vishwash-Rukwal-1"
                },
                {
                    "user_id": "Keerthi Lakshmi",
                    "user_href": "/profile/Keerthi-Lakshmi-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priya Bansal",
                "href": "/profile/Priya-Bansal-19"
            },
            "answer_text": "There is a lot of time for NEET 2021. Utilise it effectively and study hard. You have the liberty of moving slow with the syllabus. Follow either school syllabus or coaching. Do not be confused between both od them. Prioritise and study effectively.Class 11th physics and entire organic chemistry forms the basics for 12th. Under no circumstances should these topics be left weak. Study them alongside class and practice a lot of questions. Chapters like mechanics and oscillations will be used in integrated HOTS as well.In biology special emphasis is to be given to plant and human physiology. These are high weightage chapters and require concept building. Learn the cycles and revise them periodically.While solving questions, mark questions which you got wrong with one colour and, questions which made you think and analyse multiple concepts at once with another. Before NEET, revise these questions alone. This will save time and get all the important questions done.Needless to say NCERT is to be read as many times as you can! You should be able to quote lines in your sleep. :PThere is no need to rush to class 12th syllabus. Finish 11th first as syllabus is more. Do not rush… take your time and build concepts.Good luck! :) ",
            "date": "Answered June 11, 2019",
            "views": "87",
            "upvotes": " View 53 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Jäïsmëëñ",
                    "user_href": "/profile/Jäïsmëëñ"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ruchika Chauhan",
                "href": "/profile/Ruchika-Chauhan-52"
            },
            "answer_text": "Hello You should start preparing from basics. Clearing of basic concepts is very important to ace this national level exam and come out with flying colors. As the competition level is increasing every year, you should start your preparation with a strategic approach. Firstly, check the detailed syllabus and pattern of the exam. Start preparing from NCERT textbooks. NCERTs are the best books for building the fundamentals. You can also refer to other important books for in depth knowledge of the subject. Make a time table and plan your studies so that you can complete your syllabus well before in time and you have last months for revision, solving previous year papers and attempting mock tests. Mock tests and previous year papers help you to know about your preparation level and improve accordingly after knowing your weaknesses and strengths. Make short notes and you can make a small notebook for formulas. Preparing using online study material is always useful and an additional support to enhance your speed and accuracy. I would suggest you to refer to NEET Knockout by Careers360. It is a highly effective preparation package which helps student to prepare well and master all the important concepts. The package helps students by providing the following features: Adaptive time tableVideo E-LecturesSmart Study MaterialUnlimited Mock Test SeriesPerformance AnalysisPerformance AnalysisPrepmeterFaculty SupportChat and QnAYou will get to know the most asked concepts, most difficult concepts, topics carrying the maximum weightage. You can practice unlimited tests and analyze your preparation level. All the Best! ",
            "date": "Answered October 18, 2019",
            "views": "21",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "BALORDA VENKATALAKSHMI",
                    "user_href": "/profile/BALORDA-VENKATALAKSHMI"
                },
                {
                    "user_id": "Rajshree Chore",
                    "user_href": "/profile/Rajshree-Chore"
                },
                {
                    "user_id": "Debjyoti Biswas",
                    "user_href": "/profile/Debjyoti-Biswas-36"
                }
            ]
        },
        {
            "author_info": {
                "name": "Utkarsh Singh",
                "href": "/profile/Utkarsh-Singh-2285"
            },
            "answer_text": "I will just give you a brief Biology - Read NCERT thoroughly. Multiple times Maybe 15–20 times. Keep revising. Dont mug up everything try to correlate it. Chemistry - Physical - keep your fundamentals clear. Solve every type of numerical again and again. Inorganic - Again go through ncert multiple times. If youre joining a coaching then keep revising your notes. These chapters are really easy to learn dont even try to mug up because you cant, there is just too much content first understand periodic table then go for every elements properties then their compounds. And you have to have your Bonding chaps really clear. Organic - reaction's mechanisms must be really clear to you. Dont leave any name reaction. Make a separate copy for just name reactions and important reactions to remember. NCERT is the key again. Physics - firstly dont think of it as a nightmare, again just go for the basics first and then apply formulas. This really needs a LOT of practice. Keep revising. Make a separate copy for formulas it helps a lot. For 2021 NEET you have lot of time. Make sure you get your basics really clear and keep revising bio chem and phy formulas and dont leave anything in NCERT untouched. NCERT's bio should be on your tips. Keep practicing phy numericals and physical chemistry. And last give mocks every week. Take Allen's test series they help a lot. Thanks :) ",
            "date": "Answered July 26, 2019",
            "views": "18",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Nilesh S",
                    "user_href": "/profile/Nilesh-S-33"
                },
                {
                    "user_id": "Satwik Mohapatra",
                    "user_href": "/profile/Satwik-Mohapatra-1"
                },
                {
                    "user_id": "Arpit Banerjee",
                    "user_href": "/profile/Arpit-Banerjee-5"
                },
                {
                    "user_id": "Samriddhi Dubey",
                    "user_href": "/profile/Samriddhi-Dubey-15"
                },
                {
                    "user_id": "Kushagra Tiwari",
                    "user_href": "/profile/Kushagra-Tiwari-32"
                },
                {
                    "user_id": "Kritika Pandey",
                    "user_href": "/profile/Kritika-Pandey-97"
                },
                {
                    "user_id": "Dharshana .c",
                    "user_href": "/profile/Dharshana-c"
                },
                {
                    "user_id": "Amir Athar",
                    "user_href": "/profile/Amir-Athar"
                },
                {
                    "user_id": "Baljeet Kaur",
                    "user_href": "/profile/Baljeet-Kaur-207"
                },
                {
                    "user_id": "Shabana Shabu",
                    "user_href": "/profile/Shabana-Shabu-7"
                },
                {
                    "user_id": "Khushboo Karanwal",
                    "user_href": "/profile/Khushboo-Karanwal"
                },
                {
                    "user_id": "Srinivas Pai",
                    "user_href": "/profile/Srinivas-Pai-37"
                },
                {
                    "user_id": "Ezhilarasisampu Sampathcm",
                    "user_href": "/profile/Ezhilarasisampu-Sampathcm"
                },
                {
                    "user_id": "Vinod Kapoor",
                    "user_href": "/profile/Vinod-Kapoor-26"
                },
                {
                    "user_id": "Imam Hussain",
                    "user_href": "/profile/Imam-Hussain-52"
                },
                {
                    "user_id": "Shrestha Sarkar",
                    "user_href": "/profile/Shrestha-Sarkar-10"
                },
                {
                    "user_id": "Sharan Shetty",
                    "user_href": "/profile/Sharan-Shetty-35"
                },
                {
                    "user_id": "Prinayana Sarma",
                    "user_href": "/profile/Prinayana-Sarma"
                },
                {
                    "user_id": "Shyam Kumar",
                    "user_href": "/profile/Shyam-Kumar-522"
                },
                {
                    "user_id": "Sanjana.R",
                    "user_href": "/profile/Sanjana-R-50"
                },
                {
                    "user_id": "Tanya Juneja",
                    "user_href": "/profile/Tanya-Juneja-2"
                },
                {
                    "user_id": "Saraswati",
                    "user_href": "/profile/Saraswati-31"
                },
                {
                    "user_id": "Shraddha Agrawal",
                    "user_href": "/profile/Shraddha-Agrawal-138"
                },
                {
                    "user_id": "Riya Singh",
                    "user_href": "/profile/Riya-Singh-695"
                },
                {
                    "user_id": "Malya Chakraborty",
                    "user_href": "/profile/Malya-Chakraborty"
                },
                {
                    "user_id": "Pranav Kant Tripathi",
                    "user_href": "/profile/Pranav-Kant-Tripathi"
                },
                {
                    "user_id": "Richa Priya",
                    "user_href": "/profile/Richa-Priya-19"
                },
                {
                    "user_id": "Harsh Jakhar",
                    "user_href": "/profile/Harsh-Jakhar-12"
                },
                {
                    "user_id": "Yogita Aggarwal",
                    "user_href": "/profile/Yogita-Aggarwal-8"
                },
                {
                    "user_id": "Mrinalini Nair",
                    "user_href": "/profile/Mrinalini-Nair-3"
                },
                {
                    "user_id": "Gursehajbir Singh",
                    "user_href": "/profile/Gursehajbir-Singh-5"
                },
                {
                    "user_id": "Swenya Soares",
                    "user_href": "/profile/Swenya-Soares"
                },
                {
                    "user_id": "Sangeeta Joshi",
                    "user_href": "/profile/Sangeeta-Joshi-37"
                },
                {
                    "user_id": "Harsh Giri",
                    "user_href": "/profile/Harsh-Giri-13"
                },
                {
                    "user_id": "Varun Legend",
                    "user_href": "/profile/Varun-Legend"
                },
                {
                    "user_id": "Sudhanshu",
                    "user_href": "/profile/Sudhanshu-97"
                },
                {
                    "user_id": "Rochita Ghosh",
                    "user_href": "/profile/Rochita-Ghosh-1"
                },
                {
                    "user_id": "Neha Pandey",
                    "user_href": "/profile/Neha-Pandey-699"
                },
                {
                    "user_id": "Siddharth Bhardwaj",
                    "user_href": "/profile/Siddharth-Bhardwaj-176"
                },
                {
                    "user_id": "Anshika",
                    "user_href": "/profile/Anshika-123"
                },
                {
                    "user_id": "Simmi Gupta",
                    "user_href": "/profile/Simmi-Gupta-37"
                },
                {
                    "user_id": "Soham Mandal",
                    "user_href": "/profile/Soham-Mandal-4"
                },
                {
                    "user_id": "Parul Yadav",
                    "user_href": "/profile/Parul-Yadav-90"
                },
                {
                    "user_id": "Rohit Kumar",
                    "user_href": "/profile/Rohit-Kumar-14241"
                },
                {
                    "user_id": "Amulya Gupta",
                    "user_href": "/profile/Amulya-Gupta-21"
                },
                {
                    "user_id": "Sindhu Jaiswal",
                    "user_href": "/profile/Sindhu-Jaiswal-1"
                },
                {
                    "user_id": "Palak Tiwari",
                    "user_href": "/profile/Palak-Tiwari-29"
                },
                {
                    "user_id": "Preiya Patel",
                    "user_href": "/profile/Preiya-Patel"
                },
                {
                    "user_id": "Snigdha Sinha",
                    "user_href": "/profile/Snigdha-Sinha-6"
                },
                {
                    "user_id": "Shubham Tikaria",
                    "user_href": "/profile/Shubham-Tikaria-1"
                },
                {
                    "user_id": "Aasim",
                    "user_href": "/profile/Aasim-20"
                },
                {
                    "user_id": "Ridhi Chaudhary",
                    "user_href": "/profile/Ridhi-Chaudhary-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muhammad Ifhaam",
                "href": "/profile/Muhammad-Ifhaam"
            },
            "answer_text": "Let me start You should make a time table and fix time for each subject.your first priority must be biology because it covers half of the marks of neet and the 2nd thing is that it is very easy.For biology just use NCERT because 90 %+ questions comes from Ncert.But you have to go through each and every line of book even the summary given at last if every chapter.for some topics you have to move out of ncert like Ecology _biodoversity and environment and mutual relationship topic. But your main concentration or focus should be in ncert.For questions you can use any objective book but Dinesh would be better for you and also do chapter wise solution book. Chemistry , for inorganic portion only do NCERT and make your own short notes for rapid revision.For physical read ncert that clears your concepts and use objective books for question practicing.you can use universal that is a good book covers all the previous entrance exam questions.After completing that you can use other book. Now comes organic portion for that your organic understanding must be good. For that read ncert and do practice of organic from universal and you can also use other books for it. Now physics practice as much as you can do.you can use universal for practice and also arihant for standard questions. Also do NCERT exempler questions. But your physics concept must clear for good hold in it. And make your physics good because it is weak potion of almost every student. Be confident and fully dedicate your self to towards your dream. ",
            "date": "Answered February 8, 2020",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Ramani Gowda",
                    "user_href": "/profile/Ramani-Gowda"
                },
                {
                    "user_id": "Prithwis Das",
                    "user_href": "/profile/Prithwis-Das-1"
                },
                {
                    "user_id": "Megha Shakya",
                    "user_href": "/profile/Megha-Shakya-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Teivra M",
                "href": "/profile/Teivra-M"
            },
            "answer_text": "Studying with full focus in 11th and 12th. The NCERT book should be on finger tips especially for biology and chemistry. (this does not mean no entertainment in life! He can follow one of his hobbies to relax)Either he can join a coaching institute or sign up for online classes or self study, there are many books available too.Be Disciplined and self-motivated. He should have his aim in mind always.As parents, keep him motivate and assure him that he can do it because the trust you offer him as parents will boost his confidence level.Be consistent in the scores of his mock tests.Taking care of health is very important too. I would suggest mediation with a soothing track and a little exercise to be fit.DO NOT PROCRASTINATE!!!Most of the students answering NEET are extremely good in biology, but when it comes to physics and chemistry, many are weak. So being strong in physics and chemistry helps to improve the rank and score.Regularly practicing and revising the difficult concepts.SPEED is very important too as in NEET students should attempt more questions in 3 hours.Solve the past year NEET papers by timing yourself.Your son has 2 years to go. Ask him to stay focused on his aim.",
            "date": "Answered March 22, 2019",
            "views": "366",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Chahat",
                    "user_href": "/profile/Chahat-29"
                },
                {
                    "user_id": "Kunal Mishra",
                    "user_href": "/profile/Kunal-Mishra-156"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashutosh Rathore",
                "href": "/profile/Ashutosh-Rathore-25"
            },
            "answer_text": "Initially when you start your preparation you must start reading NCERT textbook for Physics,chemistry and biology. You must understand everything you are studying and must remember important definition and important examples and should revisit them regularly so that you must not forget and you must work out the examples at the back of NCERT on your own and if you have any doubt you must be able to clear your doubts with good teachers that can clear your doubt and improve your understanding of the subject. All this will help you to get a decent but not a very good score in NEET. If you are aiming for a good score in NEET and get admissioned in your dream college you must work harder than this and follow some more steps. The best medium of preparation in that case according to me would be video lectures . In recent days a lot of video lectures are available, so which one should you choose? I believe that Kaysons provide the best video lectures for NEET preparation. Kaysons provide students with both online and offline video lectures on different chapters and topics that are required for NEET preparation. They have an excellent set of faculty that lay out videos beautifully. The videos are informative and easy to understand . They also provide students with an excellent study material. They also provide students with an efficient study planner and regular doubt removal sessions where students can have one to one interaction with the teachers and clear their doubts from the faculty. Kaysons also conduct mock tests . They also provide students with a portal with over 300000 practice problems on different topics that helps in strengthening the NEET preparation ",
            "date": "Answered September 17, 2020",
            "views": "524",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Vishwash Rukwal",
                    "user_href": "/profile/Vishwash-Rukwal-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shruti Tirpude",
                "href": "/profile/Shruti-Tirpude-2"
            },
            "answer_text": "Firstly take NEET seriously, and make sure that you have to go in this field only , so that you can focus on one goal. Then let know which college you want for MBBS ,then know their cutoff, next go for proper coaching for preparations, know important chapters in Neet syllabus. Study to get excellence in those topics ,so that you can solve all possible questions on those topics. You should must maintain balance in quality and quantity of syllabus of Neet-UG. Study whole syllabus properly. Clear your doubt and concept on time , so that you can perform well with fresh mind while practicing questions. Practice questions daily. Practice last year question papers of Neet, Aiims, Jipmer, and other pre medical entrance exams, for better preparations. Be confident in your studies. Take care of yourself and your Health . Get proper guidance from teacher and elders. Be in studious friend circle. Be up to date. Control your emotions, tension,stress, feelings properly. Don't get involve in friends's scandal. You should set study as your first priority than anything else. During board exams study for them and try to score at least more than 55% in PCB group so that you can be eligible for Neet-UG. Take your every exam seriously like your NEET exam, whether it is board papers or practice papers. Try to keep balance on theory and objective both. Study at least 8 to 10hrs daily. Revise every day what you studied on that day and yesterday. Maintain your progress, don't be degrade, make sure that you are improving, keep balance in study of every subject whether it is physics, Chemistry or Biology. Keep consistency in your studies and progress. ",
            "date": "Answered June 11, 2019",
            "views": "18",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Mohan Panjwani",
                    "user_href": "/profile/Mohan-Panjwani-1"
                },
                {
                    "user_id": "Rahul Sharma",
                    "user_href": "/profile/Rahul-Sharma-11133"
                },
                {
                    "user_id": "Garv Giri",
                    "user_href": "/profile/Garv-Giri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nishima Sharma",
                "href": "/profile/Nishima-Sharma-4"
            },
            "answer_text": "You have ample of time for NEET 2021. You must go through all the books of physics, especially, NCERT. NCERT is the Bible of all the three subjects, Physics, chemistry and Biology. Physics is really one of a difficult subject in NEET, The Strategical Preparation for Physics for NEET 2021 is given below :- Firstly, Read the NCERT number of times and make notes simultaneously. Secondly, After NCERT, Solve H.C. Verma for stronger base. Thirdly, Take pen and paper and write it down all the formulas on paper and stick it to your walls, wardrobe, on back of mirror…etc. Revise it, before starting any new topic or chapter. Fourth, Practice the numericals thoroughly, For practicing, you can go with :- Objective Physics NCERT Gear Up. It’s a good for practicing numericals and you find many miscellaneous questions for practice. Apply formula in numerical and practice it continuously. It’s an easiest way to learn, memorize and understand the formulas. Fifth, Practice past year papers and Attempt Mock Tests thoroughly and sincerely. Lastly, Practice , Practice and More Practice, only way to fight from the fear of Physics. Hope it Helps ! ",
            "date": "Answered December 16, 2019",
            "views": "13",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Abhinav Jha",
                    "user_href": "/profile/Abhinav-Jha-133"
                },
                {
                    "user_id": "Ravindra Singh",
                    "user_href": "/profile/Ravindra-Singh-2370"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pratyay",
                "href": "/profile/Pratyay-10"
            },
            "answer_text": "Making a Study time table is not the only point , you need to make a study timetable that you can follow . A timetable should include not only the time for which you study but it should also include other activities that you are going to follow throughout the day . Some points that may help you : You timetable should be achievable , do not make absurd timetable . It should contain targets that you can achieve daily .Try to divide the timetable in many parts and assign them to different subjects based on the time needed for them .Nourish A5 Size Daily Planner - These diaries are very helpful in making a timetable and it will keep you organised .Keep variety in your routine . Keep changing the sequence in your timetable for the different subjects .Lastly follow it with full dedication and regularity . Make a timetable that suites you .Best of Luck ",
            "date": "Answered June 29, 2019",
            "views": "14",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Sujatha Kamalanathan",
                    "user_href": "/profile/Sujatha-Kamalanathan-2"
                },
                {
                    "user_id": "Elif",
                    "user_href": "/profile/Elif-110"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gargi Jha",
                "href": "/profile/Gargi-Jha-17"
            },
            "answer_text": "I think I can answer well this question.First of all if you are sincerely aspiring to get into a medical college you should have a good command on ncert books be it chemistry or biology because I know bio students are not generally good with physics but that is the point where you will gain a upper hand over others. In neet exams, physics questions which are asked belongs to the basic level .If you could have all those formulas summarised and can solve the very basics,you will surely get good marks. One thing you should never skip is your test series ,I would recommend akash or allen test series because you will be able to measure where you stand among other aspirants.Apart from this,the number of students in enrollment into these institute is high. So your performance measurement will be more precise.Test yourself regularly,and never ever leave ncert books. If you want to do something extra,just go through the packages once and try to solve exercise.The questions are related so many times that you will start seeing the answers through it.solve 5 years neet question which will help you further. It will be more than enough for you to gain good marks in neet.wishing you all the best. Thankyou! ",
            "date": "Answered June 21, 2020",
            "views": "508",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Siddappa S Lamani",
                    "user_href": "/profile/Siddappa-S-Lamani"
                },
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Mayank Kashyap",
                    "user_href": "/profile/Mayank-Kashyap-73"
                },
                {
                    "user_id": "Pritam Paul",
                    "user_href": "/profile/Pritam-Paul-238"
                },
                {
                    "user_id": "Ajay Mohan",
                    "user_href": "/profile/Ajay-Mohan-22"
                },
                {
                    "user_id": "Kaberi Sahoo",
                    "user_href": "/profile/Kaberi-Sahoo-6"
                },
                {
                    "user_id": "Riya",
                    "user_href": "/profile/Riya-890"
                },
                {
                    "user_id": "Kishore Reddy",
                    "user_href": "/profile/Kishore-Reddy-49"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sakshi Kusum",
                "href": "/profile/Sakshi-Kusum"
            },
            "answer_text": "For beginners you must be knowing that NEET exam is held every year for the admission into the prestigious medical colleges of the country. The exam is out of 720 marks which is mainly divided into Three main subjects i.e. Biology( which is further divided into Botany and Zoology ),Physics and Chemistry. If you are looking for the best way to start preparation for NEET I would suggest that you should enroll in an online course that prepares students for NEET examination. The popular online courses available are Etoos, byju’s, Kaysons. Speaking from my experience I believe that Kaysons is one of the best online course for NEET preparation because: Kaysons boast of one of the best faculties that facilitate good learning. They explain everything beautifully in their videos. Kaysons provide you with Doubt removal sessions where students can have one to one interaction with the faculty to remove their doubts.They can also ask the faculty to explain whatever concept they have not understood . Kaysons provides students with the study material that is very easy to understand and which is very good for revision as well if you read it well there also practice problems which will help you in your concept building and applications. They also conduct mock tests where students can check their preparation locally and also all over the nation among various students preparing for the same exam. Apart from all this I believe that student preparation also matters a lot. Therefore along with a good online course a student must work hard, complete his/her portions and have through revision to get a very good score in NEET exam. ",
            "date": "Answered April 1, 2020",
            "views": "495",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anil Thomas",
                "href": "/profile/Anil-Thomas-6"
            },
            "answer_text": "Practice, Practice & More Practice It is impossible to study properly by just reading and listening. To study you have to roll up your sleeves and actually solve some problems. The more you practice answering problems, the better. 2. Review Errors When you’re practising with these problems, it’s important to work through the process for each solution. If you have made any mistakes, you should review them and understand where your problem-solving skills let you down. 3. Master the Key Concepts Do not try to memorise the processes. This is counter-productive. It is much better and rewarding in the long-run to focus on understanding the process and logic that is involved. 4. Understand your Doubts Sometimes you can get stuck trying to solve part of a maths problem and find it difficult to move on to the next stage. It’s common for many students to skip this question and continue on to the next. ",
            "date": "Answered July 31, 2019",
            "views": "12",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Janitha Kalaiselvan",
                    "user_href": "/profile/Janitha-Kalaiselvan"
                },
                {
                    "user_id": "Chahat",
                    "user_href": "/profile/Chahat-29"
                },
                {
                    "user_id": "Divya Pathak",
                    "user_href": "/profile/Divya-Pathak-63"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laxmi Kesarwani",
                "href": "/profile/Laxmi-Kesarwani"
            },
            "answer_text": "Start with buying modules of a well known coaching institute. Check the chart of marks distribution of various chapters. Take guidance of linkage between various chapters(for interdependence because though you will study according to the marks distribution among various chapters but you will have to study all…except few chapters ) and study from basic level chapter to higher level chapter . Read NCERT after reading modules . Similarly for physics and chemistry too. Your target initially must be to cover Syllabus and not leave any stone unturned until January. And then move to Just revision and test. Forget about studying any new chapter and just revision and study , chapter wise , segment wise, module wise, subject wise… then finally complete syllabus. (You can check my other answers about preparation in which I have discussed about prevention tips.) ",
            "date": "Answered September 19, 2020",
            "views": "424",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amit Kishore",
                    "user_href": "/profile/Amit-Kishore-30"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vaibhav Anjana (ವೈಭವ ಕ)",
                "href": "/profile/Vaibhav-Anjana-ವೈಭವ-ಕ"
            },
            "answer_text": "You are going to attempt in 2021 You have nearly 20–21 months to prepare Divide your preparation strategy into three parts BasicsNCERTReferenceBASICS: during this period ,with the help of YouTube understand all the basics and solve problems related to those basic topics NCERT:Read NCERTs of both standard and try to understand those topics which are important wrt to NEET and repeatedly asked in exams.you can get free mock tests of biology in Neelabokare mams YouTube channel .I also prepared from those video's . Analyse PYQs ant try to figure out the patternReference: Use these books only for Extra knowledge and solving questions because the question provided in NCERTS are not sufficient.If your are not able to buy just download those books for some NEET preparation websites. But after completing NCERTS you must do revisions of topics related to theory's and reactions ,these are lit bit different from problematic solutions. And My personal experience Don't waste time and keep a separeate time for you board studies , you are regular you have a lot of stress to perform well in boards also I hope this answer will help you All the best … ",
            "date": "Answered July 21, 2019",
            "views": "702",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Indranil Bar",
                    "user_href": "/profile/Indranil-Bar-1"
                },
                {
                    "user_id": "Abhishek Parpala",
                    "user_href": "/profile/Abhishek-Parpala"
                },
                {
                    "user_id": "Gaayathri",
                    "user_href": "/profile/Gaayathri-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Atharva Aggarwal",
                "href": "/profile/Atharva-Aggarwal-4"
            },
            "answer_text": "• Read all 6 NCERT’s (4 of chemistry and 2 of biology) rigorously , do not miss a single point, and there is no need to rush behind more stuff as at the end 135 of chemistry and biology will be from NCERT. • For physics too read NCERT , but only important theoretical points. • Solve more and more papers, regularly • Try to complete syllabus till March mid, so that you can solve a lot of mock test after that All the best ",
            "date": "Answered October 14, 2020",
            "views": "51",
            "upvotes": " View 80 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anamika Dalabehera",
                    "user_href": "/profile/Anamika-Dalabehera"
                },
                {
                    "user_id": "Ritul Pargaie",
                    "user_href": "/profile/Ritul-Pargaie-14"
                },
                {
                    "user_id": "Shantanu Pradhan",
                    "user_href": "/profile/Shantanu-Pradhan-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sagar Suman",
                "href": "/profile/Sagar-Suman-109"
            },
            "answer_text": "If you have not started don't be late start preparing and for the competitive exam you should join coaching because offline coaching is closed you should join online coaching join unacadmy plus which is the Indians largest online learning platform to prepare for competitive exams take subscription of a year and enrolled in the courses there you can study from grat teachers such Amit Gupta sir, DC Pandey sir and Prateek Jain sir unacadmy gives you the freedom to choose your own teachers Here’s the way to avail maximum discount on Unacademy Plus : You’ll get an instant 10% discount by using this codeIf you're new to Unacademy (haven't subscribed before) then simply subscribe to your course using the same code PLUS77W15So start your #LETSCRACKIT journey. ",
            "date": "Answered June 20, 2020",
            "views": "395",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Manasa",
                    "user_href": "/profile/Manasa-359"
                },
                {
                    "user_id": "Vishwash Rukwal",
                    "user_href": "/profile/Vishwash-Rukwal-1"
                },
                {
                    "user_id": "Saurabh",
                    "user_href": "/profile/Saurabh-956"
                },
                {
                    "user_id": "Sindhu Jaiswal",
                    "user_href": "/profile/Sindhu-Jaiswal-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tanya",
                "href": "/profile/Tanya-1015"
            },
            "answer_text": "I don't know if this will help, but as physics had been my favourite during neet prep, I'll tell you a few things which I did- Try completing a chapter in one go, you mustn't go like doing one or two formulas and then solving questions on them. Variations help. As you are going for 2021, you have plenty of time to try and make mistakes. So pick up different question banks and give *time. If you have problems on how to approach new questions type, do 2 things: go for basic formulas and practice alot*. (Ps: basic formulas are F=ma😉) Every chapter has some basic formulas nd then the derived ones, atleast go through *how* they are derived. When you r stuck they help. Practice on your speed as well, (ps: I was able to finish bio and chem so fast tht i had plenty of tym for physics, to the level tht I derived some formulas during final xam) Be strategic, even if you don't understand any category of questions till your xam time, see to it that you have copied some formulas in your mind. Good luck✌🏻 ",
            "date": "Answered April 25, 2020",
            "views": "469",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yumngam Doke",
                    "user_href": "/profile/Yumngam-Doke"
                },
                {
                    "user_id": "Rhythm Singh",
                    "user_href": "/profile/Rhythm-Singh-33"
                },
                {
                    "user_id": "Srimantan Mitra",
                    "user_href": "/profile/Srimantan-Mitra-1"
                },
                {
                    "user_id": "Ruhani Singh",
                    "user_href": "/profile/Ruhani-Singh-13"
                },
                {
                    "user_id": "Ghuru Balasubramanian",
                    "user_href": "/profile/Ghuru-Balasubramanian"
                },
                {
                    "user_id": "Lucy Bandela",
                    "user_href": "/profile/Lucy-Bandela-2"
                },
                {
                    "user_id": "Riya Roshe",
                    "user_href": "/profile/Riya-Roshe"
                },
                {
                    "user_id": "Bharghav Atri",
                    "user_href": "/profile/Bharghav-Atri"
                },
                {
                    "user_id": "Soumya",
                    "user_href": "/profile/Soumya-560"
                },
                {
                    "user_id": "Palak Tiwari",
                    "user_href": "/profile/Palak-Tiwari-29"
                },
                {
                    "user_id": "Shalini Sahu",
                    "user_href": "/profile/Shalini-Sahu-28"
                },
                {
                    "user_id": "Aruthra Murughan",
                    "user_href": "/profile/Aruthra-Murughan-1"
                },
                {
                    "user_id": "Dhanush",
                    "user_href": "/profile/Dhanush-88"
                },
                {
                    "user_id": "Pramit Bhowmik",
                    "user_href": "/profile/Pramit-Bhowmik"
                },
                {
                    "user_id": "Chaistha Goyal",
                    "user_href": "/profile/Chaistha-Goyal"
                },
                {
                    "user_id": "Sanjana",
                    "user_href": "/profile/Sanjana-723"
                },
                {
                    "user_id": "Anjali Rawat",
                    "user_href": "/profile/Anjali-Rawat-539"
                },
                {
                    "user_id": "Sumitra Tiwari",
                    "user_href": "/profile/Sumitra-Tiwari-12"
                },
                {
                    "user_id": "Afreen Ara",
                    "user_href": "/profile/Afreen-Ara-4"
                },
                {
                    "user_id": "Shivi Pandey",
                    "user_href": "/profile/Shivi-Pandey-47"
                },
                {
                    "user_id": "Lakhan Bansal",
                    "user_href": "/profile/Lakhan-Bansal-6"
                },
                {
                    "user_id": "Akshansh Kumar",
                    "user_href": "/profile/Akshansh-Kumar-38"
                },
                {
                    "user_id": "Sivani Sajan",
                    "user_href": "/profile/Sivani-Sajan"
                },
                {
                    "user_id": "Anumay Singh Bhandari",
                    "user_href": "/profile/Anumay-Singh-Bhandari"
                },
                {
                    "user_id": "Jeetu Rao",
                    "user_href": "/profile/Jeetu-Rao-1"
                },
                {
                    "user_id": "Kamesh Singla",
                    "user_href": "/profile/Kamesh-Singla-1"
                },
                {
                    "user_id": "Nikita Sharma",
                    "user_href": "/profile/Nikita-Sharma-2079"
                },
                {
                    "user_id": "Samg",
                    "user_href": "/profile/Samg-6"
                },
                {
                    "user_id": "Priya",
                    "user_href": "/profile/Priya-3518"
                },
                {
                    "user_id": "Dolly Mahadule",
                    "user_href": "/profile/Dolly-Mahadule"
                },
                {
                    "user_id": "Nakul Rawal",
                    "user_href": "/profile/Nakul-Rawal-1"
                },
                {
                    "user_id": "Karan Upadhyay",
                    "user_href": "/profile/Karan-Upadhyay-42"
                },
                {
                    "user_id": "Sonam",
                    "user_href": "/profile/Sonam-419"
                },
                {
                    "user_id": "Pritikona Roy",
                    "user_href": "/profile/Pritikona-Roy"
                },
                {
                    "user_id": "Vanshita Dorkar",
                    "user_href": "/profile/Vanshita-Dorkar"
                },
                {
                    "user_id": "Sonali Subhechha",
                    "user_href": "/profile/Sonali-Subhechha"
                },
                {
                    "user_id": "Ashish Anand",
                    "user_href": "/profile/Ashish-Anand-678"
                },
                {
                    "user_id": "Abhishek Singh",
                    "user_href": "/profile/Abhishek-Singh-18120"
                },
                {
                    "user_id": "Amulya Rajan",
                    "user_href": "/profile/Amulya-Rajan-2"
                },
                {
                    "user_id": "Rakesh Ranjan",
                    "user_href": "/profile/Rakesh-Ranjan-1673"
                },
                {
                    "user_id": "Farid",
                    "user_href": "/profile/Farid-131"
                },
                {
                    "user_id": "Abhay kirti Shukla",
                    "user_href": "/profile/Abhay-kirti-Shukla"
                },
                {
                    "user_id": "Ashish Kadam",
                    "user_href": "/profile/Ashish-Kadam-210"
                },
                {
                    "user_id": "Aryan Patel",
                    "user_href": "/profile/Aryan-Patel-756"
                },
                {
                    "user_id": "Mohammad Faisal محممد فیصل",
                    "user_href": "/profile/Mohammad-Faisal-محممد-فیصل"
                },
                {
                    "user_id": "Tehreem Shaikh",
                    "user_href": "/profile/Tehreem-Shaikh-7"
                },
                {
                    "user_id": "Anamika Dalabehera",
                    "user_href": "/profile/Anamika-Dalabehera"
                },
                {
                    "user_id": "Manisha Chaudhary",
                    "user_href": "/profile/Manisha-Chaudhary-72"
                },
                {
                    "user_id": "Manda Kedare",
                    "user_href": "/profile/Manda-Kedare-2"
                },
                {
                    "user_id": "Shreyashi Koar",
                    "user_href": "/profile/Shreyashi-Koar"
                },
                {
                    "user_id": "Jenny Maheshwari",
                    "user_href": "/profile/Jenny-Maheshwari"
                },
                {
                    "user_id": "Lavanya Kriti",
                    "user_href": "/profile/Lavanya-Kriti-1"
                },
                {
                    "user_id": "Shifa.",
                    "user_href": "/profile/Shifa-106"
                },
                {
                    "user_id": "Ankitprince",
                    "user_href": "/profile/Ankitprince"
                },
                {
                    "user_id": "Ritul Pargaie",
                    "user_href": "/profile/Ritul-Pargaie-14"
                },
                {
                    "user_id": "Soniya",
                    "user_href": "/profile/Soniya-244"
                },
                {
                    "user_id": "Fawaz Shaikh",
                    "user_href": "/profile/Fawaz-Shaikh-7"
                },
                {
                    "user_id": "Priyanshu Soni",
                    "user_href": "/profile/Priyanshu-Soni-36"
                },
                {
                    "user_id": "Aryan Singh",
                    "user_href": "/profile/Aryan-Singh-1328"
                },
                {
                    "user_id": "Aryash D",
                    "user_href": "/profile/Aryash-D"
                },
                {
                    "user_id": "Kiran Khuntia",
                    "user_href": "/profile/Kiran-Khuntia-6"
                },
                {
                    "user_id": "Sudhanshu Rayamajhi",
                    "user_href": "/profile/Sudhanshu-Rayamajhi"
                },
                {
                    "user_id": "Aravind Anand Kumar",
                    "user_href": "/profile/Aravind-Anand-Kumar"
                },
                {
                    "user_id": "Divya Yejre",
                    "user_href": "/profile/Divya-Yejre"
                },
                {
                    "user_id": "Harini Sri",
                    "user_href": "/profile/Harini-Sri-13"
                },
                {
                    "user_id": "Anugya Singh",
                    "user_href": "/profile/Anugya-Singh-11"
                },
                {
                    "user_id": "Samarth Patil",
                    "user_href": "/profile/Samarth-Patil-8"
                },
                {
                    "user_id": "Aditya Chandra Vaibhav",
                    "user_href": "/profile/Aditya-Chandra-Vaibhav"
                },
                {
                    "user_id": "Sanchiti Tripathi",
                    "user_href": "/profile/Sanchiti-Tripathi"
                },
                {
                    "user_id": "Anil Singh",
                    "user_href": "/profile/Anil-Singh-2319"
                },
                {
                    "user_id": "Preet Singh",
                    "user_href": "/profile/Preet-Singh-768"
                },
                {
                    "user_id": "Ankit Bishnoi",
                    "user_href": "/profile/Ankit-Bishnoi-95"
                },
                {
                    "user_id": "Shravani Pednekar",
                    "user_href": "/profile/Shravani-Pednekar-1"
                },
                {
                    "user_id": "Krishna Mishra",
                    "user_href": "/profile/Krishna-Mishra-222"
                },
                {
                    "user_id": "Shilpy Chaudhary",
                    "user_href": "/profile/Shilpy-Chaudhary-5"
                },
                {
                    "user_id": "Mohit Soni",
                    "user_href": "/profile/Mohit-Soni-662"
                },
                {
                    "user_id": "Harsha Shekhar",
                    "user_href": "/profile/Harsha-Shekhar-2"
                },
                {
                    "user_id": "Abhiuday Singh",
                    "user_href": "/profile/Abhiuday-Singh-9"
                },
                {
                    "user_id": "Aarya Sahani (आर्य साहानी)",
                    "user_href": "/profile/Aarya-Sahani-आर्य-साहानी"
                },
                {
                    "user_id": "Mukul Dadheech",
                    "user_href": "/profile/Mukul-Dadheech"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neha K.M",
                "href": "/profile/Neha-K-M-2"
            },
            "answer_text": "Hi, so before reading this answer ask yourself this question that can you crack NEET 2021. If you are a repeater then question yourself twice that can you?? Stop listening to what people and others say. I am a repeater , I wrote NEET in 2019 and 2020 I couldnt secure a seat inspite of working very hard. . . It’s all in you that whether you can do it or not. If you are totally positive now then also think twice because you might lose the spirit in the race. So think and act. If you are a fresher then all the very best you give your best and go for it. You can do it. ",
            "date": "Answered October 10, 2020",
            "views": "167",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dekho Funny Cruze",
                    "user_href": "/profile/Dekho-Funny-Cruze"
                },
                {
                    "user_id": "Dreamerᕦ( ͡° ͜ʖ ͡°)ᕤ",
                    "user_href": "/profile/Dreamerᕦ-͡-͜ʖ-͡-ᕤ"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajiv Vijay",
                "href": "/profile/Rajiv-Vijay-5"
            },
            "answer_text": "Following should be proper strategies. Make proper weekly timetable.Decide fixed material that you want to complete.Like: Physics: cengage book + NCERT textbook ; chemistry: textbook + P Bahadur; Biology: NCERT textbook + Pearson Objective Biology.If you can learn by own don’t join any institute.If you can’t be regular for your self . Join online portal . Best one is VizyyVizyy (Hai Easy) - Australia 17 Cosmos Street Glenroy 3046 Victoria, Australia Vizyy (Hai Easy) - Banglore H402, Jalhalli west, shettyhalli, Bangalore 560015 Vizyy (Hai Easy) - Kerela 2nd Floor, Shamees Building, Hospital Lane, Near  W & C Hospital, Thycaud,\r\n                                        Thiruvananthpuram, Kerala 695014 1E3, IIIrd floor, Saniya plaza, near K S R T C bus stand, Kochi - 682035http://vizyy.com  if you want.Be positive.",
            "date": "Answered July 11, 2020",
            "views": "77",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akshit Gupta",
                    "user_href": "/profile/Akshit-Gupta-351"
                },
                {
                    "user_id": "Tanya Singh",
                    "user_href": "/profile/Tanya-Singh-686"
                },
                {
                    "user_id": "Nidhi Tyagi",
                    "user_href": "/profile/Nidhi-Tyagi-107"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lalit",
                "href": "/profile/Lalit-76"
            },
            "answer_text": "Study properly for 10th boards. You can try other scholarship exams if you want (NTSE,KVPY etc) or you can enjoy your schooling till board exams. 11th and 12th, two years are more than enough for preparations, if you can work hard. Even if someone study for pmts in 9th 10th, I don't think it's easy to retain the syllabus for 3–4 long years and personally I would advise against handling such pressure at 13-14 years of age, enjoy your childhood and wait for 11th. ",
            "date": "Answered February 1, 2019",
            "views": "58",
            "upvotes": " View 68 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sk Mukhita",
                    "user_href": "/profile/Sk-Mukhita"
                },
                {
                    "user_id": "Spandan Bhattacharjee",
                    "user_href": "/profile/Spandan-Bhattacharjee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rosh J",
                "href": "/profile/Rosh-J-4"
            },
            "answer_text": "If u practice u can overcome any challenge… just make targets and hunt them🎯 if you want strategy here it is: Starting with biology - ncert book for 300–330 marks or if you want extra 20–30 marks thejin some extra edge topics you have to do. And practice questions from mtg, pyqs chapter wise,or you can use modules if you have. Physics-start from any video lecture for understanding the chapter. Then refer one reference book can be hcv or dcpandey, then do solved examples first. Then go to unsolved questions. And practice more questions. It is up to you how many ques you have to solve. And specially clear your doubts. And revise important ques. So that you won't miss anything. Chemistry - it can be divided into physical, inorganic& organic .Physical che. It's same as physics.understand the concept & then questions. Inorganic - read ncert. Almost questions are from ncert. Then solve questions. Organic che. - start with iupac,then isomerism, goc.understand with patience. Then rxn mechanism. Then do chapters.Use books like mtg, pyqs to understand the trends, balaji publication books, and refer modules if any. Hope it will help u❣️ Thanku for reading👌❤ ",
            "date": "Answered July 25, 2020",
            "views": "320",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Smily",
                    "user_href": "/profile/Smily-37"
                },
                {
                    "user_id": "Swati Jha",
                    "user_href": "/profile/Swati-Jha-361"
                },
                {
                    "user_id": "Mayank Kashyap",
                    "user_href": "/profile/Mayank-Kashyap-73"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aashish Kumar Rai",
                "href": "/profile/Aashish-Kumar-Rai"
            },
            "answer_text": "First of all set your target that helps you in geeting your dream college then begin your journey. There are lots of online free or low paid platforms who ready to help you in your journey. PHYSICSWALLAH-Alakh Pandey sir launches his own app on which he teaches live and he is one of the top educator on youtube.He charge 999(less than 100rs per month) for his live batch. BIOMENTORS-One of the best channel for neet on youtube.You can join biomentors test series in which you get dpp,mock tests,key notes and many other things. Study Bio NCERT word by word and make your own notes.Also read inorganic chemistry from NCERT. Solve MCQs as many as possible. BEST OF LUCK! ",
            "date": "Answered June 20, 2020",
            "views": "342",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rudra Tewari",
                    "user_href": "/profile/Rudra-Tewari-3"
                },
                {
                    "user_id": "Nandini Yadav",
                    "user_href": "/profile/Nandini-Yadav-100"
                },
                {
                    "user_id": "Nikita Nagpure",
                    "user_href": "/profile/Nikita-Nagpure-1"
                },
                {
                    "user_id": "Karan Singh",
                    "user_href": "/profile/Karan-Singh-3615"
                },
                {
                    "user_id": "Abcd",
                    "user_href": "/profile/Abcd-1045"
                },
                {
                    "user_id": "Shubham Gill",
                    "user_href": "/profile/Shubham-Gill-11"
                },
                {
                    "user_id": "Simmi Harshita",
                    "user_href": "/profile/Simmi-Harshita"
                },
                {
                    "user_id": "Ankita",
                    "user_href": "/profile/Ankita-401"
                },
                {
                    "user_id": "Kristi Das",
                    "user_href": "/profile/Kristi-Das-3"
                },
                {
                    "user_id": "Vanshika",
                    "user_href": "/profile/Vanshika-126"
                },
                {
                    "user_id": "Ashutosh Kumar",
                    "user_href": "/profile/Ashutosh-Kumar-5593"
                },
                {
                    "user_id": "Mathesh",
                    "user_href": "/profile/Mathesh-4"
                },
                {
                    "user_id": "Shruti Gupta",
                    "user_href": "/profile/Shruti-Gupta-1390"
                },
                {
                    "user_id": "Keshav Vatsa",
                    "user_href": "/profile/Keshav-Vatsa"
                },
                {
                    "user_id": "Akatya Singh",
                    "user_href": "/profile/Akatya-Singh-1"
                },
                {
                    "user_id": "Priyadarshini Patnaik",
                    "user_href": "/profile/Priyadarshini-Patnaik-2"
                },
                {
                    "user_id": "Kaustubh Sonar",
                    "user_href": "/profile/Kaustubh-Sonar"
                },
                {
                    "user_id": "Pratik Rayghol",
                    "user_href": "/profile/Pratik-Rayghol-1"
                },
                {
                    "user_id": "Pakhee Sinha",
                    "user_href": "/profile/Pakhee-Sinha"
                },
                {
                    "user_id": "Ayaan Kashyap",
                    "user_href": "/profile/Ayaan-Kashyap-3"
                },
                {
                    "user_id": "Namit Gupta",
                    "user_href": "/profile/Namit-Gupta-78"
                },
                {
                    "user_id": "Dave Si",
                    "user_href": "/profile/Dave-Si-3"
                },
                {
                    "user_id": "Pratap Siddhu",
                    "user_href": "/profile/Pratap-Siddhu-1"
                },
                {
                    "user_id": "Pallavi Mandal",
                    "user_href": "/profile/Pallavi-Mandal-6"
                },
                {
                    "user_id": "Sudip Chaudhuri",
                    "user_href": "/profile/Sudip-Chaudhuri-4"
                },
                {
                    "user_id": "Ashish Kumar Jha",
                    "user_href": "/profile/Ashish-Kumar-Jha-140"
                },
                {
                    "user_id": "Vishnu Kulkarni",
                    "user_href": "/profile/Vishnu-Kulkarni-15"
                },
                {
                    "user_id": "Bipasha Das",
                    "user_href": "/profile/Bipasha-Das-43"
                },
                {
                    "user_id": "Sevya",
                    "user_href": "/profile/Sevya"
                },
                {
                    "user_id": "Pragati Ahlawat",
                    "user_href": "/profile/Pragati-Ahlawat-1"
                },
                {
                    "user_id": "Gunjan Jha",
                    "user_href": "/profile/Gunjan-Jha-25"
                },
                {
                    "user_id": "Rubbaiya Sultana",
                    "user_href": "/profile/Rubbaiya-Sultana"
                },
                {
                    "user_id": "Dev",
                    "user_href": "/profile/Dev-693"
                },
                {
                    "user_id": "Aman Raj",
                    "user_href": "/profile/Aman-Raj-515"
                },
                {
                    "user_id": "Atul Saraswat",
                    "user_href": "/profile/Atul-Saraswat-20"
                },
                {
                    "user_id": "Satwik",
                    "user_href": "/profile/Satwik-13"
                },
                {
                    "user_id": "Ahmed Sahib Rassel",
                    "user_href": "/profile/Ahmed-Sahib-Rassel"
                },
                {
                    "user_id": "Tanmay Sai Prakash",
                    "user_href": "/profile/Tanmay-Sai-Prakash"
                },
                {
                    "user_id": "Viru Dhvra",
                    "user_href": "/profile/Viru-Dhvra"
                },
                {
                    "user_id": "Aparna Vinod Pillai",
                    "user_href": "/profile/Aparna-Vinod-Pillai"
                },
                {
                    "user_id": "Nidhi JHA",
                    "user_href": "/profile/Nidhi-JHA-195"
                },
                {
                    "user_id": "Nidhi Budhwar",
                    "user_href": "/profile/Nidhi-Budhwar"
                },
                {
                    "user_id": "Hansika Singh",
                    "user_href": "/profile/Hansika-Singh-13"
                },
                {
                    "user_id": "Rohan Padia",
                    "user_href": "/profile/Rohan-Padia-1"
                },
                {
                    "user_id": "Aditi Sharma",
                    "user_href": "/profile/Aditi-Sharma-1760"
                },
                {
                    "user_id": "Akshita Tiwari",
                    "user_href": "/profile/Akshita-Tiwari-7"
                },
                {
                    "user_id": "Sourav Pal",
                    "user_href": "/profile/Sourav-Pal-119"
                },
                {
                    "user_id": "Divyanshi Sethi",
                    "user_href": "/profile/Divyanshi-Sethi-1"
                },
                {
                    "user_id": "Shivam Chauhan",
                    "user_href": "/profile/Shivam-Chauhan-379"
                },
                {
                    "user_id": "Nehanjali Soni",
                    "user_href": "/profile/Nehanjali-Soni-2"
                },
                {
                    "user_id": "Sachin Kumar",
                    "user_href": "/profile/Sachin-Kumar-5776"
                },
                {
                    "user_id": "MADHUSMITA Sethi",
                    "user_href": "/profile/MADHUSMITA-Sethi-9"
                },
                {
                    "user_id": "Kapil Sharma",
                    "user_href": "/profile/Kapil-Sharma-857"
                },
                {
                    "user_id": "Soumya Mishra",
                    "user_href": "/profile/Soumya-Mishra-94"
                },
                {
                    "user_id": "Prithika Srivastava",
                    "user_href": "/profile/Prithika-Srivastava"
                },
                {
                    "user_id": "Aasim",
                    "user_href": "/profile/Aasim-20"
                },
                {
                    "user_id": "Harsh Raj",
                    "user_href": "/profile/Harsh-Raj-724"
                },
                {
                    "user_id": "Amulya Gupta",
                    "user_href": "/profile/Amulya-Gupta-21"
                },
                {
                    "user_id": "Palak Tiwari",
                    "user_href": "/profile/Palak-Tiwari-29"
                },
                {
                    "user_id": "Sindhu Jaiswal",
                    "user_href": "/profile/Sindhu-Jaiswal-1"
                },
                {
                    "user_id": "Ranjita Ach",
                    "user_href": "/profile/Ranjita-Ach"
                },
                {
                    "user_id": "Pranjali Pandey",
                    "user_href": "/profile/Pranjali-Pandey-17"
                },
                {
                    "user_id": "Saiyeed Muhammed Tahmeed",
                    "user_href": "/profile/Saiyeed-Muhammed-Tahmeed"
                },
                {
                    "user_id": "Saraswati",
                    "user_href": "/profile/Saraswati-31"
                },
                {
                    "user_id": "Prinayana Sarma",
                    "user_href": "/profile/Prinayana-Sarma"
                },
                {
                    "user_id": "Ravinder Sihag",
                    "user_href": "/profile/Ravinder-Sihag"
                },
                {
                    "user_id": "Mrinalini Nair",
                    "user_href": "/profile/Mrinalini-Nair-3"
                },
                {
                    "user_id": "Aditya Singh",
                    "user_href": "/profile/Aditya-Singh-2971"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vivek K Mall",
                "href": "/profile/Vivek-K-Mall-2"
            },
            "answer_text": "Hiii…hope you are fine!!!! Vivek K Mall's answer to Today is my test of 720 marks. I prepare it from my whole heart but I scored only 397 and now I am feeling very demotivated. What and how should I do now to stay motivated for the NEET 2021? Vivek K Mall's answer to I wanna get 70% in Inter and Crack NEET with 630+? in Self study for NEET You can check the above link too…I guess it wud help you… Just remember it's never too late to start…u need to be dedicated towards your work . Neet is a game of nerves besides your study…so be calm…work hard..study smartly… I HAVE PINNED SOME ANSWERS IN MY PROFILE..I SUGGEST YOU TO CHECK THEM…EVEN AFTER THAT..IF YOU HAVE QUERIES…ASK THEM..I WUD TRY TO ANSWER.. U WUD DEFINITELY GET THROUGH WITH GOOD RANK ..BE POSITIVE GOOD LUCK… ",
            "date": "Answered June 20, 2020",
            "views": "423",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Neeraj Awagan",
                    "user_href": "/profile/Neeraj-Awagan"
                },
                {
                    "user_id": "Pratibha Verma",
                    "user_href": "/profile/Pratibha-Verma-304"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ayush Shubhankar",
                "href": "/profile/Ayush-Shubhankar-1"
            },
            "answer_text": "Great to see you being so sincere and focused about your studies. Since you are in class 10, then you may start by studying physics of higher classes. Medical aspirants mainly find difficulty in the physics portion. You may buy any reference book such as of Pradeep publication. This would help you in keeping your basics right. If you find time, then study periodic table chapter from ncert class 11- this would be helpful both in your board exams as well as in NEET preparation. Similarly, finish one chapter of class 10 and move on to the related chapter of class 11 or 12. The same strategy should be followed for biology as well. Preparing early would definitely provide you and edge over others. Hope it helps!!! ",
            "date": "Answered January 17, 2019",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dreamerᕦ( ͡° ͜ʖ ͡°)ᕤ",
                    "user_href": "/profile/Dreamerᕦ-͡-͜ʖ-͡-ᕤ"
                }
            ]
        },
        {
            "author_info": {
                "name": "Annie D'Souza",
                "href": "/profile/Annie-DSouza-16"
            },
            "answer_text": "The most important thing before starting preparing for this exam is to be absolutely clear about the exam syllabus, it’s paper structure, and what exactly are the topics the paper touches most frequently. All of this we will give a fair idea about your level of preparation before actually even starting preparing for this. This will also give a fair direction to start with. Since most of the questions asked in this paper are from NCERT Textbooks of classes 11 & 12, you must start with them. I understand that sometimes NCERT Books are not sufficient to get a clear understanding of concepts, for that you may refer some reference books. After getting the concept right, it is now time to put them into practice. This moment calls for some rigorous practice of questions of varying difficulty levels. For this, I would recommend you to go for Oswaal NEET Question Banks. They have a very good compilation of question of AIPMT & NEET from last the 33 years. Moreover, they have 2020 NEET paper fully solved attached in the book. Solving this book will introduce you to various types of questions that the NEET has been asking since so many years. I think the amalgamation of strong concepts and sufficient practice will help you ace the exam. Hope this helps! ",
            "date": "Answered October 24, 2020",
            "views": "199",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nishit Amin",
                "href": "/profile/Nishit-Amin-7"
            },
            "answer_text": "NCERT is the most important weapon to crack NEET in NCERT we can get all things- basics for the preparation all concepts very clearly and with that also we can refer objectives and problems (in physics) Now if we talk about any other reference then please follow this particular book PHYSICS CONCEPT OF PHYSICS by HC VERMA vol-1 and vol-2Objectives NCERT for NEET by MTGCHEMISTRY New pattern chemistry by RK GUPTAO.P.TANDAN for all three different chemistry (Organic, inorganic, physical)NCERT objectives by MTGBIOLOGY TRUEMAN’S Elementary Biology vol-1 and vol-2NCERT objectives by MTGThese books help you to prepare for NEET exam All the best 👍 ",
            "date": "Answered July 3, 2020",
            "views": "220",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pranav",
                "href": "/profile/Pranav-469"
            },
            "answer_text": "First of all you have enough time to Prepare just a little bit of consistency and dedication would be required. I will suggest you to have a study plan dividing into 5–2 months .Complete your whole syllabus in 5 months and do Full revision and practice as much Mock test to get a Good Grasp at Concepts Biology : NCERT + Modules Chemistry: Inorganic For NCERT +Modules Physics: Notes and Practice During Lockdown join any coaching or do self study , Self study is more effective as compared to coaching…..Suit Yourself PEACE✌ ",
            "date": "Answered October 2, 2020",
            "views": "115",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prerna Chauhan",
                    "user_href": "/profile/Prerna-Chauhan-103"
                },
                {
                    "user_id": "Anshul Raj",
                    "user_href": "/profile/Anshul-Raj-47"
                },
                {
                    "user_id": "Dreamerᕦ( ͡° ͜ʖ ͡°)ᕤ",
                    "user_href": "/profile/Dreamerᕦ-͡-͜ʖ-͡-ᕤ"
                }
            ]
        },
        {
            "author_info": {
                "name": "Divyang Tiwari",
                "href": "/profile/Divyang-Tiwari-3"
            },
            "answer_text": "Stick to NCERT very very seriously…Make your own notes instead of depending on modules, videos or digital platforms..Do self study at least 6 hrs daily..ask questions continuously in your coaching..Never never skip any test…After doing this you are going to get best rank only when you discontinue all social media platforms until your goal is achieved.. If you fail to do all these then you must change your Aim…or take options. I guarantee you the success ",
            "date": "Answered September 15, 2020",
            "views": "171",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Viru Dhvra",
                    "user_href": "/profile/Viru-Dhvra"
                },
                {
                    "user_id": "Sourav Pal",
                    "user_href": "/profile/Sourav-Pal-119"
                },
                {
                    "user_id": "Ranjita Ach",
                    "user_href": "/profile/Ranjita-Ach"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ramani Gowda",
                "href": "/profile/Ramani-Gowda"
            },
            "answer_text": "Hi All, I have got an admission in one of the best medical College of India after clearing my NEET in 2019. I would like to share my experience about neet exam preparation and advise for you. I studied at Gate Indian Institute of Tutorials GATEIIT. It's really best coaching centre in India. I have studied at Aakash and Allen too but didn't get personal attention classes which I got only at GATEIIT. I would suggest to join GATEIIT Gate Indian Institute of Tutorials Bangalore online classes. GATEIIT is not only the best in personal attention but also for study material, notes, two times syllabus completion, two times revision, unlimited tests, each faculties individual performance monitoring and many other ",
            "date": "Answered May 9, 2020",
            "views": "294",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shubham",
                "href": "/profile/Shubham-2046"
            },
            "answer_text": "Make a dedication first and give your 100 % till achieve it and your believe and hard works will take you too the 600 + Score. Decide from where to start your coaching now and take the package of a year and start studying from today onwards, it takes lots of dedication, complete guidance in right track towards your goal and then study well with experiences faculties those who are already qualified NEET in their life they guide you in the most effective and efficient way. As i seen the vedantu”s method of teaching and was really amazing and with the previous proven records and their most of the teachers are IIT’s and PHD Scholars.. who can give you the best teaching and it was the more effective than than the physical coaching through WAVE (White board audio video environment ) gives you the real classroom sitting feel in live classes, Vedantu gives you a assistant teacher who can solve your doubts, gives you SAM who can guide you technically, gives you support with education counselor who can motivate you .. and also lots of amazing features.. Call to one of the best Counsellor Samiksha Gupta mam(8272828562) take a first NEET Counselling session solve your all doubts and know each details from her then decide . ",
            "date": "Answered July 28, 2020",
            "views": "292",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Harsh Saxena",
                    "user_href": "/profile/Harsh-Saxena-288"
                },
                {
                    "user_id": "Ritul Pargaie",
                    "user_href": "/profile/Ritul-Pargaie-14"
                },
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                },
                {
                    "user_id": "Sowmi Dasarathan",
                    "user_href": "/profile/Sowmi-Dasarathan"
                },
                {
                    "user_id": "Akanksha Sharma",
                    "user_href": "/profile/Akanksha-Sharma-321"
                }
            ]
        },
        {
            "author_info": {
                "name": "Namrata Deshpande",
                "href": "/profile/Namrata-Deshpande-29"
            },
            "answer_text": "If you have not yet started, you need to start now. Join some good institute, so that you can start following a systematic study plan which includes lectures and tests. In all likelihood, the coaching institute would be covering Std.XII syllabus now. But never mind, you can start with that and make your own plan to cover up the Std.XI topics step by step. You can also ask your teachers to help you do that. Since you will have started late, you will really have to work hard to make up for the lost time. But don’t worry, it is very much doable and you can still crack NEET. ",
            "date": "Answered May 19, 2020",
            "views": "242",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shantanu Pradhan",
                    "user_href": "/profile/Shantanu-Pradhan-10"
                },
                {
                    "user_id": "Golden Hamster",
                    "user_href": "/profile/Golden-Hamster-1"
                },
                {
                    "user_id": "Tejasri",
                    "user_href": "/profile/Tejasri-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priya Sehgal",
                "href": "/profile/Priya-Sehgal-10"
            },
            "answer_text": "✔️ Focus on NCERTs ✔️ Practice many many mock papers ✔️ NCERT is your Bible for inorganic and biology ✔️ Follow 1 source religiously. Don't run too much ✔️ For physics, try to practice 70–80 questions daily… All the best 👍 ",
            "date": "Answered October 14, 2020",
            "views": "262",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yash Dudani",
                    "user_href": "/profile/Yash-Dudani-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Bailey",
                "href": "/profile/Matthew-Bailey-297"
            },
            "answer_text": "YES. You just need resources for it. I recommend you to get any e-learning platform that suits your studying style. I know that Lecturio is very good for NEET, so you can get their platform and use whatever they’ll provide you with. Video lectures are conducted by professors teaching in the world’s leading universities, they’re also divided into section so that you’ll stay concentrated throughout the entire time watching the lecture. I use their Qbank too and I think you’ll find it useful as well, because those questions have clinical correlations and if you’re able to answer them well, you’re basically gonna thrive on NEET! So definitely give a shot to lecturio and similar preparation platforms. You should find something that suits YOU the most, not me or someone else. We’re just here to suggest you things available online. ",
            "date": "Answered December 4, 2019",
            "views": "394",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mukesh Gunasekaran",
                    "user_href": "/profile/Mukesh-Gunasekaran-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aparupa Dey.",
                "href": "/profile/Aparupa-Dey-8"
            },
            "answer_text": "If you belong to general category and scoring below 540, I guess it's going to be tough to get a seat. But if from other categories, u're safe. If you're just on the margin, wait till counselling is done. You might get a seat in 2nd round ;) There's one more point. “Satisfaction”. If you're not satisfied with your marks and have potential to score more next year, then dude what are you waiting for. Its your time, tie your shoes and get set. Every single day counts. Ps; I'm no expert in this, but just sharing what I got to know after a research in this regard. ",
            "date": "Answered September 27, 2020",
            "views": "12",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shreya",
                    "user_href": "/profile/Shreya-1434"
                },
                {
                    "user_id": "Mayank Kashyap",
                    "user_href": "/profile/Mayank-Kashyap-73"
                },
                {
                    "user_id": "Mukul Dadheech",
                    "user_href": "/profile/Mukul-Dadheech"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muskan Gangwar",
                "href": "/profile/Muskan-Gangwar-1"
            },
            "answer_text": "Hello, How one should prepare for it can vary person to person but according to me you should go for online classes rather than wasting your time and money both migrating in coaching classes. You can go for M-Learning India Online classes where you can study all the necessarily important concepts at your fingertips at your own comfort and peace. They provide a well efficient study material which could prepare you in accordance with the toughness of the examination as well as you can test your skills and knowledge by solving the test series and question bank. They also have a YouTube channel which you can use to study important concepts and you can came to know about the methodology used by the teachers. They also have an app available in Google play store M-Learning India Video Streaming app which concludes 11000s of videos. This app is specifically designed to help people like you take the greater advantage of your mobiles. I hope the suggestion works for you. Thank you. Good luck. ",
            "date": "Answered May 13, 2018",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gagana",
                    "user_href": "/profile/Gagana-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harsh Yadav",
                "href": "/profile/Harsh-Yadav-1060"
            },
            "answer_text": "yess,just keep in mind that you have to stay focused throughout the year by without any distraction and focus more in important anf frequently asked topics rather than doing difficult as it weightage is just 5% in neet exam…… remember that hard work is not sufficient to crock neet,side by side you have to do smart work also…. if any query on how to prepare ……just hit me the msg…… thanks….😊😊 ",
            "date": "Answered August 9, 2020",
            "views": "234",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deepesh Rajawat",
                    "user_href": "/profile/Deepesh-Rajawat-2"
                },
                {
                    "user_id": "Mayank Kashyap",
                    "user_href": "/profile/Mayank-Kashyap-73"
                },
                {
                    "user_id": "Rishabh Kr. Shukla",
                    "user_href": "/profile/Rishabh-Kr-Shukla"
                },
                {
                    "user_id": "Ankur Reja",
                    "user_href": "/profile/Ankur-Reja-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Alisha-964"
                },
                {
                    "user_id": "Utkarsh",
                    "user_href": "/profile/Utkarsh-304"
                },
                {
                    "user_id": "Sneha Kumari",
                    "user_href": "/profile/Sneha-Kumari-755"
                },
                {
                    "user_id": "Abhay kirti Shukla",
                    "user_href": "/profile/Abhay-kirti-Shukla"
                },
                {
                    "user_id": "Swati Mandal",
                    "user_href": "/profile/Swati-Mandal-34"
                },
                {
                    "user_id": "Jagdip Madaan",
                    "user_href": "/profile/Jagdip-Madaan"
                },
                {
                    "user_id": "Mrinmoy Bhagawati",
                    "user_href": "/profile/Mrinmoy-Bhagawati-6"
                },
                {
                    "user_id": "Lithun R Gowda",
                    "user_href": "/profile/Lithun-R-Gowda"
                },
                {
                    "user_id": "Bipasha Das",
                    "user_href": "/profile/Bipasha-Das-43"
                },
                {
                    "user_id": "Deeksha Bhattacharyya",
                    "user_href": "/profile/Deeksha-Bhattacharyya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saloni Gupta",
                "href": "/profile/Saloni-Gupta-766"
            },
            "answer_text": "If you are a medical aspirant then NEET is undoubtedly the most important exam for you. Beginning the preparation for NEET 2021 right now gives you sufficient time to be ready for the exam. Complete Preparation Guide for NEET 2021 If you are anxious to prepare for NEET 2021 and want to clear it with a good score, you can follow the strategy given below. 1. Know your syllabus and exam pattern First of all, you must know all about the NEET 2021 exam pattern and its syllabus. An insight into the syllabus and pattern can help you plan your preparation in a better manner. Exam pattern will held by TOPPR ",
            "date": "Answered July 3, 2020",
            "views": "161",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vijay Karnam",
                    "user_href": "/profile/Vijay-Karnam"
                },
                {
                    "user_id": "Priyanka Sharma",
                    "user_href": "/profile/Priyanka-Sharma-2000"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keerthi Vasan",
                "href": "/profile/Keerthi-Vasan-534"
            },
            "answer_text": "There are several approaches for adopting a study method for NEET preparation. Primarily you need to be thorough with your 12th standard Physics, Chemistry and Biology concepts. Apart from this there are textbooks that comes with MCQs that are asked in actual NEET exam. However, I would like to recommend one more approach. There is a new App in the market, where you can register and take NEET challenges. NEET challenges in this App are timed NEET exams, which are taken by many Students on the same day and at the same time. So, you will be getting the feel of a real NEET exam when you take these NEET challenges. You will come to know your score within a short period of time after you submit your NEET challenge. NEET being a competitive exam, it is very important for you to know where you stand in the competition. ",
            "date": "Answered May 22, 2019",
            "views": "795",
            "upvotes": " Answer requested by Shreyas Singh",
            "upvoters": [
                {
                    "user_id": "Prakash",
                    "user_href": "/profile/Prakash-1182"
                },
                {
                    "user_id": "Abhinab Sharma",
                    "user_href": "/profile/Abhinab-Sharma-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samiha Singh",
                "href": "/profile/Samiha-Singh-7"
            },
            "answer_text": "You have a lot of time in hand. Almost a year. You can do wonders provided you make the right amount of efforts. And it can't be like you haven't studied anything at all. You just have to do it in the right direction. Read NCERT line by line for Biology and Chemistry. Watch videos lectures if you haven't enrolled in any coaching for Physics and Chemistry. Start making notes and learning and revising the concepts. Once done with that practice as many MCQs as possible. Appear for grand tests that will give you a true picture of where you stand. Don't give up so soon! Time is always less but our efforts should be adequate to make up for it. ",
            "date": "Answered May 23, 2020",
            "views": "192",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mayank Kashyap",
                    "user_href": "/profile/Mayank-Kashyap-73"
                },
                {
                    "user_id": "Harinee Javaji",
                    "user_href": "/profile/Harinee-Javaji"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saloni Gupta",
                "href": "/profile/Saloni-Gupta-530"
            },
            "answer_text": "Only best books is not enough to do practicing of neet 2021 the most important is best guidance and dedication about your studies and always believe in yourself but after this awards if you read only books so 1dt clear your basic concepts to read 11th and 12th NCERT books . Than if you need good guidance than Toppr_The better learning app provides good guidance to their students. ",
            "date": "Answered June 25, 2020",
            "views": "178",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Akshaya Srinivasan",
                    "user_href": "/profile/Akshaya-Srinivasan-51"
                },
                {
                    "user_id": "Shakti Kumar",
                    "user_href": "/profile/Shakti-Kumar-420"
                },
                {
                    "user_id": "Jais",
                    "user_href": "/profile/Jais-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amit Ranjan",
                "href": "/profile/Amit-Ranjan-535"
            },
            "answer_text": "As you are going to appear for board exams in this session. So you also have to focus on your 12th. So tye best way is to make a separe routine for tye revision of 11th. But be more focused on 12th.All the best👍👍You can follow me on youtube for video lectures and notes of physics.LIVE SESSIONS 12TH (CH-1- Electric charges and field) - YouTube 1 view Upvote Share  Add a comment...  Amit Ranjan, studied at National Institute of Technology, Patna Answered 1h ago ",
            "date": "Answered April 26, 2020",
            "views": "130",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "ClearExam",
                "href": "/profile/ClearExam-1"
            },
            "answer_text": "Start with NCERT. NCERT has everything you will be needing for cracking NEET. I talked about how to like make a timetable and complete the syllabus on tym. Check that out ClearExam's answer to I am a 2021 neet aspirant so can u plssss tell what should be my strategy if I start now and my 11th is also weak and I m doing self study no coaching I m currently in 12th pls suggest some tips to get a seat in AIIMS Delhi? in Self study for NEET   All the best!! Hope it helps!! ",
            "date": "Answered August 2, 2020",
            "views": "289",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Saloni Gupta",
                    "user_href": "/profile/Saloni-Gupta-766"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harsh Rao",
                "href": "/profile/Harsh-Rao-119"
            },
            "answer_text": "Hi All, I can tell you best ways to prepare but almost all are mentioned below in this question. But I will advise you to join One of the Best coaching centre mentioned below. Gate Indian Institute of Tutorials GATEIIT. Aakash Allen Resonance Narayana You can join any of the above mentioned institutes for best results. Regards ",
            "date": "Answered April 6, 2020",
            "views": "190",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Razeen",
                "href": "/profile/Razeen-4"
            },
            "answer_text": "Passing neet doesn't mean anything.If you are aiming for government medical collage you have to work hard.to have a good rank you must score atleast 600 marks then only we can sure about getting seat in a medical collage. For neet 2021 your physics should be very strong as it decides your rank.you should practise from books like dc pandey but should not forget about ncert. As when you look at physics NCERT it contains many IIT level problem which enhances your concept. Biology ncert should be read multiple times.not mere reading will not help you. You should make short notes out of it and palractise many ncert based questions and previous year questions. ",
            "date": "Answered July 26, 2019",
            "views": "526",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mayank Kashyap",
                    "user_href": "/profile/Mayank-Kashyap-73"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishnuvardhan",
                "href": "/profile/Vishnuvardhan-20"
            },
            "answer_text": "Better you join the Coaching centre so that you can get the right guidance with support. Neet exam is tough and getting seat in medical college has lot of competition. Therefore you can join the best ranking Coaching centre in India right now is Gate Indian Institute of Tutorials GATEIIT. GATEIIT has best results, records, study material, test series, facilities, two times syllabus completion, doubt clearing and revision two times makes students to qualify. Best of luck. ",
            "date": "Answered April 6, 2020",
            "views": "351",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mustakim Rahman",
                    "user_href": "/profile/Mustakim-Rahman-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sakshi Mandot",
                "href": "/profile/Sakshi-Mandot-6"
            },
            "answer_text": "Your NEET Preparation journey should start with realizing few points: Set a Goal & Aim for 650+Make an Effective Study Plan.You have to Love Biology – 90 Questions – 360 Marks.Chemistry – 45 Questions – 180 Marks.Physics – 45 Questions – 180 Marks.Solve MCQs, Questions Papers.Hope this answer will helpful for you. Thank You. ",
            "date": "Answered February 8, 2020",
            "views": "147",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ramani Gowda",
                    "user_href": "/profile/Ramani-Gowda"
                },
                {
                    "user_id": "Pratiksha Patil",
                    "user_href": "/profile/Pratiksha-Patil-437"
                },
                {
                    "user_id": "Harsh Rao",
                    "user_href": "/profile/Harsh-Rao-119"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sowmya Gowda",
                "href": "/profile/Sowmya-Gowda-134"
            },
            "answer_text": "If you want to prepare the best than i will advice to join only Gate Indian Institute of Tutorials (GATEIIT). Gate Indian Institute of Tutorials (GATEIIT) has best faculties, tests practices, doubt clearing, study material, classes, ranks and results, personal attention classes, two times syllabus completion, maximum number of hours classes, etc. Best of luck for neet exam preparation. ",
            "date": "Answered April 6, 2020",
            "views": "201",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Janitha Kalaiselvan",
                    "user_href": "/profile/Janitha-Kalaiselvan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rony",
                "href": "/profile/Rony-197"
            },
            "answer_text": "you neet preparation strategy should be such that yu can cover max topics in minimum time. Yu have enough time to make your weak topics your strength. But utmost requirement is consistency and discipline. Best of luck👍🏻 ",
            "date": "Answered July 11, 2020",
            "views": "74",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kumudhwathi C",
                "href": "/profile/Kumudhwathi-C-1"
            },
            "answer_text": "To gain knowledge and to score good marks in NEET , the best book to refer is NCERT. As most of the questions are asked from the NCERT itself, it will be easy to score if we understand the each concepts given in the textbook clearly. For purchasing these NCERT textbooks I use mypustak, which is a online bookstore where we can guy free NCERT textbooks and also we can donate the books to it. #mypustak  ",
            "date": "Answered September 21, 2020",
            "views": "122",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ramani Gowda",
                    "user_href": "/profile/Ramani-Gowda"
                },
                {
                    "user_id": "Pratiksha Patil",
                    "user_href": "/profile/Pratiksha-Patil-437"
                },
                {
                    "user_id": "Priya Malik",
                    "user_href": "/profile/Priya-Malik-56"
                },
                {
                    "user_id": "Harsh Rao",
                    "user_href": "/profile/Harsh-Rao-119"
                },
                {
                    "user_id": "Sonali Ganguli",
                    "user_href": "/profile/Sonali-Ganguli-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prakhar Malik",
                "href": "/profile/Prakhar-Malik-2"
            },
            "answer_text": "There can be 3 ways to do that : offline coaching you can join coaching centre which would help you .online coaching you go for online coaching I can suggest ( Toppr for better learning )self study through (NCERT) the holly book",
            "date": "Answered June 25, 2020",
            "views": "131",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zaheka Ahmad",
                    "user_href": "/profile/Zaheka-Ahmad"
                },
                {
                    "user_id": "Sapna Yadav",
                    "user_href": "/profile/Sapna-Yadav-689"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yalla Habibi",
                "href": "/profile/Yalla-Habibi-9"
            },
            "answer_text": "Me …. I'm preparing for neet 2021 .. How is it going ?🤐 Yeah it's ok ok kind of yeah that's been a lot of pressure in us… And if you are preparing for neet 2021, then then you can been contact with me and also tell me what institute or how you are studying something like that self study?? ",
            "date": "Answered September 29, 2019",
            "views": "245",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Harinee Javaji",
                    "user_href": "/profile/Harinee-Javaji"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rahul Singh Yaduvanshi",
                "href": "/profile/Rahul-Singh-Yaduvanshi-3"
            },
            "answer_text": "How much it's depend on you but if you are average student then you should study Atleast 5–6 hour per day. If you are going to appear in neet 2021 then you have sufficient time to prepare for final war. Firstly you have to clear your basic for this you should follow NCERT for all subjects. For biology you should understand each and every line of ncert because approx 80% question directly comes from these line and for rest 20% you have to go some beyond the ncert but according to ncert syllabus and previous years paper. Practice mcq from any good book For chemistry once your basic will clear and learn all the formula then you should solve ncert question.these questions are very good level and these also help you to boost your concept.finally practise mcq from any good book For physcis  If you are not going take choching No problem but you should join online test series to any premium institute ",
            "date": "Answered October 30, 2019",
            "views": "680",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Parth Sharma",
                "href": "/profile/Parth-Sharma-314"
            },
            "answer_text": "Why not? Of course! You can and you will. Firstly, be positive. Don’t doubt your capabilities. Aspirants who cracks this examination aren’t from MARS. They are like us only. Thing is you’ve to be the one who want that one seat at any cost. Whatever it takes. 2021 is so far. Just start today, infact from now onwards. Wipe all the recent applications from your Smartphone and go get that one seat. Good Luck! :) ",
            "date": "Answered December 2, 2019",
            "views": "269",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Elif",
                    "user_href": "/profile/Elif-110"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sonali Pathak",
                "href": "/profile/Sonali-Pathak-49"
            },
            "answer_text": "Focus on your 12th portion and Saturday and Sunday study 11th portion. For physics first clear all your topics, solve ncert questions and then your module…. Also practice previous year questions. Study hard 😊 ",
            "date": "Answered February 20, 2020",
            "views": "222",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Milli Rattan",
                    "user_href": "/profile/Milli-Rattan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mallikarjun Sungulkar",
                "href": "/profile/Mallikarjun-Sungulkar"
            },
            "answer_text": "Thanks to A2A NEET PG 2021 hardly ua left with 3 months… U can still get average rank if ua confident enough… Dz is the high peak time, Wer everyone starts to revise the cover subjects in the coaching institute… Solve nly MARROW Qbank and give as many as Grant Tests from the marrow app… In Grand Tests analytics , work on the weaker subjects… Atleast 2 Revisons are minimum abt the QBank. In free time, do Marrow pearls.. From now on minimum 10hrs of study per day is must… Be bold and confident… Sure u ll get good rank!!! ALL THR BEST!!! ",
            "date": "Answered September 28, 2020",
            "views": "163",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tanuja Bhavihal",
                    "user_href": "/profile/Tanuja-Bhavihal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sweta Panda",
                "href": "/profile/Sweta-Panda-22"
            },
            "answer_text": "Sure if you had not got good marks and you are sure you are not going to qualify or get a seat. Then you should start preparing added if you want it seriously.If not you can simply go and apply for other courses. ",
            "date": "Answered September 23, 2020",
            "views": "94",
            "upvotes": " Answer requested by Bhanu Pratap",
            "upvoters": [
                {
                    "user_id": "Maria Gonsalvez",
                    "user_href": "/profile/Maria-Gonsalvez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sonali Ganguli",
                "href": "/profile/Sonali-Ganguli-2"
            },
            "answer_text": "Hi All, I will suggest none other than Gate Indian Institute of Tutorials GATEIIT. Why GATEIIT? They have Best ranks and results. Best study material. Two times neet syllabus completion. Unlimited tests. Personal classes Personal doubt clearing Maximum numbers of hours classes Motivational sessions. Etc many more. Best of luck. ",
            "date": "Answered April 6, 2020",
            "views": "124",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pratiksha Patil",
                "href": "/profile/Pratiksha-Patil-437"
            },
            "answer_text": "According to 2020 online survey report GATEIIT has become most successful Coaching centre for preparation of Neet exam. Gate Indian Institute of Tutorials GATEIIT has best teachers and test practices. GATEIIT completes two times neet syllabus with revision in detail and that is the key of success. It's a economic institute as well. Good luck. ",
            "date": "Answered April 6, 2020",
            "views": "190",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Priya Malik",
                    "user_href": "/profile/Priya-Malik-56"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anumeha Dwivedi",
                "href": "/profile/Anumeha-Dwivedi-2"
            },
            "answer_text": "prioritize ncert first and then mtg ncert fingertips for biology mtg neet champion for physics and chemistry ",
            "date": "Answered May 10, 2020",
            "views": "137",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mayank Kashyap",
                    "user_href": "/profile/Mayank-Kashyap-73"
                },
                {
                    "user_id": "Tejashwini Murdeshwar",
                    "user_href": "/profile/Tejashwini-Murdeshwar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "S. Rameshwar Rao",
                "href": "/profile/S-Rameshwar-Rao"
            },
            "answer_text": "Excellent, you are starting at exactly the right time. There is no fixed BEST way. It all depends on you and how you will balance school, boards and NEET/AIIMS/JIPMER ",
            "date": "Answered January 16, 2019",
            "views": "585",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aditya Gupta",
                    "user_href": "/profile/Aditya-Gupta-683"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daskhi Rathore",
                "href": "/profile/Daskhi-Rathore"
            },
            "answer_text": "NCERT PRACTICE PREVIOUS YEARS PAPER that's more than enough . No matter how much u wanna study materials . I suggest against it. Jusr NCERT is more than enough. ",
            "date": "Answered May 2, 2019",
            "views": "472",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Radha Krishna",
                "href": "/profile/Radha-Krishna-1239"
            },
            "answer_text": "Join best coaching institute and study according to them ",
            "date": "Answered October 17, 2019",
            "views": "178",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Megha Shakya",
                    "user_href": "/profile/Megha-Shakya-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anshu Yadav",
                "href": "/profile/Anshu-Yadav-78"
            },
            "answer_text": "Well first of all u must make concept by reading the ncert as much as u can and solve mcq based on neet pattern ",
            "date": "Answered June 20, 2020",
            "views": "115",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kanchan Guru",
                "href": "/profile/Kanchan-Guru-2"
            },
            "answer_text": "First of all ,you have to complete your NCERT…Ncert of 11th and 12th must read for biology …you should complete all numerical from NCERT for chemistry and physics then solve other books ….question practice must important ",
            "date": "Answered April 4, 2019",
            "views": "387",
            "upvotes": " Answer requested by Girish Kawaskar"
        },
        {
            "author_info": {
                "name": "Deepak Gorantla",
                "href": "/profile/Deepak-Gorantla-1"
            },
            "answer_text": "for two years ncert is god, even if you are an avg student if consistent you will top the exam. learn calculus and straight lines of math and little trignometry for easy going for phy ",
            "date": "Answered July 28, 2019",
            "views": "285",
            "upvotes": " Answer requested by Debjyoti Biswas, Sarah Lohan and 1 more"
        },
        {
            "author_info": {
                "name": "Alisha Deshmukh",
                "href": "/profile/Alisha-Deshmukh-3"
            },
            "answer_text": "This was mine Alisha Deshmukh's answer to Can you share your NEET preparation strategy and time table? Hope it helps! ",
            "date": "Answered July 26, 2019",
            "views": "263",
            "upvotes": " Answer requested by Sarah Lohan"
        },
        {
            "author_info": {
                "name": "Prasant Shah",
                "href": "/profile/Prasant-Shah"
            },
            "answer_text": "Give at least 2 hour time for neet prepration. 40 min for physics,30 min for chemistry and 20 to 30 min for bio. Rest for all question solution ",
            "date": "Answered October 17, 2019",
            "views": "297",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yash Patel",
                "href": "/profile/Yash-Patel-1169"
            },
            "answer_text": "Join a coaching develop a nice mentality of working hard…. ",
            "date": "Answered February 23, 2020",
            "views": "183",
            "upvotes": " Answer requested by Shruti T"
        }
    ]
}