{
    "title": "How rich should you be in order to invest? - Quora",
    "tags": [
        "Becoming Rich",
        "Personal Finance Investment Advice",
        "Wealthy People and Families",
        "Wealth",
        "Investment Advice",
        "Wanting and Making Money",
        "Personal Finance",
        "Finance",
        "Investing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rick Ferrara",
                "href": "/profile/Rick-Ferrara"
            },
            "answer_text": "You have it backwards. You don’t wait to be “rich”, you get yourself in order and you start as soon as you can. First, you need to pay your bills… you shouldn’t be investing if you have debts. Get your finances in order, pay off your debts (except your mortgage if you have a house). Then start putting away 15% of your gross income each and every month into retirement investments. This will most likely be a 401k at your place of employment, and personal IRA’s that you’ll create when you move from one job to another and transfer your old 401k into an IRA that you can direct. The key to investing in TIME and discipline. You can grow rich if you start young enough to have 35 years of compound interest, and you need to be putting something away each and every month. This runs contrary to human nature as some people way over think this and stop investing when the market takes a down turn. This is a really bad thing as they fail to realize that stocks are on sale and that their buying power is multiplied. They wait till the market gets strong and start buying after the stock prices rise… remember the old adage… “Buy low, sell high”… they are doing the opposite. ",
            "date": "Answered October 22, 2020",
            "views": "94",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bukola Ola Adeboye Adeboye",
                "href": "/profile/Bukola-Ola-Adeboye-Adeboye"
            },
            "answer_text": "It is not necessary to base investment on the amount of cash in the bank It is the ability to perform through personal efforts For instance when I decided to give my book to Amazon I had spent ten years on the book with heavy investment But there is big problems with the book industry in Nigeria The case of copyright offences is very rife Among the tribes there is a particular tribe notable of counterfeiting products There is limit to which you can do anything for them since in most cases they operate in their state This is a massive stumbling block That is why when I met Amazon I thought everything would be okay But it has been a woeful experience Amazon had sold my book quite alright But I never benefited from its ingenuity of performance Realistically there is no way I could have matched the record of Amazon in term of production and distribution But furiously since December 2017 when I gave my book to Amazon I never collected a cent or a farthing as royalties I need money I am now sixty years old I need money to solve my problems This is 1:19 am in the morning here How glad would I be in the morning to see Amazon declare the decision to pay me some money? I have no reason to quarrel with Amazon having done a splendid job for me But I need money I need help on this ",
            "date": "Answered October 25, 2020",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Usmanov",
                "href": "/profile/James-Usmanov"
            },
            "answer_text": "You don't have to be rich at all to invest. You just have to be comfortable with your income and your lifestyle to set aside some money that you don't mind investing. This means that you have to have enough to pay your bills, provide for your family, have an emergency fund and still have a bit left over that you don't need to use for anything. Your investment money should come from this last item on the list. You have a lot of options to invest in. You just need to educate yourself in the field that you want to invest in and be comfortable with your decision. You can invest in the stock market, real estate, precious metals and stones, art, local businesses… just pick something and learn as much as you can first. ",
            "date": "Answered October 22, 2020",
            "views": "51",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Randy Huizenga",
                    "user_href": "/profile/Randy-Huizenga"
                }
            ]
        },
        {
            "author_info": {
                "name": "Caleb Millichap",
                "href": "/profile/Caleb-Millichap"
            },
            "answer_text": "You don't have to be rich at all to invest. Most people invest to beCOME rich. The best way to kbow you can invest, is to look at your current status. Are you deeply in debt? Are you making a lot of payments? Do you still keep on buying something that's taking money away from you? If you don't have a lot of debt, you have a decent amount in your savings, and your more conservative with your money, I would say it's time for you to invest. If you dont like to invest yourself, just go to a insurance company, a bank, or any Financial service member to open an IRA (roth or traditional) ",
            "date": "Answered October 22, 2020",
            "views": "81",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Randy Huizenga",
                    "user_href": "/profile/Randy-Huizenga"
                },
                {
                    "user_id": "Dechen Dolkar",
                    "user_href": "/profile/Dechen-Dolkar-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julio C Gonzalez",
                "href": "/profile/Julio-C-Gonzalez-2"
            },
            "answer_text": "You don’t have to be rich. You just need to know how. Here are a few options: House hacking: get roommates. Meaning, rent any room you got vacant to reduce your part of the rent or mortgage. The extra money can be saved to invest. buy a duplex or triplex. Live in one side and rent the rest. purchase a house every couple of years. If you buy a house, you can live in it for one year, then buy a second one as your primary home, move to the new one and rent the other one. Now, I have done this. Most people tend to think you must buy a nice house. If you do that, it is hard to come up with the down payment every year. But if you buy houses or condos in Class “C” neighborhoods, is easier to do. Yes, it takes sacrifice. Yes, it is not easy to do. But it can be done because I have done it. ",
            "date": "Answered October 22, 2020",
            "views": "52",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dechen Dolkar",
                    "user_href": "/profile/Dechen-Dolkar-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanny Sah",
                "href": "/profile/Sanny-Sah"
            },
            "answer_text": "Its not about been rich and then only you can trade. One can start trading when they are financially secured. As trading involves the fluctuation of the market. And nobody is completely or 100% sure about how the market will turn. So, in my opinion one should start trading while they are having other source of income. In the beginning they should be trading in the mini lot and once they start understanding about the market, gained a good experience or having the proper knowledge about the risk management and money management. then they can increase there time duration on trading. However still having other source of income then trading is also very important. Though trading gives a financial independence. However ones should always be ready with the backup So, its not about been how much rich you are because even people who are rich makes mistake and loose all there money in revenge trading. ",
            "date": "Answered October 22, 2020",
            "views": "77",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Randy Huizenga",
                    "user_href": "/profile/Randy-Huizenga"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Rouillier",
                "href": "/profile/Robert-Rouillier-2"
            },
            "answer_text": "You don’t have to be rich at all to start investing. A person looking to invest should have at least 3–6 months of expenses set aside, and should then invest 15% (or more if you’d like) of their income however they’d like. Most millionaires didn’t start with a million dollars, and it’s a slow and steady process. Make a schedule for investing and stick to it. ",
            "date": "Answered October 25, 2020",
            "views": "225",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Hinkle",
                "href": "/profile/Scott-Hinkle-3"
            },
            "answer_text": "You don't need to be rich but you should have enough money to continue on if your investment fails and you lose it all. Now, if you're looking to invest in startups (aka crowdfunding/Angel investing), there are limits unless you meet certain net worth/income or educational/credential requirements. ",
            "date": "Answered October 22, 2020",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gene Hennig",
                "href": "/profile/Gene-Hennig-1"
            },
            "answer_text": "You don’t have to be rich. But I would have an emergency fund of 3 - 6 months of living expenses 1st. I began investing in my 401k at work to start with. And I was far from rich. I think this is how a lot of people start out. ",
            "date": "Answered October 26, 2020",
            "views": "402",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zainab Als",
                    "user_href": "/profile/Zainab-Als-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Damien Massey",
                "href": "/profile/Damien-Massey-1"
            },
            "answer_text": "There's a rampant myth that you need a lot of money to start investing in stocks, mutual funds and Exchange Traded Funds (ETFs). You will never get rich by stashing your money under a mattress or in a bank account. In order to build wealth, you will need to invest your money over time. Source: How To Start Investing Even If You Aren't Rich Yet ",
            "date": "Answered October 22, 2020",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eden Ray",
                "href": "/profile/Eden-Ray-2"
            },
            "answer_text": "You don't have to have a lot of money to invest. start with the spare change and take it from there. Just go online and look for investing apps. In the UK we have trading 212 which is very good. you can always start off with an ISA account and see how things go. ",
            "date": "Answered October 22, 2020",
            "views": "151",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Edgar Allen",
                    "user_href": "/profile/Edgar-Allen-21"
                }
            ]
        }
    ]
}