{
    "title": "How to get good at math at college - Quora",
    "tags": [
        "Academic Self-Improvement",
        "Mathematics Education",
        "Self-Improvement",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Prashant Sharma",
                "href": "/profile/Prashant-Sharma-12"
            },
            "answer_text": "A2A. Great that you realized it while there is still time! First, as others have mentioned, practice is indispensable. But it's important to practice in a proper manner to get the most out of it. I have described about an effective practice strategy in this answer. Here's a quick overview (but you should also read the longer version): Do multiple passes (or phases) over the same set of questions, to reinforce concepts. Here's a three-phase approach -- Learning phase : Go over each and every problem. Spend as much time as you can working out the problem without looking at the solution. If you get it right, great! If not, analyse thoroughly the given solution. Mark problems which you are not completely sure of being able to solve in the future.- Strengthening phase : Go over the marked problems, not spending so long on each problem now. Modify markings as you go along. Repeat until you are comfortable with most problems.- Finishing phase : Go over the problems orally, checking if you are able to recall the basic techniques in a few seconds or not. Next, I would recommend starting with GRE Math Review which is a modest-sized book covering various basic topics in math. You should apply the above practicing strategy to this book, and be absolutely comfortable with all problems here. Another important aspect is to build a strong intuition of various concepts. Suppose you are studying linear algebra. Take a 2x2 matrix, and see how it maps a 2-D vector to another 2-D vector by drawing them explicitly. Do it for several of them. See the null space forming, the range space forming and so on. Play with full-rank and rank-deficit matrices.You should be able to see what the (ε, δ)-definition of limit is saying, what does changing the order of summation means (by expanding it out completely) and when is it legal, why does the mean value theorem work only for continuous functions, etc.You should analyse in detail any techniques that you come across in problems and proofs. The more you analyse, the better you get at them.Also, see how different formulas reduce to one another. For example, Heron's formula for area of a triangle applied to an equilateral triangle, volume of prism reduces to volume of cylinder, volume of pyramid reduces to volume of cone, etc.See how things are consistent in maths: 0! = 1 by definition. How do you know if it is consistent with other factorial relations? (Hint: m! = m * (m-1)!)How about log(1) = 0?Understand how induction works: the basic principle. Next, making notes is important in many cases.Very often, maths courses will involve a lot of theorems and proofs. It becomes difficult at times to get the big picture, and you tend to get stuck in the details. It is very important that for such courses, you make short notes: write the statements of the theorems one after the other, mentioning along with each theorem under what conditions is it applicable. Sometimes, there is a hierarchy - a result is stated, then a reason why it is not applicable in all cases, and then a more general result is stated. You might want to include these in your notes, so that you have a clearer idea of which ideas are applicable in which situations. Finally, ask questions. If you don't understand something, discuss with people around you - friends, teachers, online forums, etc. ",
            "date": "Answered May 20, 2015",
            "views": "18",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nancy Nancy",
                    "user_href": "/profile/Nancy-Nancy-419"
                },
                {
                    "user_id": "JCG",
                    "user_href": "/profile/JCG-8"
                },
                {
                    "user_id": "Arym Arevir",
                    "user_href": "/profile/Arym-Arevir"
                },
                {
                    "user_id": "Trevor Hailey",
                    "user_href": "/profile/Trevor-Hailey-4"
                },
                {
                    "user_id": "Rahimunnisa Begum",
                    "user_href": "/profile/Rahimunnisa-Begum-2"
                },
                {
                    "user_id": "Andrew Borges",
                    "user_href": "/profile/Andrew-Borges"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandi Stewart",
                "href": "/profile/Sandi-Stewart"
            },
            "answer_text": "You must have the basics memorized so you can recite them very quickly -- your times tables, your additions, divisions, fractions.  You should know for instance that 1/5 is 20% without having to think about it.  You should know these at least down to 1/10.  You should know your times tables up to your 12's and be able to come up with the answers very quickly. If you don't know the basics very very quickly, you will never be able to do well on a math test, which is always a timed test.  Whether it's algebra, geometry, or calculus, if you are struggling with the basics, you will never be able to understand the more complex concepts, let alone finish a test. ",
            "date": "Answered August 5, 2015",
            "views": "838",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alina Yakusheva",
                    "user_href": "/profile/Alina-Yakusheva-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erin Charnow",
                "href": "/profile/Erin-Charnow"
            },
            "answer_text": "It is most definitely possible. It will take hard work but is totally doable. There are already some good responses on practicing at home and getting help from people. I would also say during class to go to your professor's office hours. Professor's can help you quiet a bit.  If you feel like you need even more basic math foundation support there are a lot of free resources on line to learn math. You can always look at you tube and watch videos or go to Khan academy and work your way through their topics. If you need some basic elementary math support Tenmarks is free over the summer. Free TenMarks Summer Math Program .  I'm sure there are some more stuff but that's what I was thinking off my head. ",
            "date": "Answered May 20, 2015",
            "views": "531",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mellie Francis",
                    "user_href": "/profile/Mellie-Francis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hafiz Azman",
                "href": "/profile/Hafiz-Azman-11"
            },
            "answer_text": "Hey, it seems that we're kinda in the same boat. I'm doing my a levels in about a month or two and most of the subjects are math related.  My plan is this: I'll do a quick revision on maths of the previous syllabus (high school).  Then, I'll research how's the math in the college (example questions, recommendations, etc) in forums like reddit.  And during college, I'll be applying tactics in this book http://calnewport.com/books/straight-a-student/ Hope that helps. P.S: I got the epub of the book, you can email me if you'd  like one. 4.hafizuddin@gmail.com ",
            "date": "Answered May 20, 2015",
            "views": "266",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mellie Francis",
                    "user_href": "/profile/Mellie-Francis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ajax Boeing",
                "href": "/profile/Ajax-Boeing"
            },
            "answer_text": "The best way to become better at Math is by practicing different kinds of problems from each concept everyday. Once you're thorough with the concepts as you've been practicing solving problems regulary, you can be prepared to solve any problem. ",
            "date": "Answered December 23, 2018",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scarlet Wang",
                "href": "/profile/Scarlet-Wang-1"
            },
            "answer_text": "Math is a kind of tool,as we all know,math is the most important subject in China.And if you want to learn some abstract subjects like physics ,programming.You should be good at math.Actually,it's possible that you could practice your math,there are some online courses,I hope it could be helpful.https://www.coursera.org/courses?query=math&categories=math ",
            "date": "Answered May 20, 2015",
            "views": "212",
            "upvotes": " Answer requested by Mellie Francis"
        },
        {
            "author_info": {
                "name": "Ge Robert",
                "href": "/profile/Ge-Robert"
            },
            "answer_text": "just practise! move important, it's that you should come to addicted to it.when i as a student in a college, i disliked it very much,i do a lot of practices in it so that coming to addicted to it slowly.you can have a try just like me, and you will have a good luck! ",
            "date": "Answered May 31, 2015",
            "views": "242",
            "upvotes": " Answer requested by Mellie Francis"
        }
    ]
}