{
    "title": "How long does it usually take to register for school (public)? - Quora",
    "tags": [
        "High Schools",
        "Registration",
        "High School Education",
        "The High School Experience",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alisa Boyd",
                "href": "/profile/Alisa-Boyd-3"
            },
            "answer_text": "If you’re the only one in line, it should be a quick, pretty much painless process. You’ll need proof of residency, your shots record, information about your previous school. Check your school district’s website to see if there are any more requirements. Go to the school fully prepared. Someone will look over your paperwork. Then you’ll make an appointment to see a counselor and pick your classes. You might be able to see a counselor right then, depending on how busy the counseling department is. If you are registering within the first two weeks of a new school year, expect the process to take a lot longer. There will be many students and parents who’ve waited until school actually starts to get registered. The counseling staff will be overworked and cranky. Make it your goal to be the nicest person they deal with that day. Trust me, it will pay off later. Now it may take several days to get in to see a counselor, time you’re getting behind in your classes. That’s frustrating, I know. The moral of the story is: don’t wait until school starts to register! ",
            "date": "Answered August 22, 2019",
            "views": "19",
            "upvotes": " Answer requested by Rebecca Bean",
            "upvoters": [
                {
                    "user_id": "Nelson Workman",
                    "user_href": "/profile/Nelson-Workman"
                },
                {
                    "user_id": "Henry Brown",
                    "user_href": "/profile/Henry-Brown-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "RG Pascual",
                "href": "/profile/RG-Pascual"
            },
            "answer_text": "At most for me it was two days. The first day was fifteen minutes updating emergency and contact information. Online, Next there was the selection and registration for extracurricular activities, choosing and giving donations for various school projects and classrooms, etc. Parents can pre signup for the entire year of events. Day two, parents attend the school walkthrough where they deliver residency proof documents and pick up information about the assigned teacher and class. 15 minutes, tops. ",
            "date": "Answered August 4, 2019",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kim Bogert",
                "href": "/profile/Kim-Bogert-1"
            },
            "answer_text": "It’s not a lengthy process, as long as you have the documentation that is required. Our kiddos have to provide everything at certain points- starting pre-k, starting kindergarten, starting 6th grade and starting 9th grade. Those registrations require the most documentation and take the longest time. Many of our parents are registering online and then bringing in their sign in information to our registrar to complete the process, which saves even more time. ",
            "date": "Answered August 22, 2019",
            "views": "591",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John W Cohen",
                "href": "/profile/John-W-Cohen"
            },
            "answer_text": "Ranges a great deal based on the grade level and the amount of computer automation used by the secondary school. Forty-five minutes to an hour seems about right for a secondary school. It’s a good idea to arrange for an early appointment as some classes do tend to fill up, quickly. ",
            "date": "Answered August 30, 2016",
            "views": "780",
            "upvotes": " View 2 Upvoters"
        }
    ]
}