{
    "title": "How do percentages work? - Quora",
    "tags": [
        "Statistics (collected data)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carter McClung",
                "href": "/profile/Carter-McClung"
            },
            "answer_text": "A percentage is one way of describing a portion relative to another quantity. It does so in a way that often doesn’t require the use of decimals or fractions (something that lowers the blood pressure of much of the public at large.) The word percent literally means per 100. So if you’re making 3 free throws per 5. How many would we expect you to hit per 100? [math]\\frac{3}{5}=\\frac{x}{100}[/math] [math]x=60[/math] So we would say you shoot 60 per 100, or 60%. The simple formula is: [math]\\frac{\\text{quantity}}{\\text{reference quantity}} = \\frac{\\text{percent}}{100}[/math] This can be rewritten as: [math]\\frac{\\text{quantity}}{\\text{reference quantity}}*100 = \\text{percent}[/math]  Percentage change is similar. Instead of quantity changed, you can measure change relative to your initial value: [math]\\frac{\\text{quantity changed}}{\\text{original}} = \\frac{\\text{percent changed}}{100}[/math] It’s often shown like this: [math]\\frac{\\text{new - old}}{\\text{old}} = \\frac{\\text{percent changed}}{100}[/math] or [math]\\frac{\\text{new - old}}{\\text{old}}*100 = \\text{percent changed}[/math] For example, if you make $20 an hour, and you get a raise to $25 per hour, your raise is $5, and $5 out of $20 is 25%. [math]\\frac{25-20}{20}*100=25%[/math] Percentage change trips a lot of people up, because it’s not reversible in an additive or subtractive way. If you do 20% better today than yesterday, then do 20% worse tomorrow than today, you’re not back to where you started. That’s because while the percentage is the same, the quantity is different, because you were comparing to 2 different quantities. For example, if you make $25 an hour, and you got a 10% pay cut, your pay did not decrease by $2, it decreased by $2.50 (10% of $25).  On a side note, percentages are definitely something it’s worth your time to wrap your brain around, as they are omnipresent in the financial world. ",
            "date": "Answered August 28, 2017",
            "views": "282",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Manish Chhatlani",
                    "user_href": "/profile/Manish-Chhatlani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cassidy Block",
                "href": "/profile/Cassidy-Block"
            },
            "answer_text": "A percentage is really just the conversion of any rational number into a whole number. The conversion process from rational number to percentage given two integers  and  that make up a rational number  is . For example, if you want to convert the number 342.567 into a percentage, you would use the above process like so: . ",
            "date": "Answered August 28, 2017",
            "views": "45",
            "upvotes": "0"
        }
    ]
}