{
    "title": "How would you describe life at AIIMS Bhopal? - Quora",
    "tags": [
        "Bhopal, Madhya Pradesh, India",
        "All India Institute of Medical Sciences (AIIMS)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harsh Katiyar",
                "href": "/profile/Harsh-Katiyar-2"
            },
            "answer_text": "Really, that's asking two questions at once, first how life is for an Indian med student and then how is med student life in Aiims, Bhopal. If you know the answer to the first question then it's easy to tell you about the latter. It's fun because you get to meet a lot of people and I mean it, a lot of different one's owing to it's location in central india students from all around the country come, consequently,you get to make many friends,participate in various events, and have a blast, We have “RETINA” an Intercollege fest,and the best elements are the live concert and DJ night, so you get to dance like hell, not to forget we even have Retina afterparty to celebrate the success of Retina(everyone works hard and as a junior you work a lot too so here's your little reward, generous seniors you see ), and if you think that's taking it too far, here's the life at AIIMS, BHOPAL for ya, fun isn't it. There is an annual sports event Pravah also,so you get to flex a bit too, 😄.How about a cup of noodles and cafe latte, well here you go, so we also have magee hotspots, very near to hostel, yaa like verry near, you lazyass!, just kidding 😂.You'll also love the hostels and even love more the hostel life, also the hostel rules here are much more relaxed , and you'll know the benefits of it when you go to live in one. Because of the recent developments in sports facilities here, it's even better. And if you are still wondering about the first question in the back of your head let me give you a brief answer - In India we have medical colleges for Mbbs that means you don't need graduation and medical schools for studying medicine, that saves a lot trouble and time, like you don't need a 3 year graduation before entering med school of 4 years,thar means same stuff less time, so if you give it a second thought medicine is rather lengthy, and yep, it's hard to remember huge stacks of conceptual as well as rote stuff in less time, your full determination and resolve is required,to push it all inside your little brain 😅 and yes the academics are a real pain in the ass, so you have to work hard a month or so before your exams, dah!, got scared 😱, chill you'll make it through just fine, though I'm not in s position to say so, but because I've seen my seniors go through, just fine. So, the latter brings the stress element in your life. So, ammm a mix of stress and fun but more of stress as you advance through in your studies, I suppose. I guess that's how the life of sacrifices for the doctor is 😌. ",
            "date": "Answered July 20, 2020",
            "views": "32",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lakshmi Nanduz",
                    "user_href": "/profile/Lakshmi-Nanduz"
                },
                {
                    "user_id": "Haari Vinayak",
                    "user_href": "/profile/Haari-Vinayak-1"
                },
                {
                    "user_id": "Sadia Naaz",
                    "user_href": "/profile/Sadia-Naaz-10"
                },
                {
                    "user_id": "Arjun B",
                    "user_href": "/profile/Arjun-B-135"
                },
                {
                    "user_id": "Vishal Suggala",
                    "user_href": "/profile/Vishal-Suggala-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Madhavi-192"
                },
                {
                    "user_id": "Harshit Yagyik",
                    "user_href": "/profile/Harshit-Yagyik-1"
                },
                {
                    "user_id": "Rimjhim Rastogi",
                    "user_href": "/profile/Rimjhim-Rastogi-1"
                },
                {
                    "user_id": "Shruti Kumar",
                    "user_href": "/profile/Shruti-Kumar-153"
                },
                {
                    "user_id": "Aarushi Asrani",
                    "user_href": "/profile/Aarushi-Asrani-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Singhal",
                "href": "/profile/Abhishek-Singhal-327"
            },
            "answer_text": "The All India Institute of Medical Sciences Bhopal (AIIMS Bhopal) is a medical research public university situated in Bhopal, Madhya Pradesh. It is one of the seven AIIMS apex healthcare institutes being established by the Ministry of Health & Family Welfare, Government of India under the Pradhan Mantri Swasthya Suraksha Yojna (PMSSY). AIIMS Bhopal was established in 2012 and its hospital was inaugurated on 26 January 2013.  Infrastructure The AllMS Bhopal campus is sprawled on an area of 143-acres and is easily accessible by the airport and the Bhopal and Habibganj Railway stations. AIIMS provides world-class medical facilities and is a dream destination for students aspiring to be top-notch doctors. In keeping with its image of one of the leading providers of advanced medical education, AIIMS Bhopal has excellent infrastructure to facilitate your academic endeavors.  Some of the modern academic infrastructure at AIIMS Bhopal includes airy, Global Studies classrooms, a well-stocked Library, Hi-tech Computer labs, Faculty Room, etc. The Institute has well equipped audio-visual classrooms with state-of-the-art equipment which includes LCD projectors, Computers, Overhead projectors, etc. which help in conducting interactive sessions and project presentations. Distinguished faculty from industry mentor students and industry visits are a regular feature for students.  The Auditorium at AIIMS Bhopal is an impressive architectural building. It is octagonal in shape with viewer’s gallery having a seating capacity of 1000 seats. The entrance to the auditorium is to the north. An open air amphitheatre adjoins the auditorium for open- air events. The auditorium will be equipped with synchronized sound and lighting system and green rooms. Hostel Facility The institute provides separate hostel facilities for boys and girls. The hostels are equipped with all the modern amenities such as well-furnished, spacious and air-conditioned rooms. The rooms have attached bathrooms, proper housekeeping facilities, telephone, etc. Faculty members provide supervision and guidance by living in the hostels and there is an availability of good nutritious food as per the preferred menu of the occupants.  The hostels have a running mess serving 4 meals a day. Hostels are equipped with indoor games facilities. To facilitate outdoor games like cricket and volleyball, surrounding land has been readied. The hostels have round the clock security. Central Library  Entrance  -1st Floor    Discussion Room  AIIMS Bhopal has a state-of-the-art Central Library. World class library management systems like radio frequency identification (RFID) system have been placed in the Central library of the AIIMS Bhopal. AIIMS Bhopal has a dedicated Fully Air-conditioned Building for the Library spanned over 3 Floors. Library Entrance have a Sensor equipped Automatic Gate.Each Floor Has a Washroom And a Water Cooler.Issuing and Returning Books has been hassle Free with the help of a Fully Digitalised scanner.The Ground floor is for general reading and periodicals.There are Desktop Computers for browsing Internet And Reading.Hardcopies of Novels,Shirt Stories and Biographies are also Available.Middle Floor is for Medical and Nursing Books.It also have a Conference Room for practicing Presentations, Discussion Room and a Room Dedicated for Research Related Stuff.The Top floor houses the e-library, Individual Reading area and Computer Section. Free Wi-Fi facility is available in all three floors.This Floor also have Study Pods each with its own LAN Port and 2 Charging Port.You will have complete Privacy to Read Books or Stream a Movie!Library edits suggested by Jeril Jose. Life outside the campus Bhopal is the perfect place for you to spend your formative years as it’s a fascinating place with interesting trivia and anecdotes. E.g. did you know that ‘The Bhojtal’ or the ‘Upper Lake’ is the largest man-made lake in India?  The Taj-ul-Masjid in Bhopal is one of the largest mosques in India. Split by a pair of lakes, Bhopal is indeed two cities within a city with two starkly contrasting cityscapes. Towards the North, you have the old city, a fascinating area of mosques, serpentine alleys, chowks, milling crowds, exotic havelis, and crowded bazaars. On the South of the two lakes is the new Bhopal. Here, you’ll find wide roads, upmarket shopping complexes, and plush hotels and restaurants nestled comfortably in the Arera and Shamla Hills, which overlook the lakes and the old city. The central district is known as New Market. Both sides of Bhopal are bound to enamor you in their own way and will bring out the child in you. Why you should Study at AIIMS Bhopal Premier Medical Institute in India: AIIMS, Bhopal is one of the top medical institutes in the country. Students from all over the world dream of studying at this premier medical college.State-of-the-art Infrastructure: As mentioned earlier, the academic infrastructure at AIIMS, Bhopal is second to none and it certainly gives you an edge when you’re studying at this top-notch medical Institute.Best Research Facilities: At AIIMS, Bhopal you’ll be encouraged to identify at research problem and address it with the help of a mentor in the Institute. Many students of AIIMS Bhopal have bagged the prestigious STS fellowship and have won accolades in platform and poster presentations in various national and international conferences.Excellent Faculty Members: The Institute boasts of various prominent members of Industry who mentor and guide the budding medical students.Moderate Fee Structure: A significant factor for various medical aspirants who face financial constraints while pursuing medical studies. AIIMS, Bhopal has a very reasonable fee structure that attracts students from all classes of society.Hope it will help, thanks.. ",
            "date": "Updated July 25, 2020",
            "views": "16",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arul Agarwal",
                    "user_href": "/profile/Arul-Agarwal-1"
                },
                {
                    "user_id": "Dr.Tapash Kumar Biswas",
                    "user_href": "/profile/Dr-Tapash-Kumar-Biswas"
                },
                {
                    "user_id": "Preeti Patnaik",
                    "user_href": "/profile/Preeti-Patnaik-22"
                },
                {
                    "user_id": "Akshat Gupta",
                    "user_href": "/profile/Akshat-Gupta-1031"
                },
                {
                    "user_id": "Darsh Udawat",
                    "user_href": "/profile/Darsh-Udawat"
                },
                {
                    "user_id": "Rajib Medhi",
                    "user_href": "/profile/Rajib-Medhi-4"
                },
                {
                    "user_id": "Lakshmi Nanduz",
                    "user_href": "/profile/Lakshmi-Nanduz"
                },
                {
                    "user_id": "Haari Vinayak",
                    "user_href": "/profile/Haari-Vinayak-1"
                },
                {
                    "user_id": "Sadia Naaz",
                    "user_href": "/profile/Sadia-Naaz-10"
                },
                {
                    "user_id": "Shiv Kumar",
                    "user_href": "/profile/Shiv-Kumar-7827"
                }
            ]
        }
    ]
}