{
    "title": "How to know if a student is not paying attention - Quora",
    "tags": [
        "Attention",
        "Focusing and Concentrating",
        "Teachers",
        "Students"
    ],
    "response": [
        {
            "author_info": {
                "name": "Khalid Al-Marri",
                "href": "/profile/Khalid-Al-Marri"
            },
            "answer_text": "You can tell by the look on their faces whether or not they are day dreaming. Look at their eyes and notice if they look away. Paying attention and listening requires Your earsYour eyesYour mindTwo way interactionSo ask that student some questions. Put them on the spot and keep it engaging to all ",
            "date": "Answered November 16, 2018",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Doe",
                "href": "/profile/John-Doe-17227"
            },
            "answer_text": "-When their head is laying down -When they are looking around the room -When they are talking to someone else -When they look like they're paying attention to you, but are actually thinking of something else. To tell this, look at their eyes. Are they making full eye contact? Are they shifting their eyes sometimes? This varies really. -When the object they're fiddling with is more important than your lecture -When they're secretly on their phone or just plain shows that they are -If they look bored. -When they're not taking notes -When they have their headphones in -When they doodle There's many more. You really learn these as you are in a class more. Just be aware of your surroundings and study ",
            "date": "Answered November 19, 2018",
            "views": "230",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Patricia Wheeler",
                "href": "/profile/Patricia-Wheeler-7"
            },
            "answer_text": "Check their grades. Actually, it is not the teachers main occupation to monitor if students are paying attention. Students do have more responsibility for their own education, than what is commonly assigned. Young students do need to be taught how to pay attention, but at some point in their education, a student must take responsibility for his participation. ",
            "date": "Answered November 17, 2018",
            "views": "54",
            "upvotes": "0"
        }
    ]
}