{
    "title": "How does education work? Why are teachers paid for something that students do not? - Quora",
    "tags": [
        "Teachers",
        "Teaching",
        "Students"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Park",
                "href": "/profile/Chris-Park-171"
            },
            "answer_text": "If you mean “Why are teachers paid but students are not,” well, stick a bunch of students in a classroom WITHOUT a teacher and see how much smarter they get. Students grow more and more capable of teaching themselves the older they get. Teachers both impart content knowledge and direct the collective efforts of the entire class, in a perfect world. This requires both a high level of knowledge of the subject and the ablity to be responsible for multiple other people. (If this sounds easy, explain the national shortage of teachers!) Even the smartest seniors in high school are usually not as smart as they think they are, however. Their usual deficit is in not knowing their own weaknesses, or what they don’t know, which only the bigger challenges of college can show them. The “I should be paid to go to school!” logic gets brought up by kids starting in late middle school through high school. Here is a conversation condensing how it opten goes: Student: “We should get paid to go to school!” Teacher: “Why?” S: “Because I’m here and I’m working!” T: “Ah, so, is this like a job?” S: “Yeah, a sucky job.” T: “Do you have another job?” S: “Yeah, at McDonalds.” T: “So you thnk you should be paid here the same way McDonald’s pays you?” S: “At least!” T: “Okay. How much do you get to sit down at McDonalds during a shift?” S; “Only like, twice.” T: “Good! That will save us a lot of space. We’ll get rid of the desks and you can stand all period.” S: “Wait, what?!” T: “Does McDonald’s give you an hour for lunch where you can go play basketball?” S: “Oh, hell no.” T: “Well, good. That will shorten our day then, since we’ll eliminate lunch hour and give you maybe 20 minutes. And of course, we won’t be feeding you the way we have either, since McDonald’s doesn’t just give away food. The market value of lunch is about 3–4 times what you pay for it, so the cost of lunch just trippled.” S: “Wait a minute, this isn’t what I meant—” T: “Doesn’t McDonald’s expect you to wipe the floor and take out the trash, plus clean up any messes created by anyone else? S: “Uh, yeah …” T: “Man, this is starting to sound like a great deal for the school. Now we can save a LOT of money on janitorial staff! Every time one of the toilets overflows, guess who we can put on the job, since now we are paying you?” S: “It’s not the same!” T: “Why?” S: “At my McDonald’s job I don’t have to just stay at one place all day, the customers are coming and going, and they’re different all the time. Even the worst stuff only happens now and then. T: “So, you’re saying you’d strongly prefer a job that didn’t require you to stand most of the day, put up with the same jerks day in and day out, clean up messes created by other people, and gave you a whole hour for lunch? S: “Well, yeah.” T: “Don’t go into teaching, kid.” ",
            "date": "Answered August 13, 2020",
            "views": "186",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Matthew Daneman",
                    "user_href": "/profile/Matthew-Daneman"
                },
                {
                    "user_id": "Donald Molleker",
                    "user_href": "/profile/Donald-Molleker"
                },
                {
                    "user_id": "Martin J Pitt",
                    "user_href": "/profile/Martin-J-Pitt"
                },
                {
                    "user_id": "Joanne Vicente",
                    "user_href": "/profile/Joanne-Vicente-2"
                },
                {
                    "user_id": "Sherry Millis",
                    "user_href": "/profile/Sherry-Millis"
                },
                {
                    "user_id": "Robert Pattison",
                    "user_href": "/profile/Robert-Pattison-4"
                },
                {
                    "user_id": "Dani Alexis",
                    "user_href": "/profile/Dani-Alexis-2"
                },
                {
                    "user_id": "Michiel Brumsen",
                    "user_href": "/profile/Michiel-Brumsen"
                },
                {
                    "user_id": "Madhu Sudhanan",
                    "user_href": "/profile/Madhu-Sudhanan-22"
                },
                {
                    "user_id": "Laura Riggs",
                    "user_href": "/profile/Laura-Riggs-23"
                },
                {
                    "user_id": "Leo Barker",
                    "user_href": "/profile/Leo-Barker-6"
                },
                {
                    "user_id": "Monica Eavenson",
                    "user_href": "/profile/Monica-Eavenson"
                },
                {
                    "user_id": "Brittany Robertson",
                    "user_href": "/profile/Brittany-Robertson-57"
                }
            ]
        },
        {
            "author_info": {
                "name": "Madhu Sudhanan",
                "href": "/profile/Madhu-Sudhanan-22"
            },
            "answer_text": "Does education work? Yes, it does. Are teachers are paid to teach ‘all’ students in a class (including the sincere ones and lifelong bullshitters)? One big YES. If some students ‘refuse’ to learn and while away their time in school because they want to,and they simply don’t give a damn about their future or their teachers effort to improve them, fine, no big deal. Is it the teachers fault? NO. Is it the teacher’s fault that he/she is paid for something that students do not want to be educated. NO. ",
            "date": "Answered August 15, 2020",
            "views": "60",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Martin J Pitt",
                    "user_href": "/profile/Martin-J-Pitt"
                },
                {
                    "user_id": "Joanne Vicente",
                    "user_href": "/profile/Joanne-Vicente-2"
                },
                {
                    "user_id": "Sherry Millis",
                    "user_href": "/profile/Sherry-Millis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cory Erickson",
                "href": "/profile/Cory-Erickson-16"
            },
            "answer_text": "Why would the students get paid? Do diners at a restaurant get paid, or does the chef? Do patients get paid, or does the doctor? I'm sorry, I'm not sure I'm even interpreting your question right, but if I am then it's very confusing. ",
            "date": "Answered August 13, 2020",
            "views": "318",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ali Baker",
                    "user_href": "/profile/Ali-Baker-44"
                },
                {
                    "user_id": "Joanne Vicente",
                    "user_href": "/profile/Joanne-Vicente-2"
                },
                {
                    "user_id": "Sherry Millis",
                    "user_href": "/profile/Sherry-Millis"
                },
                {
                    "user_id": "Alexis Rousseau",
                    "user_href": "/profile/Alexis-Rousseau-5"
                },
                {
                    "user_id": "Michiel Brumsen",
                    "user_href": "/profile/Michiel-Brumsen"
                },
                {
                    "user_id": "Monica Eavenson",
                    "user_href": "/profile/Monica-Eavenson"
                },
                {
                    "user_id": "Brittany Robertson",
                    "user_href": "/profile/Brittany-Robertson-57"
                },
                {
                    "user_id": "Patrick Stott",
                    "user_href": "/profile/Patrick-Stott-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Gray",
                "href": "/profile/Gary-Gray-38"
            },
            "answer_text": "The reason teachers get paid is why don’t you try finding teachers who would do the job for free. You would not be successful. You might find one here or there, but to find enough unpaid, yet qualified teachers who have invested tens of thousands of dollars in themselves through their own university education, certifications, etc, would be a fruitless pursuit. The reason students do not get paid money is that they are the beneficiaries of an education system that is there to teach them and grow their intelligence and knowledge. The payment to the students is the growth in knowledge and learning. A price tag cannot be put on that. The person that does not realize that is missing the big picture. ",
            "date": "Answered August 17, 2020",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Patrick D",
                "href": "/profile/Patrick-D-146"
            },
            "answer_text": "The stupidity of this question is astronomical. Why would students be paid for learning something? You are there to get smarter. The teacher is there to teach and is paid to do that. ",
            "date": "Answered August 14, 2020",
            "views": "46",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alexis Rousseau",
                    "user_href": "/profile/Alexis-Rousseau-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Goodell",
                "href": "/profile/Gary-Goodell-1"
            },
            "answer_text": "So students should get paid to learn now? The job of the teacher is to teach. The responsibility of the student is to learn. And by being taught correctly, your last sentence should be written, “Why are teachers paid for something that students are not being paid for?” ",
            "date": "Answered August 18, 2020",
            "views": "53",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Pattison",
                    "user_href": "/profile/Robert-Pattison-4"
                }
            ]
        }
    ]
}