{
    "title": "How to write a seminar - Quora",
    "tags": [
        "Seminars",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aastha Shrivastava",
                "href": "/profile/Aastha-Shrivastava-6"
            },
            "answer_text": "Hi A seminar paper must contain the following Title page and Table of ContentsAbstractThe problem studied, methods used, main results and conclusion. If needed you can include even the keywords.IntroductionIntroduce your topic and write down the thesis.BodyPart 1: Literature Review: Mention what other works talk about your topic and compare them. These works must be well summarized.Part 2: Your implementation, results, discussion, and analysis.ConclusionCitations and ReferencesPresenting the paper: You can either read your seminar paper or prepare notes for the presentation. Reading the paper will make the presentation boring. Therefore, its better that you use notes. The below steps will guide you to make perfect notes for an interesting seminar Decide the time limit of your talk.Write down what you would be saying in the presentation (script). This will help you build up your confidence, you will not to forget a thing, and you will stick to the time limit of your talk. While writing down what you will be speaking, you have to consider some important pointsKeep your focus on the major points (start with the personal introduction followed by the thesis and significance of the paper)Write down even the examples that you would quote during the presentation.Rehearse the script.Make an outline of the script.During the seminar, take both the outline and the script with you. Use the outline to address the audience. The script is only a back up in case you forget something (with proper rehearsal, there will be no need for you to look the script).Look at the audience while speaking (very important).Your conclusion should be strong. Sum up everything and remind the audience how you reached the conclusion. Probably end with a punch.Hope it helps!!!!!!!!!!! HAPPY READING ",
            "date": "Answered July 9, 2019",
            "views": "21",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vipin Kumar",
                    "user_href": "/profile/Vipin-Kumar-2628"
                },
                {
                    "user_id": "Sandeep Karande",
                    "user_href": "/profile/Sandeep-Karande-18"
                },
                {
                    "user_id": "Alameen Bello",
                    "user_href": "/profile/Alameen-Bello"
                },
                {
                    "user_id": "Savara Srinu",
                    "user_href": "/profile/Savara-Srinu-1"
                },
                {
                    "user_id": "Prasanna Hosangadi",
                    "user_href": "/profile/Prasanna-Hosangadi"
                }
            ]
        }
    ]
}