{
    "title": "How many years are there in high school? - Quora",
    "tags": [
        "High School Education",
        "The High School Experience",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lily Bradshaw",
                "href": "/profile/Lily-Bradshaw-7"
            },
            "answer_text": "It depends on where you live, country wise, I believe. But usually, for the most part, in the United States, high school contains 4 grade levels. Ninth GradeTenth GradeEleventh GradeTwelfth GradeTwelfth Grade is when you graduate in American high-school. For some students, they graduate a year or a year and a half early. In that case their high school career lasted 3 years to 3 and a half years depending on if they graduated that fall for that spring with the then, current graduating class. Many high schools offer an early graduation plan, typically a student would “skip” a year but taking double classes (or at least my school does). For example, if a ninth grader wanted to graduate in 3 years, the spring semester of that same school year, they’d meet with their counselor and discuss the classes they’d take their tenth grade year. That following fall semester they’d still be considered a tenth grader, they would just be a tenth grader taking tenth and eleventh grade classes. Then the fall after their tenth grade year, they’d be considered a senior and they can graduate in the spring. ",
            "date": "Answered August 9, 2019",
            "views": "68",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "M.Steve",
                    "user_href": "/profile/M-Steve-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Thompson",
                "href": "/profile/Jim-Thompson-156"
            },
            "answer_text": "The majority of high schools in the USA are four years, 9th through 12th grades. The grades are given names, 9th grade is freshman, 10th is sophomore, 11th is junior and 12th is senior. Probably 98% of students and parents refer to the grades by name. In some areas the high schools are grades 10 to 12, with the grade/names the same as the four year high school. The decision to be a three or four year high school is determined by the local school board. Those boards usually follow city boundaries but may be governed by a county or parish. In some areas there may even be special districts formed. ",
            "date": "Answered November 9, 2018",
            "views": "57",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karen Hurst",
                    "user_href": "/profile/Karen-Hurst-41"
                },
                {
                    "user_id": "Jerry Mason",
                    "user_href": "/profile/Jerry-Mason-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Teddy Ward",
                "href": "/profile/Teddy-Ward-5"
            },
            "answer_text": "Where and when I went to school, grades 10 through 12 were considered high school. 7 through 9 were junior high school an 1 through 6 were elementary school. I've heard of high school as being 9 - 12, middle school as 6 - 8, and elementary was 1 - 5. I guess it all depends on what your district calls it. But it will most likely be 4 years or 3 years. Cheers. ",
            "date": "Answered November 17, 2019",
            "views": "800",
            "upvotes": " Answer requested by Brandon Dotson"
        },
        {
            "author_info": {
                "name": "Lana Kinkade",
                "href": "/profile/Lana-Kinkade"
            },
            "answer_text": "It depends on whether the school district uses a middle school or a junior high school plan. Middle schools result in 4 years of high school; junior high schools result in 3 years. Middle schools are for grades 5-8; junior high's are grade are grades 7-9. ",
            "date": "Answered August 11, 2019",
            "views": "396",
            "upvotes": " Answer requested by Na’Tonya Colton"
        },
        {
            "author_info": {
                "name": "Beheruz N Sethna",
                "href": "/profile/Beheruz-N-Sethna"
            },
            "answer_text": "Four, in the US. But, only three to build a great application for prestigious college admissions, because the best colleges will expect your applications early in your senior year, particularly for early admission, financial aid, etc. So, you don’t have four years to build your “WOW!” resume. You may have three or a little more. ",
            "date": "Answered August 30, 2019",
            "views": "148",
            "upvotes": " Answer requested by Katlin Watts"
        },
        {
            "author_info": {
                "name": "Becky Baxter",
                "href": "/profile/Becky-Baxter-8"
            },
            "answer_text": "In most US schools, 4. The exception would be really large districts where they have a 9th grade school, then high school is 10, 11, 12. ",
            "date": "Answered September 11, 2019",
            "views": "171",
            "upvotes": " Answer requested by Reginald Cristofer Rogoff"
        },
        {
            "author_info": {
                "name": "Wei Shen",
                "href": "/profile/Wei-Shen-5"
            },
            "answer_text": "Depends on which district your school board is in and what they have decided what the length of high school is. In Ontario Canada high school is Gr. 9–12 4 yr. ",
            "date": "Answered February 5, 2020",
            "views": "145",
            "upvotes": " Answer requested by Brendon Summer and Khan Demont"
        },
        {
            "author_info": {
                "name": "Elizabeth Smith",
                "href": "/profile/Elizabeth-Smith-265"
            },
            "answer_text": "4 ",
            "date": "Answered October 5, 2019",
            "views": "123",
            "upvotes": " Answer requested by Brandon C. Njichop, Reginald Cristofer Rogoff and 3 more"
        }
    ]
}