{
    "title": "How should I plan my preparation for the GRE? - Quora",
    "tags": [
        "GRE Preparation",
        "Graduate School Admission Tests and Exams",
        "Graduate Record Examination (GRE)",
        "Graduate School Admissions",
        "Exam and Test Preparation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shruti Rijhwani",
                "href": "/profile/Shruti-Rijhwani"
            },
            "answer_text": "THIS IS NOT A LOT OF STUDY. Just a rather descriptive post. I did most of this in less than a week, but with long, intense study hours. Two or three weeks of relatively less manic preparation will easily finish all I've mentioned. This is not going to tell you what the GRE questions look like - all books do that, have a look before reading this. These are just a few things I observed and practised while studying for and taking the test.  Schedule: I wouldn't recommend following the schedule I did. It was five days of very intense studying. Too much pressure and no fun at all. Three to four weeks would be ideal to prepare without panicking. Take a diagnostic test - found in almost all GRE books, to assess what you need to study. It's basic math and english, so studying things you already know is definitely a waste of time. Identify weaknesses and study those. Whatever you are good at can be revised later on.  Quantitative Reasoning: So this is 7th grade Indian middle school math. No exaggeration, but one might have forgotten certain things. So a quick revision might help. Statistics, probability, geometry, arithmetic and algebra are covered. No trigonometry or calculus - but extremely basic trigonometry sometimes helps with the triangle questions, even though it's not prescribed to study.  The best way to do this would be to do several practice sections and then revise whatever you don't know.  Data interpretation questions are sometimes confusing and require practice, if only to see what they look like. There are several types of graphs that can be given and interpreting them may require different methods. These questions sometimes take longer than others, so I always left these to solve last. Quantitative comparison questions often have corner cases that you may not consider if you haven't practised them enough. There are two quantities given and they are to be compared. So do plenty of these questions in order to understand what sort of values can be used to test the quantities. Generally important are using values like 1, -1, 0, negative and positive fractions apart from other real numbers/integers.  This is true of the GRE in general, but more so in quant. Do not assume anything! Figures are NOT drawn to scale. Something that looks like a right angle is NOT a right angle unless it is marked or specified. The rest of quant is basic math, make sure every topic is refreshed. It shouldn't take too long, if you were good at high school math. If a lot has been forgotten, practice! Quant is definitely the easier GRE section for a large percentage of test takers. What most people realise is that the quant sections are extremely easy, but it's also very easy to make (incredibly) silly errors. Quant sections are 35 minutes, 20 questions. Most questions do not take over a minute to solve. I tried to solve all questions within 20 minutes and use the remainder to solve ALL the questions again. I changed a couple of wrong answers in my actual GRE on doing this, so it's rather important to CHECK each answer at least once. Do not check passively. Check a problem by solving as if it's the first time you're seeing it - in practice tests as well.  Verbal Reasoning: Verbal reasoning questions are text completion, sentence equivalence or reading comprehension. I won't describe what these questions look like, but what I studied and practised. Reading comprehension (RC) - none of my practice tests (Barrons, ETS) had RCs as difficult as the ones I saw on the GRE. The multiple choice questions have confusing, convoluted answer options - and often, two answers seem equally likely. In my opinion, the only way to overcome this is by doing a few *difficult* RCs and looking at answer explanations, understanding why one option is more likely to be correct. I did not do ANY practice comprehensions that were as difficult as the actual test, but ETS Powerprep comes quite close.   Another thing with RCs is that some of them are long - over 6 paragraphs. It is important to know how to handle such passages without losing track of the content while reading - so practice doing these questions. NEVER assume anything in RCs. Everything you need is in the paragraph. They are not asking for your opinion or assumptions. If something is asserted in an answer choice, but it is not implied from the paragraph - it is wrong, no matter how logical/correct/appropriate it may seem to you. The world is ONLY the respective reading matter and not the world around you. It has to be implied or mentioned by the passage. Coming to text completion and sentence equivalence, blanks need to be filled in with appropriate words. This is one of the most challenging parts of the GRE because the answer options are words that might not be present in an average vocabulary.  Improving ones vocabulary is best done by reading plenty. But GRE prep time may not be sufficient for reading a lot, so other sources can be used.  Apart from actually *knowing* a word, context and elimination of other options is VERY useful. In sentence equivalence, you have to select two equivalent options. If an option is not similar/equivalent in meaning to any other option (IN THE CONTEXT), eliminate it. Read the sentence/text to be completed and understand the context before selecting options. In the GRE I wrote, all words except ONE were found in the following sources:1. My pre-GRE vocabulary2. Word Power Made Easy by Norman Lewis3. Barron's 1100 Words You Need To Know4. Magoosh Basic Wordlists and Common Wordlists5. Barron's 333 high frequency words   When I took the diagnostic test, I identified vocabulary as my weakness and concentrated most efforts on that section (so my initial vocabulary wasn't spectacular).I covered the other sources in their entirety. It does not take very long if you can do 300 words a day, but that is rather painful. If you have over two weeks, do 20-50 words a day and keep revising. WRITE DOWN words you don't know with their meanings. It is so much easier to revise from your own handwriting than from print. I can't stress that enough. Revise all previously done words every day.   Rote learning of words will NOT HELP. The ETS is testing your English skill and NOT your learning-of-definitions skill. So it's very important to learn words in context. Barron's 1100 does exactly this and I highly recommend it for everyone. Words are given in a (funny) story and I often remembered several words because of the stories I learnt them in.   Word Power Made Easy is also brilliant. It takes a bit long to read, but keep at it. It teaches word roots so deciphering unknown words becomes easy. Apart from roots, several common GRE words are taught as well - in a format that is structured. Again, no word-definition pairs. It's interesting with plenty of humourous examples. Magoosh's flashcards are GREAT on the go! Android and iOS have an app. WinPhone users (like me!) can use any third party app that extracts flashcards from Quizlet.They *are* word-definition pairs and are not sufficient to learn context properly. But I used them simply because I always had my phone around. Any free fifteen minutes was spent revising a few words. Basic and common Magoosh lists are a must-do. I did not touch the advanced words at all.Flashcards at: chloemoreno | QuizletAlso on the Magoosh website. Barron's 333 high frequency words are a quick revision of supposedly common GRE words.  The vocabulary isn't extremely challenging. These are words used in everyday high-level conversation. I did not see more than two or three advanced words on the actual test. Again, all words except one were from the sources studied. Know the basic words before you move to advanced in any wordlist! Alphabetical wordlists are confusing and rather painful, in my opinion. But if you can bear with them, go for it. I wish I had had time to make synonym trees. Try doing so -How to Tidy up the Vocab Clutter-Synonym Trees (Part 1). Barron's 800 essential words is useful too, I have heard. I did not have time to go through it.  For verbal as a whole, do timed practice sections. See where time is being wasted and try to cut down. With confusing answer choices, several minutes are lost in debating with yourself - try not to do that. Mark the question (the software allows marking) and come back to it later. 30 minutes, 20 questions - one minute per question would be great. I always did text/sentence questions first (as they were quick) following which I did RCs in increasing length of reading matter, simply because I didn't want to spend initial time reading long passages. Figure out a pattern in your practice sections that works well for you and follow it.  AWA:  AWA is supposedly not very important for engineering programs (I don't know how far this is true). However, ONE practice essay of each type (Issue, Argumentative) is a must. ALL possible topics are already on the internet, published by ETS themselves - check the official website. Unfortunately, there are around 200 for each essay type, so practising all of them is near impossible. Writing in 30 minutes is not easy, so practice at least once.  Issue essay - read sample essays (from ETS and the internet) and figure out what pattern of paragraphs you want to use.   The essay is essentially asking you to analyse an issue, take a stand and support with examples. The stand does NOT have to be either for or against the issue. It could be inclined towards one side or even ambivalent, if you can substantiate it.  I used introduction, brief body about my opinion and example 1, example 2, example 3, contradiction and justification, conclusion - 6 paragraphs.  Contradiction is a paragraph where you approach the opposite stand and justify your stand with that view - like arguing with a completely opposite opinion.  Argument essay - read samples (from ETS and the internet). Also, definitely look up the kinds of logical fallacies common to GRE argument essay topics. There aren't many (maybe five or six) and are easily identifiable. If you can detect three or four logical fallacies, you're set to write the essay. Pattern I used - introduction, fallacy 1, 2, 3, recommendations, conclusion - 6 paragraphs. GRE ESSAY GUIDETop 5 Strategies for the GRE Argument EssayBarron's Test Prep Blog - Online Education and Test Prep Long essays are preferred for both topics - look at ETS samples. 5-6 paragraphs is sufficient.  <begin Anjishnu Kumar> The first thing about the essays - They are NOT testing how great of a creative writer you are. Do NOT try to use them to express your originality. They are testing articulation, perfect grammar and logical structure - so use simple language as far as possible and easy to understand sentences.  Have a relatively rigid sentence structure for your essay - you then can devote more time to coming up with points to write and less time thinking about how to start the essay and conclude.  Spend the first few minutes thinking about what you are going to write before you start typing- finish with time to spare and spend a few minutes proofreading what you write. Practice writing with a 20 minute time limit, it's OK if you overshoot a bit. BTW, they aren't important for MS programs, but PhD programs look at AWA scores very seriously. <end Anjishnu Kumar>   Other: Powerprep II, the ETS Software - available freely on their website athttps://www.ets.org/gre/revised_general/prepare/powerprep2.MUST DO. The software is exactly what the computer GRE test uses. The standard of questions is very similar as well. Make sure all questions in the ETS textbook are done as well - easy, medium and hard. Standard is like the GRE. Sample essays from this book are a must-read. TIMED PRACTICE SECTIONS are very important. The GRE is equally about speed and accuracy. I also took a few Barron's practice sections just for more exposure to different questions. I have heard Manhattan's practice tests are of high difficulty. They can be used if you are comfortable with everything else. I did not use them, though. Read Quora answers/blogs/Facebook help pages for recommendations on other practice resources. I only did timed section practices as I did not have much time. But for familiarity with questions, several huge question banks (Manhattan 5 lb, for example) are available. ",
            "date": "Updated September 4, 2015",
            "views": "2511",
            "upvotes": " View 3.1K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Y P",
                    "user_href": "/profile/Y-P-130"
                },
                {
                    "user_id": "JULIEN YOUAN BI",
                    "user_href": "/profile/JULIEN-YOUAN-BI"
                },
                {
                    "user_id": "Gowtham Jaganathan",
                    "user_href": "/profile/Gowtham-Jaganathan-8"
                },
                {
                    "user_id": "Lidhya Shilu",
                    "user_href": "/profile/Lidhya-Shilu"
                },
                {
                    "user_id": "Malvika Rk",
                    "user_href": "/profile/Malvika-Rk"
                },
                {
                    "user_id": "Ubaid Khalid",
                    "user_href": "/profile/Ubaid-Khalid-1"
                },
                {
                    "user_id": "Christina Molitor",
                    "user_href": "/profile/Christina-Molitor"
                },
                {
                    "user_id": "All Round",
                    "user_href": "/profile/All-Round-19"
                },
                {
                    "user_id": "Devalla Thapasvini",
                    "user_href": "/profile/Devalla-Thapasvini-1"
                },
                {
                    "user_id": "Jiyu Ren",
                    "user_href": "/profile/Jiyu-Ren-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandeepan Majumdar",
                "href": "/profile/Sandeepan-Majumdar"
            },
            "answer_text": "3 month plan to ace the GRE The  majority of students spend between two and three months preparing for  the GRE. Given we all struggle to sustain our attention and  concentration for more than this long, such a duration makes perfect  sense. Here is the perfect plan for those who can commit both the time  and the cognitive resources necessary for a few months.Unlike the  other two weekly study guides – the one week and one month – this study  guide has a range of two to three months. This buffer room allows those  who have unpredictable schedules – or who simply cannot allocate enough  hours each week – to choose the three-month plan. For those who have the  time and/or simply want to be more aggressive, the study plan below can  be shortened to two months. This study guide gives general goals by  week. Essential Materials •\tAny Good GRE Prep courses in the market– Lessons and Practice Problems (optional)•\tETS’s Official Guide to the GRE, 2nd. Edition•\tBarron’s 333 High Frequency words.•\tETS’s PowerPrep Software If  you would prefer to take the practice test on paper, you can print out  ETS’s practice test PDF.  Take note that the Poweprep software and the  paper-based test have overlapping material, so it won’t be of much help  to do both, unless you space them out far enough so that you won’t  recognize the questions and answers! I recommend using the Powerprep  software if you can, since taking the test on a computer is a better  simulation of test day conditions. Also, PowerPrep 2.0 comes with two  tests. The PDF is only one test, which overlaps with Test 2 from the  PowerPrep 2.0 Software. •\tOnline GRE Flashcards. They’re free on most websites like Find out how strong your vocabulary is and learn new words at Vocabulary.com., Quizlet, magoosh.com and you can use them on the web, on your iPhone/iPad or Android!•\tFind out how strong your vocabulary is and learn new words at Vocabulary.com.•\tIndex Cards (Quizlet)•\tStopwatch or Timer Supplemental/Optional Materials:•\tMcGraw Hill Conquering the GRE Math (for those who need additional work on math fundamentals)•\tManhattan GRE (including 6 extra online practice tests)•\tNova’s Math Bible (for 160+ math scorers) Weeks 1-2 Primary Goals: Work  your way through as many of \\ Math and Verbal concepts as possible. An  effective learning strategy is to follow up a chapter by practicing  questions from the ETS Official GuideComplete 100 practice questions each from Verbal and Math from any of the materials discussed above.Determine  which of the Manhattan GRE guides will help address your weaknesses  (you only need to purchase one in order to access all of the 6 online  tests) Secondary Goals:Read two articles from Scientific American/Atlantic Monthly/Economist.  Find fifty words you do not know. Reference in Find out how strong your vocabulary is and learn new words at Vocabulary.com. or Word  Smart and make flashcards (articles should be 4 – 15 pages).Write a  quick summary/review of one of the two articles you wrote, threading GRE  words you learnt these two weeks (can come from any of the sources,  e.g. lesson, questions, etc), and apply them where necessary.Make  your way through 10 words a day from your custom made GRE Flashcards.  The goal should be 150 words after 15 days. For further context on how  the words you are learning are used consult Find out how strong your vocabulary is and learn new words at Vocabulary.com..Use Quizlet to quiz yourself on 200 vocabulary words from article. Weeks 3-4 Primary Goals:Finish watching all your concept learning from GRE Math review .Take the Powerprep 2.0 Test 1 to assess your level.Check your answers to review mistakes.Use the test to identify areas in which you need more practice.Practice 75 more questions for Verbal and 75 Math within ETS Official guides.Work  through the beginning of the ETS Official Guide 2nd. edition, and cover  the easy and medium sections at the beginning of the book for both math  and verbal. Secondary Goals:Continue  working through vocabulary from GRE Flashcards, five a day, quizzing  yourself on all the words you have learned up to this point.Up your reading to two articles a weekSolidify fundamentals using any Manhattan GRE guidePick fifty words each week from the two articles (a total of four articles for each week)Make  sure you continue practicing problems from the McGraw-Hill Math if you  are struggling with any fundamentals (fractions, exponents, etc.For the high scorers, take a practice Manhattan GRE test, reviewing all your mistakes once you are done. Weeks 5-6 Primary Goals:Practice 175 more questions for Verbal and 175 Math within your GRE Prep course if you have any.Work through the rest of the ETS Official Guide 2nd. edition questions up to the practice tests at the back of the book. Secondary Goals:Continue practicing vocabulary in the same manner described above.Depending on your level, complete 100 math problems from the GMAT Official Guide (the higher the number, the harder the problem). You may also want to  pick and choose based on your perceived areas of weakness.If lower level math, focus more on Manhattan GRE math.From the GMAT OG, do ten timed Reading Comprehension Passages. Time yourself on five Critical Reasoning questions each day. Weeks 7-8 Primary Goals:Customize  practice sessions with your GRE Test Prep course product to target  weaknesses. You should complete all of the verbal and all of the math  questions.Take both tests at the back of the Official Guide, including the AWA section.Take the Powerprep 2.0 Test 2.Make  sure you are doing as many timed sections as possible from various  sources. If you can’t work through an entire section, always have a  stopwatch whenever you work through questions. Secondary Goals:Continue  learning vocabulary as before.  You should know at least 800 words by  now, and should probably know even more from working with the GRE  Official Guide .Take a Manhattan GRE practice test. (Review mistakes). For advanced Verbal students:Do  a timed verbal LSAT Reading Section each day and 5 Critical Reasoning  questions. Try to determine why answers are wrong on your own.Take no fewer than two Manhattan GRE on-line practice tests.For advanced Math students:Finish all Problem Solving questions in GMAT OG and Nova’s Math Bible.Also, go through College Board SAT book, and be  able to complete every difficult problem (usually last 5-6 problems of  each math section).Take no more than two Manhattan GRE on-line practice tests. Get Free GRE tests @GRE Good luck!From GRE Prep Club ",
            "date": "Updated April 5, 2016",
            "views": "11",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sanchi Bansal",
                    "user_href": "/profile/Sanchi-Bansal-1"
                },
                {
                    "user_id": "Harshita Gidwani",
                    "user_href": "/profile/Harshita-Gidwani"
                },
                {
                    "user_id": "Naimish Chhatral",
                    "user_href": "/profile/Naimish-Chhatral"
                },
                {
                    "user_id": "Kundan Patil",
                    "user_href": "/profile/Kundan-Patil-28"
                },
                {
                    "user_id": "Leslie Burk",
                    "user_href": "/profile/Leslie-Burk-1"
                },
                {
                    "user_id": "Nafiz Imtiaz",
                    "user_href": "/profile/Nafiz-Imtiaz-41"
                },
                {
                    "user_id": "Srihitha Chebiyyam",
                    "user_href": "/profile/Srihitha-Chebiyyam-1"
                },
                {
                    "user_id": "Juvina Bijlani",
                    "user_href": "/profile/Juvina-Bijlani"
                },
                {
                    "user_id": "Ishita Gandhi",
                    "user_href": "/profile/Ishita-Gandhi-1"
                },
                {
                    "user_id": "Prateeth Nayak",
                    "user_href": "/profile/Prateeth-Nayak-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vyshnavi Manoj Kumar",
                "href": "/profile/Vyshnavi-Manoj-Kumar-1"
            },
            "answer_text": "Hi! I have taken the General GRE exam in March 2017 and scored 329/340 with 163 in Verbal and 166 in Quantitative. I will tell you my experience and in general some tips as to how to fare well on the exam. Nevertheless, preparation strategies vary from person to person. If you want to get an idea as to where you stand even before you start your preparation, I would suggest you to take a free mock test online. I would recommend the one offered by Galvanize. It's not a full test, but has one Verbal section and one Quantitative section. You just need to spend an hour and you would get an idea when you check your scores as to where you made mistakes and which concepts you need to learn better. This, in my opinion, embarks your preparation for GRE! The most important thing to do is to first book your test date. Until and unless your test date is booked, you would not get the requisite motivation to start your preparation. That was what I did. I first scheduled my test and then took the mock to see where I stood. I scored 302/340 in the mock test. I was not at all prepared. So the results were as expected. I found out the concepts I needed to study and started working on them. Talking about how much time you need to invest preparing for the test, it is totally dependent on what you do. If you are an engineering student or a mathematics student or someone taking math courses and constantly staying in touch with the subject, I assure you that Quantitative section would be a cakewalk! At the same time, I would like to emphasize that ETS has raised the bars for Quantitative section and it is not as trivial as it once seemed to be (I'm not generalizing anything here; whatever I say is what I opine). If you want to start from scratch and study everything throughly, I'd highly recommend enrolling for some online GRE coaching. You can subscribe for Magoosh as it would prep you up for the toughest questions - questions that are too tough that ETS might not consider asking them- which is a very good thing as you would find the actual test pretty easy! You can take a subscription for three months or six months depending on what is ideal for you and depending on when you have scheduled your test. Do not think of it as a waste of money because in the worst case scenario where you do bad in your first attempt, you might end up wasting more money for your second attempt! So it's okay to spend some money when necessary because it's worth it. :) Practice all the material religiously, and work everyday. Make sure you have the ETS official book with you and also download the Powerprep software from ETS website. Set a target, say, that you would complete your first round of preparation in a month and then take the first test on the Powerprep software. Depending on your score, you would know where you stand. You can then improve your score by focusing more on areas where you lost marks. Take the second test one week before your actual test date after you think you're fully prepared. That test is relatively tougher than the first one. Spend the last one week practicing rigorously. Verbal Vocabulary plays a crucial role in Verbal section, but, remember that it is not everything. It contributes to about 20% of your score on verbal section. The most important aspect is practicing comprehensions and text completions. GRE is an exam which you can excel by practicing more and more problems! That's the key to scoring high on GRE. So don't spend too much time simply learning words. Instead, practice more questions and continue learning words. This approach is more helpful. Quantitative The key to scoring high on quantitative is practice and practice and practice! Also, remember that the exam would put you under a time pressure. So practice with time and try to do as many questions as you can with minimum number of mistakes. Every question is worth the same score. So focus more on getting questions right than on somehow answering all the questions. Analytical Writing It would suffice to score above 3.5 in this section, but I would suggest you to spend some time and get a better score. It's not all about getting a reasonable score but it's about getting a decent and deserving score. If you're good at essay writing and arguments, you would hardly need to spend any time for this section. Otherwise, you need to practice writing and the more you practice, the better you get at it. ETS asks questions only from the given pool of essays. So make sure to check them out. I have practiced several topics from the pool of essays and scored 5/6 in this section. There are websites that have collections of GRE preparation books including Kaplan, Baron's, Manhattan, Princeton and old ETS books. So try to get them and practice as much as you can! :) Finally, I would say practice makes your GRE score perfect! I mean it literally, a perfect score of 340 is attainable with practice. :) All the best! PS: I have forgotten to mention this. In order to improve vocabulary on a long-term basis, do study Word Power Made Easy by Nornan Lewis. But this book doesn't cover several GRE words! So please download the app called “Painless GRE”. It has around 4000 words. Once you're done learning them, most of your vocabulary prep is done! :) ",
            "date": "Answered September 18, 2017",
            "views": "1119",
            "upvotes": " View 459 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Durbar Chakrabarty",
                    "user_href": "/profile/Durbar-Chakrabarty"
                },
                {
                    "user_id": "Meghana Ramesh",
                    "user_href": "/profile/Meghana-Ramesh-16"
                },
                {
                    "user_id": "Apoorva Deshpande",
                    "user_href": "/profile/Apoorva-Deshpande-35"
                },
                {
                    "user_id": "Gowtham Jaganathan",
                    "user_href": "/profile/Gowtham-Jaganathan-8"
                },
                {
                    "user_id": "Malvika Rk",
                    "user_href": "/profile/Malvika-Rk"
                },
                {
                    "user_id": "Chaitanyarushi Telanakula",
                    "user_href": "/profile/Chaitanyarushi-Telanakula"
                },
                {
                    "user_id": "Deboleena Mukherjee",
                    "user_href": "/profile/Deboleena-Mukherjee-5"
                },
                {
                    "user_id": "Christina Molitor",
                    "user_href": "/profile/Christina-Molitor"
                },
                {
                    "user_id": "Akshay Dhiman",
                    "user_href": "/profile/Akshay-Dhiman-21"
                },
                {
                    "user_id": "Alex Jonson",
                    "user_href": "/profile/Alex-Jonson-14"
                },
                {
                    "user_id": "Srishti Maurya",
                    "user_href": "/profile/Srishti-Maurya-11"
                },
                {
                    "user_id": "Manhoj Kumar",
                    "user_href": "/profile/Manhoj-Kumar"
                },
                {
                    "user_id": "Harmanpreet Kaur",
                    "user_href": "/profile/Harmanpreet-Kaur-237"
                },
                {
                    "user_id": "Varsha Ravupalli",
                    "user_href": "/profile/Varsha-Ravupalli-1"
                },
                {
                    "user_id": "Pragyan Jyoti Dutta",
                    "user_href": "/profile/Pragyan-Jyoti-Dutta"
                },
                {
                    "user_id": "Satish Nagineni",
                    "user_href": "/profile/Satish-Nagineni"
                },
                {
                    "user_id": "Kartik Soni",
                    "user_href": "/profile/Kartik-Soni-8"
                },
                {
                    "user_id": "Aditya Sanjeevan",
                    "user_href": "/profile/Aditya-Sanjeevan"
                },
                {
                    "user_id": "Madhulika Chaudhury",
                    "user_href": "/profile/Madhulika-Chaudhury"
                },
                {
                    "user_id": "Priya Adlakha",
                    "user_href": "/profile/Priya-Adlakha-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Antariksh Bothale",
                "href": "/profile/Antariksh-Bothale"
            },
            "answer_text": "Whee! GRE is the one exam I had a lot of fun preparing for. One year is plenty of time, so you're good to do. How you should go about preparing for the GRE depends a lot on where you stand right now. The Quantitative Reasoning (Math) part of the exam is fairly easy for anyone with an engineering background, so that can be tackled by solving a few practice tests to ensure that your speed and accuracy is adequate. Aim at getting ALL questions correct. The Verbal Reasoning part of the exam is where most Indian students need plenty of preparation. It's important to understand here that the VR part doesn't intend to test just your vocabulary, per se. Rather, it intends to test your reasoning and analytical skills, and vocabulary is just tool. Through comprehension exercises and other questions, the aim is to see how well you can analyze arguments and draw conclusions from a given text. Vocabulary  Try and gauge your vocabulary by attempting a few tests given in the Barrons GRE book. If you feel it's decent (you know at least 50% of the words), your job is rather easy. In my case, I could attempt about 65%. If you feel it's lacking, there is this red book (now it is white) called Word Power Made Easy by Norman Lewis that a lot of students seem to love. I have only read it occasionally, so I don't have a strong opinion about it, but its etymology approach is useful, especially if you've never seen language that way. It is good for vocabulary, but you'd better ignore its grammar advice.Try to at least complete the word lists given in Barrons. It's not exhaustive, but it's a fairly good collection. There are about 3500 words in there, and it will take you a fair amount of time if your vocabulary isn't great to begin with. Expect to spend about 3-4 hours per word list.Apart from this, you can check out online resources tooReasoning This will come largely with practice. As you work on the vocabulary, keep solving practice tests and analyze how many of your errors were not because of vocabulary issues but because of logical / reasoning issues. These are the ones you need to work on. You'll get better with practice, and will also improve your vocabulary alongside. As I said earlier, the GRE is not a test of raw vocabulary. Instead of merely mugging up words, try to put them in context. Get a feel of how those words are used, where those words are used. Get a sense of whether a word is used in an approving sense or a disapproving sense. Try to appreciate the nuances between words that appear very similar in meaning but are still not interchangeable.This is what will help you more, both in life and in the examination.Closing Notes If you prepare well and prepare properly, you'd come off with a much stronger vocabulary and reasoning ability. This is a useful asset in academia, as well as in everyday life.Students who start with relatively low vocabulary and then ramp up significantly during GRE preparation often suffer from what I call obnoxious-word-usage-syndrome, where an over-enthusiastic attempt to use the newly acquired vocabulary results in prose that is not only pathetic but that often makes little sense. This can be easily remedied if you spend time in understanding exactly how / where a particular word is used (as mentioned above)",
            "date": "Updated November 19, 2013",
            "views": "3867",
            "upvotes": " View 2K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Christina Molitor",
                    "user_href": "/profile/Christina-Molitor"
                },
                {
                    "user_id": "Maksut Magauin",
                    "user_href": "/profile/Maksut-Magauin"
                },
                {
                    "user_id": "Karthik Subramani",
                    "user_href": "/profile/Karthik-Subramani-32"
                },
                {
                    "user_id": "Rowena Chin",
                    "user_href": "/profile/Rowena-Chin"
                },
                {
                    "user_id": "Monimoy Paul",
                    "user_href": "/profile/Monimoy-Paul-1"
                },
                {
                    "user_id": "Stephanie Sc",
                    "user_href": "/profile/Stephanie-Sc"
                },
                {
                    "user_id": "Shanmugasundaram Muthuswamy",
                    "user_href": "/profile/Shanmugasundaram-Muthuswamy"
                },
                {
                    "user_id": "Devin Lgls",
                    "user_href": "/profile/Devin-Lgls"
                },
                {
                    "user_id": "Jay Hori",
                    "user_href": "/profile/Jay-Hori"
                },
                {
                    "user_id": "Jay Liu",
                    "user_href": "/profile/Jay-Liu"
                },
                {
                    "user_id": "Deeksha Sharma",
                    "user_href": "/profile/Deeksha-Sharma"
                },
                {
                    "user_id": "Faisal Hasan",
                    "user_href": "/profile/Faisal-Hasan"
                },
                {
                    "user_id": "Eric B. Grynspan",
                    "user_href": "/profile/Eric-B-Grynspan"
                },
                {
                    "user_id": "Sagar Aiya",
                    "user_href": "/profile/Sagar-Aiya"
                },
                {
                    "user_id": "Kehinde Onadipe",
                    "user_href": "/profile/Kehinde-Onadipe"
                },
                {
                    "user_id": "Sola Akindolu",
                    "user_href": "/profile/Sola-Akindolu"
                },
                {
                    "user_id": "Arjun Arul",
                    "user_href": "/profile/Arjun-Arul"
                },
                {
                    "user_id": "Pradeep George Mathias",
                    "user_href": "/profile/Pradeep-George-Mathias"
                },
                {
                    "user_id": "Emily Ann Roy",
                    "user_href": "/profile/Emily-Ann-Roy"
                },
                {
                    "user_id": "Shaokai Lee",
                    "user_href": "/profile/Shaokai-Lee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sunny Shah",
                "href": "/profile/Sunny-Shah-8"
            },
            "answer_text": "I guess it's about time I contributed to this thread, considering how much I have gained from all the answers here. My decision to take the GRE was made swiftly. I had to book the dates and begin preparation as soon as possible. The exam date was about 50 days from the day I first sat down with the books - I utilised about 45 days from those 50 for my preparation. My first week was spent in research, and these were the questions I was trying to find answers to: What is the GRE test format - time, questions, sections etc.What are the topics to be studied for Quant, and the question types for VerbalHow much focus is to be put to learning new wordsWhat are the best sources of preparation for both Quant and VerbalWhat practice tests should I give, and whenI also took Barron's diagnostic test. Its prediction was a score in the 315-321 range. I personally felt about 2 months, with 2-3 hours of preparation daily are sufficient to get a 315+ score if you come from a good math and English background. Otherwise, 4-5 months should be enough but I might be wrong. The rest of my answer is based on the answers to the above questions and how I actually went about my preparation. QuantAs described by a lot of answers, this is indeed middle school math. You'd obviously have gotten a little rusty with it after all these years, but it shouldn't take much effort to bring the shine back. Okay, first thing - go and buy ETS' official guide to the GRE. It is an absolute must and not reading it will hurt you at some point. I went through its quant review section which described the question types and topics. I had been good at math since school (f*** modesty!), and realised this won't be tough albeit with a little practice. I read through every word of the book's Math Review, and that was enough. I feel you don't need any other source for actually learning/revising the concepts and formulae. The language is simple and everything is explained in a lucid manner. I also recognised my weak areas (permutations, probability) after practising the exercises at the end of each chapter. Following this, I was able to get Nova's GRE math bible (PDF) from a friend. I divided the number of pages in the book by the number of days I wanted to finish it in, and started completing those number of pages each day. The question quality is excellent and a lot of them are much harder than what you'd see on the GRE. Solving all the problems in this book will get you familiar with all required concepts and will also give you a really good confidence boost. About 30 days before the exam, I purchased Manhattan's 5lb book. There are a LOT of questions in there, and I wanted to do all of them. Same approach - number of questions by number of days. The question quality here is again excellent (some of them being MUCH harder than on the GRE) and the explanations are fantastic. Solving the questions in this book also makes you think in the right manner and consider all possible cases for a question. Solving the above two was more than sufficient. I felt quite confident once I completed the questions in 5lb and it showed in the practice tests (more on this later). Some tips: Practice the data interpretation questions well and note the time you take to solve each. This is VERY important - make sure you don't note down incorrect numbers from the figures, read the graphs quickly but accurately and do not spend more than a few minutes (3-4) on one data interpretation set. Pay special attention to what has been asked - these questions generally involve several quantities in a single image like age, sex, height yada yada - and make sure you are not considering any other quantity when starting the calculations.Most comparision questions revolve around considering corner cases - negatives, 0, infinity etc. So review the equations/problem statement carefully and take into account ALL cases that could apply.Stay relaxed. Getting tense will screw up whatever you knew well and there is a very high chance of silly mistakes in quant anyway due to the nature of the GRE and the time restrictions. VerbalFor people from non-English speaking countries, this will be the biggest barrier. First, books. My research showed 3 sources to be the best for verbal (apart from ETS itself) - Manhattan, Barron and Kaplan. Further research on these three told me Manhattan would be the best (this is why I decided to get the 5lb book).Of course, as in quant, the first thing I did was to go through ETS' chapters on the verbal section. They made me familiar with the question types and their difficulty level. There are 3 parts to the Verbal section and I'll address each separately:Reading ComprehensionThis was by far the part I was scared of the most. I went through the ETS book's RC samples and was lost. I couldn't get most of the answers right. Like a knight would, I decided to leave it aside and come back to fight these questions after I'd practised sufficiently.The 5lb book was the ONLY book from which I practised RC. But it was more than sufficient. They have two chapters - Reading Comprehension and Logic Based RC (you can look up the difference between these online or in a book). The question quality is FANTASTIC, and solving all of these (about 200 from both chapters combined) while also understanding the logic behind and approach to each answer will get you ready to tackle most RCs. They aren't that hard, but here's what you need to do: Pay special attention to why a particular answer is the correct answer. Understand the steps of arriving at it and the thinking you need to put.Read the first third of the passage in detail, the next third in lesser detail and quickly go through the last. It's not a sermon or a love letter for your beloved - do NOT attempt questions without reading the passage and do NOT spend several minutes trying to understand the whole passage. Both are extremes - you need to find a balance between understanding the passage as well as managing your time.Do NOT assume anything that is not mentioned in the passage. I cannot stress this enough, and this is true for quant as well. If the passage says the sun revolves around the earth, take that to be the truth. Do not put in your thoughts, knowledge or opinions - restrict yourself to whatever is mentioned in the passage.Have a mental image of what part of the passage talked about what topic. This is important because you would have to refer multiple parts of the passage for some questions and you should never have to go through the whole thing for each question.Most answers can be arrived at by elimination. Look at an answer choice and if it says absolutely ANYTHING that goes against what is said in the passage, eliminate it. Of course, a lot of times you'll be left with 2 or more probably correct choices. In that case, you need to put your logic and the practice you did to action.Now's the tricky part - learning words.***********************************************************************ETS is not testing your knowledge of obscure words, neither are they testing your memory of words. What they are testing is how you can put everyday (and some uncommon) words in context and understand the meaning of a sentence. I did not encounter more than 3-4 tough words in my exam, and I believe that is the case with all. Of course, I have been reading since I was young and have an above-average vocabulary (again, f*** modesty). But what I have said is irrespective of that - most words were common words that any person who has studied in an English-medium school will know.***********************************************************************I initially downloaded Magoosh's flash card app for Android but got bored with it in some time. So I got hold of Barron's 1100 words book and did about 600 from it. I highly recommend this book especially since most words are presented in context and a lot of them are words you may have used some time in the past and are fairly common, but you might have forgotten them or their meaning.I stopped at 600 because by this time the 5lb book had arrived. The Text Completion and Sentence Equivalence in it had some really obscure words, and I decided to simply do all the words in the questions of those chapters. I believe the total would be somewhere around 800-900. Combining this with the 600 I did, my vocab and the amount of time I had, I decided that will have to do. Text CompletionI would go through about 20 questions of TC in the 5lb book everyday - first going through all the words, looking up and understanding the meanings of words I didn't know and then coming back to solve the questions after I'd gone through all the words. Sentence EquivalenceSame strategy as for TC. Tips: Write down words you don't know with their meaning. Revise the whole list everyday.In SE, there are 6 choices for each question. Usually (but not always), you fill find 2 pairs of similar meaning words from these 6, and the other will be unrelated. From the 2 pairs, decide which fits the best in the sentence and select the words of that pair. This strategy works in most of the cases and is very, very useful.TC questions test your understanding of the sentence and the meaning you draw from it. This is why most answer choices for a given blank will sound similar. You will have to re-read the sentence 2-3 times (but not more) fitting in the words according to their meaning to determine which fits best. Again - practice, practice, practice.AWANot much preparation. I just went through the 5lb book's AWA samples (20 of them) one day before the exam. As it turned out, they were THE best samples and the analysis provided at the end of each essay is very useful.Pay attention to the structure and content of the essays provided in the book. Practice writing a couple if you feel the need, especially if you've never done any writing before. I don't have more tips for AWA, since I really didn't do much for it. Practice TestsThere are lots of sites offering practice tests online for varying costs. Here's an advice - ignore ALL of them except 3 - Magoosh, Manhattan and Kaplan.Keep this in mind - there really is NO website or organization whose questions and exam structure matches that of ETS'. Only Magoosh, Manhattan and Kaplan come close and are worth the money. Buy the test pack of any of these and do ALL the tests. This is important to get a feel of the actual test environment and time restrictions, and to get a rough estimate of your score (I didn't do any of them btw since I didn't have the time, but I was going to sign up for Manhattan's). Okay, now here are two tests that are the closest to the actual GRE - the 2 practice tests provided as part of ETS' PowerPrep software (included in the CD with the book and also available online for free). The software is the same as the one in the actual exam, and will get you acquainted with the controls and the UI layout.Most importantly though, the questions in these tests are very, very close to the ones on the actual GRE. These tests will give you the best indication of your preparation level, your comfort with the exam and your mental readiness. They are also the best indicators of your actual GRE score. This has been true for most test givers - their actual score has been more or less close to the PowerPrep tests' results.Take these tests a couple of weeks before the exam. Don't take them in the beginning itself since if you're not prepared well the scores on these tests will severely lower your confidence. Use their results to understand and work on areas you need improvements in. I repeat, do NOT waste your money on other test or study packages, since none of them mimic the actual GRE and will give you a wrong, over-estimated impression of your preparedness. Here are my scores:PowerPrep Test  I  : 323PowerPrep Test II : 321GRE                       : 327 (Quant - 165, Verbal - 162, AWA - 5.5). ",
            "date": "Updated March 17, 2015",
            "views": "298",
            "upvotes": " View 160 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Padullaparthi Kushal Swarup",
                    "user_href": "/profile/Padullaparthi-Kushal-Swarup"
                },
                {
                    "user_id": "Sarthak Khurana",
                    "user_href": "/profile/Sarthak-Khurana-28"
                },
                {
                    "user_id": "Rohan Mehere",
                    "user_href": "/profile/Rohan-Mehere"
                },
                {
                    "user_id": "Aman Patel",
                    "user_href": "/profile/Aman-Patel-221"
                },
                {
                    "user_id": "Nandini Khaneja",
                    "user_href": "/profile/Nandini-Khaneja-1"
                },
                {
                    "user_id": "Rishav Chourasia",
                    "user_href": "/profile/Rishav-Chourasia-2"
                },
                {
                    "user_id": "Melissa Venedicto",
                    "user_href": "/profile/Melissa-Venedicto"
                },
                {
                    "user_id": "Smita Nyamgoudar",
                    "user_href": "/profile/Smita-Nyamgoudar"
                },
                {
                    "user_id": "Imran Hossain",
                    "user_href": "/profile/Imran-Hossain-201"
                },
                {
                    "user_id": "Prateek Verma",
                    "user_href": "/profile/Prateek-Verma-327"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Casablanca-23"
                },
                {
                    "user_id": "Harsha Okin",
                    "user_href": "/profile/Harsha-Okin"
                },
                {
                    "user_id": "Omkar Swaroop",
                    "user_href": "/profile/Omkar-Swaroop-2"
                },
                {
                    "user_id": "Madesh Msd",
                    "user_href": "/profile/Madesh-Msd-2"
                },
                {
                    "user_id": "Udita Deota",
                    "user_href": "/profile/Udita-Deota"
                },
                {
                    "user_id": "Kartik Anand Pant",
                    "user_href": "/profile/Kartik-Anand-Pant-2"
                },
                {
                    "user_id": "Piyush Sarwaikar",
                    "user_href": "/profile/Piyush-Sarwaikar-1"
                },
                {
                    "user_id": "Pallavi Upadhyay",
                    "user_href": "/profile/Pallavi-Upadhyay-20"
                },
                {
                    "user_id": "Sahib Singh",
                    "user_href": "/profile/Sahib-Singh-216"
                },
                {
                    "user_id": "Lauret Kamii Francis",
                    "user_href": "/profile/Lauret-Kamii-Francis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rich Carriero",
                "href": "/profile/Rich-Carriero"
            },
            "answer_text": "The most important piece of advice I’ve given over the years when it comes to planning for any standardized test is to set specific goals. It sounds great to go into GRE prep with the attitude that you want to do the best you can. I’ve heard many students say those exact words but it’s more of an aspiration than a plan. Don’t get me wrong, you should aim to do well but the GRE is not a high school trig final. Standardized tests are not judged through the lens of percentage correct out of 100. The GRE is taken by applicants for masters programs, PhD programs, MBA programs and now even law programs. The prospective graduate students who take the GRE also come from an incredibly broad range of fields from comparative literature to computer science. The admissions committees for all of these diverse programs view the GRE in different ways. Some care more about verbal, others math, a few place greater weight on the writing section. The more competitive programs certainly are looking for higher scores from their applicants. Sometimes there’s money on the table for top scorers in the form of fellowships and scholarships. Start by researching scores that will make you competitive for the specific programs at the institutions that interest you. Graduate programs publish the median scores of their most recent class of accepted applicants. Look up your target programs one by one and figure out the range of quant and verbal scores that are competitive across schools. You should consider scoring within that range to be priority #1. Higher is better but you must score at or above that range. Scoring higher is less important because the GRE is a filter, meant to weed out unqualified candidates. For those who clear the bar, acceptance decisions come down to GPA, research and work experience, personal statements and interviews but no one gets into a PhD program just because they have a high GRE score. Setting a specific target allows you to approach each section with flexibility, investing more time in questions you are more likely to get right. You should get as many right answers as you can but without feeling like you have to get them all or give equal time to every question. There are 40 scored quantitative questions and the same number of ver and the range of scores from lowest to highest is 40 points so a rough way to figure out how many correct answers you’ll need for a given target is to subtract 130 from your goal. So if you seek a 160 on quant, you’ll need about 30 correct answers or 15 per 20 question section. As you go through each quant section, your first priority should be to find 15 questions you can answer correctly and spend the necessary time to ensure you get them right. Get more if you can but if you encounter question you know you can’t solve guess it right away and bank the time into other problems. You may just find you can get a higher score by shooting for 160 than you every could going for a perfect 170. Once you have your target, take a practice test. Sign up on the GRE website for PowerPrep Online and take one of the two free tests. Do your best and don’t be afraid of the end score. If you’ve done no prep, then the score will be lower but at the same time, you’d be amazed at how quickly you improve just by learning the structure of the test and dusting off some old math content knowledge. Don’t just take the test for score, however. Observe what concepts are more familiar or are easier for you. Take note of question types and formats that give you a harder time. With your target score and baseline in hand, you can begin building a prep plan. If you’ve already signed up for a specific test date, then you should study content and vocabulary for the first 1/2 to 2/3 of the time you’ve got then transition to test taking practice leading into test day. Put more time into high yield concepts like ratios, triangles and number properties early, then, as your score improves on practice tests, drill down on more specific and challenging concepts. Look to study 5–6 days a week. If you have less than 8 weeks, you’ll probably need 20–25 hours of study per week but with more time you can get by on 15–20. In the closing weeks, take one practice test per week. Make sure you take them in one sitting and recreate test conditions as much as possible (think 8 AM in a library instead of 2 PM on your couch). In the final days, focus on your strengths so as to not neglect them and to build confidence going in. Don’t study the night before and day of, don’t let the GRE be the first mental activity you engage in—try a crossword puzzle. Don’t feel like this is your only shot at a great score because you can cancel your score, you only send the scores you want to grad programs and you can retake the test in 3 weeks if necessary. So just follow your game plan, stay focused on the problem in front of you and don’t worry about the others around you—they all likely have very different goals from your own. ",
            "date": "Answered December 13, 2019",
            "views": "436",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sasank Channapragada",
                "href": "/profile/Sasank-Channapragada"
            },
            "answer_text": "There are a lot of answers already on this page but for what it's worth, I thought I'd add my study experience as well. The following are the key points that I'd suggest to keep in mind while preparing for the GRE based on what I learnt during my preparation. Note: I'll be writing from the perspective of an Indian engineering student, who would customarily be more comfortable with the Quantitative section than the Verbal one.   I'll first talk about the material I used, then I'll address the different sections one by one, before talking about how I spent my time preparing for the exam. Books and Material:  Kaplan's 10 Practice Verbal and Quant Tests: They simulate the actual GRE interface and proved vital in introducing me to the different types of questions that I would come across in the actual exam. Explanations are detailed and this is what helped me identify how to go about answering different types of questions in the exam. It is imperative to do so at an early stage. ETS The Official Guide to the GRE Revised General Test (With CD) : In my opinion, the most useful resource of all. The practice questions, the sample tests and the Powerprep tests that are available in the CDs and online are the closest things to the real exam and in fact, one or two of the questions and passages turned out to be very similar to the ones in the book. This is one book that every GRE aspirant cannot afford to neglect. The scores I got in the practice tests closely resembled my final score too. It is a good indicator as to how you'll do on the GRE and how well you've prepared so far. Also, make sure you read the different strategies involved in answering the different types of questions (although most are fairly obvious, some can prove to be crucial).Barron's Guide to the GRE (do not use the CD) : This book, in my opinion, is not as useful as people make it out to be. However, it has a lot of practice questions, especially for the verbal section. The CD Roms have a lot of mistakes and to view the answer key you may have to dig through the CD files. Magoosh Vocabulary Flashcards (Android app and web application): I spent a lot of time on this as vocabulary was what was crucial for me. It has over a 1000 words, divided into Common, Basic and Advanced. It proved very useful as it covers almost all the words that normally show up on the exam. However, I found that a few words did show up that were not on this list. Quantitative Ability Easy, but not straightforward: At first glance, one may feel that there is the Quant section is extremely simple and that one wouldn't have to pay much attention to do well. While it's true that the level of maths is extremely low (a high school student could easily get a high score) it is something that definitely requires practice. Also, time is not an issue when it comes to Quant. You should be able to solve each and every one of your 20 questions, all over again, as if they were new questions, before time is up. This was my way of avoiding silly errors.Topics: Other than the normal topics that one would expect to find such as algebra and geometry, the two concepts that I had not come across before the GRE were Normal Curves and Quartiles. While the ETS books has chapters for each math topic, it is unnecessary to read them all if you are fairly competent when it comes to basic mathematics. Normal Distribution: This link was enough for the little extra bit that I did not learn before. And for Quartiles, I read the corresponding chapter in the ETS book.The quantity comparison questions will be tricky in the first few attempts and proved to be the ones most likely to be error-prone throughout my preparation. Take numerous examples before you decide on an answer. Solving inequalities is another direct way of approaching these questions.Be very careful when it comes to the units and percentages in statistics questions. Almost all questions in math can be solved in the brute force way, as a method of verifying whether your answer is correct or not.Verbal Reasoning For an Indian student, the most crucial aspect of preparation. I dabbled with different approaches. I started with this Android app called Painless GRE, but I found it was too voluminous. It had over 3000+ words, many of which were fairly easy and the time it took to do each test was too high. Then I moved on to an alphabetical listing of High Frequency words (Barron's+Kaplan's), a PDF I borrowed from a friend but I finally ended up following Magoosh's app for Vocabulary Flashcards on Gaurav Mokhasi's advice and I would recommend it to every aspirant. In order to ensure that I remembered as many words as possible, around 2 weeks before my exam, I started making a list of the words, in an Excel spreadsheet, deck-wise, as given in the Magoosh app. I found that I remembered roughly two-thirds of the words, which was very alarming at that stage. I reviewed the words that I got wrong frequently and I urge you to maintain your own way of revisiting words that you're unsure of or studying similar sounding words at the same time. Devise a system you are comfortable with, as it's possible that you remember a word based on which deck it appears in.Page on zendesk.com: A list of all the words on the Magoosh app in an order independent of the decks and Page on amazonaws.com: A Magoosh Vocabulary Flashcard e-book that talks about different ways to remember words proved very useful during my revision.Circle a word that you do not recognize during any practice test, practice questions or write it down somewhere if you're doing an online test. At the end of the test, go back and check what each of these words mean. This is proved vital in the end.Have a way of checking the meaning of a word immediately. I have an English Dictionary app on my phone and when I'm on the computer, I just type define \"word\"At the risk of sounding pompous, use these words in daily conversation with your friends (and most possibly, annoy them) Reading Comprehension is all about practice. From getting confused with what exactly the primary aim of a passage is to being able to answer questions which are very ambiguous, comfortably, reading comprehension can be overcome by doing as many questions as possible.Preparation I started around two months before the date of my exam by doing words on the Magoosh app. I'd do around one deck in a day but I'd take a day's break in between. After a fortnight or so, I started doing the Kaplan practice tests to get an idea of where I needed to improve. Since there are 10 tests in Quant and Verbal, as well as a total of 13 Basic+ Common decks in the Magoosh app (added to my final exams) this went on for over a month. With around 20 days to go, I went over the words I had already studied in the Magoosh app. I concentrated on retaining as many of them as I possibly could and I spent a good amount of time on this. This was about the time when I started reading the ETS and Barrons books' methods of solving the different types of questions, including the analytical writing analysis.I did all the practice questions on Verbal in both books and I became more confident about the Basic and Common words in the Magoosh app. Read the sample essay responses that are given in ETS. This should be enough to give you a good idea of what is looked for in the two essays.2 weeks before the exam I took my first two tests, on consecutive days, along with the writing section for the first time.After this, I started reading the Advanced section of words in the Magoosh app. These words are less likely to show up but some of them do so if you want a really good score you cannot ignore it. I would do one new deck a day during the weekdays, along with a revision of the previous decks every two days. Every night I'd do the questions in paper tests given in both Barron's and ETS.I took another full test a little less than a week before my exam and didn't do anything after that except look at the list of uncertain words that I had made for myself.Day of the examBe cool and composed as nerves are the biggest obstacle to doing well. Also, do not panic if you feel you haven't done well in a section as your score depends on its difficulty. DO NOT try guessing which section is the experimental one. Don't worry about your score during the exam and you should be fine. ",
            "date": "Updated September 19, 2014",
            "views": "1287",
            "upvotes": " View 806 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Raj Arora",
                    "user_href": "/profile/Raj-Arora-42"
                },
                {
                    "user_id": "Farman Ali",
                    "user_href": "/profile/Farman-Ali-119"
                },
                {
                    "user_id": "Gowtham Jaganathan",
                    "user_href": "/profile/Gowtham-Jaganathan-8"
                },
                {
                    "user_id": "Imran Khan Faisal",
                    "user_href": "/profile/Imran-Khan-Faisal"
                },
                {
                    "user_id": "Imdadul Haque",
                    "user_href": "/profile/Imdadul-Haque-25"
                },
                {
                    "user_id": "Gloryjah Robinson",
                    "user_href": "/profile/Gloryjah-Robinson"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jerry-1356"
                },
                {
                    "user_id": "Pavithra Gowda",
                    "user_href": "/profile/Pavithra-Gowda-31"
                },
                {
                    "user_id": "Srijato Bhattacharyya",
                    "user_href": "/profile/Srijato-Bhattacharyya"
                },
                {
                    "user_id": "Rahul Goyal",
                    "user_href": "/profile/Rahul-Goyal-110"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jessica Hui",
                "href": "/profile/Jessica-Hui"
            },
            "answer_text": "There are some basic principles for people who are trying to prep on their own. Crafting studying technique is something more tactical, and personal, that you'll have to do on your own, based on what you know about how you best learn. Most of these, apart from distinctions as noted, apply to standardized tests in general: Start by creating a realistic schedule of daily work. Because the daily part is important, realistic probably translates to 15-20 minutes a day. \"I'm going to spend two hours a night\" is well-intentioned, but unlikely to happen.Use only the official materials. There is only 1 published book for the GRE.Materials include practice problems and practice tests. Do the practice problems first, then do regular practice testing as the actual test date approaches. There are two official GRE practice tests that are free to download. Because the tests are adaptive, they can be taken multiple times. You can get away with around three sittings per test without significant overlap, so that allows you six practice tests. These should be taken once a week for the six weeks leading up to the test, in an environment that simulates the actual testing environment as closely as possible (e.g., wake up and start the test at the times you would need to, isolate yourself in a distraction-free room, don't let yourself listen to music, put your phone somewhere else).Find someone with whom you can review the questions you get wrong. This doesn't have to be a professional if that's not feasible for you, but it should be someone who's good at the relevant content, or has scored well on the test before, or both.Do more practice problems for the content areas that seem to be surfacing the highest frequency of incorrect answers on your practice tests.Though there is no official vocabulary list, GRE prep requires studying vocabulary. Antonyms and analogies (and, to a lesser extent, sentence completions) lean much more heavily on sheer vocabulary than the passage  or vocabulary in context questions that have largely replaced them on tests like the SAT for precisely that reason (see How have the SATs changed over the past 20-30 years?). They comes far closer to being \"you either know it or you don't.\" Fortunately, there are a lot of vocabulary books out there, and just doing a little every day increases the odds that you'll get these questions correct.Finally, just to underscore -- consistent, well-planned preparation is key. On tests like the GRE and the GMAT, cramming is basically a giant crapshoot.",
            "date": "Updated June 8, 2010",
            "views": "3465",
            "upvotes": " View 759 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ankit Dubey",
                    "user_href": "/profile/Ankit-Dubey-4"
                },
                {
                    "user_id": "Gowtham Jaganathan",
                    "user_href": "/profile/Gowtham-Jaganathan-8"
                },
                {
                    "user_id": "Yashvardhan Singh",
                    "user_href": "/profile/Yashvardhan-Singh-66"
                },
                {
                    "user_id": "Satish Nagineni",
                    "user_href": "/profile/Satish-Nagineni"
                },
                {
                    "user_id": "Parin Patel",
                    "user_href": "/profile/Parin-Patel-40"
                },
                {
                    "user_id": "Pradyun Anthati",
                    "user_href": "/profile/Pradyun-Anthati-1"
                },
                {
                    "user_id": "Sasidhar Muppala",
                    "user_href": "/profile/Sasidhar-Muppala"
                },
                {
                    "user_id": "Krishna Patel",
                    "user_href": "/profile/Krishna-Patel-343"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Casablanca-23"
                },
                {
                    "user_id": "Tajammul Ahmed",
                    "user_href": "/profile/Tajammul-Ahmed-4"
                },
                {
                    "user_id": "Vaishnavi",
                    "user_href": "/profile/Vaishnavi-277"
                },
                {
                    "user_id": "Aman Luthra",
                    "user_href": "/profile/Aman-Luthra-24"
                },
                {
                    "user_id": "Tanmay Bhosale",
                    "user_href": "/profile/Tanmay-Bhosale-7"
                },
                {
                    "user_id": "Aswin P",
                    "user_href": "/profile/Aswin-P-4"
                },
                {
                    "user_id": "Imroz Nezami",
                    "user_href": "/profile/Imroz-Nezami"
                },
                {
                    "user_id": "Preethi Sayyaparaju",
                    "user_href": "/profile/Preethi-Sayyaparaju-1"
                },
                {
                    "user_id": "Shreyash Solanke",
                    "user_href": "/profile/Shreyash-Solanke"
                },
                {
                    "user_id": "Ramanan Ramesh",
                    "user_href": "/profile/Ramanan-Ramesh-1"
                },
                {
                    "user_id": "Shweta Maurya",
                    "user_href": "/profile/Shweta-Maurya-39"
                },
                {
                    "user_id": "Ankush Azade",
                    "user_href": "/profile/Ankush-Azade"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Lele",
                "href": "/profile/Chris-Lele"
            },
            "answer_text": "I’ve been tutoring the GRE for a number of years. The below is inspired by the many sessions I’ve had with students, many of whom have gone on to do very well on the GRE. A lot of it is also specific to the revised GRE, which made its debut in August 2011.  1. Use official material When preparing for the GRE, no questions prepare you better than the ones written by ETS, which is responsible for writing the questions you will see test day. As much as possible, stick to the questions in the Official Guide to the GRE so you can wrap your mind around how the test writers want you to reason.  You may not think that it makes that much of a difference, but many publishers out there have questions that require you to make certain leaps of logic—or employ questionable logic—that you will never have to do on the actual test. Then there is the fact that many questions simply aren’t as difficult or nuanced as the questions you’ll see test day. This is a problem many students encounter when using Kaplan—you are essentially taking a dumbed down version of the GRE, with often poorly constructed questions to boot.  2. Take practice tests There is no better way to prepare for test day than actually taking a mock test. You will train yourself to sit for three plus hours staring at a screen, as you are pummeled by an onslaught of GRE problems.  If possible, use only the official tests, found in the Official Guide to the New GRE. There are four such tests—two that comes with the book, and two that are computer-based and come with the CD that is part of the book. Stagger these out  over the four weeks you are prepping, so that there are no fewer than five days between tests and no more than ten days. If you are studying longer, you might also want to consider Manhattan GRE tests (see below).  Finally, practice tests will allow you to better assess your strengths and weaknesses, and help inform your study sessions in between tests.  3. Focus on weaknesses Make sure not to get carried away developing those areas in which you already excel. For instance, if you are generally strong at math problem solving questions, but if you dislike Data Interpretation (that’s the section with all the graphs), then the last thing you want to do is avoid that section. Instead make it a priority to become confident and effective at all questions relating to Data Interpretation.   4. Use the best material While official material is clearly the best prep out there, it doesn’t necessarily provide the most effective strategies. You may want to take a look at Princeton Review for helpful big picture strategies. As for specific strategies for almost every aspect of the GRE—from permutations to convoluted paragraph arguments—the Manhattan GRE books (MGRE) are the best. MGRE also has six practice tests that mimic the actual test very well (though this more so with math than with verbal). For more practice on the online format, Magoosh also offers questions that are similar to--and often more difficult--than those found on the actual test. (I should probably mention that I work for Magoosh :))  Of course there is a lot of material out there that should be avoided, especially in terms of practice content. Here is a helpful breakdown: 2013 GRE Book Reviews ",
            "date": "Answered April 10, 2013",
            "views": "846",
            "upvotes": " View 238 Upvoters",
            "upvoters": [
                {
                    "user_id": "All Round",
                    "user_href": "/profile/All-Round-19"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Casablanca-23"
                },
                {
                    "user_id": "Malik Waleed Khan",
                    "user_href": "/profile/Malik-Waleed-Khan"
                },
                {
                    "user_id": "Kunal Jain",
                    "user_href": "/profile/Kunal-Jain-610"
                },
                {
                    "user_id": "Rajnikant Yadav",
                    "user_href": "/profile/Rajnikant-Yadav-18"
                },
                {
                    "user_id": "Hafiza Akter",
                    "user_href": "/profile/Hafiza-Akter-1"
                },
                {
                    "user_id": "P Vinay Kumar",
                    "user_href": "/profile/P-Vinay-Kumar-7"
                },
                {
                    "user_id": "Ana Lavinia",
                    "user_href": "/profile/Ana-Lavinia-1"
                },
                {
                    "user_id": "Riya Juneja",
                    "user_href": "/profile/Riya-Juneja"
                },
                {
                    "user_id": "Rita Omuero",
                    "user_href": "/profile/Rita-Omuero"
                },
                {
                    "user_id": "Ravalika Reddy",
                    "user_href": "/profile/Ravalika-Reddy-2"
                },
                {
                    "user_id": "Ayush Sharma",
                    "user_href": "/profile/Ayush-Sharma-1764"
                },
                {
                    "user_id": "Rifat Mursalin",
                    "user_href": "/profile/Rifat-Mursalin"
                },
                {
                    "user_id": "Karthik Subramani",
                    "user_href": "/profile/Karthik-Subramani-32"
                },
                {
                    "user_id": "Alexandria Williams",
                    "user_href": "/profile/Alexandria-Williams-169"
                },
                {
                    "user_id": "Mohannad Abbady",
                    "user_href": "/profile/Mohannad-Abbady"
                },
                {
                    "user_id": "Rainy R",
                    "user_href": "/profile/Rainy-R"
                },
                {
                    "user_id": "Vignesh Ramakrishnan",
                    "user_href": "/profile/विघ्नेश-रामकृष्णन-Vignesh-Ramakrishnan"
                },
                {
                    "user_id": "Anamitra Sen",
                    "user_href": "/profile/Anamitra-Sen-1"
                },
                {
                    "user_id": "Pavan Kumar",
                    "user_href": "/profile/Pavan-Kumar-6985"
                }
            ]
        },
        {
            "author_info": {
                "name": "Austin Li",
                "href": "/profile/Austin-Li-1"
            },
            "answer_text": "Reposting from my other answer: Austin Li's answer to What is the best way to prepare for a competitive exam (CAT/GRE/GMAT) in 1 year without paying any tuition? The quick and dirty guide for the GRE: Raise your score by 10 - 20 in a week! Note: I'm writing this because my girlfriend might be taking the GRE in a few months and I wanted to write a guide for her. I'm a lazy prick. I don't like to study, and despite buying the Barron's, the Kaplan, and the Official guide, I only studied about 2% of the content in a week. I started on the diagnostic test and got 160 quant, 150 verbal. On the real test I got a 164 quant, 163 verbal, and 5.5 AWA. The AWA is a joke. Read on and I'll show you how to nail it.  If you're reading this and taking the test in a week, most of these tips will still help.   This is probably the most helpful strategy. It keeps your time management spot on, and it frees your mind from the stress of remembering your thoughts when the mental fatigue starts getting to you. Before the test starts and in-between test sections, you are given a few minutes of time. Use all of this time to prepare. Lay out the scrap paper in landscape and use a pen to make a deductive logic grid. Don't bother with a ruler making pretty lines, just make sure you do it and label the question numbers in an easy way to read.The problems usually have 4 to 5 multiple choice options. If you're unsure of the answer, you will usually be able to tell 2 to 3 choices to be wrong if you know the math and the vocabulary words, and a remainder of 2 choices that you're unsure about/forgot the meaning/couldn't figure out the final steps of the math.Grid: Note that on the verbal section, do not fill in the question number as there will be some questions of multiple blanks that you need to each fill correctly to gain credit (Killer!), so label those questions \"1 a, 1 b, 1 c\". Take at most roughly a minute for each question. Since the new revision it is less important to ensure you get the first few questions right. If you see an answer that is wrong, mark an \"X\" on to the grid for that choice. If you see an answer that you are unsure about between two, mark an \"O\" on the grid.On the verbal section where a question has multiple blanks to fill, you will probably end up with a question that you are not sure about on almost all the choices, of which you need to chain the \"O\"s together to see which one makes sense. There are only 6 combinations on 3 blanks, each with 2 unsure choices. Eliminate from those and you'll end up with 2 to 3 choices, and will raise your probability of success from 1/27 (3 choices on 3 blanks) to about 1/2.5 (2 choices on 3 blanks, with 3-4 of 6 combinations eliminated)Circle the question numbers that you are unsure of. When you're done with the section, you can zoom back quickly and identify the question you need to check and redo.ALWAYS PICK AN ANSWER. A guess still counts to points!Buy the flash cards and sleep with them. If you've already bought them but are not sleeping with them, start doing so now. Bring them around with you to dinner, to gaming, to socializing and on and on. Break the pile of flash cards into loops of 50 cards. Study through one loop each day, and move on to the next. On the two days after you've finished a loop, do a written test with the flashcard loop only showing the word but no definition. In seven days you'll have memorized 250 words for the GRE. Always pick from flashcards of a \"most frequent\" list to cover high probability words.The AWA is a joke. Lots of people lose unnecessary points on it because of cultural practices and because of the personality of writing they present that not all test assessors will like. It's a human reading your essay, not a robot, don't buy the argument that they don't make mistakes and don't judge your personal writing style.ANALYZE AN ISSUEFirst, take a look at the \"Analyze an Issue\" brief from the website:Write a response in which you discuss the extent to which you agree or disagree with the statement and explain your reasoningfor the position you take. In developing and supporting your position, you should consider ways in which the statement might or might not hold true and explain how these considerations shape your position.Write a response in which you discuss the extent to which you agree or disagree with the recommendation and explain your reasoning for the position you take. In developing and supporting your position, describe specific circumstances in which adopting the recommendation would or would not be advantageous and explain how these examples shape your position.Write a response in which you discuss the extent to which you agree or disagree with the claim. In developing and supporting your position, be sure to address the most compelling reasons and/or examples that could be used to challenge your position.Write a response in which you discuss which view more closely aligns with your own position and explain your reasoning for the position you take. In developing and supporting your position, you should address both of the views presented.Write a response in which you discuss the extent to which you agree or disagree with the claim and the reason on which that claim is based.Write a response in which you discuss your views on the policy and explain your reasoning for the position you take. In developing and supporting your position, you should consider the possible consequences of implementing the policy and explain how these consequences shape your position.Notice how all of them point out whether you agree or disagree, and why. Your first sentence in this section should always state the extent you agree or disagree. The second sentence should always highlight the major reasons why you agree or disagree, and ideally should be in Serial commaformat. \"... agree/disagree because of AAA, BBB, and CCC\"From those points, you have your paragraphs. Each paragraph should start with defining your exact argument, and be followed by a second sentence that explains how your argument connects/enhances/weakens the issue at hand. Pick arguments that build upon each other and in the summary paragraph, summarize them, and briefly restate your position.ANALYZE AN ARGUMENTTake a look at the model answer on the official site:Analyze an ArgumentWhen you look at the model answer here's the results it gives to these three important questions:Is the claim valid or not? Yes, it may be a valid claim to increase the funding. [Take note that it's very important to separate the validity of the claim and the validity of the reasoning behind the claim.]Is the reasoning behind the claim valid or not? No, the survey may be wrong in its scope, validity, and relevance. [There is almost always a numerical piece of data in the passage that could be attacked or could have its assumptions pointed out.]Are there problems in the logical structure that undermine the argument, but not the claim? Yes, the cause of the smell and low quality of the water has not been established to be able to be \"cleaned\" effectively, and that no causal link has been established between water quality and usage has been established. [This type of logical structure usually is slippery slope logic. Read below.]Note that the farther you deviate from the evidence at hand and spin your own theories, the more assumptions you make and the weaker your argument becomes. If you look at the score 5 and score 4 essays, their logical attacks are less well explained and less grounded on to the evidence and structure of the argument.Pay attention to Slippery slope structures like the example. A slippery slope generally builds on a long chain of seemingly reasonable assumptions to arrive at unreasonable or poorly supported arguments. Take this example of a mom warning a child not to goto a party, because a party might have bad kids, that might befriend the child in question, and over time might introduce the child to drugs or alcohol as they grow up, that might develop into an addiction, that might then ruin high school grades, then destroy chances at college admissions, and ultimately fail to secure a well paying job, then ruin the child's life. From each jump the logical leap may seem small, but in the end the argument becomes going to party = life ruined. Attacking the statistical validity, the logical connection between one argument and another, the assumptions made on the evidence that determines whether it is circumstantial or irrefutable become the major points of the essay. Avoid the urge to impress the writers by using fancy words and complex grammatical structures. Use the KISS principle and write in straightforward wording to allow your argument to come out with a strong tone.",
            "date": "Updated September 13, 2014",
            "views": "756",
            "upvotes": " View 300 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bhavin Parikh",
                    "user_href": "/profile/Bhavin-Parikh"
                },
                {
                    "user_id": "Lohit Malik",
                    "user_href": "/profile/Lohit-Malik-2"
                },
                {
                    "user_id": "Rita Omuero",
                    "user_href": "/profile/Rita-Omuero"
                },
                {
                    "user_id": "Anwesh Satapathy",
                    "user_href": "/profile/Anwesh-Satapathy"
                },
                {
                    "user_id": "Haritika Pandit",
                    "user_href": "/profile/Haritika-Pandit"
                },
                {
                    "user_id": "Asma Alhumaidi",
                    "user_href": "/profile/Asma-Alhumaidi"
                },
                {
                    "user_id": "Hrishi Sonar",
                    "user_href": "/profile/Hrishi-Sonar-3"
                },
                {
                    "user_id": "Mihir Thakkar",
                    "user_href": "/profile/मिहिर-ठक्कर-Mihir-Thakkar"
                },
                {
                    "user_id": "Aashaa Zahid",
                    "user_href": "/profile/Aashaa-Zahid"
                },
                {
                    "user_id": "Karthik Subramani",
                    "user_href": "/profile/Karthik-Subramani-32"
                },
                {
                    "user_id": "Youssef Aitousarrah",
                    "user_href": "/profile/Youssef-Aitousarrah"
                },
                {
                    "user_id": "Rainy R",
                    "user_href": "/profile/Rainy-R"
                },
                {
                    "user_id": "Vignesh Ramakrishnan",
                    "user_href": "/profile/विघ्नेश-रामकृष्णन-Vignesh-Ramakrishnan"
                },
                {
                    "user_id": "Ivan Torres",
                    "user_href": "/profile/Ivan-Torres-105"
                },
                {
                    "user_id": "Md Sazzad Hossain Oli",
                    "user_href": "/profile/Md-Sazzad-Hossain-Oli"
                },
                {
                    "user_id": "Lindsay Pimm",
                    "user_href": "/profile/Lindsay-Pimm"
                },
                {
                    "user_id": "Veevek Vyas",
                    "user_href": "/profile/Veevek-Vyas"
                },
                {
                    "user_id": "June June",
                    "user_href": "/profile/June-June-72"
                },
                {
                    "user_id": "Saima Sadaf",
                    "user_href": "/profile/Saima-Sadaf-1"
                },
                {
                    "user_id": "Gaurav Joshi",
                    "user_href": "/profile/Gaurav-Joshi-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arnab Datta",
                "href": "/profile/Arnab-Datta-17"
            },
            "answer_text": "I studied for one and a half months to prepare for GRE. I scored 324. Here are some tips: 1)\tPractice questions in half an hour sprints (20 questions in 30 mins). This will mimic test conditions and give you a feel of the exam. If you’re solving quant or verbal (sentence completion, sentence equivalence) then aim for 20 questions in 30 mins. If you’re solving verbal (reading comprehension) questions, then aim for 10 questions in 30 mins. (10 questions = 3 questions from one RC + 4 questions from another RC + 3 questions from one RC). 2)\tStudy vocab regularly. Vocab is the key to cracking the verbal section. I used the Baron’s list of 800 words (essential for GRE). Don’t just memorize the what is present in the flash card. Make sure you understand the application of the word in a sentence. I studied like this – I created a word file in which I would note down the meanings of words I did not know. As I went through the Baron’s 800 words, I noted down the words I did not know. I Googled the word and noted down a sentence where it was used as well. Later, once I had finished preparing, I would only revise the word list, not the entire Baron’s 800 file.) 3)\tDon’t spend too much time studying AWA (essay writing task and argument task). The essay task is usually abstract, and you have to write on a topic that is unfamiliar to you. It’s more about phrasing proper points and writing English properly than the actual content of the essay. The argument task is easy. Every argument is based on certain assumptions. You simply have to turn around each assumption and mention how that would weaken the argument. Read the essay and argument writing chapters in the Manhattan Prep 5lb. Book. They have brilliant material. The AWA section (essay and argument task combined) gives you a score out of 6. If you score more than 3.5 out of 6, you’re good to go. 4)\tGive equal weightage to verbal and quant. (340 = 170 for quant + 170 for verbal which does not include AWA). You may feel that you are better in quant, so you’ll score more in quant and less in verbal which will balance your score. This is not true. College cutoffs are like 150 for verbal and 155 for quant. Materials- 1)\tSolve all the questions from the Official Guide to the GRE General Test Book first. After you’re done move to the Manhattan Prep 5 lb Book of Practice Questions. 2)\tThe Manhattan Prep 5 lb. Book has chapters of each question type in verbal (Sentence Completion, Sentence Equivalence, RC, etc.) and quant (each chapter of math). Be sure to solve at least 20 questions from each chapter before giving GRE exam. This will make sure you’re prepared. Study pattern - Practice questions in 30 min bursts, take a break, practice questions in another 30 min burst and so on. Once you get comfortable with the pattern, start solving questions in 1 hour bursts. Study plan – Study for 1-2 hours every day. On weekends put in 6 hours. Don’t study on the day before the exam. Just revise vocab if you want to. Exam pattern – 1 hour AWA (30 mins essay task + 30 mins argument task) 1 hour quant (30 min quant section + another 30 min quant section) 10 min break 1 hour verbal (30 min verbal section + 30 min verbal section) 30 min experimental section (either quant or verbal, you won’t know which until you give the exam.) The experimental section is unscored (it is used to try out new questions). IT IS NOT GUARANTEED THAT THE EXPERIMENTAL SECTION WILL COME AT THE END. IT CAN COME BEFORE ALSO, YOU WILL NOT KNOW. SO GIVE YOUR BEST IN ALL THE SECTIONS. Mock tests – I gave only 2 mock tests (GRE PowerPrep I and II). They are available for free while you sign up for the GRE exam. If you have the Official Guide to the GRE General Test Book, then you will find 2 mock tests in there as well. Try to mimic test conditions while giving the mock tests. Do not take breaks in the middle. Kudos to my friend Sitangshu Chatterjee for supplying all the book PDFs online at GRE PREPARATION MATERIALS - Google Drive PS: I was good in English since my school days. I read a ton of books and I write on my own personal blog as well. It is possible that you will require more time to prepare than I did, but don’t worry about that. Prepare according to what feels right for you. Hope this information was useful to you. All the best, you will ace the exam. 😊 ",
            "date": "Updated November 19, 2019",
            "views": "53",
            "upvotes": " View 50 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gloryjah Robinson",
                    "user_href": "/profile/Gloryjah-Robinson"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Casablanca-23"
                },
                {
                    "user_id": "Yashwini Tiwari",
                    "user_href": "/profile/Yashwini-Tiwari"
                },
                {
                    "user_id": "Ahmed Matter",
                    "user_href": "/profile/Ahmed-Matter-8"
                },
                {
                    "user_id": "Titilayo Adewale Fasoro",
                    "user_href": "/profile/Titilayo-Adewale-Fasoro"
                },
                {
                    "user_id": "Rita Omuero",
                    "user_href": "/profile/Rita-Omuero"
                },
                {
                    "user_id": "Utsav Gupta",
                    "user_href": "/profile/Utsav-Gupta-20"
                },
                {
                    "user_id": "Aswathy Babu",
                    "user_href": "/profile/Aswathy-Babu-7"
                },
                {
                    "user_id": "Anwesh Satapathy",
                    "user_href": "/profile/Anwesh-Satapathy"
                },
                {
                    "user_id": "Vathsala",
                    "user_href": "/profile/Vathsala-2"
                },
                {
                    "user_id": "Jitesh Gurav",
                    "user_href": "/profile/Jitesh-Gurav"
                },
                {
                    "user_id": "Svetlana Ivanova",
                    "user_href": "/profile/Svetlana-Ivanova-21"
                },
                {
                    "user_id": "Aparna",
                    "user_href": "/profile/Aparna-350"
                },
                {
                    "user_id": "Meet Alodariya",
                    "user_href": "/profile/Meet-Alodariya"
                },
                {
                    "user_id": "Sree Harsha",
                    "user_href": "/profile/Sree-Harsha-138"
                },
                {
                    "user_id": "Tanvi Malhan",
                    "user_href": "/profile/Tanvi-Malhan"
                },
                {
                    "user_id": "Vinith Angadi",
                    "user_href": "/profile/Vinith-Angadi"
                },
                {
                    "user_id": "Abhi Latpate",
                    "user_href": "/profile/Abhi-Latpate"
                },
                {
                    "user_id": "Alexandra Masgras",
                    "user_href": "/profile/Alexandra-Masgras"
                },
                {
                    "user_id": "CEN XIN",
                    "user_href": "/profile/CEN-XIN-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vince Kotchian",
                "href": "/profile/Vince-Kotchian"
            },
            "answer_text": "Here's my 2 cents. Warning - this post is long, but I wanted to include everything I thought was helpful. Take whatever you find useful. 1. Get a baseline score by taking an official practice GRE. You can find one here. 2. Set a realistic score goal + start planning and scheduling your study time. 3. Foundational skills: Vocab: learn 5 words a day from GRE Vocab Capacity. Make flashcards with this method, and guide your study with this chart. Learn word roots, too.Reading Comprehension: spend 30 min. per day reading anything from Arts and Letters Daily, the New Yorker, or the Economist. Read about all kinds of different topics.Math: Use the Manhattan GRE books (if you have more time) or Cliffs Notes Math for Standardized Tests (if you have less time) to build math skills. Use Chapter 7 (the math review) in the Official Guide as well. For those of you who haven’t done math in years, I also recommend my Everyday Math Fundamentals video course. Watch my free GRE videos, too. And finally, I’ve also made a spreadsheet that classifies the math questions in the Official Guide by concept and technique.Essays: read Chapter 2 and all sample essays and commentary in The Official Guide, as well as those in the verbal practice book. Read and brainstorm the topics for the Issue essay and the topics for the Argument essay.Logic: Get The Official Guide for GMAT Verbal (any edition) and work on Critical Reasoning questions.4. Technique: As a tutor, I teach you techniques for all parts of the test and for time management. But if you aren’t going to work with me privately, check out my technique videos, which offer you the same techniques I teach my clients, demonstrated on actual GRE questions. 5. Practice materials: The Official Guide and its verbal and quantitative supplements. I’ve explained many of the quantitative questions on my YouTube channel. Foundational practice is done untimed. This is your chance to work on concepts and techniques without time pressure.Timed practice is best done once your skills and techniques are sharper. Supplement with Manhattan’s online practice tests (which are available with the purchase of any one of their GRE strategy guides).Always circle troublesome questions or questions you guessed on.Don’t write in your books – when you review questions, they should be blank.6. Review – the most important step!  Review problems, identifying what was tested, ideal technique, and takeaways. You should be reviewing problems you got right as much as you review ones you missed. You should tell me about questions you have trouble doing this with.Now go back and work on concepts and techniques until you’re ready to practice again!",
            "date": "Answered July 25, 2015",
            "views": "91",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Apoorva Choudhary",
                    "user_href": "/profile/Apoorva-Choudhary-30"
                },
                {
                    "user_id": "Mounika Keerthi",
                    "user_href": "/profile/Mounika-Keerthi-3"
                },
                {
                    "user_id": "Urbija Goswami",
                    "user_href": "/profile/Urbija-Goswami-1"
                },
                {
                    "user_id": "Pratik Roy",
                    "user_href": "/profile/Pratik-Roy-45"
                },
                {
                    "user_id": "Malvika Rk",
                    "user_href": "/profile/Malvika-Rk"
                },
                {
                    "user_id": "Chayanika Samanta",
                    "user_href": "/profile/Chayanika-Samanta"
                },
                {
                    "user_id": "Thamson Antony",
                    "user_href": "/profile/Thamson-Antony-2"
                },
                {
                    "user_id": "Laxmikant Vishwakarma",
                    "user_href": "/profile/Laxmikant-Vishwakarma"
                },
                {
                    "user_id": "Devalla Thapasvini",
                    "user_href": "/profile/Devalla-Thapasvini-1"
                },
                {
                    "user_id": "Harmanpreet Kaur",
                    "user_href": "/profile/Harmanpreet-Kaur-237"
                },
                {
                    "user_id": "Yashas Gowda",
                    "user_href": "/profile/Yashas-Gowda-107"
                },
                {
                    "user_id": "Deepansh Bhargava",
                    "user_href": "/profile/Deepansh-Bhargava"
                },
                {
                    "user_id": "Rachel Jyothi Gandhi",
                    "user_href": "/profile/Rachel-Jyothi-Gandhi"
                },
                {
                    "user_id": "Shubhda Shail",
                    "user_href": "/profile/Shubhda-Shail"
                },
                {
                    "user_id": "Devireddy Renuka",
                    "user_href": "/profile/Devireddy-Renuka"
                },
                {
                    "user_id": "Shreya Ekande",
                    "user_href": "/profile/Shreya-Ekande-1"
                },
                {
                    "user_id": "Debolina De",
                    "user_href": "/profile/Debolina-De-4"
                },
                {
                    "user_id": "Shubha Joshi",
                    "user_href": "/profile/Shubha-Joshi-6"
                },
                {
                    "user_id": "Nandini Mittal",
                    "user_href": "/profile/Nandini-Mittal-14"
                },
                {
                    "user_id": "Pradyun Anthati",
                    "user_href": "/profile/Pradyun-Anthati-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suketu Parekh",
                "href": "/profile/Suketu-Parekh-2"
            },
            "answer_text": "I took the GRE on 30th January. My score was 155V 170Q and 4.0 in AWA. Many must be preparing to take GRE in this lockdown time. So here are some of the points which I think will be useful. It is based on my experience so are not imposed but some of my friends had similar experiences. *For verbal:* NL session words are of utmost importance. You will find it everywhere; including RCs. I would suggest after doing NL session words, go with Barron's 333 high frequency word list. After that, focus on RC as they constitute half (literally 50%) of verbal sections. For RC, I started by 60 RC given by my coaching classes. After that, I did some of Manhattan 5lb ( *do not go for Princeton right away, it will get you scared* ). It is completely okay to have 50-60% accuracy or lower at this time. *Do not miss to read the explanation.* I did the mistake of just reading the correct answers and moving on. Prefer timed practice after some initial practice. RC *will take away your time* and it is only wise to check it while maintaining the accuracy. Do NOT use your lips while reading. Let it just be in your head. Involving lips will reduce your speed. Ideal time for long passages is about 2.5-3 min per passage and that for short ones is 1.5-2 min but it is okay if you are behind by 15-20sec. *Words*. I invested quite a lot of time in learning words. I feel it would have been better if I gave more practice to RC (really). NL session words, Barron's 333 and some *high frequency word list* that you can easily find on the internet should be more than enough. (This is my *opinion* based on my exam. Your case may vary but this was consistent for my friends who gave exams in early March as well). It is difficult to judge the difficulty of Verbal sections in the actual GRE so do not get disappointed if you feel like your section is easy. *For Quant*: Quant is pretty easy for us students with engineering background (you probably know that). It is all about speed with accuracy. I rarely find anyone not being able to solve a question. It is just some slip of pen errors or silly errors that take away the marks. Manhattan 5lb will give you speed practice. I found my actual GRE Quant on a bit of tougher side. *P&C, Probability and Statistics* can be the parts on which one may be struggling. But I suppose some practice will suffice for it. Some questions are intentionally tricky and needs some critical thinking and confidence. (I remember I had a question in part 2 which had 7 options and *all* of them were correct). Practice *Quantitative Comparison* more. It will help you think in more ways. *For AWA*: This section is dependent majorly on your typing speed and the time you will take to bring in logical points. I went in with reading 5-6 responses of each and some practice in mocks. It is important to note that many test takers report exhaustion after the AWA section. You should be relaxed while writing this section. *Others*: I gave about 6 mock tests. 2 of GRE and 5 of Kaplan. Powerprep will give you closest estimation of your actual score. Do NOT get intimidated by any YouTube videos or any ads or by listening to anyone else's score. GRE is also about keeping your calm and composure. Edit: “NL” mentioned in the Verbal part stands for Norman Lewis. It is a colloquial term used which I learnt is not very common form the doubts that I used to get. NL refers to the book 'Word Power Made Easy by Norman Lewis' (that thick Red coloured book). Hope it clarifies some of the doubts. ",
            "date": "Updated September 1, 2020",
            "views": "22",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gloryjah Robinson",
                    "user_href": "/profile/Gloryjah-Robinson"
                },
                {
                    "user_id": "Parneet Kaur",
                    "user_href": "/profile/Parneet-Kaur-399"
                },
                {
                    "user_id": "Krishna Patel",
                    "user_href": "/profile/Krishna-Patel-343"
                },
                {
                    "user_id": "Muhammad Ibrahim",
                    "user_href": "/profile/Muhammad-Ibrahim-1-2"
                },
                {
                    "user_id": "Anudari Bayar",
                    "user_href": "/profile/Anudari-Bayar"
                },
                {
                    "user_id": "Bhoomika Goel",
                    "user_href": "/profile/Bhoomika-Goel"
                },
                {
                    "user_id": "Sonal Yadav",
                    "user_href": "/profile/Sonal-Yadav-75"
                },
                {
                    "user_id": "Arun Pal",
                    "user_href": "/profile/Arun-Pal-9"
                },
                {
                    "user_id": "Srinidhi Reddy",
                    "user_href": "/profile/Srinidhi-Reddy-19"
                },
                {
                    "user_id": "Rajnikant Yadav",
                    "user_href": "/profile/Rajnikant-Yadav-18"
                },
                {
                    "user_id": "Nasir Aziz",
                    "user_href": "/profile/Nasir-Aziz-21"
                },
                {
                    "user_id": "P Vinay Kumar",
                    "user_href": "/profile/P-Vinay-Kumar-7"
                },
                {
                    "user_id": "Akshay Padiyar",
                    "user_href": "/profile/Akshay-Padiyar-2"
                },
                {
                    "user_id": "B K",
                    "user_href": "/profile/B-K-1364"
                },
                {
                    "user_id": "Pavan",
                    "user_href": "/profile/Pavan-608"
                },
                {
                    "user_id": "Divam Kesharwani",
                    "user_href": "/profile/Divam-Kesharwani"
                },
                {
                    "user_id": "Preetanshu Shukla",
                    "user_href": "/profile/Preetanshu-Shukla"
                },
                {
                    "user_id": "Madhan Thota",
                    "user_href": "/profile/Madhan-Thota-1"
                },
                {
                    "user_id": "Sanjeev Tarigopula",
                    "user_href": "/profile/Sanjeev-Tarigopula-1"
                },
                {
                    "user_id": "Nc Bassey",
                    "user_href": "/profile/Nc-Bassey"
                }
            ]
        },
        {
            "author_info": {
                "name": "SriHarsha Bolisetti",
                "href": "/profile/SriHarsha-Bolisetti"
            },
            "answer_text": "When I was preparing for GRE I noticed several mistakes I did and my friends did. Avoid these common mistakes to get high score. Don’t scrimp on study materials. Trying to save some bucks by not buying some good (expensive) study materials will get you nowhere.I know some people who were reluctant to buy study aids like Manhattan GRE Guide since they are a bit expensive.This is not about Manhattan if you think of a book which can help you in your preparation but cost a little more then go get it! You have to spend some lakhs of rupees for masters. Saving few thousands by not buying good material is not advisable.Take GRE Practice Tests every weekend. Many people save practice tests for last 10 days before exam. I do not recommend this strategy, instead I advise you to do practice tests every weekend since it helps you to identify your weak areas, so you can concentrate more on them.Do not underestimate quantitative section of New GRE. Please do not make a mistake of underestimating quants. Many of us are of impression that getting through quants section is just a cake walk (even I was under the same impression). Remember GRE math isn’t hard but it’s tricky. Without enough practice and proper strategies it can turn out to be a major score bummer. Guys, Quants is the scoring part of GRE and we Indians are good at maths so with enough practice it can boost up our score.Verbal section isn't just about vocabulary. You can’t crack verbal section of GRE just by learning words, however that doesn’t mean vocab is useless. You need vocabulary for Text completion and Sentence equivalence. As ETS states emphasis on vocab is reduced and I experienced this first hand. Please note that 50% of question in verbal were from RC’s where vocab doesn’t help you much. Even in sentence Equivalence and Text Completion, you have to focus on nuances in sentences and learn to work in context. Just to say, I know many people who memorized 5000 wordlist and scored less than 145. Take away – Without vocabulary you can never beat verbal section. Just with vocabulary the result is the same. You need to know more than words to slay the verbal monster.Try to do 5 sections in practice tests instead of 4. This is a major score bummer for me, I don’t know how many people feel the same but it affected me and all my friends. In general, majority of practice tests have only 4 sections (2 verbal and 2 quants),most of them do not have the 5th section i.e. unscored section which we will find in real GRE. I did 8 practice tests (7 CAT and 1 paper based) in all these there were only 4 sections and I was tuned to expect score after 4 sections. Even we all know that there would be an additional section in real GRE... I couldn’t focus on the last section and I petered out. Practicing 5 sections instead of 4 surely helps as it reflect the test conditions more accurately.Official guide and power prep are must do things. I came across many people who plan to attempt GRE without using Official GRE guide. If you are serious about GRE then you should definitely get official guide, no other test prep book is equivalent to Official guide. Similarly no other practice test can reflect real GRE as powerprep does. I didn’t do powerprep until last moment as I had some problems in installing power prep in my pc and finally I took test on my friends laptop and it is very helpful.No last minute preparation. Preparing on test day is an absolute no-no. I saw people in test center solving Barron’s and Kaplan, this would never help you and in bonus you can get stressed too much. I would also strongly recommend that you try to relax and rejuvenate your mind before the test. Make sure to get a good night’s sleep and have some time where you are not studying. Going into the test stressed is not an asset. Kindly note that GRE is all about testing you under stress.LAST BUT NOT LEAST. If you want to get a good (high) score on GRE …you have to work hard and smart …just by buying books,downloading practice tests ..you cannot achieve high scores.. Remember there is no magic formula which can make you virtuoso overnight ,you have to work sedulously. “There are no shortcuts to success”.Don’t make the above mistakes and stultify months of hard work! ",
            "date": "Answered November 12, 2013",
            "views": "43",
            "upvotes": " View 135 Upvoters ",
            "upvoters": [
                {
                    "user_id": "NJ Patel",
                    "user_href": "/profile/NJ-Patel-1"
                },
                {
                    "user_id": "Milan Tripathi",
                    "user_href": "/profile/Milan-Tripathi"
                },
                {
                    "user_id": "Nafiz Imtiaz",
                    "user_href": "/profile/Nafiz-Imtiaz-41"
                },
                {
                    "user_id": "Shreya Saxena",
                    "user_href": "/profile/Shreya-Saxena-33"
                },
                {
                    "user_id": "Rita Omuero",
                    "user_href": "/profile/Rita-Omuero"
                },
                {
                    "user_id": "Chamil Liyanage",
                    "user_href": "/profile/Chamil-Liyanage"
                },
                {
                    "user_id": "Mubashir Ali Sangal",
                    "user_href": "/profile/Mubashir-Ali-Sangal"
                },
                {
                    "user_id": "Tanjina Alam",
                    "user_href": "/profile/Tanjina-Alam"
                },
                {
                    "user_id": "Marybeth Benton",
                    "user_href": "/profile/Marybeth-Benton"
                },
                {
                    "user_id": "Manisha Sharma",
                    "user_href": "/profile/Manisha-Sharma-194"
                },
                {
                    "user_id": "Elizabeth Craig",
                    "user_href": "/profile/Elizabeth-Craig-37"
                },
                {
                    "user_id": "Vikram Bath",
                    "user_href": "/profile/Vikram-Bath"
                },
                {
                    "user_id": "Shreya Banthi",
                    "user_href": "/profile/Shreya-Banthi"
                },
                {
                    "user_id": "Reasat Chowdhury",
                    "user_href": "/profile/Reasat-Chowdhury"
                },
                {
                    "user_id": "Pallavi Gatkal",
                    "user_href": "/profile/Pallavi-Gatkal"
                },
                {
                    "user_id": "Steph Cab",
                    "user_href": "/profile/Steph-Cab"
                },
                {
                    "user_id": "Abhishek Joshi",
                    "user_href": "/profile/Abhishek-Joshi-66"
                },
                {
                    "user_id": "Tushar Chhipa",
                    "user_href": "/profile/Tushar-Chhipa"
                },
                {
                    "user_id": "Anggie Pratama",
                    "user_href": "/profile/Anggie-Pratama"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ayush Kumar",
                "href": "/profile/Ayush-Kumar-68"
            },
            "answer_text": "Quant - 170 Verbal- 164 AWA- 4.5/6 I recently gave my GRE on 28th September 2017. Although I started my preparation 3 months prior to the examination I could not continue due to the fact that I am also preparing for other competitive exams. Also I was put down by Chicken pox and Typhoid for a month. Effectively I had little more than a month to prepare for the test. So I was quite surprised with the result that I got as you can see above. Here is how I prepared for my GRE test. Study Material - Magoosh GRE prep account (most important)Magoosh Vocabulary builder (words flashcard app)Manhattan prep GRE 5 lb. book of gre practice problemsManhattan GRE Prep Reading comprehension and EssayOfficial Guide for GRE by ETS (all three books)Various news sites such as The New Yorker , The Economist etc. ( as prescribed on Magoosh GRE blog).Study Plan - I started my preparation at the start of the month of July . As I told earlier I am also studying for other competitive exams so I could’nt devote much time to GRE. I studied for maximum 3 hours each day. I also did’nt study according to any plan. Some days it was only vocab building by flashcards and reading articles. Some days it was practicing problems Some days divided between both. Also I watched Magoosh GRE video lessons and I can say they were very useful.This is a tip for students from engineering background preparing for GRE. Don’t ignore the quantitative section even if it seems easy to you. Practice it as you would the verbal section.After recovering from my maladies I had approx 5 weeks to prepare for GRE. So I decided to tidy up my routine soI increased my GRE study time to 5–6 hours per dayIn a day I would first go through my magoosh flashcards and try to learn atleast 30 new words per day and also revise a few old words. Also I made a point to read and understand atleast 2 news articles per day .Then I would practice quantitative for approx 1 hour . I generally used timed custom practice test in Magoosh GRE account.For next 2 hours I would go through practicing the verbal section and writing essays.I learnt how to read the paragraphs swiftly and in detail. Again Magoosh video lessons were very important in this regard.Unfortunately I was not able to give any full practice test due to my surroundings but I would recommend everyone to give atleast one of them.My main focus was on improving my vocab by learning new words , their meaning and context of their uses as it appeared to me to be very useful for Sentence equivalence and Text completion questions. Again and I cannot stress this enough watching Magoosh video lessons was very important.I practiced and practiced as much as my schedule allowed me to.On the day of the examination Reach the centre atleast 1 hour prior to the commencement of test as there are plenty of verification to be done before the examination. Also carry a water bottle with you. GRE is very attentively conducted examination and staff of testing centres are very vigilant. If you have any problem feel free to ask for their help. GRE is a very easy exam as you can see in my case , with a directed and concentrated approach you can score very well ( 330+) within a relatively short amount of prep time. Be well , Be prepared and best of luck. ",
            "date": "Updated August 10, 2018",
            "views": "60",
            "upvotes": " View 396 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gowtham Jaganathan",
                    "user_href": "/profile/Gowtham-Jaganathan-8"
                },
                {
                    "user_id": "Bhargav Yagnik",
                    "user_href": "/profile/Bhargav-Yagnik-2"
                },
                {
                    "user_id": "Parneet Kaur",
                    "user_href": "/profile/Parneet-Kaur-399"
                },
                {
                    "user_id": "Preeti Kapse",
                    "user_href": "/profile/Preeti-Kapse-1"
                },
                {
                    "user_id": "Sai Praveen",
                    "user_href": "/profile/Sai-Praveen-255"
                },
                {
                    "user_id": "Xinyu Wei",
                    "user_href": "/profile/Xinyu-Wei-19"
                },
                {
                    "user_id": "Adhitya R M",
                    "user_href": "/profile/Adhitya-R-M"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gaurav Mokhasi",
                "href": "/profile/Gaurav-Mokhasi"
            },
            "answer_text": "I put in 2 months of prep for the GRE (1 at home in the semester break, and the second at college) and wouldn't recommend preparing for the exam for more than 2 months (you might forget stuff and hey, there are better things to spend time on). Pre-prep, I would describe my quant skills as good (at par with any Indian engineering student at an NIT) and my vocabulary as wanting. Keeping that and the 2 month timeline in mind, I would recommend the following plan of action. If you have more than 2 months before your test: Buy this book! - Word Power Made Easy -  It's insanely cheap and a great primer to learning vocabulary. I had a lot of fun doing its exercises. However, not a lot of words from here will show up on the actual GRE. So, you might skip it if you're short on time.2 months before the test: Register on the site (ETS Home) and book a test date.Get these 2 books:The Official Guide to the GRE Revised General Test with CD-ROM, 2nd Edition (If you have to choose one, get this since it's by the makers of the GRE - ETS)Barron's New GRE 2013 19th EditionPrep: I started preparing with Barron's and gave the diagnostic test first up. Based on your performance here, you can figure out areas that you really need to work on and come up with a target score that you want to hit. eg. GRE Scores for Science ProgramsI was at home for the holidays. So I dedicated like an hour daily to solving the exercises in Barron's (maybe a couple of hours on weekends).I would recommend doing a few questions of one type and then switching to another, instead of doing all the practice questions in a particular chapter at once. Solve even the examples and pay special attention to the explanations for all the answers. I found the explanations for practice test answers especially helpful.I did not do any math from Barron's as I had found that at least for the SAT, Barron's has a lot of unnecessary and difficult content.Go through everything in the ETS book. The explanations aren't particularly helpful, but the questions are really good. Do all of them. Again, I didn't do the math questions but I did read the math review. I would recommend going through the data analysis, statistics and probability parts properly as some of these questions can be a little tricky.Math is easy but be careful not to make silly mistakes. From what I inferred from the practice tests, you need to practically get all the questions right to get a perfect quant score.I had some trouble with reading comprehension questions. Here, Arjun Narayanan's tip of taking small notes as you read through the passage really helped. I found that I was able to concentrate more when I did this.Vocab: I highly recommend the Free GRE Vocabulary Flashcards by Magoosh. I got the Android app and started drilling with them a month before the test. Several times, the GRE uses secondary meanings of words and the app does a good job of illustrating these meanings with nice examples. For a free resource, Magoosh is incredibly good and I would recommend reading their GRE blog once in a while.Write down words that you find difficult. Maybe even make flashcards of your own.Attribute difficult words to settings you are familiar with - traits of your friends, characters from books and TV shows, etc.Use them in conversation (the jokes your friends make about your attempt at grandiloquence may actually help you remember a word's meaning better than any app), throw them into your writing and make mnemonics. Basically, whatever works to make them stick!Like the New Yorker on facebook and read articles about topics that interest you. Each time you see an unfamiliar word, try guessing its meaning based on context and then cross-check using \"define <word>\" on google. A couple of days before the test, reset your Magoosh word app and just go through all the words again to ensure you know most. If you forget a few advanced ones, don't panic. The probability of them showing up on the test is pretty low.Practice Tests: Both Barron's and the ETS guide give you 2 paper based tests and 2 computer based tests. The GRE is a long exam (~4 hours) that at times feels like an endurance test. So I would definitely recommend giving a few practice tests before the exam, just so you know how to pace yourself.The tests on Barron's don't give you a scaled score and should be thought of more as practice than a serious indicator of how you would perform on the GRE. I gave 1 paper based test 2 weeks in and 1 more a month in. I did not do the computer based tests offered by Barron's.Take the ETS practice tests much more seriously, especially the POWERPREP II Software tests (that you can access either from the CD that accompanies the book or from the website via download). These are very similar to the actual test in terms of difficulty and offer the exact same interface. Make sure you take the tests timed and simulate test day as much as possible. Go through the answers properly to see what you got wrong.I took all 4 ETS tests and alternated between paper and computer. I gave my last practice test (computer based) 5 days before my actual GRE.Analytical Writing Assessment: You can download the AWA prompts from the Argument and Issue pools and just go through them in your leisure time. Read the sample responses and their analysis available in the ETS guide to gain an understanding of what they look for. Make sure you pack everything necessary on the day before and...on the day of the test:   Cheers! ",
            "date": "Updated February 28, 2015",
            "views": "1223",
            "upvotes": " View 826 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pallvi Sharma",
                    "user_href": "/profile/Pallvi-Sharma-40"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Casablanca-23"
                },
                {
                    "user_id": "Apurv Rathore",
                    "user_href": "/profile/Apurv-Rathore-1"
                },
                {
                    "user_id": "Ravi Gautam",
                    "user_href": "/profile/Ravi-Gautam-29"
                },
                {
                    "user_id": "Jaya Badlani",
                    "user_href": "/profile/Jaya-Badlani-1"
                },
                {
                    "user_id": "Andrew Komopo",
                    "user_href": "/profile/Andrew-Komopo"
                },
                {
                    "user_id": "Bhoomika Goel",
                    "user_href": "/profile/Bhoomika-Goel"
                },
                {
                    "user_id": "Amardeep Singh",
                    "user_href": "/profile/Amardeep-Singh-966"
                },
                {
                    "user_id": "Himanshi Singh",
                    "user_href": "/profile/Himanshi-Singh-60"
                },
                {
                    "user_id": "Arun Pal",
                    "user_href": "/profile/Arun-Pal-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mitul Jhaveri",
                "href": "/profile/Mitul-Jhaveri"
            },
            "answer_text": "Here is how I prepared for the test: 1.Verbal: I will break this up into two sub-categories namely vocabulary and actual practice of the questions. a) Vocabulary: I did the Magoosh flashcards, watched an entire video series called 'Vocab Wednesday' by Magoosh on YouTube and I made sure I knew all the words in the Official Guides. I used an app called Quizlet for the latter two wherein you can make your own flashcards and learn the words. However important learning words is, do not think that you will master Text Completion and Sentence Equivalence just by cramming a bunch of flashcards. I can't stress on how important it is to read daily whereby you will encounter a word you just learnt and that will help to stick the word in your mind. Read from sources like NYTimes, Economist, New Yorker etc.  b) Practice: I did verbal practice from Magoosh subscription and ETS Official Guides. Practice more and more questions especially Reading Comprehension as this is often the weakest part of most Indian Engineering students. Don't just practice questions and see which one's you got right and which one's wrong, focus on why an answer is right or why it is wrong, it will help you see how ETS prepare questions and what their wrong answer choices encompass of. Again, do not think that once you've completed a couple of sets of Vocabulary flashcards, you will be able to answer Text Completion and Sentence Completion correctly, sufficient practice is very important. 2. Quantitative: From the perspective of an average Indian engineering student, this section is easier than the much more dreaded verbal section. However, do not get overconfident by thinking 'how easy' it is. It is very important to know the various question types and practice for the same. GRE tests the application of basic concepts so do make sure that you study them. Temperament during the test is another important aspect during the test, especially in this section. Make sure you read the entire question properly and take your time on the questions, especially Quantitative Comparison questions as they tend to be tricky. I practiced maths from the following sources: ETS Official Guides, Manhattan GRE 5lb ( this is an absolute must!), Magoosh and I did one question type from The Official Guide to GMAT as they tend to be tougher than the GRE questions. All in all, it is very much possible to get a perfect score on this section- good. sufficient practice and temperament should do it. 3. Practice Tests: I took the following practice tests with the score I received in each: Magoosh Practice test (327) ETS Official Guide Practice test 1 ( 324) ETS Official Guide Practice test 2 (332) Manhattan test 1 (322) Manhattan test 2 (327) ETS Powerprep test 1 ( 326) ETS Powerprep test 2 (329)- This was two days before my actual GRE and according to me, the best indicator of your score. I would suggest you to take the Powerprep test 1 at the start of your preparation so you know where you stand and what aspects you need to spend more time on. It is important to take practice tests but do not give a lot of them as they can be very exhausting. Do not start taking practice tests once you complete your entire portion. A lot of practice tests in a short time can be quite mentally draining. Take a practice test maybe every couple of weeks to gauge the difference in your performance. Take the tests along with essays as it is very taxing and it will help you prepare for your actual test. Also, all the practice tests have four sections each and the actual test has five sections. It may not seem much of a difference but I was mentally drained during the fifth section during my test. So whenever you take a practice test, just add a mixed practice section, either quantitative or verbal so it will help you practice to concentrate through essays+5 sections. Take your practice tests in the time slot in which you are going to take the actual test. These nuances may not seem very important, but it is these things that will make a difference to your test score. I hope this helps! ",
            "date": "Answered February 2, 2016",
            "views": "78",
            "upvotes": " View 58 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gowtham Jaganathan",
                    "user_href": "/profile/Gowtham-Jaganathan-8"
                },
                {
                    "user_id": "Siddharth",
                    "user_href": "/profile/Siddharth-190"
                },
                {
                    "user_id": "Parneet Kaur",
                    "user_href": "/profile/Parneet-Kaur-399"
                },
                {
                    "user_id": "Pulkit",
                    "user_href": "/profile/Pulkit-144"
                },
                {
                    "user_id": "LEHA DUTTA",
                    "user_href": "/profile/LEHA-DUTTA-2"
                },
                {
                    "user_id": "K.M. Siddharth",
                    "user_href": "/profile/K-M-Siddharth"
                },
                {
                    "user_id": "CM",
                    "user_href": "/profile/CM-426"
                },
                {
                    "user_id": "Jalakandeshwaran R(Jalax)",
                    "user_href": "/profile/Jalakandeshwaran-R-Jalax"
                },
                {
                    "user_id": "Sharayu Jadhav",
                    "user_href": "/profile/Sharayu-Jadhav-4"
                },
                {
                    "user_id": "Sathish N Kumar",
                    "user_href": "/profile/Sathish-N-Kumar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chantelle D'Silva",
                "href": "/profile/Chantelle-DSilva"
            },
            "answer_text": "Thanks for the A2A! Here are some strategies I followed while preparing for the GRE. Keep them in mind as you plan your own preparation. Quants: The topics the questions are based on are simple, it is the questions that are tricky.The GRE mentions certain instructions - read the question carefully, figures are not drawn to scale, etc - which seem fairly obvious. However, since we’re always in a hurry to solve the sum and move on, we tend to make silly mistakes, which will cost us that easy extra point in the exam.One method I personally found useful to fix this was using Manhattan’s 8 Strategy guides. These books actually detail a majority of the types of tricks the GRE will use to trick you. Compiling a list of tricks that I always seemed to fall for and revising them before every test I gave, helped keep me aware of the possible tricks I could encounter as soon as I saw a sum, thus improving my accuracy.Aim to maximize your quants score as far as possible. Practice a lot, the Manhattan 5 lb. book has a lot of great sums. Solve from the ETS Official books without fail.Verbal: Start the word lists as early as possible, ideally much before you start actual prep even. Use the time you take to travel to and from college or work to do these words. The word lists I did were Magoosh (excluding advanced), Manhattan and Barrons 1100.Another thing to practice beforehand is reading. GRE Reading Comprehensions are dreaded by all. The language can be quite tough and attempting to understand it can drain your mental energy. Couple that with long, winding passages? You just might fall asleep in the middle of the RC itself. Train yourself not only to read long passages and but to read those passages with the same attentiveness throughout. Building this stamina will help you on test day, when sitting for nearly four hours straight will already be a drain on your energy.For the individual Verbal question types, the only mantra is practice, practice and practice. But don’t just blindly solve 100 questions at a go, as tempting as that may be. Solve sets of 20 questions of a particular question type, note down the mistakes made and reflect on what could be done to rectify it. Note down these strategies and read through them from time to time, especially emphasizing on mistakes that you make often.ETS Official books, Manhattan 5 lb, Princeton’s 1014 GRE Questions (for TCs and SEs) and Verbal Grail (for RCs) were some of the books I used. Many people swear by Word Power Made Easy for building language as well, although I’ve never used it. A lot of the articles on the Magoosh blog are also helpful in devising strategies to solve particular question types.Tests: Give as many tests as you can. The GRE is a long exam. Therefore, it is necessary to build up the stamina to maintain your focus throughout the exam.AWA: AWA was a last moment thing for me. Went through the Manhattan AWA Strategy Guide and picked up a few pointers, which I then applied on exam day.Practice a few essays beforehand. You should make sure that you are able to complete them while ensuring that they were also of appropriate length.Lastly, finding a group of friends or a buddy at work who is giving the GRE as well is definitely a boon. A bunch of my friends gave the GRE at the same time as I did and discussing words from time to time, sharing resources and solving each others doubts definitely helped sharpen my own skills. If you prefer a week by week plan, check out this answer : Suhail Barot's answer to How should I prepare for the GRE in one month to score 320+? Hope this helps :) ",
            "date": "Answered June 18, 2017",
            "views": "7",
            "upvotes": " View 46 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gowtham Jaganathan",
                    "user_href": "/profile/Gowtham-Jaganathan-8"
                },
                {
                    "user_id": "Chintaluri Atreya",
                    "user_href": "/profile/Chintaluri-Atreya"
                },
                {
                    "user_id": "Chaity Dey",
                    "user_href": "/profile/Chaity-Dey"
                },
                {
                    "user_id": "Mayank Dhiman",
                    "user_href": "/profile/Mayank-Dhiman-8"
                },
                {
                    "user_id": "Bazella Ashraf",
                    "user_href": "/profile/Bazella-Ashraf"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Casablanca-23"
                },
                {
                    "user_id": "Priyal Powle",
                    "user_href": "/profile/Priyal-Powle"
                },
                {
                    "user_id": "Luna Lovegood",
                    "user_href": "/profile/Luna-Lovegood-457"
                },
                {
                    "user_id": "Timothy Tiet",
                    "user_href": "/profile/Timothy-Tiet"
                },
                {
                    "user_id": "Prashant Goyal",
                    "user_href": "/profile/Prashant-Goyal-71"
                },
                {
                    "user_id": "Pragati Gaikwad",
                    "user_href": "/profile/Pragati-Gaikwad-1"
                },
                {
                    "user_id": "Nithisha Guntur",
                    "user_href": "/profile/Nithisha-Guntur"
                },
                {
                    "user_id": "Rajnikant Yadav",
                    "user_href": "/profile/Rajnikant-Yadav-18"
                },
                {
                    "user_id": "Gagan Toor",
                    "user_href": "/profile/Gagan-Toor-1"
                },
                {
                    "user_id": "Vansh Bhatia",
                    "user_href": "/profile/Vansh-Bhatia-19"
                },
                {
                    "user_id": "Pradeep Kumar",
                    "user_href": "/profile/Pradeep-Kumar-3861"
                },
                {
                    "user_id": "Oliviar IM",
                    "user_href": "/profile/Oliviar-IM"
                },
                {
                    "user_id": "Raghav Sadany",
                    "user_href": "/profile/Raghav-Sadany"
                },
                {
                    "user_id": "Nandini Gopan",
                    "user_href": "/profile/Nandini-Gopan"
                },
                {
                    "user_id": "Saumik Satapathy",
                    "user_href": "/profile/Saumik-Satapathy-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aishwarya Balwani",
                "href": "/profile/Aishwarya-Balwani"
            },
            "answer_text": "This is a brief description of what I did and what I found best suited my style of studying. As far as material goes, I honestly believe that the ETS material is indispensable and the most accurate. Do all of it. The official GRE guide and the separate Quantitative and Verbal guides. I was always extremely confident about my quant section. Right from day 1, I knew I'd be satisfied with nothing less than a perfect 170. After a couple of practice tests, I could see that if I was paying complete attention, getting that 170 wouldn't be difficult. So throughout my study period, I solved multiple sums from all topics and concentrated a little more on statistics because that was the one area I felt I needed to brush up a bit. I'd highly recommend helping friends and meeting up and solving sums together. I find that it not only gets you some extra practice, but helps clear your concepts too when you try explaining a sum to someone else. The verbal section was my undoing, so to speak. My only advice would be to expand your vocabulary qualitatively. That means don't simply mug up words, but learn how they can be used in multiple ways, and also pay attention to the slight differences in meanings of words which mean similar things. I think the Magoosh app is sufficient when it comes to the number and the list of words you need to know for the test, so to speak. Practice your RCs. They account for a good 50% of your verbal score, and once you get the hang of it, they're incredibly fun. Start with Barron's for a quick morale boost and move onto the Manhattan 5lb. (And also their RC guide if possible) Your aim should be to cross 165 in both sections. Which means you give importance to both sections. Take it a little easier on your stronger section and use the extra time on strengthening your other section. Finally, take practice tests. Replicate exam conditions as far as possible, and please don't cheat whilst practicing. Or take unscheduled breaks. And on test day, have a good breakfast, and keep calm. Don't let the pressure get to you. The GRE is a pretty easy test and someone who's familiar with the pattern and has spent some time preparing should have absolutely no trouble getting a good score. ",
            "date": "Updated June 19, 2016",
            "views": "67",
            "upvotes": " View 34 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chandra Sekar",
                    "user_href": "/profile/Chandra-Sekar-1087"
                },
                {
                    "user_id": "Preethi Reddy",
                    "user_href": "/profile/Preethi-Reddy-382"
                },
                {
                    "user_id": "Saurav Bose",
                    "user_href": "/profile/Saurav-Bose-9"
                },
                {
                    "user_id": "Rajnikant Yadav",
                    "user_href": "/profile/Rajnikant-Yadav-18"
                },
                {
                    "user_id": "Aiyad Alshimaysawee",
                    "user_href": "/profile/Aiyad-Alshimaysawee"
                },
                {
                    "user_id": "Hansel Presley",
                    "user_href": "/profile/Hansel-Presley"
                },
                {
                    "user_id": "Anwesh Satapathy",
                    "user_href": "/profile/Anwesh-Satapathy"
                },
                {
                    "user_id": "Ravalika Reddy",
                    "user_href": "/profile/Ravalika-Reddy-2"
                },
                {
                    "user_id": "Karthik Subramani",
                    "user_href": "/profile/Karthik-Subramani-32"
                },
                {
                    "user_id": "Ajinkya Patil",
                    "user_href": "/profile/Ajinkya-Patil-54"
                },
                {
                    "user_id": "Zaid Ahmed",
                    "user_href": "/profile/Zaid-Ahmed-165"
                },
                {
                    "user_id": "Shayon United",
                    "user_href": "/profile/Shayon-United"
                },
                {
                    "user_id": "Kaustubh Sridhar",
                    "user_href": "/profile/Kaustubh-Sridhar"
                },
                {
                    "user_id": "Shrinivas Sridhar",
                    "user_href": "/profile/Shrinivas-Sridhar"
                },
                {
                    "user_id": "Selva Kumar",
                    "user_href": "/profile/Selva-Kumar-630"
                },
                {
                    "user_id": "Mamal Bhanushali",
                    "user_href": "/profile/Mamal-Bhanushali-1"
                },
                {
                    "user_id": "Shahbaz Ahmad",
                    "user_href": "/profile/Shahbaz-Ahmad-160"
                },
                {
                    "user_id": "Anuj Sood",
                    "user_href": "/profile/Anuj-Sood-18"
                },
                {
                    "user_id": "Ayushee Agarwal",
                    "user_href": "/profile/Ayushee-Agarwal"
                },
                {
                    "user_id": "Aman Chheda",
                    "user_href": "/profile/Aman-Chheda-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yuan (PrepScholar)",
                "href": "/profile/Yuan-PrepScholar"
            },
            "answer_text": "I propose the following steps to prepare for your GRE: Find your target GRE scores.Why: Depending on where you are applying to, the GRE score you need can vary greatly. Your grad program may be highly competitive and without hitting a high GRE score, your application can be automatically rejected. Your grad program may also be competitive but the GRE does really matter as long as you hit a pretty mediocre GRE score. You need to find this out first.How: Create a spreadsheet and in column A, list all the grad programs you are applying to. Next to this column, list the average and/or minimum GRE score for Verbal, Quant, and AWA separately. The average GRE score across all of your target schools is what you want to target. Sometimes graduate programs publish their past GRE score of admitted students directly online. If you can’t find this information, you can also email the admission office directly or simply survey 2–3 current students within the program.Take a PowerPrep (Official GRE) Practice Test.Why: The first thing you should do after finding your target GRE score is to take an official online GRE practice test. You want to know exactly where you are on the GRE today so you can find out how far you need to go. It’s possible you already have what you need on the GRE or you have a long way to go.How: There is only 1 place you should take this test and it happens to be free. You should only take an official GRE test that is fully simulated in the online environment, just like the real GRE.Head over to the ETS GRE homepage. You’ll need to create an account before you can add a free PowerPrep GRE test to your cart and “pay” (in this case, you pay nothing) to start.Identify your weakness, learn from your mistakes, crush the GREWhy: The fastest way to increase your GRE score is by identifying your weaknesses on the GRE, then focus your energy on learning and improving your weakest skills on the GRE first. It’s really hard to go from good to great, but you make more progress in less time if you first turn the bad into good. Focus on quality, not quantity. Learn what you need to learn, and do not mindlessly practice for hours on end. Take every single question seriously and review your answers carefully to make sure you learn to never make the same mistake twice.How: you can take a prep course that specifically allows you to identify, drill, and improve. Or, you can do this yourself using an excel sheet.",
            "date": "Answered October 9, 2017",
            "views": "510",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aditya Pratap Singh",
                    "user_href": "/profile/Aditya-Pratap-Singh-500"
                },
                {
                    "user_id": "Sarath Kumar",
                    "user_href": "/profile/Sarath-Kumar-294"
                },
                {
                    "user_id": "Rajnikant Yadav",
                    "user_href": "/profile/Rajnikant-Yadav-18"
                },
                {
                    "user_id": "Mubin Likhon",
                    "user_href": "/profile/Mubin-Likhon"
                },
                {
                    "user_id": "Vansh Bhatia",
                    "user_href": "/profile/Vansh-Bhatia-19"
                },
                {
                    "user_id": "Pravalika Manugu",
                    "user_href": "/profile/Pravalika-Manugu"
                },
                {
                    "user_id": "Harshitha Ck",
                    "user_href": "/profile/Harshitha-Ck-6"
                },
                {
                    "user_id": "Nishtha Sethi",
                    "user_href": "/profile/Nishtha-Sethi"
                },
                {
                    "user_id": "Kashish Jawed",
                    "user_href": "/profile/Kashish-Jawed-1"
                },
                {
                    "user_id": "Nafiz Imtiaz",
                    "user_href": "/profile/Nafiz-Imtiaz-41"
                },
                {
                    "user_id": "Ruturaj Rucha Rajendra",
                    "user_href": "/profile/Ruturaj-Rucha-Rajendra"
                },
                {
                    "user_id": "Somnath Acharya",
                    "user_href": "/profile/Somnath-Acharya-7"
                },
                {
                    "user_id": "Saurav Sagar",
                    "user_href": "/profile/Saurav-Sagar-2"
                },
                {
                    "user_id": "Ravi Teja",
                    "user_href": "/profile/Ravi-Teja-1180"
                },
                {
                    "user_id": "Bindesh Tripathi",
                    "user_href": "/profile/Bindesh-Tripathi"
                },
                {
                    "user_id": "Rishab Balaji",
                    "user_href": "/profile/Rishab-Balaji"
                },
                {
                    "user_id": "Sabah Pathan",
                    "user_href": "/profile/Sabah-Pathan"
                },
                {
                    "user_id": "Sanchari Chaudhuri",
                    "user_href": "/profile/Sanchari-Chaudhuri-3"
                },
                {
                    "user_id": "Umarah Kay",
                    "user_href": "/profile/Umarah-Kay"
                },
                {
                    "user_id": "Ronish Raval",
                    "user_href": "/profile/Ronish-Raval"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suhail Barot",
                "href": "/profile/Suhail-Barot-1"
            },
            "answer_text": "Anybody can score 330+ in GRE. I followed a 3 week preparation plan. It is important to understand that the GRE is very different as compared to the other exams we are used to giving, talking from an Indian’s perspective. Blind hard work will not serve any purpose and sometimes will be counterproductive. ETS (the company that conducts the GRE) wants to convince you that your score is a measure of how good you are at ‘critical thinking’, but in reality it is only a measure of how good you are at giving the GRE. So, fortunately for us, the more you practise in the correct way, the better you become at giving the GRE. The Correct Way (in my experience) : Quality > Quantity. Always. Please do not spend 10+ hours a day mechanically solving problems and forgetting about them as you move forward. This will cause you to plateau at a certain skill level. The key is small incremental improvements. For me, the ideal way was a simple 3 step process : Solve problems in small sets, around 20(+5 || -5) questions per set.Check your answers. See the solutions, understand them thoroughly.After checking all, recap the questions you got wrong, why, and what you learnt from them. This is extremely important.Let’s jump into the schedule now, shall we? Pre-prep phase (1 week) : Okay, I lied, it’s not really 3 weeks, but this pre-prep phase won’t take more than two hours of your time per day, and what’s more, you can easily do this while you eat or just before sleeping. What is to be done? Words, Words and more Words. Spend this week learning the words from the following apps : Barron’s 1100Magoosh Flash Cards (around 1000 words)Manhattan Essential Words (around 500 words)Vocabulary is essential to understanding the Reading Comprehensions as well as the sentence completions, so please complete this before moving ahead! Week 1 : Congratulations! The boring part is done. This week, let’s do : 4 Practice TestsPractise each type of question in isolation. For example, do 20 Text Completions in one set. This will help you to identify weaknesses to work on.Brush up all the shortcuts and maths formulae that you encounter.(Online Magoosh article exists)Week 2 : This week, let’s move forward with : 6 Practice Tests.Do mixed practice sets now (All types of problems together), to simulate the actual GRE scenario.Strictly time your tests and practice sets. Keep 5 minutes per section as a buffer. Identify which type of questions you are slow at. Work on them.Week 3 : Buckle up, this is your final lap : 8 practice tests.Start reading AWA essays online, as well as general structuring tips. A lot of video material is available online. Practise a few essays if necessary.Revise the Vocabulary words and mathematical formulae.At the end of this schedule, you should be ready to face the GRE. So be confident, sleep well before the paper and ohh, don’t forget to carry a jacket. It’s freezing in there. Thanks for reading! Please do upvote if this helped you. ",
            "date": "Answered May 29, 2017",
            "views": "253",
            "upvotes": " View 310 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Priscilla Rho",
                    "user_href": "/profile/Priscilla-Rho"
                },
                {
                    "user_id": "Aditya Agarwal",
                    "user_href": "/profile/Aditya-Agarwal-532"
                },
                {
                    "user_id": "Avc Def",
                    "user_href": "/profile/Avc-Def"
                },
                {
                    "user_id": "Leslie Burk",
                    "user_href": "/profile/Leslie-Burk-1"
                },
                {
                    "user_id": "Saurabh Bansode",
                    "user_href": "/profile/Saurabh-Bansode-6"
                },
                {
                    "user_id": "Monisha Reddy",
                    "user_href": "/profile/Monisha-Reddy-10"
                },
                {
                    "user_id": "Viana Rumao",
                    "user_href": "/profile/Viana-Rumao"
                },
                {
                    "user_id": "Adedotun Banjo",
                    "user_href": "/profile/Adedotun-Banjo"
                },
                {
                    "user_id": "Deepank Dixit",
                    "user_href": "/profile/Deepank-Dixit"
                },
                {
                    "user_id": "Ajoy Sahu",
                    "user_href": "/profile/Ajoy-Sahu-3"
                },
                {
                    "user_id": "Pavitra",
                    "user_href": "/profile/Pavitra-21"
                },
                {
                    "user_id": "Sneha Wattamwar",
                    "user_href": "/profile/Sneha-Wattamwar"
                },
                {
                    "user_id": "Pranav Ganorkar",
                    "user_href": "/profile/Pranav-Ganorkar"
                },
                {
                    "user_id": "Ahmed Ziya",
                    "user_href": "/profile/Ahmed-Ziya"
                },
                {
                    "user_id": "Rohit Chaudhari",
                    "user_href": "/profile/Rohit-Chaudhari-1"
                },
                {
                    "user_id": "Pankaj Jindal",
                    "user_href": "/profile/Pankaj-Jindal-2"
                },
                {
                    "user_id": "Swetha Sangubhotla",
                    "user_href": "/profile/Swetha-Sangubhotla-2"
                },
                {
                    "user_id": "Shivanand Pujari",
                    "user_href": "/profile/Shivanand-Pujari-1"
                },
                {
                    "user_id": "Kushagra Agarwal",
                    "user_href": "/profile/Kushagra-Agarwal-11"
                },
                {
                    "user_id": "Nikhil Alisary",
                    "user_href": "/profile/Nikhil-Alisary"
                }
            ]
        },
        {
            "author_info": {
                "name": "Austrin Dabre",
                "href": "/profile/Austrin-Dabre"
            },
            "answer_text": "Well I have given GRE and i studied for like about 20-25 days. I scored 310(Q-160 V-150). I know these marks aren't good enough, but if you get an head start of about 3 months and get on the schedule you can easily score about 320+. Here is what is i recommend you do. DO NOT JOIN ANY COACHING CLASSES. This is the most important thing that you have to do. Because first of all, you are about to be graduate or you have completed and i assume you have good grip on basic mathematics. Going to classes will just waste your time and more importantly waste a good amount of 20-30k on the things you already know.Now, starting from Quants, the first important job you'll have is to brush up the mathematics that you have already studied in your Xth and XIIth grade. This you can do by solving the NOVA MATH BIBLE. The NOVA MATH BIBLE (NMB)will get you acquainted with all the basic concepts of probability and all the other important concepts and will make you very comfortable with the questions. Once you have solved the NMB(will take about 2-3 weeks), go on to the Manhattan series. You'll find a Manhattan series with 8 books in total, Manhattan 5lb and 7 other basic manhattan books. Do not start solving Manhattan 5lb as of yet. Solve the other manhattan books. Once done that you will be very familiar to the type of questions that are asked. Finally move on to Manhattan 5lb. That book will be your everything for Quants. Eat with it, sleep with it! Solve the compelte book.(Finish it in a month or so). Also solve the Advanced questions that are asked. Once you solve Manhattan 5lb , you will have a kind of mastery over GRE Quants. After that you can go ahead and solve ETS GUIDE(Will take about 3 days). REMEMBER THE MOST IMPORTANT THING IS TO MAINTAIN AN ERROR LOG. WRITE DOWN ALL THE MISTAKES THAT YOU, ANY SILLY MISTAKE WRITE IT DOWN IN THAT ERROR LOG.BEFORE A WEEK OR TWO OF THE ACTUAL EXAM, STUDY YOUR ERROR LOG ONLY AND ELIMINATE EVERY POSSIBLE PROBABILTY OF SILLY MISTAKE IN YOUR EXAM.Once these three books are done(NOVA, MANHATTAN, ETS), i think you can quite easily score very good marks in Quants. Absolute score(170) is definitely possible.Moving on to VERBALS. The most important thing in verbals is that you have to understand the context of every sentence and what words are to used in it. Firstly you'll have to improve your vocabulary. PRINCETON HIT PARADE, MANHATTAN 600 and Magoosh words are more than enough. If you do all these you may learn about 1500 words( Most of the words are common in these three, but nevertheless do all three). Not just learn these words but try to use these words in day to use of your English. Flaunt it if you want. The most important thing to be successful at VERBALS is to be very good at context reading and thinking literally. I mean GRE passages boasts the most boooring and high fundo english. So i suggest you start reading american newspapers like The New York Times and so on. Now so as to practice verbals, you can do passages from Manhattan 5lb/Kaplan Series/Princeton Series. The Verbal section is down to how good you are at English and not just spoken English but the actual literal grammatically correct English.Coming to the final part, the AWA section. The AWA section is down to your application of knowledge and your English and how you structure your points down. ETS GUIDE is good enough, wherein you can figure out the structure of the essays also it contains a pool of 100-200 essays which you can refer to.Now coming to the final part. THE TESTS! No matter how much you solve or practice, it is all down to how you perform in the exam. Now to get well acquainted to the actual test,   you have to solve as many as tests you can. Starting off from Kaplan Test series move on to Manhattan test series. Give these tests as if you are writing your GRE. Try and give these tests under supervision of your parent or any friend or so.These tests can give you an idea where you lag and where you need to improve. Give these tests occassionaly while you are solving the material I've told you to before.Now before a week or so of your exam, give the ETS POWERPREP series. Give both the tests with a gap of 3-4 days. These tests will show you where exactly you stand and will more or less be your GRE SCORE(+-3)I personally suggest that instead of buying paperbacks, you buy or download digital copies of these books, as you are going to give your exams on the computer screen , you might as well start studying from the computer screen it self. You can buy these books on Amazon or the ones who cannot afford it can download a torrent named \"GRE PACKAGE\" on kickass torrents.Hope this helps you! All the best ",
            "date": "Updated January 27, 2016",
            "views": "131",
            "upvotes": " View 86 Upvoters",
            "upvoters": [
                {
                    "user_id": "Imtiajul Alam",
                    "user_href": "/profile/Imtiajul-Alam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Siddhartha Sahu",
                "href": "/profile/Siddhartha-Sahu"
            },
            "answer_text": "There is a plethora of good answers here. Just adding the approach I took for GRE preparations. Background: Indian ICSE student, relatively well read, fast readerTime input: 4 weekends worth Books and Practice These are the only books I used: Absolute must The Official Guide to the GRE Revised General TestVerbal Practice Official GRE Verbal Reasoning Practice Questions5 lb. Book of GRE Practice Problems - Manhattan PrepQuant Practice Official GRE Quantitative Reasoning Practice QuestionsPractice Tests Official GRE test: 2 paper based + 2 Power-prep software testsManhattan diagnostic testsGo through the official ETS GRE book first. Properly read and understand the various sections and question types. Do all the practice questions for each section. Read through the explanations, where you may learn new approaches and tips to solving these questions. Verbal Reasoning This needs two things: VocabularyFortunately, the current GRE format does not require a vast knowledge of obscure words anymore. My preparation list consisted of words from just @Barron's 800 High-Frequency GRE Word List and @The Ubiquitous 400. Learn words in context. Just words and their meaning will quickly slip out of your mind. I used Vocabulary.com to learn the new words. It is an awesome site with well written,  sometimes funny definitions and many examples from real world usage.Flash cards is the usual suggested method for learning words, but I found it not suited to my learning style. Instead, I created a text file with all the words I wanted to learn. Then I went though the words in multiple passes, each time marking words I did not know (by putting a space in front of them and sorting the list at the end, so I get all unknown words at the top).So in pass 1, I would get all words I did not know or was not sure of the answer. I then created a custom word list at Vocabulary.com Lists  and practised until I learned all the words.Pass 2 then focused on which of the words I remembered from pass 1 (again by putting in additional spaces in from of words, and sorting at the end).Repeated until I got all the words. Every 2 hours or so, I revised the pass >= 2 words again.PracticeIt is more important to practice the GRE vocabulary question types than just mugging up words. These questions check your reading skills as well as logical thinking capability. Practice as much as you can. Don't get dejected if you keep getting wrong answers initially. Wrong answers will mainly be for two reasons: unknown words and improper logical thinking: not reading/understanding the questions, etcFor unknown words: Keep noting down the new words you encounter and revise every half an hour or soFor improper logic: Note carefully where you went wrong in your thinking. This is super important, and will help you avoid the same mistake in future questions.I kept a counter for each type of mistake like: didn't know the words, didn't read question properly, did not reason it out to the end, did not analyse all the options, etc. It helped me keep track of what kind of mistakes I was making, and avoid the irritating silly mistakes next time. Quantitative Reasoning As mentioned in a lot of places. the syllabus of this section is very easy for an Indian student. Yet, I kept on making small silly mistakes: wrong calculations, not thinking it though, etc. Thus, diligent practice is required here too. I used just the official ETS resources and practice tests for this section. Kept track of all the mistakes I was making (wrong calculation, did not think of all the possibilities, took a lazy/wrong shortcut, did not read question properly etc), and tried to avoid them in the future questions.Go through the Math review section. Data analysis section usually needs a revision, esp. percentiles and quartiles.You'll find many tips in the official explanations. Eg, Comparison section may not need full calculations to find the answer.Analytical Writing Did not practise this section at all. The night before the exam, I just went through the official book examples and tips. Also, looked up examples for both the sections online.I will of course suggest that you practice 2-3 questions of each section (with 30 minutes time limit) to form an idea of the structure and flow of your approach to these questions. General Tips Don't hurry  through the exercises. It is better to do 50 questions/words properly and remember all of them later, than to  learn 100 and remember them in bits and pieces.Then pick up speed as you get closer to the test date. In the actual GRE test, I was able to complete the verbal sections with enough time left to go through all the questions again, and made a couple of corrections where I had misunderstood the question. Similarly for the math section, I could revise most of the sections.One month of diligent practice should be enough to ace the GRE. All the best! ",
            "date": "Answered October 1, 2015",
            "views": "30",
            "upvotes": " View 153 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gowtham Jaganathan",
                    "user_href": "/profile/Gowtham-Jaganathan-8"
                },
                {
                    "user_id": "Christina Molitor",
                    "user_href": "/profile/Christina-Molitor"
                },
                {
                    "user_id": "PULAVARTI VINAY KUMAR",
                    "user_href": "/profile/PULAVARTI-VINAY-KUMAR"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Casablanca-23"
                },
                {
                    "user_id": "LAXMI PATIL",
                    "user_href": "/profile/LAXMI-PATIL-37"
                },
                {
                    "user_id": "Megha Shashidhar",
                    "user_href": "/profile/Megha-Shashidhar-2"
                },
                {
                    "user_id": "Iedupulapati Bandhavya",
                    "user_href": "/profile/Iedupulapati-Bandhavya"
                },
                {
                    "user_id": "Shreya Janjua",
                    "user_href": "/profile/Shreya-Janjua-3"
                },
                {
                    "user_id": "Princess Agina",
                    "user_href": "/profile/Princess-Agina"
                },
                {
                    "user_id": "Alamin Hossain",
                    "user_href": "/profile/Alamin-Hossain-128"
                },
                {
                    "user_id": "Rahul Dutt",
                    "user_href": "/profile/Rahul-Dutt-1"
                },
                {
                    "user_id": "Uzair Sohail",
                    "user_href": "/profile/Uzair-Sohail-4"
                },
                {
                    "user_id": "Karan Idnani",
                    "user_href": "/profile/Karan-Idnani-1"
                },
                {
                    "user_id": "Neha Patil",
                    "user_href": "/profile/Neha-Patil-20"
                },
                {
                    "user_id": "Jaya Badlani",
                    "user_href": "/profile/Jaya-Badlani-1"
                },
                {
                    "user_id": "Aryan Rajput",
                    "user_href": "/profile/Aryan-Rajput-248"
                },
                {
                    "user_id": "Bhoomika Goel",
                    "user_href": "/profile/Bhoomika-Goel"
                },
                {
                    "user_id": "Jayanth Jayadevan",
                    "user_href": "/profile/Jayanth-Jayadevan"
                },
                {
                    "user_id": "Amardeep Singh",
                    "user_href": "/profile/Amardeep-Singh-966"
                },
                {
                    "user_id": "Rohan Tipnis",
                    "user_href": "/profile/Rohan-Tipnis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashish Manik",
                "href": "/profile/Ashish-Manik-1"
            },
            "answer_text": "To those Who don’t have much time to prepare, such as those having a job (my case) or too much of college work.Preparing on their own, without any coaching. Without any hard books.Who are lazy. (Less euphemistically)Here’s my brief:(It’s quite a long read - TL; DR at the end) I was not able to do what they do, owing to the lack of time. These things should not let you down--  “No time for Mock tests”: I did not take any (of the 3) mock tests fully - I only used to attempt both the Quant sections, review the mistakes, and ultimately end up preparing for Quant only till the day ended. I’d attempted Verbal only once (that too while triple-clicking and peeping at the meaning for each of the words that were unknown to me :P ) and gotten only 20 of 40 correct. This was before I’d started preparations, so I didn’t mind it much. LAST MINUTE Preparations: In spite of everyone telling me against it, I couldn’t leave the house in the morning without scrolling through my (mostly unprepared) word list, and the salient Quant mistakes notes. “Enough Sleep before the Day”: Didn’t have! :( Feeling underprepared, just twisting on the bed for hours without sleep!What I can make out now All that last minute anxiety, laziness towards Verbal, the last sleepless night, were all immaterial. For the most important thing is to be Calm & Concentrated during the exam. That’s all! :) Your score is already decided; a few months’ preparation would be puny in front of the all the Math/English that you’ve acquired during the past 20-25 years of your life. The post by Ananth Balasubramanian is the truest. Sincere thanks to him. :)[Here’s the link: GRE brief by Ananth Balasubramanian | Facebook] Suggested preparation material (i.e. the ones that I referred to)  Manhattan 5 lb. (the hot favourite) for Quant - being a lover of Maths, I solved all of the problems and tests in this.ETS Official Guide - devour it completely! Burp!ETS Quant Practice and ETS Verbal Practice books - the best ones to understand the type & range of questions asked and to develop your own strategies.Magoosh Vocabulary Builder app - for the times when I used to take a break or while commuting or that eyes-wide-open-in-the-phone-light time before sleep.Quant tips  Practice all types of questions from all topics. Don’t even ignore simple Algebra questions like “1+3=?”, for there must be a trick involved. Even once would do, if you grasp things quickly. Then review the answers and keep jotting down the mistakes you commit. These should be helpful at the LAST MINUTE preparations. (For example, don’t ignore fractions and negative values in x2; double check DI questions; that new formula of ‘sample standard deviation’ etc.) If you have time, do review the answers to the correct ones too - there can be some wisdom provided there too, e.g. in Manhattan and ETS books.Verbal tips  Practise RC as much as you can. It’s not important that you finish the whole book of RC99. I did practise only about 15-20 essays from the books that I’ve mentioned. The important thing is to learn how to critically think about the questions and the choices. Every now and then, you’d have to reason with the choices like: “Hey! The passage does say that Apples are Bad. But it doesn’t state ‘specifically’ that they’re bad in taste. So eliminate.” Reasoning gets even more stringent than this. Learn to do it, and RC is your toy.Also, speed reading in RC helps a lot. Verbal sections might be found to be time-taking by you.SE and TC - Go with your instinct. Eliminate. Practice didn’t help me much I guess. But to be confident in the exam, do practise. :)AWA tips I don’t think I’m the right person to speak about it. I only read a few samples from the ETS OG, on the day before D-day. I like writing, and so I could write quite much in the exam as well.  All this I did within 10 days effectively. Lack of sleep didn’t bother me on the test day. (Might bother others, do sleep!) However, during preparations, I believe sleep matters - for whatever you learn needs the warmth of the pillow to be happy to stay in your brain... :) As much important are everyday chores and play - I used to play at least two games of Carrom everyday during my preparation. But DON’T do anything that brings that guilt in you of having wasted time.On Test Day  Had slept only for 4 hours the night before, awoke at 6:30 AM, had only one banana for breakfast, and reached the venue at 7:30 AM. To my surprise, security check had already begun! :O Plus, to add to the torment, the ‘Prometric Intro video’ was playing on the TV there in loop! Grrr!AWA topics were good, had ample thoughts to write. Time is also enough for you to write 400-500 words.Happy to see the Quant section first! :D Got all the answers. However, it was trickier and lengthier than the second Quant section - so I knew that it was experimental.And most of the verbal passages I got were related to Science - Astronomy, Chemistry, Botany etc. Lucky, for I love to read about those. :)A Little Time Hack: Don’t press the Continue button when the section finishes. Take deep breaths. Prepare your mind to shift from Q to V or V to Q. Then press Continue and enjoy an official break of 60 more seconds ... :P (Had read this somewhere, so implemented.)Break time: Snickers. No wonder. (I think ETS should write this in the GRE conventions’ PDF now)All went smooth. And the score screen. My eyes went to the Quantitative section first: 170. Emotionless. Fine. Expected. Then they turned to Verbal section: 159. I added it to my Quant score and... “WTF! It’s becoming 329! Perhaps my brain is too tired to do simple addition now”, I’d said to myself. I did the Math again. And then again on the yellow rough sheet - that’s when it settled in! I smiled, filled in the Universities, and went straight to my friends waiting for a party. :) TL; DR KNOW the question types; PRACTISE until you start getting the answers correct; CHILL often: most importantly, during the exam. All the Best! :) [If anyone has any further queries, I'd be happy to help. :) ] ",
            "date": "Answered October 4, 2015",
            "views": "308",
            "upvotes": " View 127 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gowtham Jaganathan",
                    "user_href": "/profile/Gowtham-Jaganathan-8"
                },
                {
                    "user_id": "Christina Molitor",
                    "user_href": "/profile/Christina-Molitor"
                },
                {
                    "user_id": "Haripriya",
                    "user_href": "/profile/Haripriya-52"
                },
                {
                    "user_id": "Bazella Ashraf",
                    "user_href": "/profile/Bazella-Ashraf"
                },
                {
                    "user_id": "Andrew Komopo",
                    "user_href": "/profile/Andrew-Komopo"
                },
                {
                    "user_id": "Xufeng He",
                    "user_href": "/profile/Xufeng-He-1"
                },
                {
                    "user_id": "Siddhesh Manjrekar",
                    "user_href": "/profile/Siddhesh-Manjrekar-1"
                },
                {
                    "user_id": "Maisoon Islam",
                    "user_href": "/profile/Maisoon-Islam"
                },
                {
                    "user_id": "Suriya Narayanan",
                    "user_href": "/profile/Suriya-Narayanan-57"
                },
                {
                    "user_id": "Abdelrahman Abdelalim",
                    "user_href": "/profile/Abdelrahman-Abdelalim-2"
                },
                {
                    "user_id": "Rimsha Choudhary",
                    "user_href": "/profile/Rimsha-Choudhary"
                },
                {
                    "user_id": "Pranava Pakala",
                    "user_href": "/profile/Pranava-Pakala"
                },
                {
                    "user_id": "Frank Franklin",
                    "user_href": "/profile/Frank-Franklin-44"
                },
                {
                    "user_id": "P Vinay Kumar",
                    "user_href": "/profile/P-Vinay-Kumar-7"
                },
                {
                    "user_id": "Akshay Padiyar",
                    "user_href": "/profile/Akshay-Padiyar-2"
                },
                {
                    "user_id": "Anurag Varma",
                    "user_href": "/profile/Anurag-Varma-16"
                },
                {
                    "user_id": "Sakshi Singh",
                    "user_href": "/profile/Sakshi-Singh-175"
                },
                {
                    "user_id": "B K",
                    "user_href": "/profile/B-K-1364"
                },
                {
                    "user_id": "Lopa Singh",
                    "user_href": "/profile/Lopa-Singh"
                },
                {
                    "user_id": "Amaan Ali Khan",
                    "user_href": "/profile/Amaan-Ali-Khan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keerthana Devanand",
                "href": "/profile/Keerthana-Devanand"
            },
            "answer_text": "I took the GRE recently and scored 318 (166 Q 152 V 4.0 AWA) with 1-2 months of preparation. Few resources and tips I found really helpful during my preparation: MISCELLANEOUS TIPS Finding the right resources for preparation is of utmost importance. Most books aren’t representative of the actual GRE. Please do not opt for mediocre material. Ask your peers or seniors for suggestions. I cannot underscore this enough. The verbal section focuses more on complex sentence structure rather than difficult vocabulary, so keep this in mind while choosing a resource for your preparation. Quant too isn’t as easy as some books portray it to be. It does require some practice and one will definitely have to brush up obscure topics like quartiles, standard deviation etc.I prepared using Magoosh’s one month GRE plan and Manhattan 5lb book (for Quant). I can totally vouch for these resources. Magoosh’s user interface is very captivating and its score predictor is pretty accurate as well. The questions from both these resources are at par (if not more difficult) than what I actually encountered on the test day.If you reach a plateau stage while preparing (i.e. you see no improvement in your scores/ practice sessions) then look up some strategies. I found Magoosh’s videos to be crisp yet jam packed with information. These videos can easily be found on torrent sites.Being consistent in your preparation is very important. Your preparation should consist of 50% practice and 50% analyzing of mistakes.As I have already mentioned several times, don’t get misguided by the level of questions in some books. The actual GRE is much harder. Practice as many full length tests as you can to gauge your performance. From my own experience and from what I have heard from others, you can expect ~5 mark deviation from mock test scores when you take the actual GRE. My mock test scores ranged from 319–324.ETS Power prep I & II are a must for any GRE aspirant. Solves these when your test date is approaching to get an idea of what to expect on the test date. Also go through ETS’s Verbal and Quant books and practice their questions under timed conditions to gain maximum benefit.During you last week of preparation, maintain an error log and make a note whenever you answer a question wrong. Work on your pacing as well.QUANTITATIVE If you are from an engineering background and have a strong foundation in math, then scoring 165+ with some effort isn’t hard. I would recommend taking timed Quant practice sessions to identify weak areas and to do targeted practice to improve. I had solved all questions from Magoosh and 75% questions from Manhattan 5lb book. Both these resources are great for Quant.Definitely study topics that you’re unfamiliar with and glaze over the rest. I used Magoosh’s videos to brush up concepts I was unfamiliar with.While practicing, try to finish the Quant section in 30 mins. On the test day, I found the second quant section to be time consuming and I was unable to attempt one question as the clock ran out. However, this had never happened during my mock tests.VERBAL Don’t focus too much on vocabulary. I had learnt 1000 words from the Magoosh’s Flashcard app, but I feel that I could have performed better had I learnt 300–500 words and focused the remainder of my time in solving more questions. On the test day, I hardly encountered tough vocabulary. I was faced with complex sentence structure (in the SE and TC sections). Barron’s 333 is also a good resource for vocabulary. Don’t just memorize the meaning; learn how to use these words in sentences. Also, learn the secondary meaning of words (if any).Learn strategies either from prep books or some other resource. I went through all the videos offered by Magoosh. It was monumental in my preparation for the verbal section.AWA I devoted merely 2-3 days for the AWA section. Manhattan’s 7th book- Reading Comprehension and Essays was extremely helpful. I used a lot of strategies provided in this book and ended up scoring well in this section. Come up with at least two paragraphs apart from the introduction and conclusion; avoid spelling and grammatical errors at all costs and you should be able to score a 3.0 atleast. The aforementioned Manhattan book is especially useful for tackling the argument essay: it provides a list of common fallacies found in GRE arguments such as unwarranted assumption, troubled analogy, vaguely defined terms to name a few. After going through this book, practice a couple of essays under timed conditions and your good to go. Final Tips: Stay Calm and Ace the GRE. Hope this helps! ",
            "date": "Answered September 4, 2017",
            "views": "49",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Casablanca-23"
                },
                {
                    "user_id": "Manish Basavalinga",
                    "user_href": "/profile/Manish-Basavalinga"
                },
                {
                    "user_id": "Lakshay Arora",
                    "user_href": "/profile/Lakshay-Arora-42"
                },
                {
                    "user_id": "BM Sa",
                    "user_href": "/profile/BM-Sa-2"
                },
                {
                    "user_id": "Saloni Chopra",
                    "user_href": "/profile/Saloni-Chopra-22"
                },
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-49"
                },
                {
                    "user_id": "Anwesh Satapathy",
                    "user_href": "/profile/Anwesh-Satapathy"
                },
                {
                    "user_id": "Shyam Mayil",
                    "user_href": "/profile/Shyam-Mayil"
                },
                {
                    "user_id": "Rifat Mursalin",
                    "user_href": "/profile/Rifat-Mursalin"
                },
                {
                    "user_id": "Amthul Nusrath",
                    "user_href": "/profile/Amthul-Nusrath"
                },
                {
                    "user_id": "Utkarsh Kumar",
                    "user_href": "/profile/Utkarsh-Kumar-634"
                },
                {
                    "user_id": "Karthik Subramani",
                    "user_href": "/profile/Karthik-Subramani-32"
                },
                {
                    "user_id": "Kshitij Badkas",
                    "user_href": "/profile/Kshitij-Badkas-1"
                },
                {
                    "user_id": "Olarinde Oluwatobi",
                    "user_href": "/profile/Olarinde-Oluwatobi"
                },
                {
                    "user_id": "Arun Khemani",
                    "user_href": "/profile/Arun-Khemani"
                },
                {
                    "user_id": "Aditya Paranjape",
                    "user_href": "/profile/Aditya-Paranjape-10"
                },
                {
                    "user_id": "Sharan.C",
                    "user_href": "/profile/Sharan-C-10"
                },
                {
                    "user_id": "Nimisha Modi",
                    "user_href": "/profile/Nimisha-Modi-1"
                },
                {
                    "user_id": "Aravind Sasikumar",
                    "user_href": "/profile/Aravind-Sasikumar-5"
                },
                {
                    "user_id": "Sanchit Nevgi",
                    "user_href": "/profile/Sanchit-Nevgi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sumit Singh Gandhi - (Rahul )",
                "href": "/profile/Sumit-Singh-Gandhi-Rahul"
            },
            "answer_text": "5 most effective GRE tips are as follows:1. Set your goalsMake a list of the graduate programs that interest you and research the average GRE scores (quantitative, verbal, and writing) of accepted students for each program. Sometimes this information is listed on the program’s website. In other cases, you may have to call the admissions office. With this information in hand, decide on a score goal for yourself.2. Take a practice exam:Before you go off and spend a bunch of money on GRE prep books and courses, determine how far you are from your goal score right now. If you are at or above your goal score, go take the real thing! If not, you’ll want to come up with a preparation plan.3. Analyze your assessment reports:Our free practice exam comes with a set of assessment reports. Use these reports to pinpoint strengths and weaknesses. Ask yourself the following questions: a. Am I stronger in math or verbal?b. What question formats do I tend to struggle with (text completions, quantitative comparisons, etc.)?c. What question topics do I tend to struggle with (geometry, fractions, etc.)?d. Did I struggle with time management?The answers to these questions will help you determine what you need to study and how much you need to study.4. Develop a Study ProgramExperts suggest starting preparation anywhere from 4 to 12 weeks before the exam so that you can master the material without forgetting anything. Whatever study program you choose, you need to be sure that it will properly prepare you for the conditions of the exam. For example, practicing with pencil and paper will only help so much if you’re going to be taking a computer-based exam. If you’re looking for courses or tutoring, we at greking.com offer a range of services from online practice tests to guides across the country.5.Try Physical and Mental WorkoutsThere’s more to improving your GRE scores than practicing with a study guide. If you really want to do your best on the GRE, add physical and mental workouts to your study routine, too.Researchers have found new evidence that regular cardiovascular workouts may boost brainpower as much as 20 percent, regardless of age. According to one study of adults ages 21 to 45, a three-month exercise program that included aerobic activity increased blood flow to the brain and caused new nerve cells to grow in the part of the brain that’s responsible for memory and cognitive agingMental exercises can boost brainpower, too. Whether you study a map instead of using a GPS to navigate to a new destination or seek the novelty of mastering a brain-teasing game like Sudoku, thinking your way through new and complex sets of problems will help you develop problem-solving skills, as well as the cognitive ability to understand relationships between varying concepts .Embarking on a course of mental and physical exercises will, at the very least, give you the stamina to complete the nearly four-hour exam — and could potentially result in improved GRE results, too. ",
            "date": "Answered December 11, 2015",
            "views": "542",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gowtham Jaganathan",
                    "user_href": "/profile/Gowtham-Jaganathan-8"
                },
                {
                    "user_id": "Chaity Dey",
                    "user_href": "/profile/Chaity-Dey"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Casablanca-23"
                },
                {
                    "user_id": "Shashwat Pandey",
                    "user_href": "/profile/Shashwat-Pandey-19"
                },
                {
                    "user_id": "Krishna Nair",
                    "user_href": "/profile/Krishna-Nair-174"
                },
                {
                    "user_id": "Adrijeet Deb",
                    "user_href": "/profile/Adrijeet-Deb"
                },
                {
                    "user_id": "Mallipudi Aditya",
                    "user_href": "/profile/Mallipudi-Aditya"
                },
                {
                    "user_id": "Swapnil Desai",
                    "user_href": "/profile/Swapnil-Desai-20"
                },
                {
                    "user_id": "Asif Khan",
                    "user_href": "/profile/Asif-Khan-6763"
                },
                {
                    "user_id": "Hrithik Raman",
                    "user_href": "/profile/Hrithik-Raman"
                },
                {
                    "user_id": "Chandra Sekhar",
                    "user_href": "/profile/Chandra-Sekhar-3860"
                },
                {
                    "user_id": "Rajnikant Yadav",
                    "user_href": "/profile/Rajnikant-Yadav-18"
                },
                {
                    "user_id": "Shrikant Raut",
                    "user_href": "/profile/Shrikant-Raut-1"
                },
                {
                    "user_id": "Vansh Bhatia",
                    "user_href": "/profile/Vansh-Bhatia-19"
                },
                {
                    "user_id": "Reshma Chandran",
                    "user_href": "/profile/Reshma-Chandran-11"
                },
                {
                    "user_id": "Ana Lavinia",
                    "user_href": "/profile/Ana-Lavinia-1"
                },
                {
                    "user_id": "Shagun Rai",
                    "user_href": "/profile/Shagun-Rai-19"
                },
                {
                    "user_id": "Tejas Pandey",
                    "user_href": "/profile/Tejas-Pandey-4"
                },
                {
                    "user_id": "Varsha Jadhav",
                    "user_href": "/profile/Varsha-Jadhav-27"
                },
                {
                    "user_id": "Rimpal Suthar",
                    "user_href": "/profile/Rimpal-Suthar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dolly Sharma",
                "href": "/profile/Dolly-Sharma-3"
            },
            "answer_text": "Hi There could be multiple ways to prepare for the test. Here I am listing a few fundamental steps towards GRE preparation: Step 1-  Understand what you are up against!  Take a trip to ETS Home and collect necessary information such as structure of the test Computer-based Test Content and Structure, strategies and tips Strategies and Tips, Content- sample questions- Verbal Reasoning (other links are stated on the same page) Step 2- Take an ETS prep test to know your current level (if you haven't already done that).  This is get you a feel of the real test – how it feels to sit through the grueling 4 hours. Once you gauge your starting point – in other words, what is your Level Zero? you understand how much further you need to go.  Step 3- Based on your performance in the test. decide whether you wish to take any professional help If yes, explore the available options based on your requirements such as flexibility, medium of the training and so forth. I would highly suggest to have a meet the instructor in person, discuss your performance and expectations, and ideally sit through a class to understand if the teaching methodology and the approach of the instructor is aligned with your understanding and comfort.  In case you have a moderate idea of the test and you wish to prepare on your own, you should chart out a plan considering your performance. Do a self review of the diagnostic test.  Examine your result and identify:  what concept(s) were you tested onwhich topics are you making mistake(s) in- (Sentence Equivalence, Text completion, Reading comprehension, problem solving, Geometry etc.)which area are you making mistake(s) in- (comprehending the text, vocabulary, formulas and etc. )Categories your mistakes. You may use this link to analysis your responses  Nailed it, Missed it, Guessed it, Timed it, Screwed itOnce you do this, it will be easy to figure out the next steps. The idea is to get a grip on the specific gaps in your preparation and fix them. Step 4- Start your preparation   Allot at least couple of hours every day for your prep. Slogging in the last week won't help.Make a day wise study plan giving more emphasis on the concepts you are getting most of your questions wrong in. Read some good (complex and boring) magazines and journals to get a taste of complex reading passagesBrush up all quantitative fundamentals. More importantly, don't just jump on to calculations without grasping the concept. Learn techniques that would help you get questions right faster.To Prepare for AWA. Go through the following links:Page on Ets Issue essay pool Analyze an Issue(I've just stated issue essay pool; please check out link for argument essays pool on the same page) Pick essay topics from the pool, write essays and get them reviewed by your instructor or someone who can grade you for your grammar, consistency of ideas, organization, writing etc.. Take full length tests on regular basis (including essays) this will help you have the true simulation of the test.  You may also go through these FAQ by gre aspirants GRE- FAQs Hope this helps!Dolly SharmaVerbal TrainerCrackVerbal ",
            "date": "Answered January 2, 2014",
            "views": "2",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gowtham Jaganathan",
                    "user_href": "/profile/Gowtham-Jaganathan-8"
                },
                {
                    "user_id": "Parneet Kaur",
                    "user_href": "/profile/Parneet-Kaur-399"
                },
                {
                    "user_id": "Kaustubh Shankar",
                    "user_href": "/profile/Kaustubh-Shankar"
                },
                {
                    "user_id": "SHILPAM TRIPATHI",
                    "user_href": "/profile/SHILPAM-TRIPATHI"
                },
                {
                    "user_id": "Anwesh Satapathy",
                    "user_href": "/profile/Anwesh-Satapathy"
                },
                {
                    "user_id": "Karthik Subramani",
                    "user_href": "/profile/Karthik-Subramani-32"
                },
                {
                    "user_id": "Hassan Arshad",
                    "user_href": "/profile/Hassan-Arshad-3"
                },
                {
                    "user_id": "Jaswinder Singh",
                    "user_href": "/profile/Jaswinder-Singh-324"
                },
                {
                    "user_id": "Yogesh Jamdhade",
                    "user_href": "/profile/Yogesh-Jamdhade-2"
                },
                {
                    "user_id": "Anshu Singh",
                    "user_href": "/profile/Anshu-Singh-52"
                },
                {
                    "user_id": "Ajay Bale",
                    "user_href": "/profile/Ajay-Bale"
                },
                {
                    "user_id": "Swapnika Guntuka",
                    "user_href": "/profile/Swapnika-Guntuka"
                },
                {
                    "user_id": "Adhitya R M",
                    "user_href": "/profile/Adhitya-R-M"
                },
                {
                    "user_id": "Muskan Singhal",
                    "user_href": "/profile/Muskan-Singhal-19"
                },
                {
                    "user_id": "Sai Rishab",
                    "user_href": "/profile/Sai-Rishab"
                },
                {
                    "user_id": "Hannan Ahmed",
                    "user_href": "/profile/Hannan-Ahmed-9"
                },
                {
                    "user_id": "Anushka Sahu",
                    "user_href": "/profile/Anushka-Sahu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rubin Sagar",
                "href": "/profile/Rubin-Sagar"
            },
            "answer_text": "Brett's answer is pretty much what one needs to do to prepare for the GRE, however I will give you a student's opinion (I gave the GRE a little over a year ago).  1. Set a time, everyday for about 2 months to study.  2. Buy good materials for preparing. I would suggest Kaplan because the textbook has good exercises and if your math is relatively strong, they cover all the topics within a few pages, in case you need a brief revision. Also, according to me and a lot of my friends who used Kaplan, their tests are very similar to the actual test and the scores you get in the practice tests are very similar to what you will actually get (trust me on this). 3. Each day, I would give all my time to one topic only and build my vocabulary (at least 50 words a day). My math was relatively strong, so I didn't spend a lot of hours on math.  4. Although the verbal section in the test covers grammar and tests your English in a comprehensive fashion, I would suggest to focus a lot on improving your vocabulary.   5. Try to cover the material in 3 weeks or so, with practice exercises. Give a complete mock test as if you are giving the actual exam. This would give you a good idea of your standing int terms of concepts, as well as time management. Usually people give a mock test before any kind of preparation, but in my opinion that is just wasting a test.  6. From that point onwards, focus on topics which you feel are weak, for another 3-4 weeks, with an overall revision about once a week. But keep doing the vocab.  7. After you are confident (which you should be after 6-7 weeks), start giving mock tests only. If I remember correctly, Kaplan has 7 complete practice tests, and ETS has 2 practice tests. One tip, take the tests in the exact same time as your actual test for the first 2-3 practice tests. Your score should be within a small range.  8. Revise everything for a couple days. Now, say you have 4 days to go. Give 3 full practice tests at the same time as your actual test and make sure your routine is exactly the same everyday before the test. If your test is at 9 am, make sure you use the bathroom, shower and eat exactly the same way for the rest of the days. Also the exam room might be a bit cold, so switch on the a/c, and take the practice tests. 9. One day to go, leave everything aside for that day. This might be difficult, but it really helps. Keep your routine the same, but without giving any practice test or studying. Watch a couple of movies during the practice test time, and chill.  Good luck!  ",
            "date": "Answered January 24, 2016",
            "views": "593",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gauri",
                    "user_href": "/profile/Gauri-86"
                },
                {
                    "user_id": "Jigar Panchal",
                    "user_href": "/profile/Jigar-Panchal-36"
                },
                {
                    "user_id": "Anisha Mukhija",
                    "user_href": "/profile/Anisha-Mukhija"
                },
                {
                    "user_id": "Sumit Singh Gandhi",
                    "user_href": "/profile/Sumit-Singh-Gandhi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anjishnu Kumar",
                "href": "/profile/Anjishnu-Kumar"
            },
            "answer_text": "If your vocabulary is weak, start playing some vocab game like www.vocabulary.com or read Word Power Made Easy. I like it because the gamification makes it addictive, the words are always in context, and you get to learn some pretty interesting facts about etymologies. Math is pretty easy, just practice everything you'd need once. Make sure you aren't having speed issues. Mistakes in this section tend to be quite silly. I'm still ashamed of losing 2 points in this section. If you have time, start reading a lot of different books. However this will make only a small difference.  Be logical in your approach to questions: cut out answers that are definitely wrong, and make a judgement call on those that remain. The exam is as much about eliminating answers as it is about picking the right one off the bat. For AWA, practice writing a couple of times to make sure you don't run out of time in the actual exam. Remember the focus is on breadth and not depth, and you do not need to produce a work of literary genius. What worked for me was0) Keep a set format- a 'template' in mind for both types of question.1) Spend 3-5 mins coming up with ideas and structuring without typing anything. If you come up with a new idea on the fly, you tend to immediately write it down, which leads to weak structuring.2) 15 minutes of furious writing. Around the 5 minutes left mark, finish up and start inspecting your writing.3) Spend the last 5 minutes 'finishing off', removing obvious mistakes, adding filler statements in case you've jumped from one conclusion to the next without qualifying it. Most importantly, you may be inclined, as I originally was, to buy a lot of study materials, for quant this may be fine as the extra knowledge doesn't hurt.  However, for the verbal section I used to find that other prep resources (apart from ETS) used to have different standards for the kind of leaps in logic you are allowed to make (often resulting in more spurious and/or tenuous links between statements).So on the last couple of days do ONLY ETS papers and get a very clear idea of what they want from you. A friend of mine recommended this, I thought it didn't make sense at the time, but now I feel it really helped. Good luck! Edit: Downvoted to the underworld eh? Oh well. ",
            "date": "Updated June 7, 2014",
            "views": "118",
            "upvotes": " View 38 Upvoters",
            "upvoters": [
                {
                    "user_id": "Himanshu Chowdhary",
                    "user_href": "/profile/Himanshu-Chowdhary-4"
                },
                {
                    "user_id": "Priya Jha",
                    "user_href": "/profile/Priya-Jha-12"
                },
                {
                    "user_id": "Chethan Rajan",
                    "user_href": "/profile/Chethan-Rajan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sameer Kamat",
                "href": "/profile/Sameer-Kamat"
            },
            "answer_text": "Since business schools have started accepting GRE scores for their MBA programs, a common question we get is whether MBA admission teams prefer GMAT over the GRE. The (official) answer is they don't. However, if you're planning to target the top tier consulting firms and investments banks, some may ask for a GMAT score. So make sure you think through the process before starting your test prep. Happy to share more details on this if you'd like (just mention it in the comments). Other than that, for admissions if you think you have a better shot at the GRE than the GMAT, go for it. We’ve seen some candidates doing better with GRE after multiple attempts at the GMAT. For newbies, the video below provides an overview of the GRE - the test fee, format / syllabus, registration process, best prep books, average GRE scores for Harvard, Stanford, MIT and other top universities. The description below the video includes several GRE prep resources - like the GRE percentiles, list of practice tests. It also includes a free GRE essay grader that you can use unlimited times to test out your practice essays. While using the free tool, keep in mind that this is just an approximation and it may not replicate the behavior of the official essay tester.  Baaki sab kushal mangal! ",
            "date": "Answered July 3, 2019",
            "views": "569",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jinang Bhansali",
                "href": "/profile/Jinang-Bhansali"
            },
            "answer_text": "just by increasing your vocabulary, you will drastically increase your chance of scoring high on all verbal sections. A high vocabulary directly correlates to higher understanding of the English language, additionally a high vocabulary will allow you to express your ideas and views in a more cogent and articulate manner. Do the following to increase your vocabulary (note that it will take a minimum of two months to do this properly): Barron's Word List: The entire list consists roughly 4000 words, if you want a score higher than 160, then it will be necessary to wade through the entire list. But since the New GRE places a lower emphasis on Vocabulary, even if you just complete the high frequency \"Ubiquitous 800\" word list, you will be able to score a 150+.Use the Words Regularly: Continuous revision is a necessity if you hope to learn the entire word list, so make use of the words which you learn everyday when even the opportunity presents itself. Additionally once a week, revise all the words which you learnt the previous week.Use Flash Cards: A easy and fun way to revise on the go, is to use flash cards. While you do get them ready made, if you make your own they will prove to be more effective, since you will be writing them down as well.How to Ace the GRE Verbal Text CompletionThe only things which is checked in the text completion section is your ability to understand the complete picture i.e. your ability to select words which will fill the blanks completely and make sense to read. Clues to the answer will be found within the words present in the passage itself, so read carefully before answering. How to Ace the GRE Verbal Sentence Equivalence This is by far the easiest of the three sections, mostly because with a strong vocabulary you will be able to answer most of them correctly. A important tip for this section is that you must select two words which mean the same thing, complete the sentence perfectly i.e. of the 6 answer choices provided, 3 will be obviously wrong, the other three will fit, but only two will be synonyms, so always select the synonyms! How to Ace the GRE Verbal Reading Comprehension This is by far the toughest of the three sections in the GRE Verbal since it requires a high vocabulary, a high understanding of the English language, and a high reading/understanding speed. The only way to score high in this section is to: Read classic books where the use of language is exceptionally goodRead newspapers articles of high quality i.e. The Hindu Editorial SectionUnderstand the flow and reasoning behind the textRead about the different types of questions which are commonly asked; this will save you time and allow you to find the answer fasterPractice, Practice, and more Practice (try as many questions as you can)While all of the above will take a lot of time and effort from your part, it will pay off big. If you manage to do all of the above, you are guaranteed a 160+ score. ",
            "date": "Answered April 12, 2017",
            "views": "713",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Yash Ashara",
                    "user_href": "/profile/Yash-Ashara"
                },
                {
                    "user_id": "Aditya Cherukuri",
                    "user_href": "/profile/Aditya-Cherukuri-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yogish Lavanis",
                "href": "/profile/Yogish-Lavanis"
            },
            "answer_text": "The internet is flooded with awesome forums and groups for GRE aspirants. In the era of online education, the advantages of one-on-one interaction, personalized online training, doubt clearance, and many other aspects of learning are what you should capitalize on to give an edge to your preparation. However, I would like to emphasize here that even though forums are excellent sources of information, one will not be able to achieve high scores using just forums and discussion groups. It is not a prudent idea! One requires expert guidance to score high and land in his/her dream university.  With that said, here is a list of forums which one might find somewhat useful: Urch-GRE: Urch is a great place for students to interact with fellow GRE aspirants. Still it has some cons. Find the specific pros and cons of Urch-GRE forum in this Table. The GradCafe: The topics in this forum are broad, ranging from AWA analysis to Visa preparations. This forum differs from Urch and also has a set of pros and cons: Dr. Raju's Forum: This is another good forum for GRE verbal and quant preparations. There are threads which address issues related to Visa and other admission requirements. GRE PrepClub-Forum: This website is dedicated to GRE and has detailed GRE forums. The forums offer in-depth and detailed analysis of each topic Edulix forum: is known for its profile evaluation sub-forum. It is also a well thought GRE prep forum, it still lacks the volume of GRE preparation threads. For details about other forums, you can check this blog: Best online forums for GRE preparation.There are some Facebook groups which can be helpful for a self-preparing student, who seeks to get quick replies to his doubts. Check these out: MS in US fall' 2016: Though it seems a little out-dated, the group is active. People regularly post their doubts and get replies from fellow aspirants and other experienced people. It is a big community of like-minded people aiming for success in GRE.MS Dreams: This is another group with 6 k+ members looking to land in their dream universities for Master’s. The added advantage in this group is that as aspirants interact with each other, GREedge experts answer each doubt with careful analysis of the doubt. Expert advice is a big advantage any day. The group also has regular quizzes and other activities to keep the aspirants well-informed and engaged.To summarize there a few good things & the some not so good things of general user groups and forums. To state a few: Answers usually don’t come from experts that is why the answers are not carefully curated or vetted. All kinds of marketers & product pushers and highly excitable or frustrated writers take to such forums. It is highly likely to see a swaying, persuasive statement that is far from the truth or at least not universally applicable. In the field of GRE preparation, high score and university choice - personalization is everything. The decisions, teaching and training has to be quite nuanced and personalized to each student. This tends to be missing in a general, uncurated forums.Forums are a great place for you to interact with other GRE aspirants like yourself. You can clarify doubts and gain insights into personal experiences such as things to watch out for on the test day etc. That said, it is necessary to acknowledge that in these forums, it is personal experiences, not expert guidance, that takes the forefront. What works for one student may not work for another and blindly following a plan without ensuring it adheres to your strengths and problem areas is a concern.Keep your eye on the prize when you are preparing i.e, getting the best admit for your profile and choose the right method of preparation tailor-made for you. ",
            "date": "Updated September 13, 2016",
            "views": "8",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nandini Ghosh",
                    "user_href": "/profile/Nandini-Ghosh-39"
                },
                {
                    "user_id": "Anwesh Satapathy",
                    "user_href": "/profile/Anwesh-Satapathy"
                },
                {
                    "user_id": "Karthik Subramani",
                    "user_href": "/profile/Karthik-Subramani-32"
                },
                {
                    "user_id": "Anamika Misra",
                    "user_href": "/profile/Anamika-Misra-4"
                },
                {
                    "user_id": "Mahendra B",
                    "user_href": "/profile/Mahendra-B-2"
                },
                {
                    "user_id": "Ramesh Adhikari",
                    "user_href": "/profile/Ramesh-Adhikari-25"
                },
                {
                    "user_id": "Abdul",
                    "user_href": "/profile/Abdul-177"
                },
                {
                    "user_id": "Abhishek Bicchal",
                    "user_href": "/profile/Abhishek-Bicchal"
                },
                {
                    "user_id": "Akshay Khanna",
                    "user_href": "/profile/Akshay-Khanna-2"
                },
                {
                    "user_id": "Khan Asif Ur Rahman",
                    "user_href": "/profile/Khan-Asif-Ur-Rahman-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shital Pagare",
                "href": "/profile/Shital-Pagare"
            },
            "answer_text": "1. Start Early\tStart early and study often! If you majored in philosophy and haven’t  seen a polynomial since high school, be realistic regarding how much  time it will take you to refresh your knowledge of algebra and geometry,  and then how much time it will take you to study GRE-specific content  (such as the Quantitative Comparison format) and practice under timed  conditions and on actual Section Adaptive Tests. If it took you two  years to learn algebra the first time around and you feel like you’ve  forgotten it all, you can expect to need several months (at least) to  get back in the game. \tSimilarly, if you majored in engineering and haven’t been regularly  reading and processing college-level material in areas such as social  science, literature, and historical analysis, it’s going to take awhile  to become comfortable with and confident about that kind of material –  not to mention the time it will take to substantially augment your  vocabulary. 2. Learn Vocabulary in Context\tMany students make the mistake of memorizing dictionary definitions of  words without really understanding those definitions or being able to  comfortably use those words in sentences.\tYou want to learn words like “traduce” and “bonhomie” the same way you  know words like “study” and “mistake” – that is, you can barely even  remember a time when you didn’t know those words.\tWhile vocabulary lists, flashcards, and the like are important, some of  the best vocabulary accrual occurs when you are reading difficult  material , and you go look up a word you just read in context. 3. Don’t Leave “Holes in the Foundation”\tIt’s very satisfying when you figure out the greatest possible value of  n such that 40 to the 60th power is divisible by 2 to the nth power  (it’s 180). However, questions like this one are relatively rare,  whereas basic and medium-level questions in algebra, geometry, and data  analysis (especially percents and averages) are very common. Students  who focus only on the “brainteasers” while neglecting the basics do  poorly on the exam.\tBefore focusing on the most difficult level of material, make sure you  are completely solid on solving equations and systems of equations, the  average formula, percent change, the difference between adding and  multiplying fractions, when you can cancel in an equation with many  fractions, converting decimals to percents, converting fractions to  decimals, finding a circle’s area and circumference, factoring  polynomials, and many other high school math topics you may have  forgotten. 4. Take Your Online Practice Tests Seriously\tWhen you work through the Manhattan GRE Strategy Guides or the Official  Guide to the GRE Revised General Test, do you work at your own pace,  write in the book and on the geometry diagrams (rather than redrawing  them), and do problems one or a handful at a time before taking a break  or stopping to reflect?\tIf so, your practice is nothing like the real experience of taking the real GRE. On the real test:\tMost people are incredibly pressed for time. We typically do not have  time to check our work, or to run back over or reflect on our work.\tYou have to redraw any geometry diagrams, and otherwise copy down relevant information to your paper.\tYou only get one break, after writing two essays and completing your first two GRE math or verbal sections without stopping.\tNo water! Obviously, no coffee, no sandwiches. You can’t absentmindedly  apply lip balm, pet the cat, grab a ponytail holder and put your hair  up, go grab a sweater, or check your text messages. You have to sit in  the chair, dehydrating by the minute, and go through about two hours of  testing at a time, without stopping.\tBefore taking the real GRE, you should have achieved your goal score on  three consecutive practice tests. Needless to say, you should take  those practice tests under the conditions described above. Ideally, you  could even take your practice tests at the same time of day as your  actual exam appointment. 5. Cultivate a Productive Attitude\tThe above might seem daunting (although an assiduous approach will  indubitably redound to your success!) Some students say “I’m already a  college graduate. Why do I have to spend months studying for this exam?  That’s just too much time.”\tHere’s a way to look at it – if you exercise for one hour a week,  you’ve almost thrown that time away, because that’s not enough time to  get results. But if you exercise for five hours a week, you’ll end up in  much better shape! That is, it’s exercising insufficiently that is a  waste of time.A serious, academic approach to GRE study isn’t about tricks and quick  fixes. It’s about the actual material and skills that the GRE is  designed to test. And no amount of time is too much to spend on becoming  a more knowledgeable person with a brain that functions at a level of  peak performance. ",
            "date": "Answered August 8, 2015",
            "views": "805",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sarah Kunish",
                    "user_href": "/profile/Sarah-Kunish"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carol Linn Miller",
                "href": "/profile/Carol-Linn-Miller"
            },
            "answer_text": "That depends. All I am going to is go a bookstore and buy one, maybe 2 GRE prep book, pretty much what I did 35 years ago. . If you to pay for GRE prep course and tutor, fine , go ahead, but that is YOUR choice and YOUR decision. Despite what another person has said. i found three ETS  books one published by Kaplan by looking at the Barnes and Noble web pages. , and since it is Sunday night, Barnes  and Noble  may have just closed. .   Excuse me.  It's  dinner time.  My brain does not work very well  without glucose. I may do some more online research after dinner.  You can pay a GRE  tutor  ri Continue Reading",
            "date": "Answered November 3, 2015",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sneh Prateek",
                "href": "/profile/Sneh-Prateek"
            },
            "answer_text": "I took a sabbatical and went home for 3 weeks to study (I know, lame!) before my GRE. I took a lot of mock tests - 5 Kaplan, 3 Princeton and 2 ETS. This kind of helps as you get used to the rhythm of taking the exam and sitting for around 4 hours at a stretch plus I think it helped me in quants especially to see the kind of mistakes I tend to make. Quantitative Reasoning:I did not do much besides the mocks. I will recommend people who are rusty in maths to brush up on Statistics, Permutation Combinations and Probability.Recommended Material: ETS Official Guide.Mock Tests (Take as many as you Continue Reading",
            "date": "Answered October 24, 2014",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "VocabSmith",
                "href": "/profile/VocabSmith"
            },
            "answer_text": "GRE consists of the following sections. 1.\tAnalytical Writing – 2 sections or tasks     a.\t“Analyze an issue”     b.\t“Analyze an argument”2.\tVerbal Reasoning – 2 sections     a.\t25 questions/section3.\tQuantitative Reasoning – 2 sections     a.\t25 questions/section Your verbal ability accounts for two thirds of your score; quantitative ability accounts for the rest. To do well in GRE, you must ace the linguistic side of the test.  How do you do that?  Cultivate a habit of reading extensively. Any book (my personal recommendation are the classics), magazines – The Economist, Reader’s Digest Continue Reading",
            "date": "Answered May 11, 2016",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Socrates Chinnasamy",
                "href": "/profile/Socrates-Chinnasamy"
            },
            "answer_text": "Three books and an app  I am writing this for a not so avidreader and a person with decent mathematical skills and aiming at somewherearound 320 and a month’s time and i am suggesting this for all sections except Analytical Writing Assessment (AWA) Resources Required The Official Guide to the GRE Revised     General Test (With CD)Manhattan 5lb bookMagoosh GRE vocabulary App The Schedule 1st week Daily dose of words (20-30)/day from Magoosh app with their meaning clarified completely in different contexts (use different online dictionaries to pin down the right meaning with the help of sentences). R Continue Reading",
            "date": "Answered March 25, 2016",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sandra Siby",
                "href": "/profile/Sandra-Siby"
            },
            "answer_text": "Hi! I took the GRE in October 2011, right after they changed the format to the current one. First of all, a note about the format: In the earlier version of the GRE, there used to be synonym and antonym sections. These were scrapped and the new version has comprehension and sentence completion questions mainly. This has a bearing on your preparation because now, the focus has shifted from how many words you know to how well you can understand a piece of text. I feel that the new format reduces the pressure on students to memorise a large set of words. Regarding the time you should devote, it re Continue Reading",
            "date": "Answered June 9, 2013",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Parth Mehta",
                "href": "/profile/Parth-Mehta-6"
            },
            "answer_text": " GRE is an aptitude exam that cannot be beaten but can definitely be mastered. It comprises of three different types of sections, namely Quants, Verbal and AWA (Essays).To prepare for it requires around 2 months, give and take a few days. If you are an Indian (or Asian for that matter)  like myself, chances are your verbal will be weaker compared to quants. Needless to say, you will have to spend more time improving your verbal. The following are a couple of things I did while preparing for the exam   Start by solving the standard books for both quant and verbal. This includes books like BarContinue Reading",
            "date": "Answered April 6, 2014",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Somnath Mishra",
                "href": "/profile/Somnath-Mishra"
            },
            "answer_text": "If you are good in Quants and average or even below average in Verbal then I can suggest you a very good planning because that’s what I am and I did okay in GRE. To make you familiar with my level, I took the CAT and scored 98+ percentile in Quants with less than a months’ light preparation but I scored so bad in Verbal that I am even ashamed to put the score here, I would say I was Verbally abused that day. But an MBA was never really my plan so that din’t bother me much. I spent two months preparing for GRE, almost 2 hours a day, I also used to look into words everyday and I din’t really keep Continue Reading",
            "date": "Answered August 2, 2016",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vinay Nair",
                "href": "/profile/Vinay-Nair-3"
            },
            "answer_text": "1. Reading wordlists:About one month before my exam, I started reading word lists – basically a set of words that most commonly appear in GRE. Over the course of the month I memorized the meanings of almost all the words in one list (about 800 or so) – although it did help that I was already acquainted with many of them. 2. Taking sample tests to realize my weak areas:About 2 weeks from the exam, I took my first practice test and I saw that most of my mistakes were in the comprehension type questions and also a few “fill in the blank” type questions where I didn’t know the meanings of some Continue Reading",
            "date": "Updated November 15, 2015",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adhrit",
                "href": "/profile/Adhrit-1"
            },
            "answer_text": "Start reading American newspapers and magazines from Day 1 and continue till your GRE test date. Try to learn the contextual meaning of the new words that you come accross . Eg : Washington post (Washington Post: National, World & D.C. Area News and Headlines ), The New York Times (Breaking News, World News & Multimedia ), The Scientific American ( Science News, Articles, and Information ), The New Yorker (The New Yorker )Month 1 : Write 3 - 4 mock GRE tests ( No need for any preparation ) and check your scores. It will definitely be low / very low. Don’t get disappointed by the score. It will Continue Reading",
            "date": "Answered June 6, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Monil Shah",
                "href": "/profile/Monil-Shah-57"
            },
            "answer_text": "There are few key things you can take care of : Try to enroll in some coaching, if you feel you can do it on your own then your wish . I took Princeton Review classes. 1. Practice consistently with increasing time. You can start by giving Quant 10–15 minutes per day and Verbal 30 mins per day. 2. Search for some Vocabulary list that can give you nearly 1000–1500 High frequency words like Manhattan. These words are not a gurrantee but are most likely to be asked. 3. Practice Vocabulary regulary. Atleast 15–20 words a day. You can either start reading a novel that has rich voacbulary or Hindu Expres Continue Reading",
            "date": "Answered July 23, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Saikiran Dudyala",
                "href": "/profile/Saikiran-Dudyala-1"
            },
            "answer_text": "A very nice and a generic question to answer. Let me try to answer this question as much as possible.  The first thing you would want to do is to understand what is tested on the GRE. You should be knowing the concepts and the structure of the test in order to relate to whatever you are preparing. You can refer to the below link for the same.  About the GRE revised General Test After this, you should be taking a full-length mock test. The purpose of the diagnostic test is twofold: 1. To give you a taste of what the actual GMAT feels like (length, difficulty and fatigue) 2. To help you understand Continue Reading",
            "date": "Answered September 3, 2015",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manoj Singh Negi",
                "href": "/profile/Manoj-Singh-Negi-2"
            },
            "answer_text": "Before you read the following answer, you should have PASSPORT. If not, apply now at Passport Seva Home | Indian Passport | Passport | Passport Seva Project . It's okay to say it!! You want to get that barrier of 320+ in GRE. But do not want anyone else to know. Fine!! So here are things that can make you score above 320+ in GRE. 1. Positive mindset. Make a target. I'm not saying only 320+, that can be 310 or 305. Great, but make a target and rely on that. Always think that you can achieve that threshold.  2. Measure your performance daily. You have made a target, and now it's time to measure it dai Continue Reading",
            "date": "Answered January 10, 2016",
            "views": "0",
            "upvotes": "0"
        }
    ]
}