{
    "title": "How to know if college is for me - Quora",
    "tags": [
        "The College and University Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Derek Magill",
                "href": "/profile/Derek-Magill"
            },
            "answer_text": "You’re already starting on a better foot than most people by asking this question, Don’t trust anyone who says college is good for everyone anywhere regardless of personal context. It’s an unthinking opinion that we wouldn’t apply in almost any other category but which we use gleefully when speaking of college all the time. It’s led to massive debt, unemployement, and general unhappiness for tens of thousands of people. Without knowing more about you, the best I can do is give you a bit of a system to use to make the decision more clearly. Try to answer the following questions as concretely as possible. A. What do I want to use my degree for? B. What’s the financial cost of the degree? Will I have to go into debt? How could that limit my other goals? Do I really understand all the implications of a large college loan? C. Can I micro test my career first before enrolling in school through an internship or apprenticeship somewhere? D. Are there cheaper/faster alternatives I can pursue elsewhere? E. Is it the right time for me to enroll now or would I prefer to do something else first? F. What are my reasons for going to college? Are they my own reasons or the reasons of my friends, family and teachers? G. What is the opportunity cost of going to college in terms of time? In other words, what do I give up by spending 4 years in the classroom and am I willing to giv that up? Don’t stress about the answers, just be honest. Nobody will have the exact same answers but I’ve found these questions to be particularly helpful. If you’re like the majority of young people out there, you probably shouldn’t enroll in college right away. It’s hard to have these answers and in their absence, I don’t think you can justify the cost and time associated with a degree. ",
            "date": "Answered October 3, 2017",
            "views": "45",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Lim",
                    "user_href": "/profile/Mark-Lim-133"
                },
                {
                    "user_id": "Solid Rogue",
                    "user_href": "/profile/Solid-Rogue"
                },
                {
                    "user_id": "Kija CM",
                    "user_href": "/profile/Kija-CM"
                },
                {
                    "user_id": "Birkir Leó",
                    "user_href": "/profile/Birkir-Leó"
                },
                {
                    "user_id": "Kortney Baca",
                    "user_href": "/profile/Kortney-Baca"
                },
                {
                    "user_id": "Isaac M. Morehouse",
                    "user_href": "/profile/Isaac-M-Morehouse"
                },
                {
                    "user_id": "Kenneth Clark",
                    "user_href": "/profile/Kenneth-Clark-51"
                },
                {
                    "user_id": "Bruce Wills",
                    "user_href": "/profile/Bruce-Wills-2"
                },
                {
                    "user_id": "Solomon Kane",
                    "user_href": "/profile/Solomon-Kane-14"
                },
                {
                    "user_id": "Edward Glyver",
                    "user_href": "/profile/Edward-Glyver"
                },
                {
                    "user_id": "Kshitij Uniyal",
                    "user_href": "/profile/Kshitij-Uniyal-1"
                },
                {
                    "user_id": "Rohin Gupta",
                    "user_href": "/profile/Rohin-Gupta-5"
                },
                {
                    "user_id": "Jackson Sullivan",
                    "user_href": "/profile/Jackson-Sullivan-2"
                },
                {
                    "user_id": "Ganesh Dhungana",
                    "user_href": "/profile/Ganesh-Dhungana"
                },
                {
                    "user_id": "Labne Karemel",
                    "user_href": "/profile/Labne-Karemel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Gosnell",
                "href": "/profile/Scott-Gosnell"
            },
            "answer_text": "If you can’t think of any better opportunity, then college is for you. If you can’t think of anything worse, then college isn’t for you.  I mean the first one literally. Some people have a specific, concrete opportunity in mind that is so life-changing that college pales in comparison, or that gets them to their goal without an intermediate step. They have a choice between studying Drama in college or being the star of a big budget movie or TV series—taking the starring role is a better, more direct option, and they can always go back to school if they want to. I mean the second one figuratively. For many people, it’s a great privilege to have four years to read great books, learn from the learned, and have a marvelous social life. For others, college seems like four more years of the worst parts of high school, and they’re now paying for the privilege. College is still the best option for many people, even people who don’t yet know what they’re going to do with it. Many of the downsides can be avoided with conscious attention paid to selecting a college that is right for you: it provides the experience of college that you want to have, with classmates who feel the same way. Consider many colleges, especially the weird ones—they have the strongest cultures. You should also consider and explore other options. Find out what your friends are doing and why. Even if you ultimately reject some or all of those options, that gives you information about yourself. ",
            "date": "Answered October 14, 2017",
            "views": "16",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ted Runion",
                    "user_href": "/profile/Ted-Runion"
                },
                {
                    "user_id": "Susan Bertolino",
                    "user_href": "/profile/Susan-Bertolino"
                },
                {
                    "user_id": "Peter Fernoviski",
                    "user_href": "/profile/Peter-Fernoviski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas B Walsh",
                "href": "/profile/Thomas-B-Walsh"
            },
            "answer_text": " In the US about 40% of high school graduates rush off to college to earn that credential of credentials—the bachelor’s degree—not realizing they are entering into a competition for a few good jobs. Half of all college graduates are going to be under employed or unemployed in today’s job market. One in four student loans are in default or delinquency. Despite these facts many students (and parents) are obsessed with the idea of going to college. For decades the youth and their parents in our country have been the target of societal, familial, educational, and political propaganda stressing the point that: To be a success in life you MUST graduate from a four year college. This pressure has led a lot of young people to make some really naïve post-secondary education choices, the result of which is an investment of time and money with little or no return. Often this poor investment choice has had the corollary effect of running up debilitating debt. There may have been a time many years ago when a college degree almost guaranteed financial success, but nothing could be further from the truth today: There is a huge disparity between supply (graduates) and demand (suitable jobs).Colleges, by and large, are operating on an obsolete business model--pre-Internet/pre-globalization.Not only is the business model obsolete, the education they are providing has deteriorated over time. (Read Academically Adrift.)There is a gap between skills acquired and skills required. (There are businesses making a nice profit providing camps that teach college graduates the skills they need to get a job.)At the same time the cost of college has soared. Many degrees today have little or no ROI.If colleges operated as private sector businesses, they would be out of business, but yet large numbers of high school graduates just keep beating a path to their gates. Going to college in the US today is a risky business because of 1) the high cost 2) the shortage of suitable jobs, and 3) the danger inherent in taking out student loans. Is college for you? Are you really smart and highly motivated?Have you identified a marketable major?Can your family afford to send you without you having excessive student loans.Has your family prepared a “whole degree” financial plan?If you can answer, “yes,” to all four of these questions there is a pretty good chance you can go to college, graduate, and get a good job. ",
            "date": "Answered October 14, 2017",
            "views": "68",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ted Runion",
                    "user_href": "/profile/Ted-Runion"
                },
                {
                    "user_id": "Juliane Otero",
                    "user_href": "/profile/Juliane-Otero"
                },
                {
                    "user_id": "Viola Yee",
                    "user_href": "/profile/Viola-Yee"
                },
                {
                    "user_id": "Dennis Pilat",
                    "user_href": "/profile/Dennis-Pilat"
                },
                {
                    "user_id": "Tanveer Singh",
                    "user_href": "/profile/Tanveer-Singh-104"
                },
                {
                    "user_id": "Sameera K",
                    "user_href": "/profile/Sameera-K-20"
                },
                {
                    "user_id": "Tathagat Dua",
                    "user_href": "/profile/Tathagat-Dua-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vinod Chelladurai",
                "href": "/profile/Vinod-Chelladurai"
            },
            "answer_text": "You need to analyze from different perspectives while choosing a college: Degree - Research about the achievements of past students of the degree that you wish to study in this college. If you could pick a handful of students excelled in career (either in research or industry jobs) because of doing your degree of choice in this college, then you can conclude that it makes a great sense to proceed further. In this context, also make some homework about the benefits that the college offers for the department where your degree is being taught. For example, check whether the department has any great projects that it can offer for its students and therefore, upon working for such projects, your resume will be enhanced greatly.Other curricular activities - Say for example, you are interested in tennis. Check whether the college has facilities to provide you an environment where you can improve your tennis and play at local league levels. I firmly assure that college is a great place to improve your extra-curricular talents than schools.Living facilities - In case you are choosing a college far away from home, I would prefer to stay close to the campus since it adds a great benefit to get away from distractions and focus on your studies and other activities. Therefore, it’s very important to check whether college provides facilities to stay or at least the place near your campus has good and safe residential facilities.Socializing - Again, in case of staying away and studying, check whether your college has activities or local organizations for students in order to improve socializing capabilities of a student - for example, conducting events to understand other country’s culture. Socializing is very important especially when you stay away from home as it gives a positive attitude to proceed further in the college.Student Development Centre - Check whether the department of your degree of choice has something like this where they discuss about new trends. techniques or researches in order to update the students’ knowledge in a particular domain and keep them enthusiastic in their studies.",
            "date": "Answered October 14, 2017",
            "views": "958",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "An He",
                "href": "/profile/An-He-12"
            },
            "answer_text": "UPDATE: This questions was originally “How do I know if college is good for me”? Merged with another similar question with totally different meaning. It’s bad for most people. Most people come out of college unemployable when they choose the wrong major. Wrong major will cripple you intellectually and emotionally for years. You’re likely not ready for college if you can’t do one of the following: Score at least 1300 on SATPass at least 3 AP examsThat should be minimum requirement for anyone to get into a college. Sadly, most colleges are a repeat of high school, total scams. Avoid shit schools, there are only 100 schools worth going to, and some of them only if you get into their honors program. You should also avoid college if you struggle with pre-calc. College Makes People Fat and Stupid ",
            "date": "Updated December 7, 2017",
            "views": "395",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sapna Ullal",
                    "user_href": "/profile/Sapna-Ullal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Thompson",
                "href": "/profile/Dave-Thompson-84"
            },
            "answer_text": "You’re fearful of the unknown, we get that. You’re unsure that you are good enough, like lots of people. Your self-confidence is non-existent. Look around you. What would you really like to do? What are you good at? Are there jobs that pay actual money for doing that? What are your strengths? Are you very organized? Bookkeeping, accounting, inventory control, bank teller, lots and lots of jobs need that skill. What are your weaknesses? Don’t relate well to people. Stay away from sales, complaint departments, hiring, nursing homes. Do some preliminary job searching, volunteering maybe, and narrow down what you want to do after schooling is over. Then you can focus on what kind of education you will need. ",
            "date": "Answered October 14, 2017",
            "views": "589",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ted Runion",
                    "user_href": "/profile/Ted-Runion"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allen Seay",
                "href": "/profile/Allen-Seay"
            },
            "answer_text": "A college degree will be good for you because the decades old high school diploma is being replaced by the four year completed marketable college degree in the job market across the United States. In the future, people that don't have one and find that a job that they want that requires one are going to be frustrated, possibly mad and upset. Check it out and see if it offers the degree that you want. When you go college you have to learn to spend whatever time and effort that you need to to master your classwork because that is the reason why your on campus. ",
            "date": "Answered October 3, 2017",
            "views": "408",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thomas F. Keel",
                "href": "/profile/Thomas-F-Keel"
            },
            "answer_text": "I’m not sure how to answer. In a certain sense, all colleges are good for their students. And, any college is largely what the student makes of it. But I think you are looking for something more specific. An excellent way to know if a specific college is “good” for a specific student is for the student to ask the admissions people to provide alumni who have pursued similar career goals to those of the student, then contact the alumni for their experience both within and beyond the college. ",
            "date": "Answered October 3, 2017",
            "views": "362",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daniel Vu",
                "href": "/profile/Daniel-Vu-3"
            },
            "answer_text": "Look at yourself right now. Are you bored to death in that class that’s supposedly preparing you for college in high school? Are you lusting to be out and about, traveling, seeing what the world has to offer, along with actually learning something useful? College is not necessarily the answer unless they actually have a program that’s set up to cater to you that way, in which they do not always do. So think very carefully before you go the default route of college. ",
            "date": "Answered August 9, 2017",
            "views": "376",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chuck Cobb",
                "href": "/profile/Chuck-Cobb-3"
            },
            "answer_text": "College should not be an end-in-itself. The primary purpose of any college education is to help prepare you for a professional career. If you have a goal to be in a professional career that requires a college education, you should go to college. If you don’t know what your career goal is, you should probably get some career placement testing to better understand your aptitude and interests. ",
            "date": "Answered October 14, 2017",
            "views": "285",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ravi",
                "href": "/profile/Ravi-1476"
            },
            "answer_text": "First of all visit the college before joining.Collect all the details of the college.Then analyse the college.Have some discussion with your parents.Then you will know which college is best for you. ",
            "date": "Answered December 10, 2017",
            "views": "190",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shriram R",
                "href": "/profile/Shriram-R-6"
            },
            "answer_text": "Go in person and have a look at facilitiesinfrastructurealumni networkplacementnumber of courses/workshops/seminarssyllabiThen interact with the students and alumni this will give you a good idea. Best wishes ",
            "date": "Answered December 10, 2017",
            "views": "103",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jan Dawson",
                "href": "/profile/Jan-Dawson-3"
            },
            "answer_text": "College is a route to professional settings and a career . If you are not interested in a professional career in technology or medicine, or science or engineering then you could approach your career without going to college. If you can gain the experience or training needed without the aid of going to school, then that's fine, too. It depends on what you want to do A2A. ",
            "date": "Answered October 14, 2017",
            "views": "317",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wallstone Sangala",
                "href": "/profile/Wallstone-Sangala"
            },
            "answer_text": "A couple of things you can do. One is to check its rating. You can also find out from people who studied there. ",
            "date": "Answered December 6, 2017",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joan McEachern",
                "href": "/profile/Joan-McEachern"
            },
            "answer_text": "Spend some time on campus. Sit in on a few classes Go to the meeting place and hang out with the students. You need to feel you belong. ",
            "date": "Answered October 15, 2017",
            "views": "84",
            "upvotes": "0"
        }
    ]
}