{
    "title": "How is the salary of a high school teacher determined? - Quora",
    "tags": [
        "High School Teachers",
        "High School Education",
        "Teachers",
        "Teaching",
        "The High School Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard P. Morrall",
                "href": "/profile/Richard-P-Morrall"
            },
            "answer_text": "Originally, before the era of contract negotiations, the Board of Educations set the salary schedule. The district had so much income and thetefore money to spend. From those funds the administration has to pay for facilities, supplies, student costs, insurance, food, and salaries. I doubt that any member of a school board would vote to keep salaries low if they had the budget to allow them to pay more. If it costs the school district a million dolars to give teachers a one per cent raise, that means a million dollars less for other costs. Now, of course, salaries are set by negotiations between the teachers association/union and the school board through the administration. Both sides know how much money the district has to work with. We could ask for a ten percent raise, but we know that to fund that, thete would be no heat in our classrooms, no food services, and no paper! At least in my experience, both sides wanted to keep salaries competitive and fair, and both sides knew what it costs to maintain a district. For many years, even before the negotiations era, the district promised to keep our salary schedule above the average of the seven surrounding districts. If the average raise was three percent, the district would give up a raise at or above three percent. When the State of California was in trouble, and didn't send the money we expected and they had promised, both the district and the teachers knew that there was no money for raises. Indeed, there were cuts in personnel to allow the district to maintain the payroll. Everyone kept track of what we would have gotten if the salary had been tied to the cost of living. When, after a number of years, the state met its constitutional requirements to fund schools at a certain level — the state supreme court ruled that the state had acted illegally — the district added up all the raises we had missed and that was its offer. It also added enough of a raise to fund the money we had not received the years of no raises. We had pulled together to get through the lean years; we certainly stayed together when the funding improved. an aside. In the United States all states use a unified school district. All teachers are on the same salary schedule. Education, experience, and special duties determine the salary. The level on which one teaches — elementary, middle schhol or high school — has no influence on one's pay. ",
            "date": "Answered November 24, 2019",
            "views": "262",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "Gene Rick",
                    "user_href": "/profile/Gene-Rick-1"
                },
                {
                    "user_id": "Michael Fiorot",
                    "user_href": "/profile/Michael-Fiorot"
                }
            ]
        },
        {
            "author_info": {
                "name": "Norman Plume",
                "href": "/profile/Norman-Plume-3"
            },
            "answer_text": "At my Charter School (as well as the school district we came from), salary is determined by the number of college credits received AFTER getting your Bachelors Degree, and by your years of service. at 20 years and 96 units of credit, you max out, and only get a raise when one is negotiated, or when you reach a 5 year supplement (so you get a raise at 25, 30, 35, and so on). Most schools work on a seniority system or a modified seniority system where you get credit for additional training. This is mainly because this system is the only one that is clearly measurable and not determined by the performance or lack of performance of children on a test. Right now, I work on EDUCATING my students. I am only worried about making sure they understand history. I get them ready for the state tests, but that is not my focus. If we went to a system where my pay relied on the students doing well on a test, you can bet your bottom dollar I would give up this understanding history crap and teach nothing buy test taking skills, and drill and kill on facts likely to be on the test. I wouldn’t give a rats behind if they understood… My only job would be to get them ready for that test, then do everything I legally can do to make sure they all scored well on that day (and perhaps encouraged one or two to play hooky on the day of the test)… ",
            "date": "Answered November 27, 2017",
            "views": "316",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Smith",
                "href": "/profile/James-Smith-4741"
            },
            "answer_text": "In the state of Georgia, there is a state-pay base salary scale. No matter where you teach, teachers with the same number of years teaching and with the same degrees are paid the same amount FROM THE STATE. It doesn’t matter whether you are teaching in a rich district or a poor district; the state pay is the same. However, local boards of education can add supplements to teachers’ salaries, and the supplements can differ dramatically. I retired with 36 years of experience and have a Master of Education degree and a Specialist of Education degree. My local teaching supplement was $1800. If I had chosen to drive 35 miles to a neighboring county to teach, the local supplement for someone with my credentials and experience earns an $8000 local teaching supplement. Additional supplements can also be added for extra duties (coaching a sport, for instance), and, of course, there are administrative supplements. So, the pay a teacher receives from the state is the same regardless of where you teach for teachers with comparable degrees and years of experience, but where you teach can add a little or a lot to your salary. The cost of living in the district 35 miles from me is considerably more than where I live and teach, and while I have never calculated the cost of commuting against the supplement I would receive, I have never been unhappy with my pay where I am. ",
            "date": "Answered November 24, 2019",
            "views": "173",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gene Rick",
                    "user_href": "/profile/Gene-Rick-1"
                },
                {
                    "user_id": "Michael Fiorot",
                    "user_href": "/profile/Michael-Fiorot"
                }
            ]
        },
        {
            "author_info": {
                "name": "Glen McGuffin",
                "href": "/profile/Glen-McGuffin"
            },
            "answer_text": "I’ve often wondered. It is usually on a step basis. You start at a very low amount and the next year a slight raise comes and so on up the line. Usually it is just enough so that the teacher can pay rent on a third class abode and is barely enough to keep a fly alive. How are they decided? A school board is elected—usually formed with doctors, lawyers, business owners [all rich as hell] whose connection with the school is very minimal and they try to lo ball salaries in favor of athletic equipment and other items before looking at teachers’ salaries. ",
            "date": "Answered November 24, 2019",
            "views": "110",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Wilson",
                "href": "/profile/David-Wilson-491"
            },
            "answer_text": "It varies by country and, probably, by state. In New Zealand almost all teacher salaries are set by negotiation between the teachers’ trade unions and the government. Teacher salaries are also paid by the government. School boards, which are the legal employers of all school staff, have no say in the pay of those staff. Salaries progress with experience and if leadership roles are taken on, in accordance with a set scale. The exception is a small number of private schools, which employ and pay their own staff as they wish. ",
            "date": "Answered November 24, 2019",
            "views": "116",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carter McClung",
                "href": "/profile/Carter-McClung"
            },
            "answer_text": "In my district, it’s determined by years of experience. Here’s the salary schedule for Midlothian ISD where I work. There’s a few bonuses. I got one when I got my masters degree (you’ll notice that on the salary schedule, and I get one for being a math teacher. Extra duties can sometimes earn you extra pay. I get extra for sponsoring the UIL academic math teams. ",
            "date": "Answered November 27, 2017",
            "views": "305",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Beasley",
                    "user_href": "/profile/Jonathan-Beasley-11"
                },
                {
                    "user_id": "Karthik Pendur",
                    "user_href": "/profile/Karthik-Pendur"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Puntasecca",
                "href": "/profile/James-Puntasecca"
            },
            "answer_text": "Well, initially by the pay scale and amount of years experience. The tax base has a lot to do with how much you will get. remember, if you coach or run an activity you get more. ",
            "date": "Answered November 25, 2019",
            "views": "51",
            "upvotes": " Answer requested by Jahlia Finney",
            "upvoters": [
                {
                    "user_id": "Claire Snibbe",
                    "user_href": "/profile/Claire-Snibbe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wendy Nieto",
                "href": "/profile/Wendy-Nieto-4"
            },
            "answer_text": "By the years of experience on the vertical scale along with the amount of degrees held on the horizontal scale of the salary schedule ",
            "date": "Answered November 24, 2019",
            "views": "53",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Frank Saunders",
                "href": "/profile/Frank-Saunders-2"
            },
            "answer_text": "dont real ly know but there is a basic rate which goes up depending on how many years on job.had friend who taught music.its ok,average middleclass lifestyle applicable. ",
            "date": "Answered November 25, 2019",
            "views": "26",
            "upvotes": " Answer requested by Michael Fiorot"
        }
    ]
}