{
    "title": "How to stop people from asking me my grades - Quora",
    "tags": [
        "Social Advice",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Beth Injasoulian",
                "href": "/profile/Beth-Injasoulian-1"
            },
            "answer_text": "It’s not unusual to be annoyed by certain questions, certain people, or even random moments where even you are surprised by your own irritation. I ask myself whether I want to let it slide (smile, reply with a distraction); try to improve the situation long term (teach this person where my boundaries are so we don’t cover the same ground repeatedly); or communicate that I am feeling truly disrespected. I personally prefer not to answer questions that feel inappropriate. I think it encourages people to be insensitive, not only with me but others. How we handle these situations impacts - either positively or negatively - our relationships. Replying thoughtfully and honestly not only protects our relationships, but improves our communication skills. I love that you posed this question, and I hope you are rewarded for sharing your dilemma! ",
            "date": "Answered May 13, 2018",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "ANUJ INDANE GAS AGENCY BADUHI Jai Sacchidanad",
                    "user_href": "/profile/ANUJ-INDANE-GAS-AGENCY-BADUHI-Jai-Sacchidanad"
                },
                {
                    "user_id": "Leon Johnson",
                    "user_href": "/profile/Leon-Johnson-97"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sampoorn Gupta",
                "href": "/profile/Sampoorn-Gupta"
            },
            "answer_text": "Hahaha…… brother we can't stop anyone from asking this very ancient question frequently asked by our relatives, neighbours, uncle, ant and many more. I too have less grades. Do you know what I do when someone ask me the same question. I usually smile and say they are less ( काम है मेरे grades ) and ignore the question. And if someone is insisting me to tell my grade points I tell them and directly say (5 or 5.5 or 6 out of 10) whatever the pointer is. Because its wisely said that a single sheet of paper cannot decide our future.  ",
            "date": "Answered May 13, 2018",
            "views": "397",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Satyendra Kumar",
                    "user_href": "/profile/Satyendra-Kumar-1854"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kathy Powers",
                "href": "/profile/Kathy-Powers-10"
            },
            "answer_text": "Continue to say, “I don’t answer that question.” It is non-confrontationally boring to keep hearing this answer. Word will get around. People may keep trying and eventually give up. This technique works well with children. Caveat, this “broken record” technique is very effective. Use it if you are truly serious about ending inappropriate questions. If you are not all that serious, I wouldn’t blame you for having fun with your questioners. I think I would. Know your intent and have at it! ",
            "date": "Answered May 13, 2018",
            "views": "367",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marlene Wolkenbruch",
                "href": "/profile/Marlene-Wolkenbruch"
            },
            "answer_text": "Adults: Just ask about their grades in school. Or better ask their parents. My grandma has the worst stories to tell about my father. He ended up becoming a doctor btw. ",
            "date": "Answered May 13, 2018",
            "views": "179",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Divya Singh Thakur",
                    "user_href": "/profile/Divya-Singh-Thakur"
                },
                {
                    "user_id": "Julie Gates",
                    "user_href": "/profile/Julie-Gates-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deborah Perry Fruk",
                "href": "/profile/Deborah-Perry-Fruk"
            },
            "answer_text": "If it’s your parents- you can’t. They have a right to know.Anyone else— it’s none of their business..Just give them a funny look and ask “Why does that matter ?” ",
            "date": "Answered May 13, 2018",
            "views": "206",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Agbenu",
                "href": "/profile/Stephen-Agbenu"
            },
            "answer_text": "Let them know that you’re not comfortable giving out your grade information. ",
            "date": "Answered May 13, 2018",
            "views": "108",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Stevenson",
                "href": "/profile/Steve-Stevenson-46"
            },
            "answer_text": "You have the right to remain silent. ",
            "date": "Answered May 13, 2018",
            "views": "153",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Roberts",
                "href": "/profile/David-Roberts-303"
            },
            "answer_text": "Better tha yours otherwise why as ",
            "date": "Answered May 13, 2018",
            "views": "270",
            "upvotes": "0"
        }
    ]
}