{
    "title": "How should I prepare for the JEE exam in 2020? - Quora",
    "tags": [
        "JEE 2020 Preparation",
        "JEE 2020",
        "2020 (year)",
        "Joint Entrance Examination Main",
        "JEE Preparation",
        "Exam and Test Preparation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ishita Desai",
                "href": "/profile/Ishita-Desai-44"
            },
            "answer_text": "For the last couple of months before the exam: Time to fix your schedule which you probably messed up after reading the point 4. Again, the basics are pretty obvious, all that revision and stuff. Keep rehearsing for the exam day. By this, I mean if the exam is from 9 to 12 then give a test daily in that duration. Your mind will automatically adjust to this particular time slot to work at its maximum efficiency. Give as many tests as possible so as to overcome the anxiety of the exam which is the leading cause of the so-called “silly mistakes”. Needless to say, Stay healthy.  Dividing Time into smaller parts : Now you have to plan for these 45 days.Divide one day study time in Physics, chemistry, and maths almost equally.Divide chapters in 3 categories as per your understanding and practice : Well studied,Half studied andLeast studied.Each subject : All those chapters you have in Half studied would be studied firstly with 40% time.Then the least studied with 30% time andThen remaining well studied in the last 30% time.Make 3 notebooks for each subject. Whenever you find some topic you are still struggling with. Write imp formula, rules and one example of that in these notebooks called A. Subject wise A-P, A-C, A-M .*Now In the above strategy, you need other divisions of chapter for Hard,Easy andMediumAs per they are asked in JEE mains and to what extent. Now Everday’s plan would be like hard chapter in one subject and easy in 2 ormedium chapters in 2 subjects and easy in one.This way the load for one-day won't increase much.Now [other than daily Physics, maths, and chemistry] you have to solve a paper daily If you haven't solved much strictly go for 2.5 Hr paper. Else you can just go through the answer sheets in 1 Hr. Every paper you solve, you gonna learn at least a few new and tricky ways of handling problems. Whatever you learn new from that write it at a separate place. Call it notebook B. You will collection of 20–25 new easy and interesting methods 5 days before Mains. ** Its high time, Pick out silly mistakes like calculation,wrong interpretation,picking wrong data,Find out one such daily after every paper and Then tell your self not to do that thing the anytime in the whole day whenever you are drinking water. Woah, man! you are out of disease you were suffering from last two years. Not only one, This way you'll remove 20–25 silly mistakes this month. Believe me that works. Also, write these all in a paper. Call it Sheet C. * Make long charts for learning points,constant values,equation in maths and physics andnames of compounds andreactions in chemistry.Paste all these on your walls. Read all of them daily before going to bed. You won't forget it before you enter college. This thing to be done at the time you are studying that particular chapter. These charts would be D. ** From what to revise? : The one which is remaining unused- NOThe one learned very well earlier - NO [NCERT, Refresher]The one book you like and left some part of a few chapters. That makes you learn new problems too and you won't get bored with revision.All problems you have doubt use bookmark for that page and in pin pages write Page no.x Q. no. Y. This list is E *** Keep yourself charged up and self-motivated: Things won't go right after 3–4 days you'll feel you are doing less. It's not going the way you wished it to be. But remember its same for everyone yeah! They are feeling that too. Even the top AIR geeks, so that means you may be one. Just Before Last week:- 1.5 chapters theory in one subject, some 2 chapters to practice problems in other subjects and also to revise some in-between topics in the third subject. You can choose the subject you wish to. But what… you need not think about that coz, someone said: “Its good to be a lion in one chapter then being sheep of all chapters”. Coming to last week plan : First 2–3 days : You’ll everything at its place and for the first three days you’ll use A* and B** Revise all topics of A of three subjects and do some examples of that. Use B for revising the problems and tricks you found new last month. For 5 min, a daily look at sheet C***. Be confident that you won't do these silly mistakes in the final paper. Charts called D*** would gain there importance now. Three times a day revise all such learning facts. I know Einstein said, “Facts and values can be looked in books anytime.” But Neither you are Einstein nor you’d have your books during exams. Coming to E***, I expect you’ll solve these doubts with your friends. Just look at the solution in these three days. I said look at a solution don’t be over smart and start practice. Don’t use a pen last week. 5 hard questions you do, that won’t increase marks. One question you can’t, you’ll depress yourself. You may have heard of cases of last week's depression. Last 2–3 days : Something called handbook provided with material or you’d have bought that is would be in now your best friend. Everywhere three small tiny books as if they are your favorite storybooks. Read them at least twice in three days. Last day, Don’t study anything. Don’t read anything. Not even WhatsApp jokes. Okay ….. I’d say read the veg ones. Eat healthy, no fast food. Sleep for 8–9 hours. Bath. Even if you are a hosteler. Eat light Breakfast. Be confident. Be satisfied. Be positive. Don’t get tense. Don’t hyper in between questions. PCM or CPM or whatever only follow whatever you had practiced enough and found best. It’s not the last struggle you’re fighting for in life. It's not your last struggle. There are labs in college at 9 AM. Waking up for that is … I guess. All the best !! ",
            "date": "Answered May 10, 2020",
            "views": "718",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Suraj Sharma",
                    "user_href": "/profile/Suraj-Sharma-2015"
                },
                {
                    "user_id": "Prem Kumar",
                    "user_href": "/profile/Prem-Kumar-13450"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rahul Kumar",
                "href": "/profile/Rahul-Kumar-7786"
            },
            "answer_text": "According to my experience and knowledge jee preparation is not so difficult . It's only need your time and your focus.You have a lot of time for your jee exam preparation . So Use your time in a right way other wise it will be very difficult for you to pass this exam.Now some the things which I would like to suggest to boost your performance in a right and smarter way are: 1. First of all don’t get confused with questions like “How to start?”, “From where should I begin?”, \"When to study?\". Start with your favourate subject. It will give you confidence to prepare well for IIT JEE. 2. Study with interest without that you understand nothing. 3. Keep yourself motivated. Yes, motivation is known to cause miracles. Don't ever think that you cannot achieve your goals. Whenever negative thoughts surround you, take a break and say ‘ I can, I will and I will definitely crack the exam no matter how much difficult it is'. Keep the never say die spirit in yourself always. 4. Take your IIT JEE dreams seriously. Most students don’t. Take them serious enough to become amazing and move beyond mediocre. 5. Never ever think that you know everything. Overconfidence can never lead you to the right path. Realize your mistakes and weak spots and work hard until they become your strongest topics. 6. Never study till late night it increase depression i suggested to study in morning with fresh mind. 7. One of most important never try to find shortcut completely read all syllabus or read at least with maximum efforts. 8. Most important never ever loose your confidence . 9. Make a notebook containing your mistakes. Whenever you make any mistake in mock test or forget a concept or formula etc. note it down in this notebook. As time passes you’ll have a collection of mistakes which you aren’t supposed to commit in exams. Revise from this copy regularly. 11. Study for at-least 10–12 hours daily. Set targets for yourself and try achieving them daily. Make sure that your daily targets are realistic, so that you don't end up losing your confidence. 12. Use a couple of good theory books along with video lectures (not from youtube). If you need details on that,you can see my other answers. 13. You need to identify the right time(s) when you can study well with full concentration. A minimum of 4-6 hours per day is considered good for JEE preparation. 14. You always remember better when you write things by hand rather than read from a book. Never try to copy the exact text from the book. Read, and then write them in your own words. 15. Make some extra effort with Increase in time of study it’s more important in extra time revise your syllabus . 16. Take some older exam papers unsolved solved on your own without checking the answer until you didn’t solve or you fail at least 4 - 5 times. 17. Practice a good amount of MCQs daily and give lots of mock tests on a weekly or fortnightly basis. In my opinion, MCQs are an integral part of JEE preparation. The more you practice, the better you remember things. 18. None of the coaching institute in India complete the syllabus on time and none coaching in India have the best lot of teachers for all the subject and topics. Generally 25 30 percent of the portion is skipped by most of the coaching institute due to lack of time and slow speed or lack of quality teachers. so I would personally recommend you studying through video lectures in this you just have to sit at a place with your full comfort and convenience and have to watch the video lectures.Instead of using You Tube can opt for JEE professional video lectures.Using them for JEE preparation is something which would save a lot of your time as well make some important concepts clearer and explain some of harder ones. it is also recommended to read the chapter once before the teacher teaches you, so that you can understand better... So rather than referring to books for a thing that is completely new to you.. I would rather prefer lectures, where there is someone to explain things to you and you don't have to struggle to get acquainted to things. IN SHORT- ] Dedication ] Passion ] Constant hardwork ] Learning from your mistakes ] Concentration ] Avoiding negativities ] Time management ] Self-motivation are needed…. HOPE MY ANSWER WILL HELP………….. ALL THE BEST FOR UR FUTURE……………………… ",
            "date": "Answered August 20, 2018",
            "views": "25",
            "upvotes": " View 29 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Syed Muneeb Ali",
                    "user_href": "/profile/Syed-Muneeb-Ali-6"
                },
                {
                    "user_id": "Smarandeep Kapoor",
                    "user_href": "/profile/Smarandeep-Kapoor"
                },
                {
                    "user_id": "Pyush Pandey",
                    "user_href": "/profile/Pyush-Pandey-2"
                },
                {
                    "user_id": "Sanika Sharma",
                    "user_href": "/profile/Sanika-Sharma-15"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/NEHA-ROY-262"
                },
                {
                    "user_id": "Sachin Kumar",
                    "user_href": "/profile/Sachin-Kumar-13828"
                },
                {
                    "user_id": "Burgala Krishna Savera",
                    "user_href": "/profile/Burgala-Krishna-Savera"
                },
                {
                    "user_id": "Biswarup Dhar",
                    "user_href": "/profile/Biswarup-Dhar-3"
                },
                {
                    "user_id": "Dylan Lobo",
                    "user_href": "/profile/Dylan-Lobo-8"
                },
                {
                    "user_id": "Chandan Pandey",
                    "user_href": "/profile/Chandan-Pandey-291"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vipul",
                "href": "/profile/Vipul-146"
            },
            "answer_text": "For students who are in grade/class 10 (board exams currently going on or finished), and if you are an IIT JEE aspirant, the below points will be useful in your preparation for JEE Main and Advanced 2020. The study preparation tips and points for IIT JEE 2020 that i am going to cover here….—— What will be the IIT JEE 2020 examination pattern? JEE Advanced 2020 will be conducted in online (CBT) mode only. There may be a common engineering test in place of JEE Main and various states CETs. The exam is likely to be conducted by National Testing Agency in online mode, twice a year. The conduct of the exam, two times a year, is just a suggestion as of now. It can be scheduled similar to how SAT is conducted worldwide. The number of students who can eligible for JEE Advanced is currently top 2.24 Lakh candidates clearing JEE Main. This limit may get increased for JEE 2020. How to prepare for IIT JEE 2020? IIT JEE 2020 Preparation Strategy Take your IIT JEE dreams seriously. Most students don’t. Take them serious enough to become amazing and move beyond mediocre. Get coaching and guidance. You’ll know when you’re ready for the next phase when you attract the right teacher to help you get there.Don’t get confused with questions like “How to start?”, “From where should I begin?”, \"When to study?\". Start with your favourite subject. It will give you confidence to prepare well for IIT JEE. Follow a routine, a timetable giving equal importance to all the subjects - Maths, Physics and Chemistry. Make sure you achieve your daily or weekly targets.Number of hours to study for JEE : You should never ‘measure’ the number of hours you study. What matters more is that you should study with full concentration whenever you study. You need to identify the right time(s) when you can study well with full concentration. A minimum of 4-6 hours per day is considered good for JEE preparation.Follow a JEE study material but don't undermine the NCERTs. Solved examples and summary is of great help. For maximum score, all you need is time management and pattern of solving questions. These management of time and pattern can be only achieved by serious dedicated practice and questions solving.Do your homework/assignments on time and take them seriously. Don’t neglect what’s happening currently in your coaching/preparation in order to improve previous concepts or backlogs. You first priority should be to finish your current assignments and homework on time.Make problem solving a habit. If you’re stuck on a harder problem, start solving easier problems. When small problems gets resolved, it gives you a feeling of being a winner and pushing you to do more! You should also Focus on Concepts, Practice, Speed and Accuracy. Your teachers in coaching will help you immensely in this.Appear for mock tests, and assess yourself regularly. Take a look at each test and analyse if there’s anything you can do to improve your score. The purpose of the periodic tests in coaching is to make you realise your mistakes and not to repeat them in the succeeding tests. \"Count the marks you lose due to silly mistakes, conceptual error, wrong interpretation of any question and other mistakes. After every test compare it with the previous one. This will not only reduce your chance of committing a mistake but also it will motivate you as marks will increase.\" - Apoorv Agrawal (IIT Indore).Ask your teachers regularly about doubts/problems. Have a voice in the classroom (or after the class when teacher open the session for questions). Never ever let your doubts be unresolved. Make your teachers aware of any issue you are facing in the preparation.Make your own notes. You always remember better when you write things by hand rather than read from a book. Never try to copy the exact text from the book. Read, and then write them in your own words. Make a separate notebook for remembering formulas in each three of subjects.Notebook for mistakes : \"Make a notebook containing your mistakes. Whenever you make any mistake in mock test or forget a concept or formula etc. note it down in this notebook. As time passes you’ll have a collection of mistakes which you aren’t supposed to commit in exams. Revise from this copy regularly. This would help you score higher.\" - Ashesh Pradhan (IIT Kharagpur).IIT JEE preparation takes a lot of your time. You will understand topics/concepts, solve problems and old concepts fades away from your mind. For efficient preparation, consistent revision is necessary. Your notes will help you during your revision time.Very important point : Have a passion and determination, the self motivation to clear IIT JEE. Work hard throughout in your IIT JEE preparation.IIT JEE 2016 topper Aman Bansal advice to IIT JEE aspirants - “Regular studies are very important. Utilize your time properly. While studying, underline and highlight the important parts. Discuss with your peers and faculty members to explore various problem solving techniques. Maintain a healthy competition with your peers. Do not get stressed and give your best shot with 100% confidence.” Note : The thing with planning and strategy is that it shouldn’t be time consuming. The time consuming part is action, you actually moving forward, and following the strategy. Subject-wise Study Strategy for IIT JEE 2020 Physics Understanding the concepts and solving problems is the key to score well in physics. Master the basics of the subject rather than memorizing the formulas. While preparing, keep your concepts clear before you go for questions. Numerical problems and conceptual questions, both are important for JEE. \"Try to understand the purpose behind setting a question. The person who created the question expected that the problem will test a certain concept. Also realize that no question is unsolvable, but some questions take re efforts than others. Be open minded; and every now and then, you will come across a beautiful solution.\" - Adhish Majumdar (IIT-Delhi). Maths Mathematics is an art and requires a lot of practice. The concepts and the formulae should be at your fingertips. Know every shortcut possible. Know every formula possible. Mathematics is not just solving, it needs a little visualisation skills too (ex.- graphs and curve sketching). \"Work on the theory really well. At least understand what is the basic idea. What are we calculating? Why are we doing so? What is its significance? Where is it applied? A working amount of memory is required to recall the formulas and methods. So don’t go in with the expectation that everything is just thought and understanding-oriented. You will have to remember bulk of stuff in the beginning. With time it will eject out as a reflex.\" - Rajanish Kumar Upadhyay (IIT Mandi). Chemistry Complete NCERT thoroughly and you’ll get your basic footing in Inorganic Chemistry. Make precise notes for each chapter. In Organic Chemistry, You need to study all reaction mechanisms and remember all named reactions. Study the chapter, and make notes while you study each chapter. Keep thinking of reactions and mechanisms in free time. It helps in revision. For Physical Chemistry, Read from NCERT and have your concepts clarified at your coaching institute. After you are done with the chapter, write down all equations from the chapter in a notebook for speedy reference while solving problems. IIT JEE 2020 Syllabus The syllabus for JEE Advanced 2020 is likely to be the same as current syllabus. The syllabus for JEE Main (or common engineering test, if implemented) may include some additional sections like Aptitude/Reasoning. JEE Main 2020 Syllabus : JEE Main Syllabus JEE Advanced 2020 Syllabus : JEE Advanced Syllabus Recommended Books for IIT JEE 2020 Preparation See the list of books recommended by IITians and teachers for IIT JEE preparation : Reference books for JEE preparation You may not required to study from too many books if you follow a good JEE study material of a coaching. The study material is prepared specifically for JEE level concepts and questions. Things to avoid in IIT JEE 2020 preparation Procrastination and Backlogs : Procrastination and bad habits are a sign that something has to change - whether that be the study itself or your current style of studying. Avoid backlogs. It’s okay sometimes to miss the daily study schedule, you can cover that during the week. But what’s not good is staring at your books, daydreaming, and doing nothing.Excessive TV/Social media/Video games: The distractions comes due to lack of interest in studies. If you badly want something, your aim is clear to achieve it. You’ll have plenty of time later to spend your time enjoying things you miss out during the preparation. Get rid of all distractions like TV, Facebook, WhatsApp, Quora, etc. All these distractions can be addictions also. While preparing for JEE Main and Advanced, you need only one addiction and that is Study.Inconsistency in Studies : Always keep yourself up to date with what’s going on in the class, avoid falling back in the syllabus. Whatever is taught in the class, should be covered well before the next class.Getting depressed due to low scores in tests. Don’t think about the final paper, the JEE exam, focus on doing better in next test. It’s a gradual process to improvement till the final day of the exam.Do I Need Coaching for IIT JEE 2020? Yes, you should join coaching for IIT JEE 2020. A two year course for JEE is ideal at the start of class 11. When we enter class 11 their is a huge gap between the level of class 10 and class 11 which has to be filled. Students who join a coaching get good help from teachers and as a result it becomes slightly easier for them. Coaching classes provides students a balanced approach where they can prepare for IIT JEE in consistent way and at the same time they can do good in school also. Your teachers will not just help you in solving problems or clearing doubts, but will keep a constant watch on your study methods and your preparation level. Best Online Coaching for IIT JEE 2020 A team of experienced and qualified teachers (including IITians) will teach you online using computer/laptop and internet connection. It’s like a normal classroom where you will be able to interact with teacher and can ask your doubts. We are able to transform a traditional classroom into a digital medium and providing IIT JEE preparation at student’s home only. Attractive scholarships, Regular counselling, continuous online help from subject and exam experts, customized sessions are some of the key advantages of our IIT JEE Online Coaching. Personal attention and monitoring are the hallmarks of our online sessions. We are having not more than 20 (Max 25) students in a batch, which allows our teachers to carefully monitor the progress of each student. ",
            "date": "Answered March 22, 2018",
            "views": "47",
            "upvotes": " View 39 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samriddhi",
                    "user_href": "/profile/Samriddhi-39"
                },
                {
                    "user_id": "Yazhini Kandasamy",
                    "user_href": "/profile/Yazhini-Kandasamy"
                },
                {
                    "user_id": "Ekna Orné",
                    "user_href": "/profile/Ekna-Orné-1"
                },
                {
                    "user_id": "Pranathi Vr",
                    "user_href": "/profile/Pranathi-Vr-1"
                },
                {
                    "user_id": "Vivek Arora",
                    "user_href": "/profile/Vivek-Arora-203"
                },
                {
                    "user_id": "Chirag Saini",
                    "user_href": "/profile/Chirag-Saini-14"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/PRAMODA-MEDISETTY"
                },
                {
                    "user_id": "Suraiya Parween",
                    "user_href": "/profile/Suraiya-Parween-2"
                },
                {
                    "user_id": "Kedar Salunkhe",
                    "user_href": "/profile/Kedar-Salunkhe-5"
                },
                {
                    "user_id": "Harshavardhan Patil",
                    "user_href": "/profile/Harshavardhan-Patil-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nitesh Jain",
                "href": "/profile/Nitesh-Jain-468"
            },
            "answer_text": "From my personal experience, here’s a checklist of must-do items when preparing for the JEE and formulating an effective study plan Make sure you plan out for the entire JEE and Board syllabus. JEE is a superset of Boards when it comes to Physics, Chemistry, Mathematics but you need to apportion time for other subjects that will be in your Board Exams as wellSet deadlines to complete each topic. Measure your progress as you go alongAdopt a systematic learning method. Try to plan out your study keeping in mind the time available and the topics to cover in the given time frame.Create notes and mind-maps while studying. These will become vital when it comes to revisionLast but not the least,Make sure you include leisure activities in your schedule because all work and no play can be exhausting and in most cases, even counterproductive.Identify your STRONG and WEAK Topics It’s vital to take a hard look at yourself and identify your strong and weak topics. Break it down from a subject level into a topic level. This way, you’ll be able to have a laser-sharp focus on what needs to be done. Make a list of these topics and make sure you prepare a timetable that allocates time efficiently with a higher weightage given to the topics you’re weak at. In addition, you should also look at the important topics from each subject for JEE and prepare your timetable accordingly Identify and acquire the best study material You will need to primarily give weightage to your NCERT books period. Once you’re thorough with NCERT, it’s then you can opt for other reference books. I recommend, to go with Universal Errorless Books for revision and practicing question. Gather a list of practice questions as well and old question papers so that you know what questions are asked. Weighing Quality over Quantity: JEE demands understanding and application of logic You must have heard the adage of how quality matters over quantity time and again. A JEE aspirant must take this to heart because only quality preparation can help you achieve your goal regardless of the countless hours you invest in reading your books. You will have to adapt to the practice of embracing concepts qualitatively. An eager approach towards JEE preparation may force you to hoard concepts even if it means not understanding them properly. This can backfire and your preparation can go wrong. JEE is definitely not at all about superficialities; it tests your conceptual knowledge to the core. This means absolutely mastering the topics. Thus, you must go to the root of concepts and clear any and all doubts instantaneously and constantly to make sure you can handle any question on that topic Reinforcing a positive mindset It is said that poor performances during an examination can be traced back to a negative mindset, usually in the form of stress, anxiety and a lack of self-belief. While preparing for the exam always remember that stress and anxiety are normal, but what you choose to do with it is what matters. You could let it be your downfall or use it to drive you to improve your work. Use these tips and use it to leverage your anxiety and stress and reinforce a positive mindset. Exam worries often come from a fear of the unknown. Not knowing what to expect under exam conditions can create panic. Overcome this by studying past examination papers to get a realistic idea of what is about to come.Organised approach: Being organised should be a part of your strategy. Small attributes like organising your written material into subheadings, charts, bullet points, and diagrams can help you clear the clutter. By breaking up your work, exam preparation becomes more productiveFear of mistakes is an obvious trigger to stress and unfortunately, mistakes are an unavoidable component of exams. So keep learning from your mistakes as you practice sample papers and experience failure as a feedback to stay positiveThe DON’Ts while preparing for JEE: Purely as a precaution, here’s a list of the common mistakes made by students who prepare for JEE entrance so that you stay steer clear of these errors Ignoring NCERT BooksFailing to make or stick to a TimetableIgnoring Chemistry and focussing only on Math and PhysicsIgnoring theory in Maths and PhysicsHoarding reference material but not completing any thoroughlyMoving on without understanding concepts thoroughlyAll the best! Do upvote if you like :) ",
            "date": "Answered October 8, 2018",
            "views": "62",
            "upvotes": " View 69 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pyush Pandey",
                    "user_href": "/profile/Pyush-Pandey-2"
                },
                {
                    "user_id": "AJAY SINGH",
                    "user_href": "/profile/AJAY-SINGH-7312"
                },
                {
                    "user_id": "Varadarajan Natarajan",
                    "user_href": "/profile/Varadarajan-Natarajan"
                },
                {
                    "user_id": "Smarandeep Singh Kapoor",
                    "user_href": "/profile/Smarandeep-Singh-Kapoor"
                },
                {
                    "user_id": "Vishal Kumar",
                    "user_href": "/profile/Vishal-Kumar-11544"
                },
                {
                    "user_id": "Aryan Chandramauli",
                    "user_href": "/profile/Aryan-Chandramauli"
                },
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                },
                {
                    "user_id": "Yuvraj SinghChouhan",
                    "user_href": "/profile/Yuvraj-SinghChouhan"
                },
                {
                    "user_id": "Khushboo Shrivasatav",
                    "user_href": "/profile/Khushboo-Shrivasatav"
                },
                {
                    "user_id": "Sameer Ranjan",
                    "user_href": "/profile/Sameer-Ranjan-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Khushbu Sachdeva",
                "href": "/profile/Khushbu-Sachdeva-6"
            },
            "answer_text": "Hello! :) So you're in 12 standard right now and half phase of your preparation is already over. 12th is the most important part of JEE as per my experience. There are many questions from calculus, determinants and matrices in maths; organic and physical chemistry in chemistry; magnetism ,electrostatics and current electricity in physics in JEE.  For scheduling: Design a time table for yourself and stick to it. Devote extra time on your weak subject and sufficient for your strong ones. For eg: if your physics is weak, you can design a time table where you study 4hrs physics and 3hrs maths and 2 hrs chemistry . Generally maths demands practice so more time for it. Once your weak subject improves, you can redo your timetable. Take rest when you're tired. Don't overstuff your brain as when you're tired nothing you study makes sense and you may forget it. Go for walks, listen to music , do exercises or play your favourite sport. Anything of this sort will improve your performance. And yeah eat your favorite food too :p. Don't forget to complete your sleep. Revise your classnotes everyday, it may seem a little difficult but its a lot more helpful in long run. You remain in touch in classroom with what you are being taught. Prepare for tests. Not every test as in my case I had 2 tests a week on an average. The test which you find are important, prepare for them nicely. Analyse your test results and re attempt the problems you could not solve. Make each and every question of your test clear. (This also helps a lot ).Clear your doubts regularly. Take help from your teachers or friends . FOR BOOKS: Physics: B.M. Sharma (for all chapters) Chemistry: Cengage series for physical (K.S.Verma) R.K. gupta/solomons for organic JDLee for inorganic (don't forget ncert!) Maths : S.K. Goyal or M.L. Khanna for practice. I think this would be sufficient, you can ask for more queries! Thanks for reading! ",
            "date": "Answered June 29, 2019",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                },
                {
                    "user_id": "Raghib Anwar",
                    "user_href": "/profile/Raghib-Anwar-4"
                },
                {
                    "user_id": "Nitesh Bhagwat",
                    "user_href": "/profile/Nitesh-Bhagwat-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Biplab Ghosh",
                "href": "/profile/Biplab-Ghosh-126"
            },
            "answer_text": "You should have a very good plan and schedule for your JEE preparation because you are left with only one year. So following are the things you are supposed to do in this one year for your preparation: Using Study Aids: In this case you can use any online video lectures platform such as Kaysons.There are many advantages of online video lectures .You can save a lot amount of time by enrolling yourselves into this kind of lectures instead of enrolling in any institutions.Use question papers from past exams. Another important resource for applicants looking to pass the JEE are the question papers from past tests (freely available on the official JEE website).2.Knowing the exam  Understanding the pattern of JEE mains: The JEE Main lasts three hours and consists of 90 multiple-choice questions. The exam consists of three sections: Physics, Chemistry, and Mathematics. Each section contains 30 questions. All sections are weighed equally. For each question answered correctly, four points are awarded. For each incorrect answer, one point is deducted. No points are awarded or deducted for unanswered questions.Understand the structure of the Advanced exam. The JEE Advanced is structured differently than the main exam. The advanced exam covers the same three topics: Physics, Chemistry, and Mathematics. However, unlike the main exam, the advanced exam is divided into two three-hour long papers, each divided into three sections (one for each topic). The papers are organized as follows:Paper One: Each section contains 10 multiple choice questions with one correct answer, five multiple choice questions with one or more correct answers, and five questions that require the test taker to provide a single-digit answer.Paper Two: Each section contains eight multiple choice questions with one correct answer, eight questions that require responding to a reading passage, and several \"matching list\"-type questions.Know the topics covered by each test. Though both the JEE Main and JEE Advanced cover the same three subjects (physics, chemistry, and mathematics), the precise topics covered and the difficulty of the individual questions will vary between the two tests. To gain a sense for the topics you may be expected to know for each test, consult the official test syllabi for the Main and Advanced exams, both of which are available in free PDF form from official test resources online.Below are just a few examples of the topics you may encounter on the test — these lists are by no means complete or definitive: Physics: Kinematics, laws of motion, gravity, thermodynamics, electromagnetism, optics, electronic devices.Chemistry: States of matter, atomic structure, redox reactions, chemical kinetics, environmental chemistry, periodic groups, basic organic chemistry principles.Mathematics: Quadratic equations, mathematical induction, sequences and series, matrices, integral calculus, differential equations, coordinate geometry.3.Time yourself as you take practice tests HOPE THIS HELPS YOU…. BEST OF LUCK!!!!! ",
            "date": "Answered January 24, 2019",
            "views": "247",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priyana Sagar",
                "href": "/profile/Priyana-Sagar-1"
            },
            "answer_text": "If you’re wishing to appear for JEE Main 2020 then you should first make yourself familiar with its exam pattern. Let’s take a look at the exam pattern of JEE Main- Exam mode: online (computer-based test)Subjects: Physics, Chemistry and MathematicsType of questions: objective typeDuration: 3 hoursExam language: English and HindiMarking scheme: 4 marks will be awarded for each right answerNegative marking: 1/4th marks will be deducted for each incorrect answerHere are some useful tips which will help you gain an advantage over your competitor- Collect only the reliable study material: The market is filled with numerous books on JEE Main and its preparation which can easily confuse you. However, there are certain books and study material without which the preparation of JEE Main will be incomplete. To ease your burden, I’m listing down some of the key books which you must study no matter what at the end of the post. Kindly go through it to ensure your success in JEE Main 2020. JEE Main is a tough nut that can be cracked with hard work and consistency: When you start preparing for the exam, you’ll come across the time when you’ll question yourself whether you can crack the exam or not. But believe me when I say that I have seen many of my friends succeed in JEE Main only because they refuse to give up and stayed focused. So you can also qualify the exam, but you need to stop doubting yourself and keep your focus on the aim i.e. CRACKING JEE Main 2020. Myths busted: There is a common misconception in the mind of students and parent’s even that JEE Main can only be cracked by the intelligent lots. But let me state the truth here, a majority of JEE Main candidates who clear the exam comes from the humble background and are of average intelligence. So you need not worry about the myth that only those who possess high intelligence can qualify the exam. Consistency is the key to excel in JEE Main: Often it is observed that initially students start preparing for the exam in high spirits but over the time they stray from their objective and end up losing the momentum of studies. Now, this is bad news because you cannot let the golden opportunity slips from your hands. The key to success in JEE Main is “never lose consistency”. Follow the routine that you’ve made for yourself strictly. Bring your best foot forward while studying. Solve mock tests/previous year papers: Ideally speaking, you should devote at least 3 hours daily if you want to succeed in the exam. There is another point to be noted here that you should practice mock test daily to improve your efficiency and strengthen the concepts you need improvement in. Solving previous year papers will give you an idea of the type and level of questions asked in the exam. Therefore, you can adjust your study schedule accordingly. Don’t hesitate to clear the doubts: If you have doubts about any concept then you must clear them with your teacher/friends. A lot of students feel shy in asking for help whenever they are stuck in a question. This problem stretches and in the end student skips the whole concept. It is better for the students to get all their doubts clarified on time so that there is no baggage left in their mind. Focus on your strength and weakness: It is important for you to identify your strength and weakness as during the preparation time, these will be tested over and over again. You should focus on building a base of the concepts and try to improve the concepts you’re weak in. The weak concepts can be handled by practicing daily and clearing the doubts whatsoever with the help of your teachers and friends. NCERT-The Holy Grail: NCERTs are the first books that you must complete. They serve as a base and are written in a concise manner to build the foundation in different subjects. Without NCERTs, your preparation will never be finished. So don’t underestimate the power of NCERT books and start preparing for the exam in the right way. Recommended books to qualify JEE Main- JEE Main books for Aptitude and Drawing (for Architecture) A complete Self Study Guide for B.Arch. Entrance Examination by P K Mishra.NATA and B.Arch. Complete Self Study Material by Ar. Shadan Usmani.Steps to Architecture: B.Arch. (NATA/JEE Main) Exam Guide Paperback by Nimish Madan.JEE Main books for Mathematics Calculus by J. EdwardMathematics by Tata McGraw Hill (TMH) PublicationCoordinate Geometry by S. L. LoneyJEE Main books for Physics Understanding JEE Physics Series by D. C. PandeyConcepts of Physics by H. C. VermaFundamentals of Physics by Halliday, Resnick and WalkerJEE Main books for Chemistry Organic Chemistry by Morrison and BoydPhysical Chemistry Textbook by Peter AtkinsProblems in Physical chemistry by P BahadurConcise Inorganic Chemistry by J. D. LeeWishing you all the very best for JEE Main 2020 exam! ",
            "date": "Answered October 30, 2018",
            "views": "754",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                },
                {
                    "user_id": "Tanvir Pathan",
                    "user_href": "/profile/Tanvir-Pathan-5"
                },
                {
                    "user_id": "N Karthik Karanth",
                    "user_href": "/profile/N-Karthik-Karanth"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohit Kothari",
                "href": "/profile/Mohit-Kothari-53"
            },
            "answer_text": "Here are a few tips that will help you prepare for your exam - Prepare study material - One of the most essential parts of your JEE preparation is the study material that you pursue. Attempt to gather and begin setting up your own handwritten notes.Time is valuable so don’t waste your time.Try to clear all of your doubts. Every one of the questions that have been asked in JEE is exceptionally theoretical.Try not to miss your regular classes.Revise every chapter and practice as much as you can.Over-thinking is a stupid weapon. It leads to many undesirable thoughts and ultimately increases the pressure. Don’t think much about the exam. Just give your best physical and mental effort to accomplish your objective and have a legitimate eating and resting routine.Take breaks at regular intervals.Follow a subject-wise study plan: Select a chapter. Read the theory from reference books. Thoroughly understand the concepts, then immediately (within a span of one or two days) solve problems corresponding to the chapters you studied. Leaving a long gap between theory and practising problems might lead to forgetting the crucial concepts and would require a revision.Here’s how your subject-wise JEE preparation should go, with respect to practice - Physics In Physics, it is important to get your basics right, understand the concepts well and ensure that you have thoroughly studied Electrostatics of a conductor. Make flashcards and notes on topics that have seen a lot of importance by exam setters in the past. Understand the important types of numericals and solve multiple problems of each type. Refer to right reference books and do not confuse yourself with innumerable book recommendations. Or, instead of browsing countless reference books, which vary in difficulty level, you can also try learning and practicing on Toppr. Toppr has free video lectures taught by some of the best teachers in their respective fields. They focus on each topic of the JEE exam and it gives a detailed explanation of all you need to know for that specific topic. It has been proven that it is easier to retain information that is learned visually, therefore, you can also learn and retain information better with the animated video lectures. Typically each subject will carry 120 marks be it JEE Mains or JEE Advanced. After you have solved all the problems, make a summary sheet for the course. It is something similar to mind-mapping. It should have all the important formulae, theorems and some important problems you encountered. You can easily access Toppr’s concept sheets for every topic, it will give you all of the above information at no cost. Chemistry For Chemistry, before you start studying Alcohols, ensure that you have thoroughly studied Hydrocarbons, Organic Chemistry, and Haloalkanes and Haloarenes. This will help you form the framework that helps you understand various concepts and equations. It will also help you remember reactions more easily. Before you start making notes and diving deep into each concept, read through the chapter and understand its scope. You should start with concepts that don’t have any chemical reactions. These concepts are relatively easy. As revision and practice is essential for any JEE aspirant, live classes offered by Toppr are a great way of doing just that. These classes are optimal for chapter-wise revision - in each live class session they take 30 minutes to explain a chapter, then take another 30 minutes to solve the previous years’ questions pertaining to that particular chapter. It is also a good way to solve any question-solving related doubts you might have. Mathematics This basically needs a lot of problem solving. You’ll need to have a good combination of theoretical understanding and problem-solving skills. This followed by solving problems and followed by preparing summary sheets for each chapter. At Toppr, you will find all important formula in one place and practice questions for each chapter, this will help you in making your summary sheets hassle-free. Hope this helped. ",
            "date": "Answered March 18, 2019",
            "views": "367",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashu",
                    "user_href": "/profile/Ashu-378"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aditya Rathore",
                "href": "/profile/Aditya-Rathore-218"
            },
            "answer_text": "Hello brother, I am Aditya rathore. First, i will tell you why to read my answer! I am currently studying at allen institute indore and secured 98.3 % in jee mains. So, i can i assure you that mya advise will be the best of my knowledge. If you wish to crack jee mains of next year January, do as I say. it is gonna long but i care for your future, NCERT is geeta, bible, kuran, etc. Don't ignore it like most of students of big coching. (Especially chemistry NCERT).Chemistry Do weekly revision.This one may be boring but start (if you haven't) reading chemistry ncert for at least 1 hour a day. Give emphasis on chem. Ncert part 2 and ““ Rote the reaction by writing at least 5 times each””I am focusing till now on chemistry because believe it or not, chemistry will help you at last. Give daily one hour to inorganic/physical (as per your schedule) and one hour for organic. Physics If you wish just to clear cutoff, again start cramming formulae (ex. Moment of inertia, center of mass)If you wish to clear jee advance, take both parts of HCV and solve them completely at least once.(this is must)MATHS Again atleat 40% question are formula based and you know what, toppers don't let any of these question to be wrong.Practice regularly from ncert. Miscellaneous question are very tricky one. Complete ncert first.After doing even 50% of this, I am sure you will not at least regret for opting this stream. Sorry for grammatical mistakes. Thank you ",
            "date": "Answered May 20, 2019",
            "views": "74",
            "upvotes": " View 47 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andro Tech World",
                    "user_href": "/profile/Andro-Tech-World"
                },
                {
                    "user_id": "Avni Sharma",
                    "user_href": "/profile/Avni-Sharma-47"
                },
                {
                    "user_id": "Deepak Joshi",
                    "user_href": "/profile/Deepak-Joshi-427"
                },
                {
                    "user_id": "Rohan Mohapatra",
                    "user_href": "/profile/Rohan-Mohapatra-15"
                },
                {
                    "user_id": "Rashi Singh",
                    "user_href": "/profile/Rashi-Singh-522"
                },
                {
                    "user_id": "Sonal Kumar",
                    "user_href": "/profile/Sonal-Kumar-126"
                },
                {
                    "user_id": "Sumathi Sridhar",
                    "user_href": "/profile/Sumathi-Sridhar-9"
                },
                {
                    "user_id": "Manoj Kumar",
                    "user_href": "/profile/Manoj-Kumar-36975"
                },
                {
                    "user_id": "Nitin Malav",
                    "user_href": "/profile/Nitin-Malav-2"
                },
                {
                    "user_id": "RAJ Pasvan",
                    "user_href": "/profile/RAJ-Pasvan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akshita Goyal",
                "href": "/profile/Akshita-Goyal-53"
            },
            "answer_text": "Ok,To tell u about how it worked for me: I had joined two year programme at Resonance Lucknow. So,the very first thing to be followed is being REGULAR at your work……  I was regular at coaching and just followed what the teachers suggested. Studying daily whatever is taught that day is mandatory and solving the assignments is very very important.Working on daily basis is necessary for reaching the destination.  Referring to quality resources rather than quantity is very important. I didn’t refer any book apart from Resonance Modules and NCERT. Try to confine yourself to the Coaching Modules and Teachers Suggestions. =>Only additional thing to do is previous years papers(Mandatory) =>There’s one more thing that I did..I used to watch online video lectures and tutorials as they are quite interactive and they never let me get bored.They Played a vital role in keeping my interest at peak whenever I felt bored with books.  There are many popular Platforms for that. I’ll enlist some of them: Kaysons EducationByju’sPlancessaskIItiansTopprUmang Gupta's answer to Which is the best correspondence program for IITJEE preparation? *************************REVISION******************************************  *************************************REVISION****************************** Another very very very important thing is REVISION. If you even study less content but are able to revise it properly then you can really make it. Trust me Revision is the most important thing..And for that you need to be a bit planned and Schedule yourself..Like revising after a week then a month then after 3 month and so on.. To boost it up you can use mind maps and other techniques as well. *********************************PRACTICE*******************************  *********************************PRACTICE******************************* Practice is the most important thing if you want to reach your goals because that is the most significant thing that will Differentiate you from the rest.The more you practice, the better you become.Remember: “Practice like you’ve never won.Perform like you’ve never lost!” *******************ASSESS YOURSELF REGULARLY**********************  Testing yourself on whatever course you’ve studied is mandatory because it not only tells you where you stand but also helps you in improving your way of attempting the paper and prepare you for the final day. Always take that exam to be the final JEE exam for you so that when you sit for it on the final you dont feel any the pressure!! **Important**: During preparation if you are unable to score well in your mock tests dont get disheartened or panicked just keep trying and gradually it’ll improve and towards the end you’ll even score high. ***************EXERCISE********and *********RECREATION************  Dont get yourself preoccupied with studies too much.You should give yourself ample time for exercise and recreation.This will not only help you maintain your health but also keep your zeal on the peak because many lose their enthusiasm in the midst of preparation!!!! Remember to manage atleast 5 hours of workout per week!!!! And in case you are running short of time due to heavy work-load:  To summarize: Primary: PlanningRegularityRevision PlanSecondary: A healthy dietA little bit of exerciseProper sleepA little bit of RecreationBest of luck!!! P.S.-You could follow me and reach out to me personally if you think i can help!! I’ll be glad to help you!!!!!! Cheers!!!! ",
            "date": "Updated August 6, 2018",
            "views": "32",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Isha Chitare",
                    "user_href": "/profile/Isha-Chitare"
                },
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                },
                {
                    "user_id": "Yusra Eram",
                    "user_href": "/profile/Yusra-Eram"
                },
                {
                    "user_id": "Sumit Agrawal",
                    "user_href": "/profile/Sumit-Agrawal-229"
                },
                {
                    "user_id": "Aswath",
                    "user_href": "/profile/Aswath-10"
                },
                {
                    "user_id": "Sasidhar Reddy",
                    "user_href": "/profile/Sasidhar-Reddy-199"
                },
                {
                    "user_id": "Sam",
                    "user_href": "/profile/Sam-5919"
                },
                {
                    "user_id": "Arvind Gupta",
                    "user_href": "/profile/Arvind-Gupta-699"
                },
                {
                    "user_id": "Khushboo Shrivasatav",
                    "user_href": "/profile/Khushboo-Shrivasatav"
                },
                {
                    "user_id": "Trimdish Doka",
                    "user_href": "/profile/Trimdish-Doka"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gaurav Gour",
                "href": "/profile/Gaurav-Gour-7"
            },
            "answer_text": "Preparation for jee is not a big deal.only you have to study regularly and always focus on your goal.You have a lot of time for jee preparation.So use your time wisely and give all efforts to your studies. There are some few tips I'm mentioning below , they will be very helpful in your preparation for jee main and advance:- 1.First of all join a good coaching 2.Make a good schedule for your studies and try to follow your schedule. 3.Take your classes regularly and seriously because with the time we feel that classes are boring. 4.Solve as many as questions you can because questions practice is a very important for preparation. 5.Choose some good books with coaching material,these books are very helpful for practice. 6.Join any test series , they will prepare you for your jee exam. You can do self study also.For self study,there are so many online classes available. These classes provide a good platform for jee preparation. Online classes have several courses for your studies according your choice.Since last few years, the usual method of classroom learning has been replaced by online learning due to the advancement in the field of information and communication. And there are so many benefits by these online classes like:- Chance to interact with IITians: In most of the IIT JEE online video lectures , majority of the faculties will be IITians. Therefore, it is a great opportunity for the students to interact with these experts. They will be very familiar with all type of questions, patterns and shortcuts in JEE exams. online video lectures provides all the information about IITs, their way of teaching etc. with these expert Easy availability of study materials: Other important benefit of online video lectures are that it helps you to avail all the reference materials easily. Since these online study materials are prepared by IITians, it will cover all the essential data needed to crack JEE. Free to choose teachers and subjects:Another major advantage of taking online JEE video lectures are that it provides you options to replace your tutor. You don’t have to stick onto a single teacher for the whole year. Rather, you can change your teacher if he/she is not good. Saves travelling time: There are students, who travels miles daily to attend coaching classes. But in case of online video lectures you only need a computer with web cam and an internet connection so that you can take the lessons from your home itself. Sample test papers: Online test provides lots of sample tests, which are prepared by IITians. It also provides you the option to take these tests from your home itself. Since these mock tests are prepared by IITians, it will contain all the important questions. Now,There are some books you can choose for your preparation:- Mathematics: Following are some good Mathematics JEE Main Preparation books - IIT Mathematics-M.L KhannaDifferential Calculus-A DasguptaHigher Algebra by Hall and KnightRD Gupta’s Mathematics book for Class 11th and 12thGeometry and Trigonometry books by S.L LoneyPhysics: Following are some good Physics JEE Main Preparation books- H.C Verma’s Concepts of Physics-Part 1 and 2IIT JEE Physics by D.C. PandeyProblems in General Physics by I.E. Irodov – Best for PhysicsProblems in Physics by S.S. Krotov – Mostly RecommendedPhysics for IIT JEE by Resnick, Halliday and WalkerChemistry: Below are some best Chemistry JEE Main Preparation books- Organic Chemistry by O.P. TandonInorganic Chemistry by O.P TandonOrganic Chemistry by Morrison BoydConcise Inorganic Chemistry by J. D. LeeNumerical Chemistry by P. Bahadur",
            "date": "Updated August 16, 2018",
            "views": "500",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                },
                {
                    "user_id": "Sachin Sharma",
                    "user_href": "/profile/Sachin-Sharma-2975"
                },
                {
                    "user_id": "Abhinav Jha",
                    "user_href": "/profile/Abhinav-Jha-133"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mandeep Kumar",
                "href": "/profile/Mandeep-Kumar-275"
            },
            "answer_text": "National Testing Agency will be conducting JEE Main 2020 examination for January and April session. Candidates who are planning to appear in the exam should make a strong preparation strategy in order to crack the exam. Candidates should compare the JEE Main syllabus with class 12th syllabus so that they can get to know about the difference. Start your preparation as soon as possible there is not much time left. Candidates who are interested should fill the application form which will be available in 1st week of September 2019. Check the details of JEE Main 2020 application form such as tentative date, steps to apply, application fee, etc. here. Further, we are sharing some important tips for the preparation of the examinations. Analyze the complete syllabus that is the most important thing to do in the first step. Then separate the topics/chapters which are easy and difficult for you.After that make your study plan to prepare for the examination. Keep the study duration for the difficult chapters longer than the preparation of the easy subjects.Refer to the notes or study materials of the class 11th & 12th as the syllabus of JEE Main contains most of the topics from the same.Most of the candidates ignore NCERT books while preparing for the examination. That is the biggest mistake of them.Read the topics or chapters from the NCERT book first after that you can go for the reference books to get the knowledge of the chapter in more detail.Solve previous years question paper or mock test papers along with the preparation. It will help you in determining your preparation level.Practicing previous years question paper or mock test papers will let you know about the strong and weak point. Then you can revise your preparation strategy accordingly.Revision is must so after completing a chapter you should give a thorough revision.Do not engage yourself so much in studies. Have some time for walk, games or social activities. Listen to music to the music to avoid boring moments at the time of the study.Eat a proper meal and have a good sleep of 7 to 8 hours in order to give proper rest to your brain.",
            "date": "Answered July 2, 2019",
            "views": "225",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                },
                {
                    "user_id": "Upasana Pradhan",
                    "user_href": "/profile/Upasana-Pradhan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laraib Zemam",
                "href": "/profile/Laraib-Zemam"
            },
            "answer_text": "To excel in exams such as JEE you are required to practice extensively and you need more of your hardwork than talent. So I happen to always believe in the following quote: “Hardwork beats talent when talent doesn't work hard.” So before holding out your nerves for jee preparation you need to have firm determination that you are going to bag an IIT seat no matter what it takes.You will be needing constant motivation during the whole preparation period cause you might want to give up on yourself in your low score days or you might get bored of the daily routine and might just want to get out of all this rat race of IIT-JEE. So you need an important reason why you want to crack this Jee exam.The reason could be anything like you want to stand financially or you want to prove someone in the society that you are worth challenging or you want to have a high status lifestyle or high social status or prestige that generally IITians recieve because of their college reputation or placement reputation. The reason or reasons should be strong enough to enhance your work whenever you feel like giving up. Remember: “Reasons why you want to crack IIT-JEE would be the only source of your motivation during your whole Jee Preparation.” After the reasons comes your self-esteem meaning how you feel or think about yourself.Wether you believe in yourself or you are confused about yourself.Self esteem should be always high.Remember: “If motivation(reason) is the fuel then self esteem is the vehicle that will carry you forward.” Then when you have got a fire in yourself to get this Jee Exam clear with a safe rank then you would require a proper approach of study and proper books to follow that are more relevant than others. Approaches and books: Approaches- There are 4 kinds of approaches by which you should prepare for Jee in ascending order: 1.Theoretical Approach: Clearing the concepts and getting proper grasps on topics of Jee by studying most sorted out books that Jee crackers have generally used. 2.Numerical approach: Solving the numericals of each topic from the coaching materials or most sorted out books that Jee crackers have generally used for numerical purpose so that you can solve the Jee questions efficiently in your IIT-JEE exam. 3.Previous Years Archive: Solving questions from each topic relevant to questions asked in that topic in Jee previous years and then jumping to solve the actual previous years archives of Jee. 4.Full test practice: After you are done with the above three procedures then you should start solving sample papers of Jee given out by famous coaching institutes in a stipulated time period just like the exam conditions.Along with that you must join All India Test series in your nearest coaching institute if you are studying on your own where weekly full tests of Jee Mains and Jee Advance are held.Only then you can properly analyze where you stand and how much more practice is needed. Finally books : For books click to the link below where I have already suggesed the most sorted out books for theoretical and numerical approaches that Jee crackers have generally used during their Jee preparation. Laraib Zemam's answer to Which books are best for JEE Mains and Advanced exam preparations? Best of luck! ",
            "date": "Updated August 13, 2019",
            "views": "318",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allen Kota",
                "href": "/profile/Allen-Kota-1"
            },
            "answer_text": "JEE Main 2020 – Last 7 days Plan, Most effective strategy for Last one Week  Most of you reading this article would be going through chills in your spine as the examination that you had been working for is now almost here. And most importantly all the hard work that you have put in is now going to result in it. JEE main examination happens to be a gateway to the most prestigious colleges in India. Here we are with a few success mantras that our experts have formulated that will definitely help you in sailing the journey with flying colours. Sleeping Pattern Many studies have proven a link between studying and sleeping patterns. Not sleeping well has an impact worse than you think; it will increase your anxiety level, give you a lethargic feeling, and decrease your concentration level. During the last days before your examination, it is certain that you will be studying a lot. But if you do not have a proper sleeping pattern then psychologically you will be studying a lot but your retention ability will certainly be low. Make sure to wake up early in the morning and avoid sleeping in the afternoon, this routine will automatically make you fall off to sleep early at night. Remember, to sleep well the night prior to your examination, as it will help you in controlling your anxiety and avoiding silly mistakes. Drill As mentioned in the previous blog, it is very important to practice the sample papers as it will be very effective on the day of examination. Try practicing the sample papers at the same time frame allotted to you for the examination. Now, many students might think of doing the previous years’ questions, but it can make you overconfident as it might be easier for you to solve them as you would have practiced it previously. So do not waste your time practicing paper that is made on a tough level, since the JEE Main paper isn’t that tough. Going through this drill of practicing papers is the best way to rectify your mistakes and moreover a great way for revising. Y/M- Year-long Mistakes Most of you would have been studying for this paper for the past 2 years and you would have given an infinite number of practice papers. So make sure to go through them and analyse your mistake. Mark all the questions where you have made mistakes. As going through them will help you in revising your weaker section and boost your confidence level. If you are a student studying in class 10th or 11th make it a habit to mark all these mistakes and compile them as they are a great way of revising. S/N – Short Notes If you are a student who always made it a point to make short notes, you are a step ahead in this competition. Going through short notes is the best way to revise. But if you haven’t made short notes then refer to the NCERT and revise al the section that you are weak at. Last but not the least, share these tips and tricks with as many people as you wish to because when you share you feel contented and thus, in turn, this will bring peace to your mind. And this peace at this point in time is a necessity. Now, buckle up and finish what you started in the best way possible. Best of luck!!! ",
            "date": "Answered December 30, 2019",
            "views": "312",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manas Gupta",
                "href": "/profile/Manas-Gupta-221"
            },
            "answer_text": "These steps you could follow to do well in Jee 2020: Plan a daily timetable which should have equal distribution of number of hours to each subject.While studying the subject, make sure to invest time in the theoritical part as well as on solving good questions keeping in mind the time constraints. Practise answering each question is a certain time frame so you get into the exam mode from day 1.Always start from BASICS because “without a base, there will be no altitude” and “journey of a thousand miles begins with a single step”.Always BUILD UP RIGHT & APPROPRIATE BASICS because “once the track of train changes, it will go on only that track”. So always select the right track and follow that consistently .Never check solutions of questions before attempting the question. SELF-ATTEMPT at least five times before you take a peek at the solution. Persevere till you get the right answer because “without falling you cannot stand at once”.Never leave the question in between. There are students who practice a question without attempting it as a whole. This is a very big fault of many students and it may become a negative point sometimes. So please avoid this practice and try to analyse the problem, attempt and if you fail then check the solution. Be truthful to yourself in these attempts as only you gain from it.Always try a question with a CONCEPTUAL APPROACH. Don't just read the question and then start answering it without getting to the bottom of what it is asking. Take a breath, think and answer. This will seem difficult at the start but once you make it a practice, it will become the norm for you.Your study schedule should be such that you get the time for a little relaxation and enjoyment daily.Having a time schedule is fine but REGULARITY in studies is the combination that will help you crack the exam.Adequate sleep or rest of at least 6-7 hours a day is mandatory if you are preparing for IIT-JEE otherwise your mindset for next day will not be conductive for further studies.Do not get into the habit of studying late into the night. Instead get up at 6 in the morning and sleep by 11 at night. This will keep your brain activity maximum in the morning and will help you when you actually attempt JEE.Never cram whatever you learn; always TRY TO UNDERSTAND and approach the problem by studying the theory conceptually.BE CONFIDENT while you are preparing. NEVER LOSE CONFIDENCE. Motivation is important all the way till you reach an IIT of your choiceA peer group that matches your goals is the best company you could keep during your IIT JEE Preparation. Choose your friends wisely such that they are your strengths and help you be competitive and up to date as well as motivated .Always keep the copy of the latest syllabus of the exam. Keep the syllabus right in front and cross check before starting a new topic.Always study everything with a DEEP INTEREST otherwise it will be of NO USE.",
            "date": "Answered October 14, 2018",
            "views": "12",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                },
                {
                    "user_id": "Shubham Yadav",
                    "user_href": "/profile/Shubham-Yadav-995"
                },
                {
                    "user_id": "Tanvir Pathan",
                    "user_href": "/profile/Tanvir-Pathan-5"
                },
                {
                    "user_id": "Manvi Gupta",
                    "user_href": "/profile/Manvi-Gupta-129"
                },
                {
                    "user_id": "Dhruv Sharma",
                    "user_href": "/profile/Dhruv-Sharma-102"
                },
                {
                    "user_id": "Vibhanshu Vaibhav",
                    "user_href": "/profile/Vibhanshu-Vaibhav-9"
                },
                {
                    "user_id": "Sruthika",
                    "user_href": "/profile/Sruthika"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aman Kumar",
                "href": "/profile/Aman-Kumar-5902"
            },
            "answer_text": "Hello JEE Aspirant!! Your question is absolutely right that how to crack IIT JEE in 2020. IIT JEE is not so enough tough that you have to lose the chance in 2020. But you have to study sincerely with honesty. Continuity play important roles during preparation of JEE (Main+advance).  But if you wish to achieve appreciable rank in advance then solving a jumble of books is not enough, that's why you have to do extra effort on your study so along with your classes room study you also have to join online course like kaysons eduction, byju's, etoos, PACE, askiitian. Umang Gupta's answer to Which websites provide free video lectures for IIT JEE mains chemistry and maths? If you going through number of books of JEE it will take enough time to revise and practice that's why videos lectures curtail your time consumption during revision and it develop your better concept. During my preparation time I used to watch videos lectures if kaysons education because my friend suggested for that and it helped me a lot while preparation. After watching videos if I feel any doubt regards the topics then I placed the questions in doubt counters and I will revieved quick response an I also noticed multiple types of doubt ask by others students on that particular topic. In online course they will guide you time to time provide sufficient enough material for self study package for JEE preparation. They also have Verity of multiple conceptual questions for online practice.  Here are some tips for JEE preparation:- Make short notes for quick revision.Make a separate note for formula.Revise your syllabus time to time.Reduce excessive use of social networks.Be continuous while preparation.Practice as much as problem.Also care about your health.Don't be aggressive keep calm you focus on goal.Don't worry about your past results keep practicing.Be self motivated. Best of luck for JEE 2020!! Sanyam Singhal's answer to Which is the best correspondence program for IITJEE preparation? Nand Kishor's answer to What is the best way to study for the IIT exams? ",
            "date": "Updated July 27, 2018",
            "views": "42",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                },
                {
                    "user_id": "Chandan Mishra",
                    "user_href": "/profile/Chandan-Mishra-463"
                },
                {
                    "user_id": "Muskan Kumari",
                    "user_href": "/profile/Muskan-Kumari-184"
                },
                {
                    "user_id": "Raffat Kalim",
                    "user_href": "/profile/Raffat-Kalim"
                },
                {
                    "user_id": "Nand Kishor",
                    "user_href": "/profile/Nand-Kishor-147"
                },
                {
                    "user_id": "Kumar Vivek",
                    "user_href": "/profile/Kumar-Vivek-145"
                },
                {
                    "user_id": "Vivek Kumar[विवेक कुमार]",
                    "user_href": "/profile/Vivek-Kumar-विवेक-कुमार-4"
                },
                {
                    "user_id": "Ayush Sarma",
                    "user_href": "/profile/Ayush-Sarma-1"
                },
                {
                    "user_id": "Sarfraj Raja",
                    "user_href": "/profile/Sarfraj-Raja"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhinav Jha",
                "href": "/profile/Abhinav-Jha-133"
            },
            "answer_text": " First of all join a good coaching institute in your area.The institution that suits your studying pattern.It is highly recommended if you opt for integrated coaching as attending school and coaching simultaneously is very difficult and most of the students give up IIT-JEE preparation as it builds up a lot of pressure.Students hardly get time to self study if they go for school as well as coaching.You can also opt for dummy school i.e the ones where attendance is not a big issue. In integrated schools ,syllabus of both the parts are synchronized and coordination between both the syllabus is very important doe JEE preparation. The Most important thing: Here’s the secret for cracking JEE We have two types of memory: Long Term and Short Term  Scientifically when we read a topic for the first time what happens is most part of it is stored in Short term and when we read it again after couple of days it get transferred to the long term memory. Based on this research me and my friends had developed a method of preparation during our JEE days, we would watch a video of the particular topic that would be taught in the coming lectures at the coaching. The main reason to watch videos is that - prior to the lecture its very difficult to understand things from the book which is very well and easily explained in Videos. Books are boring at times and one can lose interest easily which is not the case of video lectures.Books are not usually worth the price. We may buy lot of books recommended to us but hardly refer the book more than twice.With the help of video lectures we can understand concepts three times faster as compared to books.Once when we had studied from the video lectures the things taught in coaching gets crystal clear and get stuck to our head and hence we remember it for long time. Understand the topic in advance with the help of video lectures it really helps a lot.Don’t go for coaching classes without studying the topic in advance. ",
            "date": "Answered April 25, 2018",
            "views": "87",
            "upvotes": " View 43 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                },
                {
                    "user_id": "Arunima Sharma",
                    "user_href": "/profile/Arunima-Sharma-68"
                },
                {
                    "user_id": "Nilkanth Shashi",
                    "user_href": "/profile/Nilkanth-Shashi"
                },
                {
                    "user_id": "Anurag Prasad",
                    "user_href": "/profile/Anurag-Prasad-79"
                },
                {
                    "user_id": "Vinay Kumar",
                    "user_href": "/profile/Vinay-Kumar-9947"
                },
                {
                    "user_id": "Anurag Singh",
                    "user_href": "/profile/Anurag-Singh-3260"
                },
                {
                    "user_id": "Rishav singh",
                    "user_href": "/profile/Rishav-singh-332"
                },
                {
                    "user_id": "Anjali Mishra",
                    "user_href": "/profile/Anjali-Mishra-349"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Khushi-maravi"
                },
                {
                    "user_id": "Kapish Malviya",
                    "user_href": "/profile/Kapish-Malviya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amrit Udbhav",
                "href": "/profile/Amrit-Udbhav-1"
            },
            "answer_text": "Some important things that u need to follow:- Be regular in your coaching class. Be attentive there and do the work that is given by the mentor on daily basis. Never think of leaving it for another day. This must be your first goal. If you start following it seriously, you will get a good rank for sure.Now, start revising what you are being taught in your coaching class. Give atleast one hour for it(so that you can also score good in your boards). Revising them will help you in building your concepts. Read books also.After revising them, go on solving ques from that part. Try to solve them from all the materials you have. Have a good command there.Then, after completing one chapter in this manner, do previous year questions on it.Ask doubts from your teacher. Dont hesitate in asking your doubts. Also,form a group of some good people with whom you can discuss your problems. Have a circle of good people now.Be consistent throught your preparation. It's not like that you are giving your best on one day and on other day, you are not giving 50 percent of it. You should be focused and try to give your maximum effort. This time is very crucial and an important phase of your life. It is one of the part of your life which will decide the next 40 years of your life.Don't go on counting the no of hours. Your learning should not be based on the no of hours you are giving daily. It should be such that how much are you learning.Revision is the goal key. You should revise what you have studied. Start revising them ondaily, weekly and monthly basis. That will really help.Make your notes. Don't copy the text from the books. Make them in your language, the concepts you are learning. It should be done one daily basis.Try to learn from the mistakes. If you are solving any ques and yiu are not able to solve it. Then, dont get depressed from that. Try to learn from it, analyse it properly. It will definitely help you.Materials that will be beneficialPhysics:- Ncert, hcv/resnick, dc pandey, past year ques.Chemistry:- Ncert(must), op tondon, past year quesMath:- Ncert, rd sharma, past year ques.This will be your plan for your 12th syllabus. For 11th, if you have forgotten the concepts, do start revising them and do ques on it(try to get some time for it also.) Do this process till november and complete your syllabus. Then, in december revise all the concepts and start giving mocks and also analyse them properly. So, work hard and give your best so that you will not give yourself a chack to regret in future. All the best. ",
            "date": "Answered August 6, 2019",
            "views": "434",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                },
                {
                    "user_id": "Mansvita Pragati",
                    "user_href": "/profile/Mansvita-Pragati"
                },
                {
                    "user_id": "Ishita Ukil",
                    "user_href": "/profile/Ishita-Ukil"
                },
                {
                    "user_id": "Soham Ladgaonkar",
                    "user_href": "/profile/सोहम-लाडगांवकर-Soham-Ladgaonkar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anshul Garg",
                "href": "/profile/Anshul-Garg-15"
            },
            "answer_text": "These are the best strategies to clear IIT JEE - The Complete IIT JEE Guide: 1. Be sincere in your efforts (Half hearted efforts do not give fruitful results!) 2. Practice from limited and standard books like SL Arora HC VERMA, etc. Don’t go for too many books. Do limited books, and do it more number of times. Become perfect in them. The end objective is to gain confidence. If you are able to get good marks and have gained confidence… That’s it. You are there.. One should create a balance between doing and non-doing… One should not over-do anything! Over-doing brings dullness and self-doubt. 3. Get a good Guru, if you can find ! Guru is the person who knows what should be done and what should not be done. He/she is the best guide. 4.Focus more on previous year questions of NEET,AIIMS and other medical exams that were conducted earlier (statewise). Physics: Start with HC Verma. Then go ahead with IIT JEE Questions directly. Don’t go for any other crap books. Also other books from Arihant, Balaji and GRB are good. You can use them .. However if u have time left after doing previous years, you can solve Irodov, Resnick, Krotov etc ! But I tell you, these don’t help much. Use Arihant and GRB Books. That will help you more.. Chemistry: NCERT-most important. Other than that, for reference, use OP Tandon, MS Chouhan, Pradeeps, Morrison and Boyd, Himanshu Pandey, P Bahadur, SN Sanyal etc. Other books from GRB and Arihant are also good ! Maths: Start with NCERT, RD (they may sound easy to you but they form a good base. Do all the questions of NCERT and only few questions of each type from RD). Then go ahead with A Das Gupta, MCQ in Maths, Advanced Problems in JEE (Balaji) and then previous year questions from Arihant 40 years! etc More books of Arihant and GRB can be used if needed. Practice previous year IIT JEE questions MANY TIMES (You can use Arihant 40 years for that ! ) . Become perfect in them. Solve other people’s doubts. That will help you score better :) (Whatever we give to the world comes back many times. Example: If you keep smiling, then people smile at you. That’s the law of nature. You give Soan Papdi in Diwali to people and Soan Papdi will only come back. World is nothing but a reflection of you. Whatever you start thinking, starts manifesting. So always be positive. Be Happy and Spread the knowledge and it will come back to you !) People run after so many modules and crap test series (which are many times intentionally made tough by coaching institutes just to show off and students lose confidence after that. Just know one thing in life: Most important rule: WHATEVER YOU DO, WHATEVER HAPPENS, NEVER LOSE YOUR CONFIDENCE. Even if you fall, stand up again. And only those people fail, who try!). Instead you should focus on limited material and do it more number of times!! Many questions ask only basic concepts but a good clarity in them. Self study is definitely most important. But one thing I would like to say, even diamonds need to be polished to shine. So coaching brings that effect. If you have potential, a good coach can help you perform on that potential. So find one good Guru for yourself if you can! Time Management: Never look at what the clock is ticking.. You should study in a target based manner. A good candidate should do atleast 100-120 questions per day (PCM Combined) (and whatever time it takes. If it takes 2 hours, well enough. Enjoy after that. But if it requires whole day, be ready to give it. After all, its about your dream and your whole life!) . And every week, one should revise all his/her self made notes. If that happens whole year, marks my words: Result is guaranteed.. J Also, don’t be so harsh on yourself. Life is a combination of being rigid and being flexible. You can take a day off every week in this process. That’s not a problem at all. Mind should be happy too.. Otherwise if you just overuse it without giving it enjoyment and rest, then one day your mind will ditch you! It won’t listen to you ! So keeping the mind happy is also very imp. Also from every chapter atleast 150-200 questions are a must to gain confidence.. More to remember: 1. Mantra: Arise awake and stop not till the goal is reached :) ~Swami Vivekananda 2. This is what Bruce Lee used to say: I do not fear the man who has practised 10 thousand kicks once but the one who has practised 1 kick 10 thousand times ! :) So do limited things and become prefect in them ! 3. Also, I recommend all my students to practice Sudarshan Kriya of the Art of Living. It gives you very good clarity of mind and keeps you focused in exams. In fact Nishita Purohit (AIIMS Rank 1) used to practice it daily ! Watch my video “Exam Tips” on our youtube channel (Satnara IIT AIIMS Academy) to know exactly what to do in exam time..  Best Wishes Satnara IIT AIIMS Academy (an initiative by IITians.. ) Mayur Vihar, Delhi ",
            "date": "Answered August 19, 2019",
            "views": "971",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jasnoor Singh",
                    "user_href": "/profile/Jasnoor-Singh-3"
                },
                {
                    "user_id": "Shakti Pandey",
                    "user_href": "/profile/Shakti-Pandey-50"
                },
                {
                    "user_id": "Deepanjali Rajput",
                    "user_href": "/profile/Deepanjali-Rajput-3"
                },
                {
                    "user_id": "Ashly Paul",
                    "user_href": "/profile/Ashly-Paul-6"
                },
                {
                    "user_id": "Aditya Bandyopadhyay",
                    "user_href": "/profile/Aditya-Bandyopadhyay-1"
                },
                {
                    "user_id": "Ayushi Gupta",
                    "user_href": "/profile/Ayushi-Gupta-993"
                },
                {
                    "user_id": "Nimisha Raina",
                    "user_href": "/profile/Nimisha-Raina-2"
                },
                {
                    "user_id": "Twinshu Parmar",
                    "user_href": "/profile/Twinshu-Parmar"
                },
                {
                    "user_id": "Tukaram Titave",
                    "user_href": "/profile/Tukaram-Titave"
                }
            ]
        },
        {
            "author_info": {
                "name": "Atul Saswat",
                "href": "/profile/Atul-Saswat"
            },
            "answer_text": " Hey Curious, This is fairly a wonted question and has rightfully received a fair amount of responses in the answers. However, I would love to add up to it being a cruiser of the same journey once. There are two ways to approach it — self-preparation & offline coaching. Both of them has their own pros and cons and is more of a subjective choice. However, if finance is not a constraint for you and there are not much impediments to join a decent coaching institute with the genuine results, then you should definitely give it a shot. It’s worth it! However, if you choose the former, to take the mantle on your own for whatever reasons, then I have something to say about it. Also, do visit the answers under my profile (Atul Saswat) related to JEE because I think I have done a fair amount of fact-finding before arriving at the answers and they will certainly help you out in one way or the other.  Now, unto this question, it is in all honestly a very broad question capable of answers of multiple perspectives. But there are a few things that holds true nonetheless and have been deliberately pointed out below in answers and deserve attention. If you join a coaching institution, prepare yourself before the class as to give yourself the extra edge and follow that up with sincerely finishing your homeworks. Trust this, backlogs are not at all pleasant, but if you get caught up then read this : Atul Saswat's answer to How can backlogs be cleared during the IIT JEE preparation?Do not fret much outside the syllabus. It might come across as harsh and a mindset against the curiosity of learning but that is the truth bud. JEE isn’t really going to be a walk in the park, you really have to struggle and excel in skills you hate. But to brush off the trouble, pick important topics. Refer : Atul Saswat's answer to What are important inorganic topics for JEE Advanced 2017? & Atul Saswat's answer to What are the most important topics for math for the JEE Main?Make customized notes and revision notes. There will be a time, when you have to go through the colossal and intimidating syllabus again to review the concepts. This is going to save you then. Atul Saswat's answer to What should I include in my short revision notes for JEE?. Also Revision holds paramount importance to the success, and yes I mean it.Appear Mock Tests more frequently during the last 3–6 months to simulate the exam environment. If your coaching doesn’t provide a very good option, there are several online, such as Resonance, Embibe, Plancess, Kayson, Allen, FIITJEE etc.Solve Previous Year Questions during the endg is better than knowing the exam inside out. This doesn’t guarantee you questions but there is a 100% chance that you will find at least a dozen of questions along the same line and you will surprise yourself for sure.Do not wander among the piles of books, not because there aren’t many good books but quite the contrary. You will be overwhelmed with the conundrum of best book and soon find yourself aimlessly steering in the spiral — futile and highly hazardous in my opinion. Stick to the basic ones, either suggested in your coaching or by people who have walked the path and made it there. Kalpit Veerwal's answer to How should I prepare for the JEE exam in 2020? I know I have left out another half-dozen generic advices but now you understand the drill, don’t you ? go through the answers, use your intellect to arrive at the destination. YOUR DESTINATION AWAITS YOU.  If you are preparing by yourself, these will come in very handy : → Atul Saswat's answer to Which are the best blogs/websites to get free jee study material? → Atul Saswat's answer to Which websites provide free video lectures for IIT JEE mains chemistry and maths? → Comparison of E-Learning Portals (Toppr, Kaysons Edu, AskIITians, Embibe) → Comparison of E-Learning Portals 2 (Embibe, Kaysons, Toppr, Plancess) → Plancess vs Kaysons Also check up this website, HashLearn — they have come up with a very good initiative.  I, lacking the pertinent information about your current situation can’t prescribe a very particular solution but if you plan to do self-study, enrolling for video lectures would solve a lot of your problem. To make that easy, go through the VIDEO LECTURE GUIDE. Also, do visit my blog, you will find tons of awesome and free resources over there ranging from A to Z, almost everything you might need — Space.  Believe not, Seek the truth yourself !  ",
            "date": "Updated April 27, 2019",
            "views": "12",
            "upvotes": " View 34 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mallireddy Bhoomika",
                    "user_href": "/profile/Mallireddy-Bhoomika"
                },
                {
                    "user_id": "Ashish Kumar Mishra",
                    "user_href": "/profile/Ashish-Kumar-Mishra-69"
                },
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                },
                {
                    "user_id": "Imon Bannerjee",
                    "user_href": "/profile/Imon-Bannerjee"
                },
                {
                    "user_id": "Sanatanpedia",
                    "user_href": "/profile/Sanatanpedia"
                },
                {
                    "user_id": "Vanshaj 'गौतम' Singh",
                    "user_href": "/profile/Vanshaj-गौतम-Singh"
                },
                {
                    "user_id": "Shreyam Das",
                    "user_href": "/profile/Shreyam-Das-2"
                },
                {
                    "user_id": "T.Manasmita Patro",
                    "user_href": "/profile/T-Manasmita-Patro"
                },
                {
                    "user_id": "Bhupendra PS Chauhan",
                    "user_href": "/profile/Bhupendra-PS-Chauhan"
                },
                {
                    "user_id": "Neeraj Patil",
                    "user_href": "/profile/Neeraj-Patil-11"
                },
                {
                    "user_id": "Pranjal Tiwari",
                    "user_href": "/profile/Pranjal-Tiwari-58"
                },
                {
                    "user_id": "Sidharth Thakur",
                    "user_href": "/profile/Sidharth-Thakur-12"
                },
                {
                    "user_id": "Sahil Chaudhari",
                    "user_href": "/profile/Sahil-Chaudhari-2"
                },
                {
                    "user_id": "Vinu Shelake",
                    "user_href": "/profile/Vinu-Shelake"
                },
                {
                    "user_id": "Nilesh Keshari",
                    "user_href": "/profile/Nilesh-Keshari-2"
                },
                {
                    "user_id": "Mann Vora",
                    "user_href": "/profile/Mann-Vora"
                },
                {
                    "user_id": "Rakesh Donthi",
                    "user_href": "/profile/Rakesh-Donthi-1"
                },
                {
                    "user_id": "Ujjwal",
                    "user_href": "/profile/उज्ज्वल-कुमार-Ujjwal"
                },
                {
                    "user_id": "Srishtik Dutta",
                    "user_href": "/profile/Srishtik-Dutta"
                },
                {
                    "user_id": "Liam",
                    "user_href": "/profile/Liam-743"
                }
            ]
        },
        {
            "author_info": {
                "name": "Annu Singh",
                "href": "/profile/Annu-Singh-540"
            },
            "answer_text": " As a JEE aspirant, you have two chances to crack JEE Main 2020 exam. The first one is in January and second one is in April. You can give both the exams and your best score will be considered for rankings and admission. Now your first intuition would be to clear JEE Main 2020 in January and then prepare for JEE Advanced 2020 which will be conducted in June. To give a best shot in JEE Main January exam, you have to finish the syllabus (including Revision) till December this year. Top 10 Tips to Crack JEE Main 2020 Here are the study tips that will help you to crack JEE Main 2020 computer-based exam. Make a list of JEE Main topics and chapters remaining (class 11 and 12) and create a schedule to complete the syllabus in time. Adjust your study hours and follow the schedule sincerely.Make sure your goals are clear. For example, saying you want to study more from now on is unclear. Write it down as, “I will study for daily 7 hours instead of 5 hours.”Master concepts/topics one by one. Take up one topic at a time and focus on accomplishing the goals related to the topic; once that is over, move to the next topic in the syllabus.Clear all the basics in all subjects. Try not to skip topics. If you find any topic boring, then incorporate new effective methods of studying to make it more interesting like quizzing, making flowcharts, tables and diagrams etc.Improve your speed, accuracy and time management skills. This is possible with lots of questions solving and practice. If you know that you are not much familiar with the concepts involved in the problem, don’t attempt it, rather study the concept first and then attempt the problem.Clear each and every silliest of your doubts. If possible, join a coaching in class 12. Ask JEE experts and teachers if your methods are correct and you’re learning the right way.Make your own notes. It’s easy and convenient to revise handmade notes in your own style and format, rather than revising from thick books and coaching modules. Make a separate notebook for remembering formulas in all three subjects.Start revising early. It’s not just after finishing the syllabus or before the exam, revision is a continuous process during regular studies. It must happen daily in some form or other. Include specific revision slot in your JEE preparation schedule. Don’t procrastinate the revision time for new study.Since the JEE Main 2020 will be conducted in online (computer-based) mode, the key change you need to make is to practice online mock tests on a computer or laptop. It’s recommended to join an online test series.After giving an online test, you have to identify your mistakes. If you got a question wrong, understand why you got it wrong. Find out what you’re good at and not so good at. Work on your weakness.Don’t panic if your JEE Main 2020 January exam don’t go as per expectation. Whatever you score in the exam, there will be an option to increase your marks. You can improve your concepts and practice more questions, online tests, and again attempt JEE Main in April. All the best. ",
            "date": "Answered April 19, 2019",
            "views": "72",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Saksham Garg",
                "href": "/profile/Saksham-Garg-77"
            },
            "answer_text": "All I learnt from my life is Strategy which works out for me may not work for you. If I say in morning 6.o clock I revised inorganic chemistry for 3 hours may not sound suitable to you. If you are a school going guy. But ideally stay truthful to yourself and study 7–8 hrs including classes and self study (working days).(for XIth class school going kids) And 12 hrs on weekends. All your sittings must include proper time division for Physics/Organic/Inorganic/physical/maths individually. Make sure you have devoted more efficiency in maths,(because I think it's very straight forward subject)Make sure you revise inorganic in morning time because in Myths and my own experience morning time is the best time to cram the things.Physics especially SHM and Waves are very crucial you must be thorough with Thermodynamics and Fluids , gaseous state etc I remembered that in my exam I was chill about these topics but at the end I felt embarrassed and sadMust give 2 sittings for 3–3 hours each and then a small recap before going to bed.You should make a habit of doing tests regularly on weekends and holidays. No excuse if you want a secured future. Please check supermonk for assistance.Gym/running/football etc is compulsory you can do either in school or at your free time.Feel free to contact me sakshamceo@gmail.com just like your elder brother.Don't ever use your phone. I owned a typing phone in my preparation days.",
            "date": "Answered July 28, 2019",
            "views": "237",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tanya Sharma",
                "href": "/profile/Tanya-Sharma-1085"
            },
            "answer_text": "Cracking an exam like IIT-JEE requires immense hard-work, consistency, and proper guidance. NCERTs play a great role in helping develop the basic concepts about the topic. Apart from NCERTs, proper guidance from the best institution works a great deal in cracking the exam. Being a student of FIITJEE, I have realized that FIITJEE has helped me a lot in polishing my skills and provided me with the best materials, assignments, course programs, and test series as well. This structure has helped me a lot in understanding and improving my overall performance.   FIITJEE offers different programs for students from freshers to droppers. These different program courses include Super Condensed Classroom Programs and Super Intensive Contact Program for JEE Mains and Advanced. I had enrolled in Super Condensed Classroom Program, and this is one of the best programs that FIITJEE provides. The course content, study material, and questions are designed in such a manner that tones up your skill and strike out all the loopholes and raise your overall confidence. The Grand Master Package contains all the value questions and study material that would help you in polishing your knowledge and work on your loopholes. Besides the different course programs of FIITJEE, the All India Test Series works a great deal in analyzing your preparation regularly and striking out the scrambling blocks from your way. FIITJEE has helped me in improving my performance every day and worked on my weaknesses. Apart from the different course structures, AITS, the main USP of FIITJEE is its faculty members that never disappoints you. They act as a guiding pillar and constant support system stretching your limits to perfection. ",
            "date": "Answered March 28, 2020",
            "views": "97",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aditya Garg",
                "href": "/profile/Aditya-Garg-421"
            },
            "answer_text": "Apurva Kumar thanks for the A2A but i ain’t gonna answer the question you are asking but a slightly different one “how to prepare for the last phase for jee 2020 ?” we’ll basically first thing is to give mock tests ! take a idea of the strong and weak concepts from thesesecondly do the previous year problems by heart ! if you can solve those then you will at least score a decent score in the upcoming paper toodon’t exert yourself too much // it’s not a time to study like 15 hrs a day but ain’t playtime too so just do decent efforts like 8 hrs a day only and that too must be divided among PCM equallytake proper sleep ; don’t disturb sleep cycles now ! if it is already disturbed then mend it while you still have time !your jee mains would have given you an idea of strong and weak topics so work accordingly and with a plan ; don’t study random new topics now :(rely on your guts :: it’s good to take advice but better to take self feedback at this stage ; if you can’t do that then listen to ppl worth listening to ; don’t randomly work on any persons advice or strategy !give up social media + quora itself !",
            "date": "Answered January 30, 2020",
            "views": "711",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nandan N",
                    "user_href": "/profile/Nandan-N-16"
                },
                {
                    "user_id": "Anjali Gupta",
                    "user_href": "/profile/Anjali-Gupta-2618"
                },
                {
                    "user_id": "Siddharth Pradhan",
                    "user_href": "/profile/Siddharth-Pradhan-84"
                },
                {
                    "user_id": "Anurag Jana",
                    "user_href": "/profile/Anurag-Jana-3"
                },
                {
                    "user_id": "Apurva Kumar",
                    "user_href": "/profile/Apurva-Kumar-56"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bikram Ghosh",
                "href": "/profile/Bikram-Ghosh-75"
            },
            "answer_text": "In IIT-JEE all the questions are asked are very conceptual. So your basics should be very strong to solve the problems in the examination hall. You should follow the instructions given below to secure a good rank in IIT-JEE. Before worrying about how to prepare for IIT JEE 2020, you must prepare for your Class XII board exams well. You can also buy a set of NCERT books to begin with and make sure that you really understand all the concepts clearly.The second step is to practice JEE papers, analyze your strengths and weaknesses topic-wise, and work on them accordingly.Resources and tools are important for any student to learn something. So, if you want to study at home, you should get appropriate books for IIT preparation. Besides mastering school books, you need to go through reference books and solve as many JEE model papers as you can.You should also enroll yourselves in online video lectures such as KAYSONS. Enrolling in such online platform gives you many advantages:Better understanding of conceptsSince students are the focal point of everything in a classroom, the introduction of video lectures is also to facilitate them. Videos present multi-dimensional aspects of things which help us understand the basic ideas playing their role behind the things happening around us. So, with the help of video lectures, students can learn the concepts of things in a better way. Students remain interestedIt is common that students lose their interests in classrooms very easily. This is because regular methods of teaching are boring. Reading books isn’t as much fun as watching videos with colorful images and sounds. Thus, using video technology in your lectures, you can ensure the interest of your students in your class. Interactive way of learningAnother upside of the video lectures is that it is an interactive way of learning. Since, you are physically viewing characters on your screen while having a lecture you can interact with them and introduce additional information in the lecture which isn’t available in the video. Easy method for teachersConventional methods of teaching are as tough for teachers to deliver as these are hard for students to understand. However, video lectures are productive for students and teachers alike. As a teacher, you can ensure maximum results with minimum efforts. Diversity in learningUnlike the regular methods of learning, video lectures introduce diversity when it comes to learning. With video lectures, you don’t just learn one concept at a time but you can understand multiple things in a single go. For instance, you can watch multiple videos simultaneously and learn multiple interconnected concepts. This introduces the aspect of diversity in modern-day learning experience. Inducing Self-study in studentsSelf-study is extremely crucial when it comes to producing amazing results. The regular way of learning doesn’t help students a lot when it comes to self-study. Students cannot read from books and grasp the ideas on their own. However, with videos students can learn things themselves. The moving multi-dimensional objects and the voice of the narrator in a video make it easy for you to learn things on your own. You should meditate regularly to improve your concentration skills.HOPE THIS MAY HELPS YOU…… BEST OF LUCK!!!!! ",
            "date": "Answered January 25, 2019",
            "views": "180",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhinav Aman",
                "href": "/profile/Abhinav-Aman-23"
            },
            "answer_text": "I gave jee this year and secured a rank of 6634 But I was performing well enough in my institute and I was supposed to get a rank near 2000,well I am happy with what I got at the end. Read it completely to get the full out of it The matter is why I underperformed . It's only because of low confidence and not so good temperament. togheter they result in silly mistakes and you also leave some question which you could answer and you will eventually loose 20–30 marks which could fetch your dream rank. According to me with knowledge only you can get only 50 percent of your potential. You need great sense of confidence,attitude and good temprament because they will help you to get the rest of 50 percent . Many people say that 2 years of hardwork is not well judged by a 6 hour paper. That's true but this is the reality so you need to perform good in those 6 hour and that is equally important as is the 2 years of learning So try to develop confidence(have faith in yourself). Never say that I am weak in following topics this will degrade your confidence in those chapters and you will be unable to perform well in those topics Have a calm mind, build good attitude and temprament. You can achieve this by doing your daily practice as tests (fixed no of question in limited time). And most important part is to analyse that practice session as you have given real test and try to improve yourself according to analysis Follow these tips you will definitely get best out of yourself on the final day I hope my answer will help you . ",
            "date": "Answered June 17, 2019",
            "views": "416",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ritik Naitam",
                "href": "/profile/Ritik-Naitam"
            },
            "answer_text": "If you want to start your preparation with coaching institute, then chose it wisely. Don't judge institutes by their results( they show us fake results ) . Go for some reputed institutes or simply ask your seniors . They guide us better. Use study materials of some good coaching institutes like resonance, fitjee. Don't use too many reference books. They confuses your mind. Coaching material is trusted. Or you can study online ( best method , I say!!!). It totally depends on you. Sites such as etoos India, entrance prime , provides video lectures of excellent kota faculties. They have many faculty options too. As I say you can refer study materials for good coaching institutes. This way will save your time by large extent. But you have keep solving mock test papers topicwise or part wise depending on your course content. You can get this free of cost at embibe app for jee. Your time is very valuable from now. After your 10th board exam you must start reading textbooks of 8th , 9th & 10th (at least 2hrs a day). It will help you to start your jee preparation. How much you study a day, depends on how much you can take? But, number of hours should be increasing on your own level.(day by day or weekly) Your time table must be fixed and comfortable to you. Choose coaching whose schedule is fixed and does not changes frequently. Give time for some entertainment( at least 1 hour). It is very necessary to be not frustrated. Don't forget to plan about your test series at end of Oct. There are many sources say online or offline. Revision is most important part of preparation, as after preparing chapter you will definitely forget theory after one or two months. Two years is plenty of time for jee preparation. If you manage to complete course in approximately 1.5 years (if you are doing self study) then you can revise again the same. Have a faith in your self and be confident. ",
            "date": "Answered February 20, 2018",
            "views": "27",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                },
                {
                    "user_id": "RUNU VERMA",
                    "user_href": "/profile/RUNU-VERMA"
                },
                {
                    "user_id": "Hriday Bajaj",
                    "user_href": "/profile/Hriday-Bajaj"
                },
                {
                    "user_id": "Anshu Anshu",
                    "user_href": "/profile/Anshu-Anshu-15"
                },
                {
                    "user_id": "Ayantika Chandra",
                    "user_href": "/profile/Ayantika-Chandra-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lokesh Sharma",
                "href": "/profile/Lokesh-Sharma-590"
            },
            "answer_text": "this is the best question for me and i think i will actually like to answer this question. first it matters how much you are understanding the concepts, actually understanding the formulas(yes you should even do that!). next thing is how much time do you have to sped on it,(because it takes a lot-per day)you have to do a lot of work on it. next-i would say practice a lot. really, doing many question does not help but doing the questions then counting your marks(like a mock test) and then understanding the concepts you do not know or you have to understand them in a better way to do the questions. you should again revise the concepts, do the que. again and then repeat if still something is left. don’t miss anything, really you can not afford to leave any topic. you have to understand all concepts, (not learn but understand)and do que. . for subject wise maths-you have!!!!! to read the NCERT very very efficiently. it seems stupid but somtimes you miss those things which are even in the ncert. you should do all the ncert que. and leanr the concept behind it. maths is a subject of practice. you should do as many que as possible(possibly of different types), and also try to do each one with many possible solutions. Chemistry-for inorganic-NCERT—-that’s it. really, the ncert is must book. you should remember each and every line of ncert. you should know which line can form which types of que.s. for physical also i would say NCERT and some books like arihant or anyone suggested by you r teacher of coaching etc. for organic i will say que from m s chauhan and MTG publications. for concepts see books you teacher suggests or pradeep’s as that contain everything even for advance. Physics-for this do master in all question of ncert and then do hc verma(actually do this cincepts first) and for questions do MTG publications and do modules from your coaching. have fiath in them and that is it, its simple ",
            "date": "Answered August 14, 2019",
            "views": "206",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashly Paul",
                    "user_href": "/profile/Ashly-Paul-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Honey Sharma",
                "href": "/profile/Honey-Sharma-194"
            },
            "answer_text": "Well you have plenty of time…left with you 7 and half months are enough to crack JEE MAINS with decent enough rank and as now as per new rules NTA will conduct JEE MAINS Twice a year one in January and other in April so there is fair enough chance for you to score better.. Now coming to the strategy . Since you are in class 12th now so be a little more focus to your academics because if you prepare well for your boards 75% work is done automatically.. . You have to make short notes of all the concepts you learn side by side because they help you in brushing up them in last time . . Buy previous year questions bank and practice them hand in hand means once you complete one topic practice each and every problem related to it. . Do core topics of each subject properly like functions in mathematics and atomic structure and chemical bonding in chemistry as these are building blocks for other important chapters. . Make use of your summer vacation in revision of class 11th part... As it is the golden chance to be back on track again. . If your are enrolled in some coaching institute do practice their sheets and pay proper attention to lectures. . Try to complete your backlogs and gaps,try to study 4-5 hours a day and study all 3 subject daily. At last remember one thing practice is the key to success so practice as much problems as you can and after 6th months start giving the test series, try to develop habit of 3 hour sitting as it is crucial in examination’s point of view. A personal advice: Give January attempt with a cool mindset as you have one more attempt in April so you can take it as mock test,so if in case you score little less in January attempt or unable to prepare properly for it, don't worry or be in panic you will still get one more chance. Good books for JEE MAINS preparation: . For physics one can refer concept of physics by HC Verma volume one and two. And 40 year chapterwise by DC pandey . For Chemistry NCERT is enough for securing good marks in addition to this you can refer problems from 40 year chapterwise by Ranjeet shahi . For maths you can refer objective mathematics by RD Sharma, NCERT exempler, 40 year chapterwise… Hope this help Cheers...!!!! ",
            "date": "Answered May 14, 2019",
            "views": "606",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rachita Checker",
                    "user_href": "/profile/Rachita-Checker-1"
                },
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                },
                {
                    "user_id": "Vikas Dagur",
                    "user_href": "/profile/Vikas-Dagur-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manisha Gupta",
                "href": "/profile/Manisha-Gupta-225"
            },
            "answer_text": "Hello Aspirant, To score good marks in Exam, You should have good hold on PCM subjects and decide well in advance how much time you are going to give on each subject, based on your strong and weak points. Work on your concepts to score good marks in exam for this you can take help of NCERT books. Here are some Important tips you can follow to prepare the exam. Divide & Segregate the Exam Syllabus: The topics from the Exam syllabus must be divided into easy, tough and very tough so that preparation of the exam is made accordingly. Make your Basic Concepts Strong: While it is essential to study the topics mentioned in the official syllabus, it is also advised to study the basic concepts well first. By knowing the basic concepts of the units involved in the examination, you will be able to understand each topics well and in depth. This will result in a greater understanding of the topics and will make it simpler for you to study complicated concepts present in the syllabus. Improve your Weak Points: Stressed over some topics or formulas which you just cannot seem to understand? Give more time and focus on these topics to improve it. Keep small notes and constantly revise those concepts which has been hard to understand. By constantly studying the topics you find difficult. Attempt Mock Test and Solve Sample Papers: Mock tests will give you an almost real experience of how the examination will be. By solving mock tests, you will be able to work on time management while at the same time understanding the question paper pattern. I would also like to inform you about Careers360 Talent search exam (CTSE) where students of 11th and 12th PCM/PCB ( Engineering/ Medical) can test their knowledge and enhance their preparation by knowing their stronger and weaker areas and win prizes and scholarships worth ₹1.25 Crore. It is a great opportunity for you. Take the test, perform the best, avail the scholarship and win prizes. You can win exciting prizes such as: ₹50,000/- cash Prizes, Upto 100% Scholarship on JEE / NEET AI-Based preparation packages, Laptops, Smartphones, Amazon Echo, Careers360 Almanacs, Powerbanks, Upto ₹250/- paytm *Cashback offer. Good Luck! ",
            "date": "Answered August 16, 2019",
            "views": "234",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                },
                {
                    "user_id": "Jitul Talukdar (জিতুল তালুকদাৰ)",
                    "user_href": "/profile/Jitul-Talukdar-জিতুল-তালুকদাৰ"
                }
            ]
        },
        {
            "author_info": {
                "name": "Madhav Tiwari",
                "href": "/profile/Madhav-Tiwari-30"
            },
            "answer_text": "Jee is one of the toughest exam in india or probably in the world also . So you need to gather up your strength and try to reach upto the mark.If you start your prepration in 2018 then it is pretty sure that if you work hard with consistency than you will land at a prestigious IIT .There are few points that you need to keep in mind while preparing for jee. Passionate: you need to be very passionate about your studies .It might happen that for initial couple of months you will not be able to do solve problems .But do not loose heart keep hard work going on .It takes some time to make an approach towards jee syllabus. Avoid apaty and neutralization: There is a case that students fall in the feeling of apaty or neutralization.Due to the regrious hard work and a poor result may lead you to such situation.This is the very beginning of your ruined jee journey .So if you fall in such situation than concern your teacher ., mentor or your seniors. Pre study : You must join a coaching institute for your jee prepration because they are the only way for the finest prepration .But you may have a brief introduction of the topic before going to coaching .Now how to do it . You have 3 options: Books: books is a better option but it would be much effective if you prefer them after coaching. Video tutorial: this is the best options for pre study.The tutorial like of kaysons, bujus are quite helpful in this reference. Revision: after completion of the syllabus you need to give a analysis to your study with quick revision that you may do easily through books or video tutorial.But i would say that books would not be enough you may add some more like video tutorials etc.Some video tutorial like kaysons that provides more that 30000 problems along with video solution is also preferable So these were the points that you may refer while preparing for jee. ",
            "date": "Answered August 18, 2018",
            "views": "387",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                },
                {
                    "user_id": "Nand Kumar Ojha",
                    "user_href": "/profile/Nand-Kumar-Ojha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ravi Sharma",
                "href": "/profile/Ravi-Sharma-3905"
            },
            "answer_text": "When you are planning to appear for JEE 2020, then get ready to learn new things. Here are some tips that are going to help you throughout your JEE preparation journey. 1. You have to give up on the old and deep-rooted habit of by-hearting everything because JEE tests your analytical skill. You can ace this by practicing different kinds of problems regularly. Also, solve riddle and puzzle in your free time. 2. Figure out the time in which you are more productive, and try to study during these hours every day because your concentration is at its peak at this time of the day. Make a solid time table and stick to it. Include snack breaks and rest-breaks in it. Please don't ever try to stretch those breaks. 3. Get your basic concepts cleared for all the subjects. Do not skip any topic. Devise exciting techniques to make the problem more engaging rather than dropping it. 4. Approach your teacher without any hesitation if you struggle with any of the topics. 5. Make a note of concepts that you are finding difficult. Work on it until you master it. 6. Revise regularly. Include revision time in your time table so that you don't forget the things you learned earlier. Follow all these instructions, and you are ready to appear for JEE 2020! Read further to make sure your preparation strategy is strong: JEE Main 2020 Preparation Tips and Tricks for Scoring Well ",
            "date": "Answered September 9, 2019",
            "views": "128",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vicky Maheshwari",
                "href": "/profile/Vicky-Maheshwari"
            },
            "answer_text": "The following tips will help students prepare well for the JEE Advanced 2020. Speed and accuracy – one of the essential aspects is rigorous practice. Aspirants are advised to practice as many problems, and questions from the previous year’s/ attempt reputed online test series for improving speed and accuracy. Both speed and accuracy matter to enhance your score with a competitive edge. As JEE is now Computer Based Test, the practice of papers from the reputed source like MyPAT is advisable.Study material & Concept Clarity – To make it to the merit list, it is essential to practice all problems graded in order of difficulty from single best study material to have perfect conceptual understanding and to hone analytical skills. Aspirants are also advised not to make use of calculators while solving problems. Being quick in calculations will help you to increase your speed in the JEE Advanced exam.Cover the complete syllabus – As aspirants would have covered most of the topics, it is advised to go through the whole syllabus of JEE Advanced thoroughly. It is advisable to avoid careful study and to cover the entire outline, but from experience, students are advised to emphasize the following chapters/topics in the three subjects.Physics- Modern Physics, Mechanics, Fluids, Electromagnetic induction, Waves and sounds, optics, heat, and thermodynamics.Chemistry- Qualitative analysis, Coordination Geometry and chemical bonding in inorganic chemistry, Electrochemistry, Thermodynamics, chemical equilibrium in physical and organic chemistry.Mathematics- Quadratic expressions and equations, Complex numbers, probability, vectors, and 3D Geometry, Matrices in algebra, application of derivatives, definite integral in calculus.Subject wise tips for JEE Advanced 2020 : Mathematics:As per the previous trends, vectors and 3-D require more attention than probability and indefinite integration.Every year 2-3 questions from complex numbers are asked. So complex numbers, 3 D, Definite integral should be revised thoroughly compared to other topics.Algebra can be made more accessible if you have a great practice of functions and have perfected applying vertical and horizontal origin shifts.Differential Calculus again deals with roots of equations, primarily if you use Rolle’s and Lagrange’s theorems.Complex numbers can be used to solve questions from coordinate geometry.Trigonometric questions require applications of De Moivre’s theorem.Permutation – combination/ Probability are linked topics of Algebra. You need to be thorough with Bayes theorem, taking care of the objects which are identical, and which are different.Matrices can be related to equations. 3*3 matrices matrix can be seen as being planned in 3D Geometry. Determinants have nice properties, for instance, the ability to break them in columns and rows, which could be exploited in tough questions.Chemistry: While preparing for the chemistry section, the students must keep in mind two things, concept clarity, and application skills. Practice the numerical questions daily. The special attention should be given to concepts like themole conceptChemical EquilibriumElectrochemistryOrganic chemistry requires a careful approach, and special attention should be given to Stereochemistry, Functional Group Analysis, GOC (General Organic Chemistry)In inorganic chemistry, the questions asked are mostly conceptual, concerned with structures, processes, and applications. Chemical bonding and coordination chemistry require extra attention.Physics: Mechanics is one topic that is relatively less scoring but as per the experts this topic contributes majorly in terms of marks so, this topic cannot be neglected. One must try to concentrate on scoring topics like optics, electricity, and magnetism.Kinematics and Particle dynamics are vital topics that have been asked frequently in the JEE Advanced exam.Mechanics, Electricity, and Magnetism are some topics having made a regular appearance in the JEE Advanced exam in terms of the number of questions.Thermodynamics is essential in both terms of physics and chemistry, so concentrate well on this.Quick Tips for the D-Day: 1. Do sleep for 6 to 7 hours in the night. 2. Reach the examination venue well in time. 3. Don’t forget to carry your admit card on the exam day. 4. Don’t discuss anything with friends outside the exam center. 5. Remember to read all the instructions on question paper carefully. 6. Solve the paper in two rounds. In first-round, Start with the subject in order of your comfort level to maximize attempted questions with not more than 45 minutes on each subject. 7. Use the last 45 minutes to solve balance questions in the second attempt and for revision. 8. Do not spend more than a minute on any problem if you find that you are not nearing a solution. Go to the next question. 9. Do not guess if you are not sure in a question with negative marks assigned to it. 10. Must attempt and even guess answers for all those questions which do not carry negative marks. 11. Just go and give your best. 12. It is the relative performance that counts, give your best shot and you will ace JEE Advanced 2020. Follow my blog for more such questions M CUBE: Math-e-Matics by Maheshwari ",
            "date": "Updated December 22, 2019",
            "views": "573",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aftab Ahmad Khan",
                    "user_href": "/profile/Aftab-Ahmad-Khan-5"
                },
                {
                    "user_id": "Krish Badawaliya",
                    "user_href": "/profile/Krish-Badawaliya"
                },
                {
                    "user_id": "Prachi Patel",
                    "user_href": "/profile/Prachi-Patel-73"
                },
                {
                    "user_id": "Ashly Paul",
                    "user_href": "/profile/Ashly-Paul-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikhil Chattri",
                "href": "/profile/Nikhil-Chattri"
            },
            "answer_text": "Students can use the http://www.kaysonseducation.co.in/ for exam preparation. Do consider opting for paid and professional video lectures here. The benefit is that you can study them anywhere and anytime plus you will be having access to your missed or weak topics. Their online doubt clearing platforms are simply awesome and they are pocket-friendly too. PHYSICS Physics requires you to have a strong hold on concepts. Once the concepts have been mastered, they are very easy to retain. Some chapters for JEE in physics have a heavy weightage in the exams. Here's the priority sequence you can follow chapter-wise. Mechanics Mechanics is probably the most important topic any engineer should know. This invariably makes it the most important part of the paper. Indeed, the bulk of questions in JEE are either directly mechanics questions or require you to have considerable skill to solve compound problems. Rotational Mechanics is the most important topic in mechanics. But in order to master that the student needs to have considerable expertise with the previous chapters. Any JEE level mechanics problem can be solved by a combination of one or more of these: · Newton’s laws· Work energy theorem· Law of conservation of energy· Law of conservation of momentum (linear/angular)· Equation of continuity· Bernoulli’s theoremThese are probably the most important chapters for JEE and have applications in other chapters for JEE Physics too. Also, do not ignore the chapter on elasticity. Electricity and magnetism This is another big section of JEE and one of the most important chapters for JEE. A lot of questions are asked from the applications of Coulomb's law and Capacitance. Stick to the JEE syllabus because this topic is diverse. Don't be scared of complex circuits and try to use the fundamentals to reduce complicated circuits to simpler ones. Use Kirchhoff's laws, series-parallel reduction, and such tricks. Do not ignore the theoretical aspects of the topic. There are quite a large number of standard formulae in electrostatics and magnetostatics. Make sure to remember them all (with directions involved) because you won't have enough time to derive standard results on D-day. Motional EMF is also one of the most asked topics and should be among the top priority chapters for JEE, so ensure that you practice ample of questions from it. Thermal physics This chapter covers a big chunk of the paper too. Since the topics are diverse, don’t be surprised to see a question, which is a mix of calorimetry with the laws of thermodynamics. Familiarize yourself with calculations of work, internal energy and heat in various processes. Fluids and waves and sound A lot of questions are asked from waves and sound; the most common ones are from Doppler Effect. Practice sample questions from fluid mechanics as well. Potentiometer-related experiments JEE contains questions involving error analysis pertaining to potentiometer-related experiments, so make sure to understand them. Optics This chapter isn’t as difficult as it seems; it is indeed it is one of the easiest topics for JEE. Practice many questions, and you’ll be able to master it. Do not ignore Huygens’s principles. Modern physics It is mostly theoretical; in this, the focus should be on understanding the nuances of Bohr’s model. The common formulae should be memorized. CHEMISTRY One must understand that it’s very important to read as much as possible in order to learn chemistry. Also, revision is crucial as there’s a possibility of forgetting things. Take chemistry as seriously as mathematics and physics. Do not ignore this subject just because you feel chemistry is purely “cramming.” Weightage is nearly equally distributed in the three streams of chemistry. It is important not to skip any topic from Inorganic Chemistry as the subject is highly scoring. Physical Chemistry Chemical Equilibrium and Ionic Equilibrium are the most important topics in Physical Chemistry but in order to master that you need to have an excellent expertise in Mole Concept and Volumetric Analysis. Mole Concept: The most important and central concept in physical chemistry is the mole concept, which lies at the heart of the subject. Hence, it is indeed one of the most important and basic chapters for JEE chemistry. You should read this chapter thoroughly to gain a firm command over the entire chemistry subject. It is also important to understand the application of mole concept to various types of reactions, especially redox reactions. Several questions of physical chemistry in competitive examinations like JEE Main and JEE Advanced can be solved easily if one is well-versed with the mole concept. Electrochemistry is also an important topic Atomic Structure This is the only chapter whose contents do not seem to have a direct correlation to Mole Concept. Questions from Atomic Structure are regularly asked in JEE. Other topics The rest of physical chemistry is essentially derived from mole concept. Other concepts like Chemical Thermodynamics, Chemical Bonding, Chemical Kinetics, Gaseous, etc. have nearly equal weightage. So, they can be revised in any order, but remember that a few questions are guaranteed to come from this section. Student needs have a basic idea of Surface Chemistry and Nuclear Chemistry. Organic Chemistry Nomenclature is the most basic concept in organic chemistry, it is essential that the student has an excellent mastery over it. General Organic Chemistry and Isomerism: The key to understanding the entire organic chemistry is being thorough with the general organic chemistry section – electrophiles, nucleophiles, types of reaction, acidity, basicity, etc. The remaining organic chemistry is just the application part. Named Reactions A large part of organic chemistry consists of the standard \"named\" reactions and students are expected to know these reactions along with the mechanisms. It is always good to know the mechanism of a specific reaction so that you can solve a similar new problem. Solomon and Fryhle's Organic Chemistry is one of the best books for learning organic chemistry besides other available books. Organic Synthesis: The Student needs to gain mastery over reaction mechanics to proceed with organic chemistry as the mechanism is very important for the entire chemistry. This is the part of the organic chemistry where things don’t need to be mugged up and can be understood and analyzed as JEE usually twists the questions on the basis of analysis. Aldehydes and Ketones are very important chapters of Organic Chemistry. Major chunk is asked from this chapter. Another important aspect of organic chemistry is the portion of organic synthesis, which involves writing a sequence of steps to synthesize a given compound from a given set of reagents with as little effort as possible. Quite a few problems of organic chemistry in the competitive examinations are based on organic synthesis where the students are expected to identify the missing reagents/chemicals in a specific step of the synthesis. So, it becomes important to be clear with all the steps of mechanism in the reaction. Please do not miss out on Biomolecules as it is the simplest and very scoring. Inorganic Chemistry All of Inorganic Chemistry is on equal footing. No chapter can be considered ‘Unimportant.’ There are a large number of compounds, and you are expected to know about them (methods of preparation, chemical reactions, uses, etc.). So, it’s a good idea to not divert much from the syllabus. Many questions of inorganic chemistry are asked from p-block elements, and it becomes important to understand this chapter rather than just cramming it. A good knowledge of periodic table and the trends in the properties of atoms (ionization potential, atomic radius, electronegativity, electron affinity, the electrode potential) will help you to understand the reactions. MATHEMATICS For mathematics, you need rigorous practice. The more problems you will solve, the better will be your speed and accuracy. The mathematics syllabus for JEE broadly consists of the following topics: · Trigonometry · Algebra · Differential Calculus · Integral Calculus · Coordinate Geometry · Vectors The topics for preparation of Mathematics for JEE Main & Advanced should be chosen wisely in order to ensure that pre-requisites for each topic are met completely. Hence, even though the priority of differential and integral calculus is undoubtedly the highest among any other chapter, calculus needs to be done after trigonometry and algebra. Calculus Calculus includes chapters on functions, limits, continuity, differentiability, differentiation, application of derivatives, integration, definite integrals and differential equations. Each of the above topics is important, and the calculus section covers around a third of the paper. So, you must be well-versed with every standard formula and technique used in calculus. Co-ordinate Geometry This topic is usually taught in high school as well, so students are already familiar with the basic concepts of the slope, the equation of a line, etc. Solving plenty of problems (subjective as well as objective) from geometry helps in scoring better in JEE. Vectors (and 3D Geometry) Having done the coordinate geometry portion, most of you will find the 3D geometry portion relatively hassle-free and do well in this section. It’s primarily easy-breezy because JEE contains numerous problems pertaining to vectors that require standard formulae as in the case of a parallelepiped, etc. Algebra Algebra questions in JEE are a bit hard, and most students struggle with the chapters on permutations and combinations and complex numbers. However, practice is the key. The chapter on complex numbers greatly depends on the coordinate geometry portion. At times, a hard question from complex numbers can be solved if one can smartly correlate it to a coordinate geometry problem. Trigonometry The formulae of trigonometry appear everywhere in JEE Mathematics exam paper. Very few questions are purely based on trigonometry, but there are always questions that involve standard trigonometric identities. Remember that an important aspect of the JEE Mathematics preparation is memorizing standard formulae. Make sure you are thorough with them to avoid last-minute anxiety. To master JEE Mathematics, all you need to do is to practice a large number of questions and you will surely perform well. P.S. :- I used video lectures during my preparation time and they proved to be very beneficial. ",
            "date": "Answered August 28, 2018",
            "views": "816",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Hfenix-Choudhary"
                },
                {
                    "user_id": "Sachin Sharma",
                    "user_href": "/profile/Sachin-Sharma-2975"
                }
            ]
        },
        {
            "author_info": {
                "name": "The Entrance Mantra",
                "href": "/profile/The-Entrance-Mantra-3"
            },
            "answer_text": "IIT-JEE is considered to be one of the toughest examinations of India by cracking which youngsters aspire to get admission in any of the 23 IITs, NIITs, IIITs and GFTIs. To aspire to sit for the JEE-MAIN 2021 one has to construct a proper study plan that takes into account exam patter, syllabus, mock tests and more. Below are few short tips and tricks that are offered by experts: 1. Look into the syllabus, focus what exactly to study. NTA publishes the syllabus to study. If you’re in standard 11 or 12, you are supposed to be good in Physics, Chemistry and Mathematics. This is the first stage to be confident enough to prepare for JEE MAIN 2021. 2. Divide the topics in the syllabus into three parts, as in: Easy, Tough and Very Tough. This not only helps to prepare for board exams but also the entrance. 3. Do proper analysis of the question papers of the past 10 years of JEE Main and AIEEE. This will help you highlight the topics which are crucial to study. 4. Note down important points that you tend to forget and important formulas. Keep that notebook handy as it’s going to help each time for a quick revision. 5. Don’t forget to take a break- Yes, while high level of concentration is important for JEE preparation but that doesn’t imply that you should study continuously. Overloading your mind can lead to bad consequences both mentally and emotionally. Therefore, keep refreshing your mind, keep engaging yourself in your favorite stuff. A clear mind is very important studies. ",
            "date": "Answered September 17, 2020",
            "views": "78",
            "upvotes": "0"
        }
    ]
}