{
    "title": "How to study Mechanics - Quora",
    "tags": [
        "Study Strategies",
        "Academic and Educational Advice",
        "Mechanical Engineering",
        "Studying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sonal Patil",
                "href": "/profile/Sonal-Patil-7"
            },
            "answer_text": "The question has enlightened my memories when I was struggling with Mechanics in first semester. Mechanics was a nightmare in those days, And seen many Non-Mech inclined student choosing Diploma way to engineering just to bypass Mechanics. ( You can get direct second year admission by completing diploma in that stream) I asked same question to one of my friend who did a summer crash course in mechanics before joining college. He showed me a mobile tower.  and asked me do you no all cross frames in this structure, their angle, the force that come at each point etc.. everything is calculated. Its called truss. Then he showed me a railway track  and asked being the smooth why trains are not sliding on track, because frictional force is directly proportional to mass (F = ma) Its just blown my mind, I had gone through many times in book and read these topics but my mind was not relating it with any of the practical application. and I was finding it difficult. But after that incident I started relating Mechanics with practical application and gain interest. You can not study Mechanics if : Your concepts are not clearYou don’t know where its applied in practicalYou just want to pass the subject.And I think it applies to every subject. Best of Luck. Image courtesy: Google Images ",
            "date": "Answered March 12, 2017",
            "views": "11",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Khushboo Rana",
                    "user_href": "/profile/Khushboo-Rana-12"
                },
                {
                    "user_id": "Namitha",
                    "user_href": "/profile/Namitha-40"
                },
                {
                    "user_id": "Ali Wahab",
                    "user_href": "/profile/Ali-Wahab-5"
                },
                {
                    "user_id": "Jatin Kr Dey",
                    "user_href": "/profile/Jatin-Kr-Dey"
                },
                {
                    "user_id": "Div Ya",
                    "user_href": "/profile/Div-Ya-43"
                },
                {
                    "user_id": "Ashish Tiwari",
                    "user_href": "/profile/Ashish-Tiwari-439"
                },
                {
                    "user_id": "Mufaddal Rasheed",
                    "user_href": "/profile/Mufaddal-Rasheed"
                },
                {
                    "user_id": "Yogesh Parte",
                    "user_href": "/profile/Yogesh-Parte"
                },
                {
                    "user_id": "Himanshu Chhatpar",
                    "user_href": "/profile/Himanshu-Chhatpar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trisha Haldar",
                "href": "/profile/Trisha-Haldar-1"
            },
            "answer_text": "This used to happen with me also, but trust me, there's no harm in being an average learner! Infact, I've seen average people working hard and moving way ahead than the lazy , intelligent ones! The key is simple: practice and revision! Revise in the morning what you read the previous day and then start off with fresh topics. This really helps. And at times, while revising, you may get to understand that topic from a different perspective which you hadn't been able to before! So, don't worry, keep practising, keep revising! Happy studies  ",
            "date": "Answered November 10, 2018",
            "views": "380",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Naman Yadav",
                    "user_href": "/profile/Naman-Yadav-86"
                },
                {
                    "user_id": "Premprakash Singh",
                    "user_href": "/profile/Premprakash-Singh-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anirudha Samal",
                "href": "/profile/Anirudha-Samal"
            },
            "answer_text": "Mechanics is not theoretical.. It's more about practice.. Mechanics can be cleared by solving problems... Go for many solved examples that will develop logic and then do unsolved ones.. REMEBER mechanics has not created man but man has created mechanics. It's not above u.. Just go for it. ",
            "date": "Answered November 10, 2018",
            "views": "184",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nitish Raja",
                "href": "/profile/Nitish-Raja-4"
            },
            "answer_text": "This problem of learning and forgetting very easily…a large no. Of students are suffering from this problem the reason behind it is simple..Ur mind is distracted somewhere..u r not interested in what u r doing. Watching something positive everyday and listening to study music will surely help u to became a great learner. ",
            "date": "Answered November 10, 2018",
            "views": "171",
            "upvotes": "0"
        }
    ]
}