{
    "title": "How should I study combinatorics? - Quora",
    "tags": [
        "Combinatorics",
        "Discrete Mathematics",
        "Computer Science Research",
        "Theoretical Computer Science",
        "Permutations and Combinations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jo Suis Foutu",
                "href": "/profile/Jo-Suis-Foutu"
            },
            "answer_text": "This is a common problem for people learning mathematics, and it's even more of a problem with combinatorics because there are so many ad hoc methods used in the field.  It's possible to know how to solve a million problems in combinatorics and feel like it's the first day of class when you're looking at number 1,000,001. Part of the answer is that, like any skill, it takes experience and a lot of practice to get a feeling for which methods might apply to a particular problem in combinatorics.  You'll have to keep doing problems from the book using the methods in the particular section, and at some point you'll start to find that you'll have ideas of which methods might be effective independent of the book. My other suggestion has to do with the way you study.  You talk about it, but in my experience, a lot of people who are learning mathematics from a textbook use a procedure something like this to do exercises: (1) Find a worked example in the section that's kind of like the exercise.  (2) Go back and forth between the exercise and the worked example until they get an answer.  (3) Check in the back of the book to see if it's right.  (4) If it's right, stop.  (5) If it's not right go back to step (1). The trouble with this method is that it's possible to get the right answer by transforming steps from the worked exercise without ever really internalizing the reasons that those steps are effective.  This leaves students with the feeling of having accomplished something (the right answer!!) but without actually having learned anything from the experience.   The worked examples function like training wheels on a bike.  At some point with bikes, though, it's necessary to remove them and then fall down a lot.  In order to avoid this pitfall, I recommend that you treat the worked examples like exercises for you to do.  Cover up the work with a piece of paper.  Try to solve the problem.  If after an honest effort you can't think of what to do, slide the paper down a little bit and read the first sentence of the solution.  Treat it as a hint and keep trying.  Repeat as often as necessary. You also don't say whether you're in school or not.  If you are I recommend that you find some people to discuss problems with, your teacher if you have one, or other people who are interested in the same material.  Mathematics is a very social activity.  Also, you might get some additional books.  Rosen is a very comprehensive introductory text, but it's also very dry and confusing in places.  Most discrete math books at that introductory level have the same material in them, and having a few others at hand to see how different authors explain things can be useful.  You can usually pick up old editions quite cheaply on amazon. It's a fact about learning mathematics that you have to struggle with problems, not just understand how solutions that other people have done work.  My analogy with bike riding is pretty accurate in that way.  Don't feel bad if you're having trouble, though.  Despite all the bad publicity she got for saying it, Barbie was right when she said that math is hard. ",
            "date": "Answered November 8, 2012",
            "views": "123",
            "upvotes": " View 58 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anurag Bishnoi",
                    "user_href": "/profile/Anurag-Bishnoi"
                },
                {
                    "user_id": "Lily",
                    "user_href": "/profile/Lily-873"
                },
                {
                    "user_id": "Sagar Chowdhury",
                    "user_href": "/profile/Sagar-Chowdhury-8"
                },
                {
                    "user_id": "Rianwiz Gitonga",
                    "user_href": "/profile/Rianwiz-Gitonga"
                },
                {
                    "user_id": "Felipe Peressim",
                    "user_href": "/profile/Felipe-Peressim"
                },
                {
                    "user_id": "Harry Wang",
                    "user_href": "/profile/Harry-Wang-150"
                },
                {
                    "user_id": "Sujal Motagi",
                    "user_href": "/profile/Sujal-Motagi"
                },
                {
                    "user_id": "Nils Dula",
                    "user_href": "/profile/Nils-Dula"
                },
                {
                    "user_id": "Meiven",
                    "user_href": "/profile/Meiven"
                },
                {
                    "user_id": "Sandeep Mehta",
                    "user_href": "/profile/Sandeep-Mehta-295"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anurag Bishnoi",
                "href": "/profile/Anurag-Bishnoi"
            },
            "answer_text": "Solving well defined, easily stated problems using ingenious arguments that don't involve much background in \"advanced\" mathematics is still a part of doing research in combinatorics. In fact combinatorial problems show up in many forms in other areas of mathematics too, but usually as a small part of a long argument after a lot of reduction (see this for example: Vipul Naik's answer to International Mathematical Olympiad (IMO): How relevant have you found your contest math experience to math study and research?). So, it can at times be helpful to have some training in solving olympiad type problems. But, you should know that research in combinatorics/discrete mathematics is much, much more than just solving such problems.  Firstly, a lot of the research in combinatorics today is done using tools and ideas from other areas of mathematics (and the demarcation between different areas of mathematics is quite fuzzy). For example, you need a good background in topology (both general and algebraic) to tackle problems in Topological combinatorics, and you need a good background in group theory, linear algebra, representation theory to get into Algebraic combinatorics. See the wikipedia entry on various other such subfields of Combinatorics.  Second, even if the research problems that you are attacking do not need a lot of background, they would need some mathematical maturity on your part which is what you are (ideally) trying to gain during your undergrad years. Learning algebra, analysis, topology, logic etc. are really helpful for that. Also, it's not always that clear what background in mathematics is required to attack a given problem.  So, I would strongly recommend that you build a strong background in the traditional areas of mathematics, while exposing yourself to different aspects of combinatorics (see this for some book recommendations: Anurag Bishnoi's answer to What are the best books about combinatorics?). You could also try taking up some additional projects in areas of combinatorics that excite you (since you mentioned it: Erdős–Ko–Rado Theorems: Algebraic Approaches), so that you can get some idea about what research is like in those areas. Spending too much time on olympiad style problem during your undergrad years could be a big hindrance to that. Of course, if you enjoy doing it then go ahead and pursue it as a hobby. But, in my opinion, your time would be better spent in doing other things that I have advised. ",
            "date": "Answered August 14, 2015",
            "views": "48",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anubhab Ghosal",
                    "user_href": "/profile/Anubhab-Ghosal"
                },
                {
                    "user_id": "Hansu Lee",
                    "user_href": "/profile/Hansu-Lee-1"
                },
                {
                    "user_id": "Piyush Varyani",
                    "user_href": "/profile/Piyush-Varyani"
                },
                {
                    "user_id": "Sanjoy Nath",
                    "user_href": "/profile/Sanjoy-Nath-10"
                },
                {
                    "user_id": "Rabeeb Ibrat",
                    "user_href": "/profile/Rabeeb-Ibrat"
                },
                {
                    "user_id": "Bramhatanu Banerjee",
                    "user_href": "/profile/Bramhatanu-Banerjee"
                },
                {
                    "user_id": "Leonardo Bianco",
                    "user_href": "/profile/Leonardo-Bianco"
                },
                {
                    "user_id": "Aanchal Gupta",
                    "user_href": "/profile/Aanchal-Gupta-2"
                },
                {
                    "user_id": "Bishwajeet Mahato",
                    "user_href": "/profile/Bishwajeet-Mahato"
                },
                {
                    "user_id": "Hamza Shaikh",
                    "user_href": "/profile/Hamza-Shaikh-3"
                }
            ]
        }
    ]
}