{
    "title": "I am an average student with 65% marks. What should I do to get 90%? - Quora",
    "tags": [
        "Academic Advice for Careers",
        "Students",
        "Academic and Educational Advice",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Ranger",
                "href": "/profile/William-Ranger-1"
            },
            "answer_text": "Study because you want to learn, and use this. Since every person is unique, each person needs to develop hiser personal life. That should be based on what is real, valid, no matter the time, place, circumstances. Once you are so founded, you can develop methods, explanations, perception suitable to your uniqueness, and compatible with the rest of the universe. This works for me. The more I have used it, the less frustrated I have become, and the more rewarding life has become. My ability to learn has also increased. Do all the standard information, and control techniques because they work for surface problems, and are often required for normal work-life functions.. Then, supercharge you achievements. Get rid of the anxieties, obstacles hidden in old memories, and twisting your perspective. Combine what everybody already knows in bits, and pieces into your most powerful tool. Affirm the essential relationships of life, and get underneath the limitations. Then dissolve them. Sounds great, right? How can you do that? Many people worked it on for a long time. Even though there were many avenues, and turns, the desire for a clear, commonly usable formulation persisted. One group got there. They used the knowledge extracted from vast experience, and deducted the limited, local, specific factors, and reduced it to six words. Nam Myoho Renge Kyo is the empirical cognitive science that has resulted from those efforts. It is utterly practical, realistic, and its use can help anyone who wants it, open the focus of the moment, or the entirety of the cosmos. The language is Japanese because that’s where the discoverer of the formula lived. Nam is the focus on what is. It also expresses the intention of equality. It is a verb. Myo is the unlimited we are all a part of. Ho is the specific. They are not separable. Renge is the aspect of causes, and effects. Those effects are local, specific, or mental, and reverberate forever. Kyo is the change, and persistence, we observe all around, and in our daily events. Since these are all true, simultaneously, inseparably, they must be taken as a package Infusing those realities into our lives by chanting the sentence engages the mind, hearing, voice, intention. It is a regular activity like breathing, eating, having a heartbeat. One shot is not enough because we humans are addicted to habits. I have always broken through my obstacles when I did this. Happiness was a faint hope, even when I had success, and money. It also works for millions of others around the globe. You can google, the “greatest secret human power, ” to get more perspectives. Or, got to William Who controls you? ",
            "date": "Updated August 9, 2018",
            "views": "2",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edwin Trinh",
                    "user_href": "/profile/Edwin-Trinh"
                },
                {
                    "user_id": "Tania Colesniuc",
                    "user_href": "/profile/Tania-Colesniuc"
                },
                {
                    "user_id": "Raymond Khalil",
                    "user_href": "/profile/Raymond-Khalil"
                },
                {
                    "user_id": "Sumit Kumar Gupta",
                    "user_href": "/profile/Sumit-Kumar-Gupta-24"
                }
            ]
        }
    ]
}