{
    "title": "I am so stressed about my studies that I cannot study. What should I do? - Quora",
    "tags": [
        "Stress (psychological)",
        "Studying Advice",
        "Health Advice",
        "Psychology of Everyday Life",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jean Cormier",
                "href": "/profile/Jean-Cormier-1"
            },
            "answer_text": "Drink some booze. but you have to know how to do it properly to keep your mind focus while calming down. My winning receipt: Rum mixed with some juice. I put around 3–4 ounces of rum per 20 ounces of juice. By mixing it with a lot of juice, you’ll stay hydrated and you’ll be more easily in control. Drink it slowly and regularly. If you feel that your stress is coming back, speed up your pace. On the other hand, if you feel a little too dizzy, slow down the pace. A 20oz glass usually takes me about 1h to drink. When it’s empty I usually wait 30min before going for the 2nd (and final) one. This however very well might be different for you depending on your resistance to alcohol. I’m simply writing it down as a reference point. This technique allows me to study for ~4h nonstop with a level of focus that I’ve not yet been able to achieve by any other means. Notes: Only use this technique if you’re an experienced drinker, since you need to be able to gauge your intoxication level.Friendly reminder that fruit juice is full of sugar…Do not drink wine, unless at a very very slow pace since it’s stronger and completely dehydrates you.Do not take liquor shots. That’s pretty much the worst thing you could do.Do not buy very cheap liquor. Your stomach will thank me later for that.If you don’t have any liquor, you can drink beer, the only thing is that beer gets warm pretty fast and a lukewarm beer tastes like piss.",
            "date": "Answered August 10, 2017",
            "views": "48",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fuvdg Vjdtkb",
                    "user_href": "/profile/Fuvdg-Vjdtkb"
                },
                {
                    "user_id": "Makenzie White",
                    "user_href": "/profile/Makenzie-White-4"
                },
                {
                    "user_id": "Manasa",
                    "user_href": "/profile/Manasa-177"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muneeb Ahmed",
                "href": "/profile/Muneeb-Ahmed-24"
            },
            "answer_text": "I'll give you a simple trick. It's easy and effective. Forget about your studies for 20 minutes. Now think in what field do you specialize, or which ladder you are climbing (Your strong point). Now, once you've figured that out, think yourself 10 years ahead, in my case, I'm a software engineer, so I would see myself working at Microsoft. Okay, now you've gone 10 years in the future and seen yourself as a doctor (if medical is your strong point). You know, you'll pass the medical exam, mainly because it’s your weapon of success, so you probably won't be that much stressed about that. Okay, medical is no problem for you, let's move on to the remaining subjects. Just make a goal in your mind, that you have to study whether you like it or not, just fill your brain as much as you can related to medical studies, you do so. After result: - Medical: - 85% Remaining subjects: - 55% You tell your parents that you're capable of Medical only, and that it’s your direction to becoming an eye specialist. You know your future, you know you need nothing except medical, you're no longer stressed.  ",
            "date": "Answered January 20, 2016",
            "views": "132",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prakash Sai",
                    "user_href": "/profile/Prakash-Sai-40"
                },
                {
                    "user_id": "Shweta Bhaledar",
                    "user_href": "/profile/Shweta-Bhaledar"
                },
                {
                    "user_id": "Jaswanth",
                    "user_href": "/profile/Jaswanth-54"
                },
                {
                    "user_id": "Soma Tarafder",
                    "user_href": "/profile/Soma-Tarafder-2"
                },
                {
                    "user_id": "Vasanthi Manoharan",
                    "user_href": "/profile/Vasanthi-Manoharan-2"
                },
                {
                    "user_id": "MyStarry",
                    "user_href": "/profile/MyStarry-1"
                },
                {
                    "user_id": "Manshi Sinha",
                    "user_href": "/profile/Manshi-Sinha-1"
                },
                {
                    "user_id": "Khadija Amir",
                    "user_href": "/profile/Khadija-Amir-4"
                },
                {
                    "user_id": "Rohan Swan",
                    "user_href": "/profile/Rohan-Swan-3"
                },
                {
                    "user_id": "Manuel Jaen",
                    "user_href": "/profile/Manuel-Jaen"
                }
            ]
        }
    ]
}