{
    "title": "I don't have a biology subject. How do I study for it for the IISER exam? - Quora",
    "tags": [
        "Indian Institute of Science Education and Research, Pune (IISER-P)",
        "Indian Institutes of Science Education and Research (IISERs)",
        "Exam and Test Advice",
        "Biology",
        "Exam and Test Preparation",
        "Studying",
        "Exams and Tests"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sai Kaarthik",
                "href": "/profile/Sai-Kaarthik-1"
            },
            "answer_text": "Even I didn't have biology… still I am in IISER today. PCM people with biology definitely have an advantage, but it doesn't mean that PCM people can't qualify for an IISER. If you have time, read some parts of bio that you feel the most interesting… or request some bio guy to advice you on important chaps of bio for IAT. If you are already not done with PCM, there is no point in worrying about biology. Give your best shot in these 3 subjects…. and you will make through.. See, usually people get their first preference if they have scored around 105–110/180 and the closing score is around 85+. Anything above 90 is a safe score if you don't prefer any iiser over the other (which one shouldn't since quality is the same). Even with pcm, the max you can score is 135/180… which is like more than sufficient. So try to be accurate, donot just go on guessing answers…. Be sure about your answers, don't panic… without bio, you'll have only 45 questions in 180 mins which makes the time per question twice as compared to jee mains. So you should focus on making your pcm perfect first…. . . Ofcourse I don't deny studying bio, anyway once you come to IISER, you'll have to study bio for 2 years (if not considering to major in bio). The same applies to non-math students. So aim to score atleast 90/180 and consider yourself safe. Good luck ",
            "date": "Answered August 19, 2020",
            "views": "168",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aman Gupta",
                    "user_href": "/profile/Aman-Gupta-2386"
                },
                {
                    "user_id": "Ankit Das",
                    "user_href": "/profile/Ankit-Das-43"
                },
                {
                    "user_id": "Shubhta Mathur",
                    "user_href": "/profile/Shubhta-Mathur"
                },
                {
                    "user_id": "Ritwik Sharma",
                    "user_href": "/profile/Ritwik-Sharma-79"
                }
            ]
        }
    ]
}