{
    "title": "I have scored 50% in class 12th, what should I do now? - Quora",
    "tags": [
        "Class 12th in India",
        "Academic and Educational Advice",
        "Exams and Tests"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tanmay Arora",
                "href": "/profile/Tanmay-Arora-76"
            },
            "answer_text": "First of all, congratulations on clearing the first major test of your life. The world, today, focuses on people getting 90%, but the fact is that there are many, many options available to you. You must ascertain what your interests are. If you are not academically inclined, you can take up Creative arts: professions like photography, culinary arts, modelling, designing, writing, and more - you can choose to join BA courses or short term onesSales & marketing: many companies are ready to hire fresh graduates to help create strategies and meet sales targets. You can pursue an MBA after three years of work experienceComputer design: courses like CAD, data entry and more can be pursued. These are not long-term coursesStart a business: Set up a home business, and when that grows, you can expand to a commercial area.Interest in academics: look for colleges that provide you with courses on engineering and other disciplines based on entrance tests. Many colleges do not take into account the class 12 scores if you do well in the entrance tests. Some accept even 45%.Look for online courses and short internships that will give you an edge when you sit for interviews. These small courses can help you augment your qualifications and help you regain confidence. Choose the ones that manifest your interests in the best way. Relevant short courses add strength to your CV. Look forward, and do your best! You can crack colleges that are good and suit your style of study. There are many academically accomplished students out there who fail miserably when trying to set up their careers. Always remember, it’s just an exam, you can focus on what next rather than think of what is not in your hands. ",
            "date": "Answered November 29, 2019",
            "views": "36",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Siddhant Shrivastav",
                    "user_href": "/profile/Siddhant-Shrivastav-16"
                },
                {
                    "user_id": "Chetan Budhabaware",
                    "user_href": "/profile/Chetan-Budhabaware"
                },
                {
                    "user_id": "Bharat Kumar",
                    "user_href": "/profile/Bharat-Kumar-3040"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sudipa Hore",
                "href": "/profile/Sudipa-Hore"
            },
            "answer_text": "First thing, board results don’t matter much in the long run. If you had specified your stream then it would have been easy for me to guide you. If you’re from science stream and have mathematics, then there are a lot engineering colleges out there in which the cut off marks are like 45%. If you have given entrance exams then you’re eligible for many engineering colleges as only your rank matters and not your board percentage. Apply for honours college as well as you have a little chance of getting honours or you can also try for general. Now whatever has happened it has happened. I can totally understand what you’re going through because last year when my board results came out, I didn’t get good marks in mathematics and I was so frustrated. Now just forget whatever has happened and take a lesson from the past. Focus on the future. Work hard when you get into a college. Prove everyone wrong. Trust me marks don’t matter in the end and I know that you won’t be convinced with this now but later you’ll understand. Just don’t give up. Always remember one thing, “Tough times don’t last, tough people do.” ",
            "date": "Answered May 26, 2018",
            "views": "41",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sidharth",
                    "user_href": "/profile/Sidharth-209"
                },
                {
                    "user_id": "Pratyush Raut",
                    "user_href": "/profile/Pratyush-Raut-1"
                },
                {
                    "user_id": "Yash Chandan",
                    "user_href": "/profile/Yash-Chandan-11"
                },
                {
                    "user_id": "Noushaba Rais",
                    "user_href": "/profile/Noushaba-Rais"
                },
                {
                    "user_id": "Dhena Marandi",
                    "user_href": "/profile/Dhena-Marandi"
                },
                {
                    "user_id": "Surya Singh",
                    "user_href": "/profile/Surya-Singh-513"
                },
                {
                    "user_id": "Shubham Gole",
                    "user_href": "/profile/Shubham-Gole-15"
                },
                {
                    "user_id": "Mayur Patti",
                    "user_href": "/profile/Mayur-Patti"
                },
                {
                    "user_id": "Mihir Yadav",
                    "user_href": "/profile/Mihir-Yadav-18"
                },
                {
                    "user_id": "Manik Thappa",
                    "user_href": "/profile/Manik-Thappa-2"
                }
            ]
        }
    ]
}