{
    "title": "I have heard that almost 50 to 60% of the students in LPU get a scholarship, is it true? - Quora",
    "tags": [
        "Lovely Professional University- LPU",
        "College and University Scholarship and Fellowships",
        "Scholarships and Fellowships"
    ],
    "response": [
        {
            "author_info": {
                "name": "Suhithkomal Chowdary",
                "href": "/profile/Suhithkomal-Chowdary"
            },
            "answer_text": "Yes , Many students get scholarship in LPU according to their +2 Percentages and their Score in LPU-NEST exam..It also provides scholarships to the toppers of the corresponding years in University Scholarship 1 Every year, roughly 50-60 per cent of the students receive scholarships from LPU thereby bringing down their course fees by 70-75%. Scholarship 2 University offers scholarship on the basis of performance in LPUNEST is available for all programms of the university except Diploma in Elementary Education (D.El.Ed.)Scholarship bracket for Hons/ Integrated/ Professional programme will be same as corresponding regular programme.Scholarship for a specific programme depends on performance in LPUNEST. There are four brackets:Marks >= 90% in LPUNESTTop 10% students in LPUNESTNext 10% (11% to 20%) students in LPUNESTNext 15% (21% to 35%) students in LPUNEST Program having fee : INR 84,500/- or moreMarks>= 90% in LPUNEST : INR 75,000/-Top 10% students in LPUNEST : INR 50,000/-Next 10% (11% to 20%) students in LPUNEST : INR 40,000/-Next 15% (21% to 35%) students in LPUNEST : INR 30,000/- Program having fee : INR 79,500/- and INR 69,500/-Marks>= 90% in LPUNEST : INR 60,000/-Top 10% students in LPUNEST : INR 40,000/-Next 10% (11% to 20%) students in LPUNEST : INR 30,000/-Next 15% (21% to 35%) students in LPUNEST : INR 20,000/- Program having fee : INR 59,500/-Marks>= 90% in LPUNEST : INR 40,000/-Top 10% students in LPUNEST : INR 30,000/-Next 10% (11% to 20%) students in LPUNEST : INR 20,000/-Next 15% (21% to 35%) students in LPUNEST : INR 15,000/- Program having fee : INR 49500, 44500, 39500, 34500Marks>= 90% in LPUNEST : INR 25,000/-Top 10% students in LPUNEST : INR 20,000/-Next 10% (11% to 20%) students in LPUNEST : INR 15,000/-Next 15% (21% to 35%) students in LPUNEST : INR 10,000/- Program having fee : INR 29,500/- and INR 26,500/-Marks>= 90% in LPUNEST : INR 20,000/-Top 10% students in LPUNEST : INR 10,000/-Next 10% (11% to 20%) students in LPUNEST : INR 10,000/-Next 15% (21% to 35%) students in LPUNEST : INR 5,000/- Scholarship 3 Fee Concession for Defence, CAPF and their dependants:Offers fee concession to Indian Army, Indian Navy, Indian Air Force, Coast Guard, Central Reserve Police Force, Border Security force, Indo-Tibetan Border Police, Sashastra Seema Bal, Central Industrial Security Force, Railway Protection Force, National Security Guards, Special Frontier Force, Assam Riffles, Border Road Organization, General Reserve Engineer Force, Defence Research and Development Organization, Military Engineers Service and Defence Security Corps. Eligibility: A relaxation of 5% in eligibility will be given for all categories and programs (Diploma, Programs after 10+2, Programs after Graduation etc.) except for programs where certain regulatory bodies have imposed minimum eligibility conditions.Fee concession – The fee concession as mentioned above is for the full normal duration of the Programs i.e. applicant will continue to get concession for all the semesters, subject to the ‘Terms & Conditions for LPU- Scholarship, its different phases and EDB ’. Category - A and BClassification - Recipients of Gallantry awards-Param Vir Chakra, Ashok Chakra, Mahavir Chakra, Kirti Chakra, Veer Chakra & Shaurya Chakra, President’s Tatrakshak Medal and Tatrakshak Medal, President’s Police medal for Gallantry, President’s Police Medal for Meritorious Service, President’s Police Medal for Distinguish Service, President’s Police medal and Killed in action, disabled in action & boarded outApplicability - (A) Applicability and (B) DependentsScholarship - (A) 50% Tuition Fee Waiverand (B) 30% Tuition Fee Waiver Category - CClassification - Serving Officers - nominated through study leaveApplicability - SelfScholarship - 30% Tuition Fee Waiver Category - DClassification - Serving personnel/ *Deceased personnel/ ex-servicemen/ retired personnel (from all defence forces mentioned above)Applicability - Self & DependentsScholarship - 20% Tuition Fee Waiver*Applicable for dependents only Scholarship 4 For Person's with Disabilities:LPU offers a special scholarship scheme of full programme fee waiver to the Persons with Disability in the programmes. The scholarship will be given to a maximum of 20 students on first come basis.Scholarship scheme of full programme fee waiver under this scholarship will be applicable to Indian applicants only.Student has to pay for all the residential facilities availed by him/her i.e stay, food, laundry etc. food and laundry charges for the attendant also. However the attendant may be allowed to stay in the same hostel room without paying additionally for residential fees (No extra bedding will be permitted in room but floor bedding is permissible in room for attendant). For availing this scholarship, the student needs to submit a medical proof from competent medical authority Scholarship 5 For Orphan Applicants:LPU offers a special scholarship scheme of full programme fee waiver in the programmes. The scholarship will be given to a maximum of 10 students on first come first serve basis subject to maximum of two candidates from one orphanage / organization.For availing scholarship under this policy student need to submit following documentsDeath certificate of both the parentsIncome certificate (Guardian/Self-if employed)The candidate is not legally adopted by any individual or couple. In case of abandoned child or death certificate not available, the candidate need to submit a certificate from Government approved orphanage or any other government authority regarding the same. Scholarship 6 Scholarship on the basis of Performance in Sports, Cultural, R & D, Co-curricular, Social Service, Bravery Awards: International Sports Championship:If S-A11: Represented India after approval of National sports Federation and SAI/ IOA in championship scheduled as part of the Annual International Sports Calendar.S-A12: Participated as a member of combined university team at International Level then Category I: 'A' Gradea) Full Programme Fee waiverb) Free Stay in Dormitory Residence (without attached washroom)c) Free Meal Plan (Standard Meal) If S-B12:Represented India after approval of National sports Federation and SAI/IOA in championship not scheduled as part of the Annual International Sports Calendar then 'B' Gradea) Scholarship on programme Fee equivalent to amount awarded to Student scoring >=90% in elig. Qualificationb) Free Stay in Dormitory Residence (without attached washroom)c) Free Meal Plan (Standard Meal) 'C' Gradea) Scholarship on programme fee equivalent to amount awarded to Student scoring 80% - 89.99% in elig. qualification 'D' Gradea) Scholarship on programme fee equivalent to amount awarded to Student scoring 70% - 79.99% in eligibility qualification Scholarship 7 National Sports championship/ Inter University Sports Competition:If S-A21:First three position in Senior National championship then 'A' Gradea) Full Programme Fee waiverb) Free Stay in Dormitory Residence (without attached washroom)c) Free Meal Plan (Standard Meal) If First three position in(S-B21 to S-B25) S-B21:All India University championshipS-B22:All India Rural sports TournamentS-B23:National Women sports Festival.S-B24:National championship conducted by recognized National Sports Fedrations.S-B25:First three position in National School Games conducted by SGFI, then 'B' Gradea) Scholarship on programme Fee equivalent to amount awarded to Student scoring >=90% in eligibility qualificationb) Free Stay in Dormitory Residence (without attached washroom)c) Free Meal Plan (Standard Meal) If First three position in(S-C21 to S-C22) S-C21:University Zonal meet.S-C22:Zonal meet conducted by recognized National Sports Fedrations, then 'C' Gradea) Scholarship on programme fee equivalent to amount awarded to student scoring 80% - 89.99% in eligibility qualification If S-D21:Participated twice in Senior National ChampionshipORParticiptaed twice in campionships mentioned in S-B21 to S-B25 in the same gameS-D22:First three position in Senior State championship then 'D' Gradea) Scholarship on Programme Fee equivalent to amount awarded to Student scoring 70% - 79.99% in eligibility Qualification Scholarship 8 State Sports Championship: 'A' Gradea) Full Programme Fee waiverb) Free Stay in Dormitory Residence (without attached washroom)c) Free Meal Plan (Standard Meal) 'B' Gradea) Scholarship on Programme Fee equivalent to amount awarded to Student scoring >=90% in elig. Qualificationb) Free Stay in Dormitory Residence (without attached washroom)c) Free Meal Plan (Standard Meal) 'C' Gradea) Scholarship on Programme Fee equivalent to amount awarded to Student scoring 80% - 89.99% in elig. Qualification 'D' Gradea) Scholarship on Programme Fee equivalent to amount awarded to Student scoring 70% - 79.99% in eligibility Qualification School Boards Tournaments:'A' Gradea) Full Programme Fee waiverb) Free Stay in Dormitory Residence (without attached washroom)c) Free Meal Plan (Standard Meal) 'B' Gradea) Scholarship on Programme Fee equivalent to amount awarded to Student scoring >=90% in elig. Qualificationb) Free Stay in Dormitory Residence (without attached washroom)c) Free Meal Plan (Standard Meal) 'C' Gradea) Scholarship on Programme Fee equivalent to amount awarded to Student scoring 80% - 89.99% in elig. Qualification 'D' Gradea) Scholarship on Programme Fee equivalent to amount awarded to Student scoring 70% - 79.99% in eligibility Qualification Scholarship 9 TABS - Trial / Audition Based Scholarship:'A' Gradea) Full Programme Fee waiverb) Free Stay in Dormitory Residence (without attached washroom)c) Free Meal Plan (Standard Meal) 'B' Gradea) Scholarship on Programme Fee equivalent to amount awarded to Student scoring >=90% in elig. Qualificationb) Free Stay in Dormitory Residence (without attached washroom)c) Free Meal Plan (Standard Meal) 'C' Gradea) Scholarship on Programme Fee equivalent to amount awarded to Student scoring 80% - 89.99% in elig. Qualification If S-E41 (Selected Students based on Trials conducted by LPU), then, 'D' Gradea) Scholarship on Programme Fee equivalent to amount awarded to Student scoring 70% - 79.99% in eligibility Qualification Sports Scholarship is not applicable for Programmes after 10th. Scholarship 10 LPU offers scholarship for various programmes on the basis of performance/ rank in the following national level entrance tests like NEETNATACATXATMATGATEGPATCLATLSAT Scholarship 11 For Toppers of Education Board:University offers special scholarship scheme of full tuition fee waiver to top 20 students of every recognized school board (State, Central, and Open Board provided minimum 1000 students should have appeared in the said exam). The scholarship scheme is as below:Full Tuition Fee waiver, andFree Stay in four seater room (Air Cooled Room) in Residential FacilityOrFree Transport Facility. Source:-SHISKHA ",
            "date": "Answered March 28, 2020",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nitesh Saini",
                "href": "/profile/Nitesh-Saini-66"
            },
            "answer_text": "Lovely Professional University strongly believes in the fact that monetary constraints should not be an obstacle for a student to have access to quality education. So, the University extends Scholarship Scheme to students on various parameters. Scholarship can be availed in all the Programmes of the University, ranging from Diploma to Ph.D. Students have been awarded with scholarship worth Rs. 100+ crores in last year only. Scholarship Categories: Scholarships are awarded to candidates based on their performance on any of the following categories: Eligibility Qualification: (for example 10+2 for Under graduate Programmes and graduation for PG Programmes)LPUNEST: (LPU National Entrance & Scholarship Test)Certain National Level Tests (like JEE (Main), NEET, UCEED, CAT, MAT, GATE, GPAT etc.)Performance in Sports, Cultural, R&D, Co-curricular, Social Service and Bravery AwardsSpecial Scholarships and/or Fee ConcessionsFor Ph.D. Applicants (Scholarship phases as mentioned below are not applicable)Defence and Central Armed Police Forces (CAPF) personnel and their dependantsToppers of Education BoardScholarship for Orphan ApplicantsScholarship for Person with Certain DisabilityScholarship Brackets: For each category mentioned above, three brackets of Scholarship (Bracket 1, 2 and 3) are defined. Each bracket represents specific criteria (for example scores in qualifying exam) which an applicant has to reach for him/her to fall in that particular bracket. The criteria in each bracket decreases as it proceeds and so does the scholarships. So, the students meeting the requirement of Bracket- 1 gets the highest Scholarship and those in Bracket - 2 or 3 gets relatively lesser scholarship. Scholarship Phases: The amount of Scholarship also depends on the Phase in which the candidate takes Admission in the University. Admissions in LPU is done in different Phases, which are bifurcations of the Admission time period. Phase I starts as early as January and continues till the end of April. The subsequent phases (Phase II, III, IV) are conducted only if the seats in the concerned Programme remain vacant. The amount of Scholarship reduces with each passing phase. ",
            "date": "Answered March 29, 2020",
            "views": "127",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amandeep",
                    "user_href": "/profile/Amandeep-87"
                },
                {
                    "user_id": "Lakshmi Mounica",
                    "user_href": "/profile/Lakshmi-Mounica-18"
                },
                {
                    "user_id": "Nikhil Sharma",
                    "user_href": "/profile/Nikhil-Sharma-4102"
                }
            ]
        }
    ]
}