{
    "title": "I haven’t started studying yet. I’m in 12th grade with biology, physics, chemistry, and maths. It’s already November. I am clueless as of where to start or how. What should I do? - Quora",
    "tags": [
        "Chemistry and Biology",
        "Physics and Chemistry",
        "Studying Advice",
        "Academic and Educational Advice",
        "Biology",
        "Studying",
        "Chemistry",
        "Physics",
        "Education",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pooja Chaturvedi",
                "href": "/profile/Pooja-Chaturvedi-116"
            },
            "answer_text": "Firstly relax you still have time and secondly make a resolution to be best from today only few suggested tips are : Mathematics : solve NCERT and NCERT EXEMPLAR along with PYQ..the more you practice the better you get here Biology : be through with NCERT do diagram based study and solve PYQ as questions are often repeated Chemistry: Do only NCERT especially in organic and inorganic you will get exactly same question don't leave even a single question even if you want to skip PYQ in thi ssubject you can skip but please don't skip NCERT at any cost make roadmaps in organic also practice by making flashcards .name reactions are important. Physics : Do concept based study ,read NCERT multiple times and solve PYQ multiple times don't skip making formula sheet of every chapter side by side so that you can revise that on the exam.day well All the best👍 That's it Stay home stay safe 🙂🙂 ",
            "date": "Answered October 25, 2020",
            "views": "88",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Thehzin Omer",
                    "user_href": "/profile/Thehzin-Omer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Somya Prusty",
                "href": "/profile/Somya-Prusty"
            },
            "answer_text": "Then, who is stopping you from studying? Noone is going to help you if you are unable to help yourself. Just consider doing the followings, Ditch everything you are doing right now( including asking questions to random strangers on Quora) and make a study schedule.Take help from your teachers.Don't estimate anything and don't compare yourself with anything.Limit the usage of internet.Get into study mode.",
            "date": "Answered October 25, 2020",
            "views": "142",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Chhandacharan Meher`",
                    "user_href": "/profile/Chhandacharan-Meher"
                }
            ]
        },
        {
            "author_info": {
                "name": "Indranil Dutta",
                "href": "/profile/Indranil-Dutta-88"
            },
            "answer_text": "Relax, dear. This may sound strange to u-that I am telling u to relax when u have so less time. But this is what can really help u. It's when u are relaxed that your brain functions well. Observe it and u can realize that. When your brain works well,u can study well. Meditation is the ultimate relaxation. If u meditate for just a few minutes daily, u can study a lot in less time. Yes. Do it and see. I recommend that u attend the Online meditation and breath workshop(Happiness program) of Art of Living as soon as u can. I also recommend regularly practicing the guided meditations by Sri Sri Ravi Shankar in YouTube. ",
            "date": "Answered October 24, 2020",
            "views": "34",
            "upvotes": " Answer requested by Thehzin Omer"
        },
        {
            "author_info": {
                "name": "Dakshaini Gupta",
                "href": "/profile/Dakshaini-Gupta"
            },
            "answer_text": "Hi. Don't worry, you can still get a decent score. I'm a 12th passout so I thought I should help. I would say!! Start from NCERTS. As cliche as it may sound, but these are bibles for boards. Doing these are very important, what you do ahead of them is your choice. NCERT for chem is more than enough for boards. In chemistry, do ALL the back exercise questions atleast thrice before boards..you've ample of time. Do not miss out on past year board papers and sample papers..they help a lot more than one thinks. And start right away! Don't get stressed, you'll get through with a good score. goodluck! ",
            "date": "Answered October 24, 2020",
            "views": "78",
            "upvotes": "0"
        }
    ]
}