{
    "title": "I have no prior CS experience. Should I still major in computer science in college? - Quora",
    "tags": [
        "Computer Science Education Advice",
        "Computer Science Education",
        "Academic and Educational Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rustin Bergren",
                "href": "/profile/Rustin-Bergren"
            },
            "answer_text": "Yes! How much experience do you think a high school senior has in economics, actuarial science, marketing or business? Probably none. That's why you're going to the college! To learn dat shit! Let the University tell you if you have the necessary prerequisites to start the course of study, they know better than anybody what you need to be successful in their program. What prior CS experience gives you is the knowledge of whether or not you like the topic. You'll figure that out pretty quick in your first year and if you don't like it, chances are you can easily pivot into something else with little, or any, sacrifice of time. If you like making really stupid things do exactly what you tell them to, you'll probably like it. An appreciation of math (read: not talent, just appreciation) won't hurt either. ",
            "date": "Answered May 4, 2015",
            "views": "32",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angela Ling",
                    "user_href": "/profile/Angela-Ling-16"
                },
                {
                    "user_id": "Hagiel Pratenta",
                    "user_href": "/profile/Hagiel-Pratenta"
                },
                {
                    "user_id": "Natalie Rowland",
                    "user_href": "/profile/Natalie-Rowland-7"
                },
                {
                    "user_id": "Dinelle Grant",
                    "user_href": "/profile/Dinelle-Grant-1"
                },
                {
                    "user_id": "Kale Hyder",
                    "user_href": "/profile/Kale-Hyder-1"
                },
                {
                    "user_id": "Nguyen Tung Lam",
                    "user_href": "/profile/Nguyen-Tung-Lam-4"
                },
                {
                    "user_id": "Sah",
                    "user_href": "/profile/Sah-20"
                },
                {
                    "user_id": "Matthew Berkin",
                    "user_href": "/profile/Matthew-Berkin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vinayak Mathur",
                "href": "/profile/Vinayak-Mathur-3"
            },
            "answer_text": "Prior experience doesn't matter! I would recommend you take some time and read up about CS and then decide if you are really interested in pursuing it. Are you good at problem solving? Do you like math? Do you like solving puzzles? Do you want to be able to build something that has the potential to change the lives of millions across the globe, on your laptop? Some of these questions can help you decide.  Prior experience is obviously not a prerequisite. As with any other field you will need hard work and dedication to succeed. To give you some inspiration CS50 is the introductory computer science course at Harvard and more than 70% of the students that take that course each year have never written a single line of code! You can do it too!  cheers! ",
            "date": "Answered May 4, 2015",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kale Hyder",
                    "user_href": "/profile/Kale-Hyder-1"
                },
                {
                    "user_id": "Rustin Bergren",
                    "user_href": "/profile/Rustin-Bergren"
                }
            ]
        }
    ]
}