{
    "title": "I want to master maths for bank PO exams. How do I make it possible? - Quora",
    "tags": [
        "Bank Probationary Officers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gopal Anand",
                "href": "/profile/Gopal-Anand-11"
            },
            "answer_text": "Hello, Strategy and Approach: Concentrate on four main topics first. Simplification\\Approximation: Questions from this topic are quite simple and can be solved easily with the right approach. These questions are mostly calculative and if your calculation is strong you can crack this section very well. In fact, this calculation helps you on various other topics. Number series: These questions are bit tricky but if you have practiced a good number of questions on this topic then you can solve these questions in less time.solving maximum questions on this topic Data interpretation: Mostly, you have two questions on DI based on bar graphs or pie charts or tabular etc. mostly, three questions from the 5 questions of DI are easy to solve and can be handled easily. Sometimes, they can get bit calculative and for that, you must learn tables to speed up your calculations. Quadratic equations\\Inequalities: Questions asked on this topic are not very difficult. And if you know the concepts then you can solve these questions easily. Next comes the scoring chapters. Average, Percentages, Profit and Loss, Interest, Ratio and Proportion. These chapters are mostly formula based and can be solved if you have practiced them properly. Practice these questions daily and try to solve them with complete accuracy. Sometimes questions in DI are also based on these topics so do not skip any of these as they are very important. Now, a question arises that can we skip arithmetic word problems to achieve sufficient marks to clear the cutoff? The answer to this question is NO. These days arithmetic word problems have become a major part of bank exams. There are some tricky questions from certain topics. Those topics are Permutations & Combinations, Probability, Time, Speed & Distance (including Boat & Stream) Algebra, Time & Work (including Pipes & Cisterns) – Mensuration & Geometry, Mixtures & Allegations. But it is not necessary to cover them all because one cannot solve all the word problems in the exam. Its not about being jack of all trades, but master of none. You must choose the topics you are good at and then go for attempting those questions. You must practice these topics well and Practice daily with good accuracy. For this section, speed and accuracy is a must. You should learn tables at least up to 30 and squares of numbers till 50 and cubes till 20. After clearing all basic concepts from all chapters, start with the test series. you can also practice from our test series as it will make you aware of the pattern and the type of questions asked in various exams. You will analyze your strong and weak points and then you can work upon them to increase your potential. So start practicing from now and get your seat in the government job. ",
            "date": "Answered July 31, 2019",
            "views": "53",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shaistha Banu",
                    "user_href": "/profile/Shaistha-Banu-1"
                },
                {
                    "user_id": "Rupali Chandra",
                    "user_href": "/profile/Rupali-Chandra-4"
                },
                {
                    "user_id": "Ronaldo Raj Minz",
                    "user_href": "/profile/Ronaldo-Raj-Minz"
                },
                {
                    "user_id": "Anushka Singh",
                    "user_href": "/profile/Anushka-Singh-1052"
                },
                {
                    "user_id": "Himanshu Rajpal",
                    "user_href": "/profile/Himanshu-Rajpal-6"
                },
                {
                    "user_id": "Arsh Deep",
                    "user_href": "/profile/Arsh-Deep-243"
                },
                {
                    "user_id": "Juthada Yoksha Neelima",
                    "user_href": "/profile/Juthada-Yoksha-Neelima"
                },
                {
                    "user_id": "Kavita Pareek",
                    "user_href": "/profile/Kavita-Pareek-39"
                },
                {
                    "user_id": "Rajat Kumar",
                    "user_href": "/profile/Rajat-Kumar-601"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/DHANANJAY-SAHU-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikhil Deshpande",
                "href": "/profile/Nikhil-Deshpande-63"
            },
            "answer_text": "It's a tricky question to answer. Because I have myself never figured out how to master maths for bank po exams. But presuming you are a commerce or arts graduate (If from engg background, you are already better than me in quants) I would suggest you few things. Focus primarily on data interpretation and simplification.By heart tables, squares and cubes so that your speed increases.Don't expect your self to be able to solve too many of miscellaneous questions ( by miscellaneous I mean, time and work, distance, speed, allegations etc). In Data interpretation and simplification there is some certainity regarding getting the final answer.Last and most important thing. Don't try to make maths your strong because it wont work. Focus on gk that's our strength plus English too.This answer is purely based on my experience as a average commerce guy in bank exams. Hope it helps.",
            "date": "Answered August 13, 2018",
            "views": "126",
            "upvotes": " View 72 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Preeti",
                    "user_href": "/profile/Preeti-687"
                },
                {
                    "user_id": "Rupali Chandra",
                    "user_href": "/profile/Rupali-Chandra-4"
                },
                {
                    "user_id": "Ronaldo Raj Minz",
                    "user_href": "/profile/Ronaldo-Raj-Minz"
                },
                {
                    "user_id": "Anushka Singh",
                    "user_href": "/profile/Anushka-Singh-1052"
                },
                {
                    "user_id": "Umesh Padhan",
                    "user_href": "/profile/Umesh-Padhan-4"
                },
                {
                    "user_id": "Next Door Brown Girl",
                    "user_href": "/profile/Next-Door-Brown-Girl"
                },
                {
                    "user_id": "Anjana Bharti",
                    "user_href": "/profile/Anjana-Bharti-5"
                },
                {
                    "user_id": "Prasad Nijwante",
                    "user_href": "/profile/Prasad-Nijwante-1"
                },
                {
                    "user_id": "Himanshu Rajpal",
                    "user_href": "/profile/Himanshu-Rajpal-6"
                },
                {
                    "user_id": "Tanish Khatri",
                    "user_href": "/profile/Tanish-Khatri-1"
                }
            ]
        }
    ]
}