{
    "title": "I want to study, but I waste my whole day without doing anything significant, and am unable to concentrate. What should I do? - Quora",
    "tags": [
        "Study Habits",
        "Focusing and Concentrating",
        "Studying Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Akshay Jain",
                "href": "/profile/Akshay-Jain-626"
            },
            "answer_text": "Let us first understand the Stanford Marshmallow Experiment: The experiment began by bringing each child into a private room, and placing a marshmallow on the table in front of them. At this point, the researcher offered a deal to the child. The researcher told the child that he was going to leave and that if the child did not eat the marshmallow, then they would be rewarded with a second marshmallow. However, if the child decided to eat the first one before the researcher came back, then they would not get a second marshmallow. So the choice was simple: one treat right now or two treats later. The researcher left the room for 15 minutes. As you can imagine, the footage of the children waiting alone in the room was rather entertaining. Some kids jumped up and ate the first marshmallow as soon as the researcher closed the door. Others wiggled and bounced and scooted in their chairs as they tried to restrain themselves, but eventually gave in to temptation a few minutes later. And finally, a few of the children did manage to wait the entire time. As the years rolled on and the children grew up, the researchers conducted follow up studies. The children who were willing to delay gratification and waited to receive the second marshmallow ended up having higher SAT scores, lower levels of substance abuse, lower likelihood of obesity, better responses to stress, better social skills as reported by their parents, and generally better scores in a range of other life measures.  The difficulty lies in when you have to make a decision between what’s immediately gratifying versus something that provides a better gratification in the future if you put in extra efforts. So, we while our times doing immediately gratifying things because it releases dopamine (ah the good old dope), but contrary to popular beliefs dopamine is more about the reward anticipation rather than the actual rewards (the journey better than the destination, anyone). Dopamine is what gets us to take an action towards a goal, and if your goals will be immensely gratifying than the futile things that provide a little dope hit, you’ll be wired to work towards your goals.  Here’s some simple things that you can do to train yourself to delay gratification: Take baby steps towards tour goals. Beginner steps that you won’t be able to say no to.Like a couple of pages of a book, a 5 minute jog. These help you be consistent, the most important thing while forming a hobby.Improve on the steps a little bit more everyday.An additional page than yesterday, a 7 minute jog. Move at a pace you feel comfortable. This Aggregation of Marginal Gains propel you to become a better you. Never underestimate the importance of these single steps, you cannot make an earth shattering effort in your first attempt. Be consistent in your endeavours. Consistent action towards your goals will accumulate all the marginal improvements under your belt. “Not breaking the chain is of utmost importance”.BEGIN. Wonders await you on the other side, a better version of yourself, only and only if begin and take action.Take out your book start reading a word, a line, a page, a paragraph and watch the effects snowball.Footnotes: The Marshmallow Experiment and the Power of Delayed Gratification ",
            "date": "Answered May 17, 2020",
            "views": "14",
            "upvotes": " View 181 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Johnathan Schwartz",
                    "user_href": "/profile/Johnathan-Schwartz-3"
                },
                {
                    "user_id": "Bofa Blanket",
                    "user_href": "/profile/Bofa-Blanket"
                },
                {
                    "user_id": "Lakshmi S",
                    "user_href": "/profile/Lakshmi-S-618"
                },
                {
                    "user_id": "Daksh",
                    "user_href": "/profile/Daksh-129"
                },
                {
                    "user_id": "Sneha.S Achar",
                    "user_href": "/profile/Sneha-S-Achar"
                },
                {
                    "user_id": "Juveria Siddiqui",
                    "user_href": "/profile/Juveria-Siddiqui-2"
                },
                {
                    "user_id": "Sachin Jha",
                    "user_href": "/profile/Sachin-Jha-299"
                },
                {
                    "user_id": "Trkle Huynh",
                    "user_href": "/profile/Trkle-Huynh-2"
                },
                {
                    "user_id": "Ronit Kumar Singh",
                    "user_href": "/profile/Ronit-Kumar-Singh-7"
                },
                {
                    "user_id": "Aditya Jha",
                    "user_href": "/profile/Aditya-Jha-422"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikunj Dudani",
                "href": "/profile/Nikunj-Dudani"
            },
            "answer_text": "I have studied... a lot.. I have studied in night, in the morning, basically anytime needed. I have studied 2 days before exams and 2 mins before exams! I sometime wake up at 11 AM, sometimes at 8 AM. I have stayed up whole night, and once for straight 36 hrs. I have studied 2 hrs for an exam and 2 months for an admission test. As an effect, I have a balanced sample space to answer this question. Bottom Line: There is no way of studying. Discussing a \"way\" or a \"rule\" to study is fruitless. These ways deal with the stem, you need to reach and address the root.. YOUR BRAIN. The key is to put you brain to it, to have your brain in control. You can do that by: Not thinking that you NEED to do anything. You do not. Why do you really want to study, why not play, why not listen to music, why not dance. That is the first problem, you do not need to study, as just studying is not the key to life. You need to do nothing. Want to go dancing, go... Go play, go out with friends. The trick: Tell yourself, announce to yourself that you enjoyed other activities. Tell yourself that you took that time off and that you are happy about it because that is equally important. Do not be shy! Be proud that you are living. This will help you not feeling guilt or pressure and will keep your happiness level high. And you will need that to study. The idea is not to place all your eggs in one basket of \"studies\". Mix it around, live a balanced life and do not stress yourself. I have sometimes stayed in Drama or Music club of my university upto 1 AM before heading to study for the next day test. You just need to be comfortable.Building a brain access: Do not get me wrong! I am not trying to play Sherlock Homes here. Not talking about a brain palace, have never been able to visualize it. But I have built access to my brain. A pathway that can be used to reference and improve memory. One trick is to listen to music when you study. Now do not jump that then you just listen to music and not study. Fair enough! Work around: Listen to music not even remotely related to your language, and preferably with pronounced beats. A melodic track is not the best option. Music with defined and repeated beats and with unfamiliar language is the key. No lyrics is also ok, but lyrics work better. The beats help you learn and your mind syncs to the beats and information is then more likely to stay in your brain.Building brain access 2: Write a line of the topics on a paper. Just the topics. So like if I start reading chapter 5, just write chapter 5, and as you study, write the topics, like 5.1, 5.2 , 5.2.1... with indentation and the topic heading. Indentation is good as it makes it clear and pictorial. Also, finishing it in minimal space is advised, and a second page is a big no no.After finishing the chapter just look at the sheet and try to read the topics. This helps the chapter stick, like literally to your brain, and also helps in understanding the flow and the topics. This works better if you can also try fitting the definitions, formulas and some derivation (in which case 2 pages is allowed). The 2nd option is what I used to do, and called it God Notes. Works best if done the day before the exam.Accessing the brain for the information: Listen to the same music (or same type of music) again. This will help the brain accessing the information. And of course, read that sheet for each chapter.Keeping cool (Actung! Spiritual and deep thoughts ahead): You do not need to ace the test, you don't need the scholarship, don't need that job, or position. Passion is one thing, but I have noticed that at this age, people often misplace passion and stick to pressure instead. Passion will not come now, it will when it will and you will know. For now stay away from that \"motivation\" telling yourself that you NEED something. Pressure will fail your brain, and you need your brain. I used to study because I wanted to learn as much stuff as there is, no matter how bad a teacher is, I used to think that \"I am getting to know something I never did\". I wanted to learn. I understand that this might not work for everyone, so you need to find an excuse for yourself, yes an excuse because it is too early to be sure. Now, I do not want you to then ask, \"Why study?\".. My answer. \"You do not know, and you will not\". You are just starting to learn about life, think of these stuff like tools to be able to handle life. You never know which one you will require, how will you know. How does one know? It is a circle actually, you will know and if you want to reduce the chances of wishing that knew earlier, you will just need to trust.Trust: On God (that He will do the right thing, if you are religious) and/or in yourself (that you will figure things out in time) and the biggest trust source, people. Learned people, people who failed, who succeeded. Trust helps in combating uncertainties, and they will come. Why? How? and \"Oh! Dammit\" are an integral part of our lives and we basically strive to overcome that. So trust along.. you will get there.Hence, it is basically biology. You need the right chemicals in your mind and that can be done by some workarounds... I have numerous other small tricks that I use to optimize my time, but I feel those apply to a very small niche so will skip that. Again, you will need to find what applies to you, and optimize it better. However, the points mentioned here are not personal in nature rather use biology, psychology and philosophy and thus should apply to a fairly large audience. Of course, this only applies if you have the prerequisites, like openness and flexibility, which are skills that need to be developed first (topic for another time). I am anticipating a lot of scepticism, but I hope to help at least a few. ",
            "date": "Updated December 31, 2018",
            "views": "4564",
            "upvotes": " View 2.2K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Y'sh Raj",
                    "user_href": "/profile/Ysh-Raj-1"
                },
                {
                    "user_id": "Andrea Millar",
                    "user_href": "/profile/Andrea-Millar-2"
                },
                {
                    "user_id": "Shri Lalitha",
                    "user_href": "/profile/Shri-Lalitha-3"
                },
                {
                    "user_id": "Edward Va",
                    "user_href": "/profile/Edward-Va"
                },
                {
                    "user_id": "Tushar Chandra",
                    "user_href": "/profile/Tushar-Chandra-21"
                },
                {
                    "user_id": "Ki Tan",
                    "user_href": "/profile/Ki-Tan-4"
                },
                {
                    "user_id": "Ajith B",
                    "user_href": "/profile/Ajith-B-1"
                },
                {
                    "user_id": "Arijit Dubey",
                    "user_href": "/profile/Arijit-Dubey-1"
                },
                {
                    "user_id": "Harsh Gundesha",
                    "user_href": "/profile/Harsh-Gundesha"
                },
                {
                    "user_id": "XaXaXann",
                    "user_href": "/profile/XaXaXann"
                }
            ]
        }
    ]
}