{
    "title": "I want to be an ethical hacker. Which college and branch do I need to go? - Quora",
    "tags": [
        "Ethical Hackers",
        "Ethical Hacking",
        "Hackers",
        "Computer Hacking (security)",
        "Academic and Educational Advice",
        "College Advice",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shantanu Kulkarni",
                "href": "/profile/Shantanu-Kulkarni-54"
            },
            "answer_text": "It doesn't matter what college you will go to. Just choose computer science related stream.branch in your education. Then you can can start leaning about the concepts related to cyber security and ethical hacking. You can select some basic level training and certification program and start preparing for it. After completing that certificate you can apply for jobs and get into this field. CEH is one of the popular certificate among them. Lets talk in details. What is CEH ? CEH stands for Certified Ethical Hacker. Its one of the reputed global certificate provided by EC-Council in the field of cyber security. Generally , people working as Security consultant , Security Analyst or Penetration Tester do this certificate. Even freshers willing to start their career in the field of Cyber Security or professionals who want to switch/upgrade into cyber security do this certification course to get start in this Field. How to Apply ? You can go on official website of EC-council , buy a exam and training voucher for it ,study and give the exam.Exam is pretty simple. You will have 125 MCQ questions as online exam and you will have to select options and submit the exam.After that you will be CEH. How to study for it ? You have many options for it. Join any online training program. Join any institute in your city. Download the whole syllabus and study each topic one by one using google and YouTube. Make your own notes and give exam.(This one is mine). Advantage ? Well, the major advantage is your resume will get shortlisted by HR. You will be preferred candidate for interview , rest part of interview will depend on on your knowledge. Cyber Security is vast Field. This certificate will open many job opportunities for you to work in this field. ",
            "date": "Answered August 8, 2020",
            "views": "90",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Haritha Senathipathi",
                "href": "/profile/Haritha-Senathipathi"
            },
            "answer_text": "It is important to have a Bachelor's degree (BSc, BTech, BE, BCA) in Information Technology or Computer Science to become an ethical hacker. Candidates with advanced diploma in network security or relevant technology can also choose ethical hacking as professional career. ",
            "date": "Answered August 5, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aryan Chaurasia",
                    "user_href": "/profile/Aryan-Chaurasia-22"
                }
            ]
        }
    ]
}