{
    "title": "I want to do a master's in development studies. Which would be the best universities for the course, according to you? - Quora",
    "tags": [
        "Master's Programs",
        "Higher Education",
        "Colleges and Universities",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vibha Kagzi",
                "href": "/profile/Vibha-Kagzi"
            },
            "answer_text": "Masters in Development Studies is offered in many top universities abroad including:  Harvard University, University of Sussex, Oxford, Cambridge, University of California, Berkeley, London School of Economics, UCLA. When deciding on which college is right for you, you need to look at a number of factors. Don’t base your decision on rankings alone, this is only one point of reference. You need to identify and evaluate other criteria too. Some may play a larger role than others, so prioritize what’s important to you. Facilities: It’s important to choose a college that not only offers these options but also has a reputation in this area. Location: The climate, the geography, and the travel distances should all be conducive to your needs. These may not look important today but can surface as pain points tomorrow. Size: If you flourish in a small classroom environment with personalized attention, choosing a large university with a class size of over 3000 students or average course size of over 300 students will hinder your learning experience. Check the school website and brochures to find out what the student: teacher ratio is. Campus or City University: If you prefer college grounds to encompass everything you need, from where you study to where you eat, then a campus university may be a better fit. However, if you are more inclined towards a city life, and are comfortable with public transport, then a city university may be for you. Cost: If attaining financial aid is a priority, then you need to select colleges that are known to offer scholarships to international students. Some private Universities do not offer aid at all, while some are very generous with funding. Employment Opportunities: If you are looking to find a job in investment banking in New York, will the college career service be able to help you with that? What types of companies are recruiting at the college and for what types of opportunities? You should factor this into your decision, based on the potential career path you have in mind. ",
            "date": "Answered September 11, 2018",
            "views": "771",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shrikant Parab",
                    "user_href": "/profile/Shrikant-Parab-8"
                },
                {
                    "user_id": "Suchitra Nair",
                    "user_href": "/profile/Suchitra-Nair-11"
                }
            ]
        }
    ]
}