{
    "title": "I want to study for several hours a day. What can I do? - Quora",
    "tags": [
        "Study Habits",
        "Studying Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dev Kumar Airon",
                "href": "/profile/देव-कुमार-ऐरन-Dev-Kumar-Airon"
            },
            "answer_text": "More important than “how much” is “How”. Give your best to the studies, whatever be the course. For best results follow proper study techniques and a well defined schedule. Keep the following in mind:- 1. A systematic schedule 2. Proper study techniques 3. Repeated revision 4. Enough practice 5. Use mind maps to recover easily from memory 6. Relaxation techniques A systematic schedule compels focus and helps in concentrationDivide the available academic days for each part of the syllabus, chapter wise and stick to it. Allot time for a. text readings (including summary writing) b. Solving problems c. Revision d. Final revision e. Set aside an evening off after every 3 days of study. f. Set practical targets. Drop the less important and focus on the important. Some important things to keep in mind 1. Maximum quality input in a day cannot be more than 7 hours. More is a waste of time. 2. Keep all subject books, except one, out of your sight. Concentrate on one at a time.   3. Have proper sleep and rest. Sleeping less will be counterproductive. You will lose the quality of learning. 4. Keep taking breaks. Listen to soothing music. Go out door in greenery and fresh air. Entertain yourself.  5. Morning hours are most productive. Study Math and tough topics at this hour. Some Study Techniques 1. First two readings should be from the text book. Don’t use help books initially. 2. Read slowly and carefully. Understand the fundamentals. Mark or underline important points. 3. After reading a sub topic, mentally review what you just read. Write its summary on the page margins itself. On reading it at the time of revision the whole content should come to your mind  4. Then attempt questions. You will be surprised to discover how much you missed. Read again and answer the questions. 5. After attempting the questions you may now consult a help book 6. Attempt all types of questions; objective, multiple choice, short answer and long answer. 7. Solve questions from previous years’ papers. These are the best source. 8. Draw a neat diagram if applicable, label it and understand the process from it.   9. Carefully learn formulae and equations. 10. Read tougher material more often. 11. >> Read tougher material more often. 12. Practice writing fast REVISE, REVISE AND AGAIN REVISE. AND FINALLY REVISE It has been scientifically established that one tends to forget three fourth within a week of the reading. Memory graph is a steeply downward sloping line. Studies also show that if you revise within hours, the retention improves significantly.  Revise immediately, at the weekend and again in a month. How to find time for so many revisions? Read a topic carefully twice underlining the key phrases. That is one revision. Second reading will take less time and will be more productive. Jot down a summary in page margin. It will be second revision. Solve questions based on the topic. It will be third revision. On the weekend revise just the summary or the key points. It will be fourth quick revision. Finally do a monthly revision. When it is exam time you will not panic. You would have remembered broader points. Quickly revise the whole syllabus paying special attention to some tough topics/questions/formulae/equations. Mind Maps Mind remembers diagrams and colours more easily than the text and numerals. Jot down the key points in coloured pens. Encircle key words in -- pink, -- blue, -- red, -- green, -- yellow etc. Use different thickness pens of different brands to make a different imprint in your memory. When you read those again and again during revisions, the colourful images of the words will etch in your memory. Your mind will easily bring them to front when you need those at the time of writing answers.   Practice, Practice and more Practice Learn its easier part first. Do the tough part later. For tough questions read solved examples first. Solve a question again and again till you feel at home. (A stage will come when you will be surprised why did you feel it difficult). Chemistry – a fascinating subject It is a fascinating subject. You study about atoms and molecules and their behavior even when you cannot see those. If those were enlarged billions of times those will look like mini solar system. Smaller balls revolving around bigger balls in a definite arrangement like planets revolving around Sun. By chemical reactions you create new planets and solar system. Those balls have definite size, weight and nature. A chemistry student can tell their behavior even as others cannot even see those tiny things. When you read chemistry imagine doing these things. 6. Relax – Take 20 Deep Breaths It has been scientifically proved that deep breathing relaxes mind, settles down fast heart beat, improves concentration, and improves efficiency. It takes very little time. It will remove the great stress in exams. It will improve your memory sharply  Sit in a – · quiet room · eyes closed · on a flat surface · back straight. · Inhale slowly counting up to 6. Mentally imbibe energy in to your body and mind. · Exhale slowly counting up to 8. Imagine expelling mental stress. This is one breath. · Take 20 deep breaths. You feel increasingly relaxed with each breath. Focus on your breathing. As the stress eases out you will gradually pass in to a semi meditative state. Believe me you will be surprised at the positive impact. ALL THE BEST TO YOU ",
            "date": "Answered November 27, 2016",
            "views": "271",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeet Thakore",
                    "user_href": "/profile/Jeet-Thakore"
                },
                {
                    "user_id": "Kamal Roshia",
                    "user_href": "/profile/Kamal-Roshia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ishita Azad",
                "href": "/profile/Ishita-Azad"
            },
            "answer_text": "Quality matters not quantity. If you can learn ,what other people can learn in more than 4 hours, in 4 hours, then I don't think you need to stress so much on improving your sitting. You could instead improve your concentration and try to grasp the stuff in a lesser time. And if you are a college student, 4 hours is more than enough. Anyhow, if you still want to improve your sitting, I'd recommend finding a study partner with whom you can divide the topics and then can later discuss it with him/her. If you can't find a partner, you can try switching from one subject to other every one or two hours or till the time it has your full attention. Once you get bored, you can switch to some other subject. Being a medical student, when I used to get bored of biology, I switched to solving physics numericals. And if you are a non medical student, then you have an upper hand as solving mathematics questions is something I found interesting. You could also try to study for one hour and then take a 10min break to refresh yourself. This way you won't feel bored and can focus back on that subject or begin fresh with a new subject. In my opinion, making is time table is futile(maybe because I can't stick to it). I'd rather study a subject I find interesting for more than 2 hours than to stick to a timetable and divide that time with a subject I find boring. Anyhow you still need to cover every topic, hence learning to balance the boring subjects with interesting subjects is the key. Study an interesting topic for sometime, then switch to a boring topic and then come back to the interesting one once you get bored. Remember, you don't need to overburden yourself with the thought of studying for more than 4–6 hours every day if you can grasp everything in less than that time. This gives you more time for your other hobbies. Hope it helps. ",
            "date": "Answered January 18, 2020",
            "views": "588",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Davis",
                    "user_href": "/profile/Davis-208"
                },
                {
                    "user_id": "Harsh Jakhar",
                    "user_href": "/profile/Harsh-Jakhar-12"
                },
                {
                    "user_id": "Prithvi singh",
                    "user_href": "/profile/Prithvi-singh-153"
                },
                {
                    "user_id": "Jiya",
                    "user_href": "/profile/Jiya-130"
                },
                {
                    "user_id": "Neera Bhardwaj",
                    "user_href": "/profile/Neera-Bhardwaj"
                },
                {
                    "user_id": "Ravi Makhija",
                    "user_href": "/profile/Ravi-Makhija-7"
                },
                {
                    "user_id": "Shyamal Patel",
                    "user_href": "/profile/Shyamal-Patel-14"
                },
                {
                    "user_id": "Gautam Chellani",
                    "user_href": "/profile/Gautam-Chellani-1"
                },
                {
                    "user_id": "Rakesh Mishra",
                    "user_href": "/profile/Rakesh-Mishra-1216"
                }
            ]
        }
    ]
}