{
    "title": "I want to become a journalist . Which subject should I take in 11th class? - Quora",
    "tags": [
        "Class 11th in India",
        "Academic and Educational Advice",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sneha Jaiswal",
                "href": "/profile/Sneha-Jaiswal-56"
            },
            "answer_text": "Really depends on the kind of journalism you want to do. Let's say you are interested in being an entertainment journalist (I know a lot of people think that's just crap, but a LOT of people ARE interested in that and it's a fun job, I guess, if you are into it), then you should take arts. And even if you want to cover arts and culture, then again, choose arts. If you are interested in doing business journalism, cover the markets, start ups, then go with commerce for class 12. If you want to cover health or science then science stream would be apt. You get the drift right? Choose what you want to eventually cover. And if you are not sure what you want to cover then just take anything you want. What I am doing as a journalist right now, has absolutely NOTHING to do with what I studied in class 11 & 12th. ",
            "date": "Answered April 16, 2018",
            "views": "797",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nagaraju Nimmala",
                    "user_href": "/profile/Nagaraju-Nimmala-1"
                },
                {
                    "user_id": "Muralidhara S Shetty",
                    "user_href": "/profile/Muralidhara-S-Shetty"
                }
            ]
        },
        {
            "author_info": {
                "name": "Narendra Kumar",
                "href": "/profile/Narendra-Kumar-348"
            },
            "answer_text": "JOURNALISM is not bound to any stream, understand this first. Next, choose the side with which you will be most comfortable, after all 12th BOARD is some serious BUSINESS, and while selecting any stream look for colleges which award degrees in JOURNALISM, and see what subjects they have for their entrance exams. if we try to relate the subjects and JOURNALISM then most probably they should be of aptitude test, along with GK, hints of history and geography and stuff. in short it doesn't matter, what side you select, what matters is tests and preparation you will be doing to get in some good college for your course. hopefully, it will eliminate your dilemma. Thanks. ",
            "date": "Answered June 14, 2017",
            "views": "682",
            "upvotes": "0"
        }
    ]
}