{
    "title": "I'm 19 and am struggling with college and my girlfriend. What should I do? - Quora",
    "tags": [
        "Girlfriend Advice",
        "Girlfriends",
        "Dating and Relationship Advice",
        "Love Life Advice",
        "Teenagers and Teenage Years",
        "Relationship Advice",
        "Dating Advice",
        "College Advice",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ephraimah",
                "href": "/profile/Ephraimah"
            },
            "answer_text": "First of all, don't worry. Worrying don't get you nowhere. Because, and this I can guarantee you, it'll be alright. Problems like these don't last long. I know you hear it all the time like so often that you stopped listening to it but that's how it is. Now, on to solving your problem. You're struggling with your girlfriend? Does she show any red flags? Do you? Be real. Maybe this relationship is toxic and you need to get out of it. Or maybe it's “just a phase” and you'll get over it. I personally don't recommend “breaks” in a relationship cause things are gonna fall apart as time goes by but this is just my personal advice. (Are you financially secure? If you rely on your girlfriend to support you financially but the relationship is toxic then y'all should break up because it hurts in the long run. You need to become financially stable because relying on ppl with this never works.) So, you're struggling with college. You can have your own opinion on this but for me: Studies > Girlfriend. Is your girlfriend a distraction from college? Then put an end to these things or tell your girlfriend to give you enough space for studies. I myself am not even a total nerd or anything, absolutely not, but you're in college and trust me, that shit matters. Focus on your studies. Don't procrastinate. Get them grades up. Things aren't gonna get easier for you. Sincerely yours Holly. ",
            "date": "Answered January 7, 2020",
            "views": "293",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amy Miller",
                    "user_href": "/profile/Amy-Miller-1-1"
                },
                {
                    "user_id": "Ayden Estes",
                    "user_href": "/profile/Ayden-Estes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Mammone",
                "href": "/profile/Michael-Mammone-2"
            },
            "answer_text": "Best thing to do is to take a step back. Figure out your priorities and work on time management. School is important but so is having friends and a relationship. Maybe spend less time with one thing to compensate for the other. Talk this out with your girlfriend. She will understand that school is important and if she doesn’t see that then maybe it’s time to rethink what you want in a relationship. ",
            "date": "Answered January 7, 2020",
            "views": "12",
            "upvotes": "0"
        }
    ]
}