{
    "title": "I'm 26 years old. Is it too late to start studying physics? - Quora",
    "tags": [
        "Is It Too Late?",
        "Physics Advice",
        "Learning Advice",
        "Advice About Learning New Things",
        "Quantum Mechanics",
        "Learning New Things",
        "Learning",
        "Physics",
        "Life Advice",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thea Kinyon Boodhoo",
                "href": "/profile/Thea-Kinyon-Boodhoo"
            },
            "answer_text": "I'm 30 and I'm starting my first college physics class this spring. I'm pretty excited about it. When I was in high school, I sucked at math even though I'd always loved science. I failed Algebra 2 twice. So I went to art school for an AA in advertising. But after working in the industry for awhile, I still wanted to scratch that science itch, so I started taking some math and science classes on the side, and found that I had become a lot better at learning as an adult, and the new subjects gave me new ways of thinking about my other work. It was a win-win. I also looked for conferences and events, and tried to make connections with people in the fields I was interested in, and that's been invaluable. People love to talk about what they do and with your existing skills, there's always some way you can help out and be involved with the field even if you find out you don't like doing it yourself.  If you're looking to go for a degree, you'll find it's not like the first time around. I'm hoping to finish a bachelors now, but after working full-time and getting married it's impossible to find any financial aid, so most schools are still out of reach. It's frustrating. But the truth is, the red tape is the biggest barrier, not my brain. I'm less distracted, smarter, better at communicating and a lot braver and more adept socially than I was as a young art student. I have a huge advantage over the other undergrads, and I'm actually not the only person my age in many classes. A lot of late-20s and early-30s veterans are back in school to finish their degrees right now, as well as people like you and me who did some other work and then came back around to their first passion. Is it awkward at first when an instructor is younger than you? Yes. But it's also a lot easier to make real intellectual connections with them that turn into projects and opportunities - and even friendships. In conclusion: Do it! And best of luck :) ",
            "date": "Answered December 30, 2014",
            "views": "14",
            "upvotes": " View 70 Upvoters",
            "upvoters": [
                {
                    "user_id": "Virbra Ligo",
                    "user_href": "/profile/Virbra-Ligo-1"
                },
                {
                    "user_id": "Anmol Tayal",
                    "user_href": "/profile/Anmol-Tayal-3"
                },
                {
                    "user_id": "Milo Dubinsky",
                    "user_href": "/profile/Milo-Dubinsky-1"
                },
                {
                    "user_id": "Valentino Richard",
                    "user_href": "/profile/Valentino-Richard"
                },
                {
                    "user_id": "Esther Eke",
                    "user_href": "/profile/Esther-Eke-2"
                },
                {
                    "user_id": "Manish Kumar",
                    "user_href": "/profile/Manish-Kumar-1435"
                },
                {
                    "user_id": "Simone S",
                    "user_href": "/profile/Simone-S-54"
                },
                {
                    "user_id": "Aziar Anidem",
                    "user_href": "/profile/Aziar-Anidem"
                },
                {
                    "user_id": "Harsh Patel",
                    "user_href": "/profile/Harsh-Patel-1053"
                },
                {
                    "user_id": "Nithin Gigi",
                    "user_href": "/profile/Nithin-Gigi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shiladitya Sengupta",
                "href": "/profile/Shiladitya-Sengupta-4"
            },
            "answer_text": "We have to abandon the idea that schooling is something restricted to youth. How can it be, in a world where half the things a man knows at 20 are no longer true at 40 - and half the things he knows at 40 hadn't been discovered when he was 20?\" ― Arthur C. Clarke I recently met a software engineer at an airport who is passionate about Physics, and reads a lot of Physics related books, both popular science and textbooks. There are many options out there. The Theoretical Minimum is a theoretical Physics course for adults who didn’t or don’t want to go to college.There are many interesting Physics and Maths courses on MOOC websites like edX. These focuses on interesting questions rather than the technical details. You can also opt for certificate.So I would suggest to try out these first. It will help you decide if you want to go further. Whether you can get a formal degree in Physics, really depends on the education system of your country. About career options: You can be a computational physicist / engineer who develop software for solving cutting edge Physics problems. Softwares that are bread and butter of academia. There is a real shortage of those kinds of experts who will focus on software development for Physics / Maths. Consider the profile of Professor Axel Kohlmeyer.Get involved into physics or math oriented open source projects, and take a hands-on approach to learn the Physics / Math involved. Recently I saw Mozilla was looking for volunteers.",
            "date": "Answered June 26, 2017",
            "views": "51",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hush Anastacia",
                    "user_href": "/profile/Hush-Anastacia"
                },
                {
                    "user_id": "Justin Bruss",
                    "user_href": "/profile/Justin-Bruss"
                },
                {
                    "user_id": "Medha Dixit",
                    "user_href": "/profile/Medha-Dixit-3"
                },
                {
                    "user_id": "Valentino Richard",
                    "user_href": "/profile/Valentino-Richard"
                },
                {
                    "user_id": "Harsh Patel",
                    "user_href": "/profile/Harsh-Patel-1053"
                },
                {
                    "user_id": "Monami Momotaro",
                    "user_href": "/profile/Monami-Momotaro"
                },
                {
                    "user_id": "Nobu Naomi Taira",
                    "user_href": "/profile/Nobu-Naomi-Taira"
                },
                {
                    "user_id": "Ayushi Solanki",
                    "user_href": "/profile/Ayushi-Solanki-2"
                },
                {
                    "user_id": "Nora Word",
                    "user_href": "/profile/Nora-Word"
                },
                {
                    "user_id": "Quyet Nguyen",
                    "user_href": "/profile/Quyet-Nguyen-41"
                }
            ]
        }
    ]
}