{
    "title": "I'm a 12th pass out student. What should I choose for a career? - Quora",
    "tags": [
        "Academic Advice for Careers",
        "College Advice for Careers",
        "Academic and Educational Advice",
        "College Advice",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yash Jha",
                "href": "/profile/Yash-Jha-6"
            },
            "answer_text": "Highest paying jobs in India after 12th: Lack of awareness among individuals who look for highest paying jobs in India after 12th about plenteous openings that are offered throughout several domains likeelectrical, electronics, Photography, Digital marketing, Animation, etc..,. Most popular myth among the individuals who are seeking best jobs without a degree will not fetch them a decent pay but there is every chance for them to get high salary jobs with such a basic qualification in latest government jobs 2015 and private sector jobs. Here we are providing few highest paying jobs without a degree in India which require basic certifications and otheron job training process. Best jobs after intermediate: These are few of the many opportunities that are available and the sequence in which the jobs listed in below are not necessarily of the descending order. Event Manager – A profession which doesn’t demand a college degree is one option for those who are looking for best salary jobs after 12th. All that you require for this profession is good communication skills and marketing skill.Modeling – Modeling is another career is one of the best salary jobs after 12th in India, basic requirement for this job is good physic and able to actSales Representative – One can choose this job who like to interact with people from all walks of life and have excellent communication skills and able to impress and market their product, most of the time the they will be paid based on their targets achievedReal-estate Agent – Those who convey or market anything related to property that is being sold or bought. This profession doesn’t require a degree which reaps a high compensation with every successful dealCarpenter – This yet another profession which requires a good amount of physical effort though it will fetch you a fair amount of money and also one of the most in demand profession these daysMakeup Artist – An artistic career to be successful Makeup artist one must possess artistic skills and able to upgrade themselves as per the demands of their clients, they can find jobs in modeling, cine fields etc.., and remuneration is purely based on their talent.Photographer – Photography is one of the best earning profession where individuals can work for movies or freelance or even they can work for the media houses as photo journalists and many other international informative media housesPersonal Trainer – Thanks to the wide awareness of health conscious among the people of India, which has created a new job opportunity for many job seekers in the form of Personal Trainer who is responsible to guide the person who has hired him for his physical fitness. Personal Trainer is a kind of profession which doesn’t demand a graduation degree and can earn huge remunerationNurse – Not that only those who have a degree in nursing can practice as a nurse in India, those who are interested to take a nursing profession can take a short term certification courses that are available and get registered with the council. There are a lot of Nursing opportunities for Nurses not only in India but also abroadMedia & Communication Equipment monitoring – This is a very challenging profession where an individual needs to monitor the digital equipment, visual equipment and audio equipment live. Those without a degree can make their career as media and communication equipment worker in broadcasting, telecasting agencies, and Media housesThese few of the most available jobs for those who doesn’t have a college degree. ",
            "date": "Answered January 6, 2017",
            "views": "139",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Himang Pandey",
                    "user_href": "/profile/Himang-Pandey"
                },
                {
                    "user_id": "Rajdip Dey",
                    "user_href": "/profile/Rajdip-Dey-1"
                },
                {
                    "user_id": "Arun Vijay",
                    "user_href": "/profile/Arun-Vijay-82"
                },
                {
                    "user_id": "Ashish Sharma",
                    "user_href": "/profile/Ashish-Sharma-6733"
                },
                {
                    "user_id": "Sidharth Thampan",
                    "user_href": "/profile/Sidharth-Thampan"
                },
                {
                    "user_id": "Sayandeep Ghosh",
                    "user_href": "/profile/Sayandeep-Ghosh-21"
                },
                {
                    "user_id": "Ridhi Mittal",
                    "user_href": "/profile/Ridhi-Mittal-9"
                },
                {
                    "user_id": "Biky Karmakar",
                    "user_href": "/profile/Biky-Karmakar"
                },
                {
                    "user_id": "Sai Anil Kumar Chikkala",
                    "user_href": "/profile/Sai-Anil-Kumar-Chikkala"
                },
                {
                    "user_id": "Zuhail Farroqui",
                    "user_href": "/profile/Zuhail-Farroqui"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saransh Ninawe",
                "href": "/profile/Saransh-Ninawe"
            },
            "answer_text": "First Make a nice and attractive Resume. Some Options: Prepare for Government Exams: Here are the two most popular exams:SSC CHSL-SSC CHSL is conducted for recruitment for the following SSC CHSL Posts: Lower Divisional Clerk (LDC), Sorting Assistant (SA), Postal Assistant (PA), Junior Secretariat Assistant (JSA), and Data Entry Operator (DEO) posts. Eligibility: 12th PassRRB Group D: Conducted for the posts of Track Maintainer Grade-IV, Helper/Assistant in various technical departments (Electrical, Mechanical and S&T departments), Assistant Pointsman, Level-I posts in other departments of Indian Railways.Eligibility: 10th PassIf you have a nice and clear catch of concepts up to 10+2, give paid Home/Class TutionsJoin Swiggy/Zomato/Dominos/Amazon/Flipkart/Myntra etc as a Delivery boyDo Short Term Job Oriented CoursesDiploma in Multimedia, 3D Animation & Visual Effects: The most sought after course after 12th is 3D Animation & Visual Effects. The demand for this diploma course has grown at an unprecedented rate and so does the requirement in the entertainment industry. A career in 3D Animation is one of the most profitable choices amongst the students nowadays. The constant demand for animations in television and films has cropped up various specialization courses to cater to it. This also includes demands for the gaming industry too.Diploma in Photography: The most creative of the lot, short term course in Photography is the most sort after field students after 12th opt for today. With splendid opportunities in creative fields today this career is lucrative and job oriented too. The duration of the Diploma course in Photography is for one year. Based on your interest and specialization in photography, you could get a job at studios, agencies and companies. Alternatively, you may choose to work on a part-time and/or freelance basis or assist senior photographers too.Source: Best Job Oriented Short-Term Courses after 12thThanx for Reading. _/\\_ Suggestions and Judgments are most welcome :) Peace out Upvote-> It takes only 0.02 milliseconds ",
            "date": "Answered July 3, 2020",
            "views": "21",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sourav Pandey",
                    "user_href": "/profile/Sourav-Pandey-48"
                },
                {
                    "user_id": "Rakshita Jaiswal",
                    "user_href": "/profile/Rakshita-Jaiswal-4"
                },
                {
                    "user_id": "Ritesh Yeddu",
                    "user_href": "/profile/Ritesh-Yeddu"
                },
                {
                    "user_id": "Anant Yadav",
                    "user_href": "/profile/Anant-Yadav-87"
                },
                {
                    "user_id": "Aditya Yadav",
                    "user_href": "/profile/Aditya-Yadav-1396"
                },
                {
                    "user_id": "Lakshya Bhambri",
                    "user_href": "/profile/Lakshya-Bhambri-2"
                },
                {
                    "user_id": "Ajay Kumar Dwivedi",
                    "user_href": "/profile/Ajay-Kumar-Dwivedi-15"
                },
                {
                    "user_id": "Prafful Kumar",
                    "user_href": "/profile/Prafful-Kumar-35"
                },
                {
                    "user_id": "Kavi Dharani",
                    "user_href": "/profile/Kavi-Dharani-3"
                },
                {
                    "user_id": "Sandeep Kumar",
                    "user_href": "/profile/Sandeep-Kumar-7873"
                }
            ]
        }
    ]
}