{
    "title": "If a teacher gave me my assignment late do they need to give me an extension? - Quora",
    "tags": [
        "Assignment",
        "Homework",
        "Teachers",
        "Teaching",
        "Students",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charles Roth",
                "href": "/profile/Charles-Roth-2"
            },
            "answer_text": "Schools have different rules for what a teacher needs to do. If there are school rules that dictate that the teacher needs to give you an extension, then he/she does need to do that. If there are no such rules, then the teacher does not need to give you an extension. However, depending on the reason for giving you the assignment late, it might be nice for the teacher to do so. If the teacher made a mistake and forgot to give it to you or typed in the wrong email address to send it to you, then he/she really should give you an extension if the decrease in amount of time really hindered your ability to finish the assignment. You should request that if it is the case. If it is your fault the teacher gave you the assignment late, then you can still make the request, though you are less likely to get an extension. However, the most important question here isn’t whether the teacher needs to give you an extension, but whether you need an extension. Can you finish the assignment on time with the same degree of mastery as you would if you had the full amount of time? Would you realistically have done better with more time? Or would it have just given you an extra day to procrastinate? If you don’t really think that the lack of an extension hindered your ability to finish the assignment to an acceptable (to you) level, then stop asking questions on Quora and do your work. If you do feel that you cannot do an acceptable job without an extension, then get off Quora and ask the teacher for the extension. :-) ",
            "date": "Answered April 30, 2020",
            "views": "86",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Riley Jayden",
                "href": "/profile/Riley-Jayden"
            },
            "answer_text": "Yes although it depends. If the assignment is due within the next day or two or is a paper then yes of course you should reach out to them. However, if the assignment is due in over a week they will likely not give you an extension though you deserve it. How I format my emails Dear mr/mrs blah blah, Hi I was wondering if I could… as the assignment was handed out…. Which severely hindered the time that I would have to work on it. Thank you and have a good evening, Input name ",
            "date": "Answered April 30, 2020",
            "views": "63",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Farin Scheinfeld",
                    "user_href": "/profile/Farin-Scheinfeld"
                },
                {
                    "user_id": "Daisy Krieger",
                    "user_href": "/profile/Daisy-Krieger"
                }
            ]
        }
    ]
}