{
    "title": "If I start now, is there enough time for preparations for the MBA entrance exams? And how should I prepare for it? - Quora",
    "tags": [
        "MBA Career Advice",
        "Master of Business Administration Degree Advice",
        "Exams and Career Advice",
        "Exam and Test Advice",
        "Master of Business Administration Degrees",
        "Exam and Test Preparation",
        "Exams and Tests",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saurabh Toshniwal",
                "href": "/profile/Saurabh-Toshniwal"
            },
            "answer_text": "(a) Firstly one must be clear about MBA Program You should understand what is it all about, its relevance and then decide about going in for it. MBA is a ‘Masters’ program, which prepares students for various functions and positions in the ‘Business World’. For details read, wikipedia or search internet for acquainting yourself with the program and the business activities. (b) Why do majority of students join MBA? First and foremost for getting a good job with a decent remuneration.Since the Business activities sphere is very large and diverse, there are many career options and job opportunities for the job seekers.Students with diverse academic backgrounds are eligible for admission and there is no bar for any graduate student, with sound academic credentials.A management career appears to be attractive and glamorous.Students with specific interest in and passion for self-entrepreneurship can learn a lot about ‘Business Management’ and can arm themselves with sound and relevant education.Children and Parents from business families are increasingly seeking professional education before entering the family business.It is in vogue and fashionable to acquire and flaunt an M.B.A degree.(c) Carefully decide your own reasons for choosing MBA program In any case whatever your rationale may be, management education is very stimulating, useful and rewarding. It is recommended that decision to go in for an MBA degree should be taken much before completion of the graduate degree or in the beginning of your professional career, in case you want to acquire some work experience before seeking admission. You must prepare a list of the Top schools and others also, alongside their eligibility criterion and the type of entrance examination. Most of the good schools require students to appear for CAT and some for GMAT tests. (d) The essential focus areas in which the students are tested are: Command over English language, i.e. expression, vocabulary, precision and grammar.Logical and Reasoning ability- this requires basic knowledge of Math and Statistics, besides of course logical thinking in general.Knowledge about the National and World affairs, specially the current ‘hot topics’Leadership Qualities and Public Speaking, which are mainly tested through Group Discussions(e) Examination Pattern All the written tests are based on multiple-choice type objective questions and are mainly conducted on-line.The ratio of the number of questions to be answered and the time allotted is very challenging, e.g. one has to answer 60 questions in 45 minutes.You cannot go to the next question before answering the previous one as per the latest pattern. This means that you cannot run through the question paper from top to bottom, solving the problems, which are easy for you and go back to the top again for the more difficult ones.The algorithms are continuously redesigned and you cannot predict the positive, neutral and negative marking weightage.It essentially boils down to ‘speed’, thorough preparation with an understanding of the subject matter and a cool minded approach.(f) How to Prepare for MBA Entrance? Start working on your language skills and the communication ability. For this you must read a standard National Daily Newspaper and a regular News Magazine on a daily basis, besides any other reading of your choice. This will also increase your awareness about the current affairs.For correct vocabulary, spellings and grammatical usage, consult a standard Dictionary and note down what you have checked.For better-spoken expression, watch a good T V news program conducted by a news anchor who speaks in an easy and accent free tone. This has to be done everyday (the same program).If you are self-conscious, you can practice by reading the newspaper aloud in front of a mirror for 15 minutes everyday.Commerce, non-medical and other students who have optional math in school and college MUST take the subject, no matter how difficult they find it to be. Others can start take private coaching from a very early stage.(g) Maximum number of students who qualify are from engineers They have a strong math background. The others are well advised not to underestimate this fact and to prepare hard to close the gap. Solving puzzles and participating in quiz competitions will enhance your logical ability.Invest in good standard CAT and GMAT preparation books and start taking online tests to check / enhance your score.Determine your weak areas and work on them for continuous improvement.Be prepared and open to ask for guidance and help from parents and friends.Join a standard Coaching Program, preferably for TWO years in succession. It should be a physical tutoring program and not a distance learning one for real effectiveness.Check with seniors and friends who have earlier got admission to good business schools and note down relevant points out of their experience.(h) This list obviously is not complete but is meant to give you a clear idea of how-to-go-about-it. A word of advice-do not be worried or over-confident. Apart from your inherent talents, serious and focused preparation is required by just about every one. Also you have to not only ‘Work Hard’ but also ‘Work Smart’ to get the most out of your efforts. ",
            "date": "Updated August 17, 2017",
            "views": "313",
            "upvotes": " View 118 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alivia Paul",
                    "user_href": "/profile/Alivia-Paul"
                },
                {
                    "user_id": "Rupam Nandy",
                    "user_href": "/profile/Rupam-Nandy"
                },
                {
                    "user_id": "Priyanka Das",
                    "user_href": "/profile/Priyanka-Das-978"
                },
                {
                    "user_id": "Kashish Chandra",
                    "user_href": "/profile/Kashish-Chandra-6"
                },
                {
                    "user_id": "Anubhuti Swarup",
                    "user_href": "/profile/Anubhuti-Swarup"
                },
                {
                    "user_id": "Hrishika Sharma",
                    "user_href": "/profile/Hrishika-Sharma-4"
                },
                {
                    "user_id": "Abhishek Agrawal",
                    "user_href": "/profile/Abhishek-Agrawal-852"
                },
                {
                    "user_id": "Naina Johari",
                    "user_href": "/profile/Naina-Johari-1"
                },
                {
                    "user_id": "Kshitija Mahakalkar",
                    "user_href": "/profile/Kshitija-Mahakalkar"
                },
                {
                    "user_id": "Sai Nikhil Yandamuri",
                    "user_href": "/profile/Sai-Nikhil-Yandamuri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Mista",
                "href": "/profile/Joe-Mista"
            },
            "answer_text": "I'm assuming you are intending to apply for this years term? which starts at the end of August.  I would tell you that if that is the case it is very unlikely for you to take the test and get all your admissions work done before the deadlines (which I'm sure have way passed for most top schools, speaking only for US Schools as that is my area of familiarity). To give you some perspective I took my GMAT and did all my admissions work about 9-10 months before the start of the term, that's a personal choice but maybe you want to take the GMAT again, maybe you decide to apply to differnt school, who knows.   If you have any other questions about preparation don't hesitate to let me know, I took the exam twice and spent plenty of time in that realm.   Good luck. ",
            "date": "Answered July 10, 2015",
            "views": "1",
            "upvotes": "0"
        }
    ]
}