{
    "title": "If I've always been an average 80% student how can I become a 90%+ student? - Quora",
    "tags": [
        "The High School Experience",
        "Students",
        "Studying",
        "Self-Improvement",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Adams",
                "href": "/profile/Andrew-Adams-288"
            },
            "answer_text": "Shoot high. As the old adage goes, “Shoot for the moon. Even if you miss, you'll land among the stars.” Here’s the deal. If you try to be an A student and get a 93% on everything, things are going to happen. Maybe a test sneaks up on you, and you don’t have enough time to prepare. Or an evil professor decides to make the world’s hardest exam and decides not to curve because that would “discourage teamwork.” Whatever it is, suddenly your big dream of getting a 93 takes a hit, and you’re back to getting another 81. If you want to get A’s you’ve got to try to get 100% on every. single. assignment. This is why research has shown that a 4.0 GPA results in significant amounts of stress. You’ve got to aim for perfection. Now once again, with this different mindset things are still going to happen. But this time, things are a little different. Since you’re starting point is an 100%, when things go wrong you move down to a 95% or maybe even a 93%, but you’re still getting an A. That’s the key to getting A’s. ",
            "date": "Answered February 11, 2020",
            "views": "504",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Caden Moffitt",
                    "user_href": "/profile/Caden-Moffitt"
                },
                {
                    "user_id": "Ashley Vandegrift",
                    "user_href": "/profile/Ashley-Vandegrift"
                },
                {
                    "user_id": "Clayton Hagberg",
                    "user_href": "/profile/Clayton-Hagberg"
                },
                {
                    "user_id": "Thomas Walsh",
                    "user_href": "/profile/Thomas-Walsh-69"
                },
                {
                    "user_id": "Yoni Amatya",
                    "user_href": "/profile/Yoni-Amatya"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Sabghir",
                "href": "/profile/David-Sabghir"
            },
            "answer_text": "Alexis, You are looking for the Fountain of Youth…lol. First of all, toss away the TV. Trim out of your life, the time wasters. Already you will be ahead of the game. It takes penultimate patience with yourself and the ability to go over and over the material until you master it. There are no shortcuts. Find a place which is conducive to study without and I underline without distractions and that means, the cell phone, social media, radio, etc. I spent four years in college living in the libraries. The more you practice, the better you will become. Get plenty of sleep and good nutrition, keep hydrated. Of course, the above is not easy, but as they say, Rome wasn’t built in a day. Have Savlanut, patience in Hebrew. You can do it! You just have to want to do it badly enough and no one can do it for you. Best of luck! ",
            "date": "Answered February 10, 2020",
            "views": "75",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Thomas Walsh",
                    "user_href": "/profile/Thomas-Walsh-69"
                }
            ]
        }
    ]
}