{
    "title": "If someone has an IQ of 80-85 can they finish high school, and what kind of job are they best suited for? - Quora",
    "tags": [
        "High Level IQ",
        "IQ Testing",
        "Intelligence Quotient",
        "High School Education",
        "The High School Experience",
        "Intelligence",
        "Schools",
        "Education",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruno Campello de Souza",
                "href": "/profile/Bruno-Campello-de-Souza"
            },
            "answer_text": "One of the best uses for IQ is predicting educational performance and attainment. Indeed, it is why it was created in the first place. The average high school graduate in the US has an IQ of about 105 (corrected from a previous typo stating 115). Excluding errors of measurement (see Bruno Campello de Souza's answer to Can someone unwillingly score low on the IQ test but actually be a genius?), a person with an IQ of 85 would be very likely to fail or to be in the very low end of performance. It is important to point out, though, that many other things influence educational success, including personality, motivation, and sociocultural context. The lower IQ individual would probably have to struggle just trying to keep up with most classes. Unless there is some reason to doubt the results of the IQ test (foreign language barrier, test anxiety, testing settings, external sources of stress during testing, etc.), I would be tempted to help the lower IQ person to advance in school as much as possible and then seek work in some sort of activity where he or she can do manual or semi-skilled labor. That is a much more viable path, and one where the individual does not automatically fall into a position of inferiority compared to his or her peers, which can lead to a much more fulfilling and satisfying life. Again, all of this strongly depends on having a good measurement of one’s IQ and a consideration of possible confounding factors. This is not a reality I relish in, nor the reflection of any elitist values on my behalf, but simply a statement of facts. I wish it were possible to turn the low IQ individual into a high IQ one through education, training, counseling, medical treatment, or some combination thereof, but, as far as we can tell, it is simply not the case. Intelligence is not fair or meritocratically distributed, nor can it be turned into something of that nature through social intervention, which is why it is not a measure of a person's worth as a human being. But it does have enormous practical implications for education and work. ",
            "date": "Answered March 31, 2019",
            "views": "29",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cedric Campbell",
                    "user_href": "/profile/Cedric-Campbell"
                },
                {
                    "user_id": "Suzanne Johnsdottire",
                    "user_href": "/profile/Suzanne-Johnsdottire"
                },
                {
                    "user_id": "Jose Romero",
                    "user_href": "/profile/Jose-Romero-483"
                },
                {
                    "user_id": "Ausar Ydestī",
                    "user_href": "/profile/Ausar-Ydestī"
                },
                {
                    "user_id": "Kshitij Anand",
                    "user_href": "/profile/Kshitij-Anand-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay L. Faulkner",
                "href": "/profile/Jay-L-Faulkner"
            },
            "answer_text": "The average I.Q is between 90–110 but I think I.Q. is grossly overrated. A high I.Q. doesn’t guarantee success. High intelligence may suggest a potential for success, fulfilling that potential requires skills and traits that no IQ test can possibly measure. I never took an IQ test ever and I’m definitely not smartest guy in the room. My persistence, resilience, self-discipline, high level socio-emotional skills have been the ingredients to my high level success in life. The skill of persistence is sorely lacking in society and this is why most fall to the wayside. Continuing to go forward when everything is against you. Despite your background, your family, your past, your mental fatigue, your burdens and circumstances, and the odds being against you, you still continue to persevere. You will never stop until the goal or task is complete, the only thing that will stop you is death. In most circumstances we withdraw, quit, or give up quickly because we do not get immediate gratification. We lack the sheer tenacity and endurance. We like the idea of success, but many of us will never accomplish it because our mind’s stamina is almost non existent and our attention span is even worse. The majority of people are inclined to give up as soon as something goes not according to the plan. An IQ test cannot measure such variables. If being a brainiac was the one and only criterion for success, everyone with a lofty IQ would be wildly successful — and obviously, that’s not always the case. Even a genius can squander their intelligence jackpot. When high IQ individuals encounter a problem that needs solving, they tend to forgo facts in favor of mental shortcuts. Trouble is, these shortcuts can lead to foolish mistakes and ultimately failure. So the real question should be: Can we actually compete with genius by going from good to great? My answer is a resounding yes! ",
            "date": "Answered March 31, 2019",
            "views": "703",
            "upvotes": "0"
        }
    ]
}