{
    "title": "If you could, how would you change modern classrooms? - Quora",
    "tags": [
        "Classrooms",
        "Educational Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jason Chen",
                "href": "/profile/Jason-Chen-604"
            },
            "answer_text": "I am a High School student myself, and I have experience mentoring & tutoring students in all subjects. One of the things that I do not like about the modern classroom is its rectangular form. Research has proven, time and again, that rectangular rooms tend to discourage creativity and imagination. In High Schools, this threat is all to real, since many students will have to sit in the back, creating a sort of separation from the teacher.  It’s difficult to concentrate when you’re sitting down in a room like this, listening to the teacher talk at you. Through mentoring students, I have come to know that learning is maximised when a teacher is talking with a student. In a traditional classroom, that is impossible, because the arrangement instantly creates a sense of distance between teacher and student. Now, what if classrooms looked like this?  Observe the arrangement of the alternative room. With this design, students can feel a connection with the teacher. This will lead to increased creativity and, most importantly, conversation. The layout essentially forces teachers and students to talk with each other, encouraging participation. With a roundtable presentation, students will also feel obliged to provide their own opinions. Now, one of the primary challenges in a modern classroom is promoting interest in the course material. Traditionally, teachers tend to resort to “pay attention or you’ll fail,” leading to rote learning and pressure. In my opinion, academic performance should be based on projects and everyday participation. If this is the case, then students will inevitably place their primary interest in discussions taking place in the classroom. One of the many interesting everyday learning tactics that I know about is as follows; in a math class, the teacher would write down a challenging problem on the right-hand side of the whiteboard, requiring a deepened understanding of course material and critical thinking skills. The student who solved the problem would write down a complete solution below the question, and would be awarded with treats, thus providing motivation. This is only one of countless tactics that teachers can use to incite enthusiasm in students. More often than not, when a student is having trouble in school, it is not because he/she is incapable of high academic performance, but rather because he/she does not obtain much-needed attention in class. This is understandable, because if discussions are discouraged in the classroom, then the teacher will not be able to grasp the strengths and weaknesses of the student. With a different classroom design, however, this trend can potentially be reversed. For your consideration, Jason ",
            "date": "Answered November 18, 2017",
            "views": "860",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jocelyn Chin",
                    "user_href": "/profile/Jocelyn-Chin-5"
                },
                {
                    "user_id": "JunLin Chen",
                    "user_href": "/profile/JunLin-Chen-6"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Maxim Declercq",
                    "user_href": "/profile/Maxim-Declercq"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brandon Teasdale",
                "href": "/profile/Brandon-Teasdale-1"
            },
            "answer_text": "Universal, robust wifi that allows students to stream in class at the same rates they stream at home.2. A cheap, durable laptop that students can use to complete school work, and that is assigned to them to use at school as well as at home. Chromebooks, but built to milspec. 3. An effective system of formative assessment and feedback designed to measure each student’s progress towards mastery and tailor instruction to that student’s specific needs. 4. A classroom setup that encourages students to work cooperatively. Furniture that’s easy to move into different configurations for students. 5. Open access to web content, but where the teacher can monitor student use (think Apple Classroom). 6. An environment where the teacher is seen as a coach and facilitator, helping students perform to their best abilities. ",
            "date": "Answered November 14, 2017",
            "views": "240",
            "upvotes": "0"
        }
    ]
}