{
    "title": "In a class, 30 students passed in maths, 20 passed in physics and 8 students passed in both. How many students failed in both if the class has 45 students? - Quora",
    "tags": [
        "Students",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Haimi Praharaj",
                "href": "/profile/Haimi-Praharaj"
            },
            "answer_text": "This can be easily solved using the concept of Venn Diagram:-  The left circle represents the students who passed in Maths. The right circle represents the students who passed in Physics. The area in the middle, which is shared by both the circles, denotes the students who passed both the subjects. The unshaed area, or the area that lies outside the circles, is the area that debotes the students who have pases neither in physics nor in maths. Students who have passed only in Physics = 20–8=12 (This is because the 20 students who have passed physics also include the 8 students who have passed both maths and physics. We wish to find the number of students who passed only in Physics ) Similarly, Students who have passed only in Maths = 30–8=22 (This is because the 30 students who have passed maths also include the 8 students who have passed both maths and physics. We wish to find the number of students who passed only in maths.) So, the total number of students in the class who passed atleast something = students who passed only in maths + students who passed only in physics + students who passed in both = 22 + 12 + 8 = 42 students in total who have passed atleast something. Total students in the class = 45 Passed students in the class=42 Number of students who didn't pass in anything = 45-42 = 3 (that's the answer)! ",
            "date": "Answered August 9, 2019",
            "views": "79",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Javi Haseeb",
                    "user_href": "/profile/Javi-Haseeb"
                },
                {
                    "user_id": "Hritik Chourasia",
                    "user_href": "/profile/Hritik-Chourasia-2"
                },
                {
                    "user_id": "Dinesh Dinesh",
                    "user_href": "/profile/Dinesh-Dinesh-1282"
                },
                {
                    "user_id": "Siddhant Indave",
                    "user_href": "/profile/Siddhant-Indave-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "C. S. Sharma",
                "href": "/profile/C-S-Sharma-14"
            },
            "answer_text": "Friends…! In a class, 30 students passed in maths, 20 passed in physics and 8 students passed in both. Students who have passed only in Physics = Total students passed in Physics - number of students passed in both physics and math 20 – 8 = 12 students Students who have passed only in Maths = Total students passed in Math - number of students passed in both Maths and Physics 30 – 8 = 22 students The total number of students in the class, who have passed atleast in some subject = Students who passed only in Maths + students who passed only in Physics + students who passed in both Maths and Physics = 22 + 12 + 8 students = 42 students Thus out of total 45 students, 42 students have passed atleast in some subject Number of students who have failed and could not pass in any subject 45 - 42 = 3 students Thus, out of 45 student 42 passed in some subject, while 3 students failed and could not pass in any subject. Answer out of total 45 students, 42 students passed in some subject, while 3 students failed and could not pass in any subject. ",
            "date": "Answered August 29, 2019",
            "views": "55",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Akash Gosai",
                    "user_href": "/profile/Akash-Gosai-11"
                }
            ]
        }
    ]
}