{
    "title": "In our education system, why is only bookish knowledge tested? - Quora",
    "tags": [
        "Bookish",
        "Education Reform",
        "Educational Systems",
        "Knowledge"
    ],
    "response": [
        {
            "author_info": {
                "name": "Biresh Kumar",
                "href": "/profile/Biresh-Kumar-35"
            },
            "answer_text": "Because by and large our education system followed the mastery model of learning where emphasis is on developing mastery of the subject matter prescribed under a course. It is defined as the minimum level of attainment to satisfy the basic requirements of a teacher,board or a university.this model of learning was introduced by the great educationist and architect of taxonomy of educational objectives prof Benjamin s bloom who was the education advisor to the government of india from1957 to 1959. ",
            "date": "Answered August 23, 2018",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tanuj Negi",
                "href": "/profile/Tanuj-Negi-2"
            },
            "answer_text": "Why blame only the system when everyone is contributing to the mess? Schools want to produce better results in exams (which, in turn, are driven solely by syllabus).Higher education institutions prefer to admit top-rankersParents want to admit their children in schools which produce toppers.Publishers and writers of academic books and resources want to sell as much as possible.Students want to study as less as possible.Policy makers rarely have a clue of what really works on the ground (and why)The first priority of teachers is to cover what the syllabus says (this is due to a variety of reasons - internal and external). Since multi-modal delivery and assessment takes more effort, money and time, very few teachers attempt it.",
            "date": "Answered August 29, 2018",
            "views": "288",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Vedant Gaikwad",
                    "user_href": "/profile/Vedant-Gaikwad-4"
                }
            ]
        }
    ]
}