{
    "title": "In the USA, is it possible to become a high school teacher at the age of 18? - Quora",
    "tags": [
        "High School Teachers",
        "Teachers",
        "Teaching",
        "The High School Experience",
        "Teenagers and Teenage Years",
        "Education",
        "The United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Van Vlack",
                "href": "/profile/Scott-Van-Vlack-1"
            },
            "answer_text": "In order to become a high school teacher in the U.S., you need three things. First, a four year Bachelor’s degree from an accredited (not online) college approved by your state’s department of education. Second, a passing score on the teacher Praxis tests, of which there are three parts now. Your state will require a certain score. The third thing you need is a teaching certificate, issued by the state department of education. In order to get one of those you need to go through some sort of student teaching or internship. That usually lasts a semester and is part of your college experience. Even if you graduate from high school at 15 or 16, you will still not have all of these things done by the time you are 18. Also, many school systems are hesitant to hire a young teacher with no experience. Some systems think that a young teacher will not be able to command the respect required from students only a few years younger than them. Most younger teachers start out at the middle school level and are then transferred to high school when they have proven themselves. ",
            "date": "Answered October 20, 2020",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Laura Riggs",
                "href": "/profile/Laura-Riggs-23"
            },
            "answer_text": "Theoretically, it is possible. If someone were to graduate high school at 14, which does rarely happen, and then graduate college at 18, the person would meet education requirements to teach in the US. However, it is extremely unlikely that a person who is able to finish high school 4 years early would want to teach high school. It seems most of the kids like that, that you read about want to become scientists. I think an 18-year-old college graduate would also have a hard time finding a principal willing to hire him/her due to the age factor. Many years ago, you did have women that young who taught K-12 schools. Laura Ingalls Wilder, who wrote the Little House books is an example of such a person. She had students older than she, and she hadn’t even finished high school when she became a teacher. ",
            "date": "Answered October 19, 2020",
            "views": "113",
            "upvotes": "0"
        }
    ]
}