{
    "title": "In the long run does it really matter where you get your degree from or what college you go to? - Quora",
    "tags": [
        "College and University Life Advice",
        "The College and University Experience",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keith Lindsey",
                "href": "/profile/Keith-Lindsey-3"
            },
            "answer_text": "There are 2 areas where it makes a difference where you get your degree - Academics and Networking. ACADEMICALLY: The material that is taught in the classroom will be essentially the same no matter where you go to school - there are only so many textbooks to choose from. But elite schools will teach in different ways, and usually require more effort, and you will benefit from interacting with more motivated peers, so the opportunity for a better education is there for you. But you don't need to go to an elite school to get that better education. A motivated student at a state school, who is trying to learn the material (rather than just trying to get a satisfactory grade) can do that extra work and visit the professors during office hours to get a deeper understanding, and end up with a better education than a person who is just trying to graduate from Harvard. Networking: If you graduate from an Ivy League school (or equivalent), you will always have that on your LinkedIn page. Some companies will hire you just so they can say they employ Ivy League grads. But you may not want to work there. It would be like living in a fish bowl, with everybody watching your every move. But that is appealing to some people. If you know which state you want to live in after you graduate, you should try to go to the best school in that state - “best” being a relative term - that means the school that offers the most to you, individually. Do not let US News & World Report tell you which is the best school, because they don’t even know you. Would you do better at a big school with auditorium classes, or a small school with more professor face time? Do you want to live close to home or far away? Is there a school with a good reputation in a subject that you want to study? Do you need to minimize the amount of debt that you will incur? The companies that rank schools don’t consider the things that are most important to you. You are going to pay $100,000 for your Bachelor’s degree - you need to put more thought and research into the decision than just saying “Oh, I have always dreamed of going to Harvard” - if you have not been working your ass off in high school, getting straight A’s in AP classes, doing a wide variety of extracurricular activities, student government, sports, and volunteering in your community, then you haven’t been dreaming of going to Harvard as much as your competition has. Get over Harvard and start figuring out which school really offers the things that you need, and will help you get started on the right foot. If you know what you want to do for a living, then do some research and find out which schools have the best programs. If you want to be an Engineer, then go the the best Engineering school you can get into. And don’t just Google “Best degree for…” - that will only give you a list of schools that have paid that website to promote them. Use your head and think about it - If you want to work in Tourism, you can get a degree in Hospitality Management from UNLV or UCF and work in the industry while you take classes - that will always look good to employers. If you want to work in the Fossil Fuel industry, go to school in Houston - that is where the schools have strong relationships with the companies in that industry. Every region is famous for something - figure out what you want to do, figure out the place in the country that is doing that the best, then figure out the schools that are tapped into that. Also consider that if you want to be a Teacher, it doesn’t matter where you get your degree - teachers will always be in demand and nobody really cares if you went to a “prestigious” school. Nearly the same thing can be said if you plan on majoring in Art History or University Studies (or nearly any Liberal Arts, Humanities, or any major with the word “Interdisciplinary” or “Studies” in it. I’m not trashing those majors, but I am saying that very few job descriptions list these degrees as a requirement) - but for a different reason - it doesn’t matter where you get your degree, because nobody is going to be hiring in those fields, so nobody will be impressed or unimpressed by your school. Some people plan on joining fraternities or sororities. A lot of them choose a fraternity based on which one looks like the most fun. That’s probably a mistake. Instead, figure out which fraternities have active alumni chapters, and then start researching where the alumni work. This could provide you with valuable networking opportunities that could last a lifetime. Finally, if you want to work toward a Bachelor’s Degree, do not go to a Community College. A lot of people who don’t know how things work will tell you that is the best place to start, because it is cheaper and it will teach you the same material. In theory, those people are correct. But in practice, most people who start Community College never finish their Bachelor’s Degree (a recent study [1] found that at one Community College, 81% of incoming freshman said they wanted to earn a Bachelor’s Degree, yet only 33% transferred to a 4 year school, and only 14% ended up getting a Bachelor’s Degree within 6 years.) If you want to earn an Associate’s Degree, or some type of job certificate, a Community College is a great choice. But if you want to earn a Bachelor’s Degree, a Community College is a trap and very few people can escape it. If you really want to get a Bachelor’s Degree, but can’t attend a 4 year university, then get a job or join the military and SAVE, SAVE, SAVE your money. Work for 2, 3, or 4 years, and then go to university (if you join the military, they will pay for a lot of your school. Plus - you will be much more mature than the typical college student and you will find college to be much easier than your work was.) Finally (no, this is really my last Finally), WHERE you get your Bachelor’s Degree is not nearly as important as where you get your graduate degree. If you really did want to go to Harvard, but didn’t get accepted there, then go to a state school and knock it out of the park, and then get your Master’s at an Ivy League school and you will be far better off. 1 - From the Community College Research Center at Columbia University Teachers College “Community College FAQs.” ",
            "date": "Answered December 3, 2019",
            "views": "27",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Safwan Zia",
                    "user_href": "/profile/Safwan-Zia"
                },
                {
                    "user_id": "Calista Castellanos",
                    "user_href": "/profile/Calista-Castellanos"
                },
                {
                    "user_id": "Adam Mitchell",
                    "user_href": "/profile/Adam-Mitchell-169"
                },
                {
                    "user_id": "Teri Bergin",
                    "user_href": "/profile/Teri-Bergin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas B Walsh",
                "href": "/profile/Thomas-B-Walsh"
            },
            "answer_text": " I have two studies in front of me that say your degree is more important than your school. I have a study that says, if you intend to get a liberal arts degree, it needs to be from a top school. The same study shows that for degrees like engineering it’s not that important. (Don’t shoot the messenger. I recognize the value of a technical degree from schools like Stanford and MIT. I’m concerned about your average kid choosing a college.) In the US today navigating from that day when you go up on stage to receive your high school diploma— then successfully through college—on to the day when you report for your first (well-paying ) job is like threading a needle—very tricky. There just aren’t anywhere near enough good jobs given the army of young high school graduates (40+%) who chose to go to four year colleges. For every four students who matriculate only one graduates and gets a good job. (Department of Labor) (Half of those who graduate are under employed or unemployed.) This doesn’t say anything about student loan debt. Even if you graduate and get a job making $60,000 you can end up in your parent’s basement if you have too much debt. College today isn’t an investment. It’s a speculation. You can improve your odds by: Identifying a marketable major and a target occupation. (You can’t make an intelligent decision about student loans unless you have a targeted first year’s salary.)Choosing the best school, strong in your major, that will accept you, and that you can afford.Preparing a financial plan for the term of the targeted degree that avoids excessive debt.Preparing an academic plan that enhances your resume with experiential learning.Selecting a school that is connected to the real world—where the jobs are.These are the “best practices” for surviving college today. Fifty years ago (when only 7% went to college) I didn’t do any of these things, and it didn’t make a bit of difference. I had a great thirty-five year career in IT and sailed happily into a comfortable retirement. College in America doesn’t work that way anymore. (And it doesn’t work the way it did twenty-five years ago when your parents graduated.) One of the major reasons for that is that the cost of tuition has increased more than 200% since then. (See chart.) The second major reason is that the US job market has undergone a restructuring since the turn of the century with the Great Recession of 2008 being the last straw. Today many college degrees just don’t have much of a return on the investment of time and money required, and, with one in four loans in default and delinquency, it is shortsighted to ignore the risk.  ",
            "date": "Answered November 24, 2016",
            "views": "151",
            "upvotes": " View 30 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maureen Serri",
                    "user_href": "/profile/Maureen-Serri"
                },
                {
                    "user_id": "Shahab Sheikhzadeh",
                    "user_href": "/profile/Shahab-Sheikhzadeh"
                },
                {
                    "user_id": "Calista Castellanos",
                    "user_href": "/profile/Calista-Castellanos"
                },
                {
                    "user_id": "David Verret",
                    "user_href": "/profile/David-Verret-1"
                },
                {
                    "user_id": "Aaron Retherford",
                    "user_href": "/profile/Aaron-Retherford"
                },
                {
                    "user_id": "Alexander Murphy",
                    "user_href": "/profile/Alexander-Murphy-11"
                },
                {
                    "user_id": "Annora Andrews",
                    "user_href": "/profile/Annora-Andrews"
                },
                {
                    "user_id": "Patrick Smith",
                    "user_href": "/profile/Patrick-Smith-586"
                },
                {
                    "user_id": "Alejandro Solà",
                    "user_href": "/profile/Alejandro-Solà"
                },
                {
                    "user_id": "Jithin Joy",
                    "user_href": "/profile/Jithin-Joy-31"
                }
            ]
        }
    ]
}