{
    "title": "Is 32GB enough for the 2018 iPad? I plan on getting the Apple Pencil with it and use it mainly for university. - Quora",
    "tags": [
        "iPad 2018",
        "Apple Pencil",
        "iPad"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arindam Lahiri",
                "href": "/profile/Arindam-Lahiri-8"
            },
            "answer_text": "Personally speaking No I dont think so. With 4k photos and videos and writing and all the things we will be doing on the iPad 2018 I doubt it will suffice anyone. You will probably end up with full storage in a few months. Generally people dont buy iPad every year or two, iPads last long and we use it for years (atlest 3–4) so given that timeframe you will need a bigger storage. My current iPad Pro is 256 gb I guess I am close to 80 gigs of usage. 256 is probably an overkill but 128 gb will be perfect. Since the new iPad comes in 32 and 128, I suggest to go with 128gb. But can 32gb can at all be used for long time? Absolutely. Just that you need to do some memory management yourself, Specially with photos and videos. Have only the apps required. Move photos to cloud storage and remove from local (icloud, google photos, One drive etc). That way 32gb can be used for as long as you want. ",
            "date": "Answered June 5, 2018",
            "views": "394",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sway",
                    "user_href": "/profile/Sway-43"
                },
                {
                    "user_id": "Saurav Verma",
                    "user_href": "/profile/Saurav-Verma-309"
                },
                {
                    "user_id": "Natjwa Aulia",
                    "user_href": "/profile/Natjwa-Aulia"
                },
                {
                    "user_id": "Syed Arsalan",
                    "user_href": "/profile/Syed-Arsalan-83"
                },
                {
                    "user_id": "Abhijeet Das",
                    "user_href": "/profile/Abhijeet-Das-48"
                },
                {
                    "user_id": "Suman Pal",
                    "user_href": "/profile/Suman-Pal-253"
                },
                {
                    "user_id": "Amit Chaudhari",
                    "user_href": "/profile/Amit-Chaudhari-31"
                },
                {
                    "user_id": "Óscar Medina",
                    "user_href": "/profile/Óscar-Medina"
                },
                {
                    "user_id": "Aman Kumar",
                    "user_href": "/profile/Aman-Kumar-8151"
                },
                {
                    "user_id": "Golam Sarowar Shuvo",
                    "user_href": "/profile/Golam-Sarowar-Shuvo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Naegele",
                "href": "/profile/Andrew-Naegele"
            },
            "answer_text": "The newer generation iPads and iPhones don’t require AS MUCH storage because they store things differently, my understanding is either the format or the way they compress the images/videos requires nearly half the storage as in the past. (Google info on the newest chip and storage for additional info) With that being said, I also utilize iCloud and think it is great! It makes it easiest to store docs and such from computer, iPad, and iPhone all in one places with iCloud and the file manager etc. For MOST it would be sufficient with use of the cloud and being used for schoolwork only. As you don’t need a lot of apps, docs typically can be moved to cloud or Google Drive etc and don’t need to be stored on the iPad itself. MOST don’t need more storage. However, if you want to put everything on the iPad and not use iCloud (bad idea, and much less convenient IMO) then you would definitely need additional storage. Lastly consider how many apps and things like that you’ll have on it, too. But again, iOS 11 is all about adding ways to save storage by offloading unused apps, more storage options and items that can be stored on iCloud, etc. ",
            "date": "Answered July 9, 2018",
            "views": "236",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paartha Sarathy",
                    "user_href": "/profile/Paartha-Sarathy-2"
                },
                {
                    "user_id": "Abhijeet Das",
                    "user_href": "/profile/Abhijeet-Das-48"
                },
                {
                    "user_id": "Christy Cox",
                    "user_href": "/profile/Christy-Cox-6"
                },
                {
                    "user_id": "Umang Mehta",
                    "user_href": "/profile/Umang-Mehta-30"
                },
                {
                    "user_id": "Amanpreet Singh",
                    "user_href": "/profile/Amanpreet-Singh-28"
                },
                {
                    "user_id": "Vadder85 .",
                    "user_href": "/profile/Vadder85"
                },
                {
                    "user_id": "Sukhvit Vilaskhamphir",
                    "user_href": "/profile/Sukhvit-Vilaskhamphir"
                }
            ]
        }
    ]
}