{
    "title": "Is 55 years old too late to go back to college and undertake a degree course? - Quora",
    "tags": [
        "50s (age)",
        "Higher Education",
        "Education",
        "College Advice",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pat Beu",
                "href": "/profile/Pat-Beu"
            },
            "answer_text": "Heavens no. Having said that I recommend the following: take the time to determine how your schedule will need to adjust to the commitment of being a student. If you are taking classes online, there is greater flexibility. But some desire the enjoyment of face-to-face classes, which requires adjusting to a college’s schedule and timeline. Online classes are inherently more flexible, especially for an adult with work, family, or other obligations. But that flexibility often promotes procrastination.look at your financial resources and plan for investment of finances as time. The commitment of resources to be a successful college student either implies you have adequate savings, you will be taking on more work to compensate, or you will be sacrificing. Worth it? Sure. But be prepared.At 55 you might have relationship issues that you will have to confront. A significant other may not be committed to your long haul education. Communication is the key. Getting a degree is not a short term commitment. All family members will need to be supportive and helpful. You will have tests to study for, papers and projects that will take you away from other free time commitments, and a recognition that after four months you will have to repeat the same process again, and then again.Finally I recommend that you access the resources schools provide: a financial aid officer to discuss possible grants or low-interest loans, an academic advisor to help you plan your class schedule to graduation, the tutoring center to help with those difficult classes, and a career center to assist in preparing you to be ready to apply what you learn in college to the job that you want.Good Luck! ",
            "date": "Answered June 17, 2020",
            "views": "230",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kenneth Gaughran",
                    "user_href": "/profile/Kenneth-Gaughran"
                },
                {
                    "user_id": "Lee Meeks",
                    "user_href": "/profile/Lee-Meeks-2"
                },
                {
                    "user_id": "Paul Savage",
                    "user_href": "/profile/Paul-Savage-46"
                },
                {
                    "user_id": "Murat B. Ozkan",
                    "user_href": "/profile/Murat-B-Ozkan"
                },
                {
                    "user_id": "Shelli King",
                    "user_href": "/profile/Shelli-King"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin J Pitt",
                "href": "/profile/Martin-J-Pitt"
            },
            "answer_text": "Not at all, if it is what you want to do. Many people do, even older. Presumably you can afford the time and the cost. Depending on your profession, you may be able to continue with part-time work, but beware of the temptation to miss classes for this, and do not find yourself in conflict with work project deadlines and student coursework. Either commit or do not. Again it might depend on your profession and your desire if you expect the degree to support your career afterwards. A master’s giving you particular skills is likely to be fulfilling and personally worthwhile. Starting a totally new career may be difficult in competition with (a) other fresh graduates who are younger (b) young graduates with a few years experience. However, you know your situation. Perhaps you are wondering if you could manage it? Well, the hours are easy compared with normal working life. You will also (probably) not be distracted by sudden freedom away from school and parents, booze and sex. But your peers are just carrying on learning for exams from school, and it may take you some time to get into it. However at this age you will have the maturity (in particular the low cunning) to adapt and recognise what actually needs to be done and the work habit to just get on with it instead of leaving things till the last minute. It’s not too old. ",
            "date": "Answered June 22, 2020",
            "views": "85",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kathryn Berck",
                    "user_href": "/profile/Kathryn-Berck-3"
                }
            ]
        }
    ]
}