{
    "title": "Is Amravati safe or not? - Quora",
    "tags": [
        "Government College of Engineering, Amravati"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vivek Fadat",
                "href": "/profile/Vivek-Fadat-1"
            },
            "answer_text": "Yes indeed, It is one of safest city as I have ever seen. I undergraduate from Sant gadge Baba Amravati University and lived in Amravati for 3 year. In 3 year of graduation I witnessed love of Amravatikars towards others , communal harmony between them, calmness, discipline and respect for others. How Amravati kar is so peaceful and how amravati city is safest? For better answers for such type of questions we need to see that particular area by historical perspective. In British regime, vidharbha was desperately affected and also played major role for freedom, After 1857 's freedom fighters retaliatory war and british government atrocities on innocent people diluted vidharbha's common man and many tribal communities. To compensate , sympathies and raise patriotism in youth and various tribes rashtra saint tukdoji maharaj organised various campaign whereas sant gadge baba did unforgettable social work by bringing deprived sections of society in mainstream by his kirtans, bharuds (devotional speeches or motivational ideas) . People of Amravati is peaceful, adorable because amravati city had got great saint like saint gadge baba, Rashtra Saint Tukdoji maharaj. The people living there conceive thoughts, ethics of these great saints who vanished poverty , campaigned cleaness program, obssesed patriotism in youth accomplished row of prosperity in 19’s Era,. Even this Era also Amravati kar posse's thought of these great sant that's why people there is so loveable and open hearted. They never discriminate, never use bad words without any reason. Despite Marathi is spoken there,They are highly accustomed with people with their language they will give them proper direction. In my graduation period i have not heard or seen and not even read in newspaper about any mob lynching, riots in amravati city . If you have got to go amravati test sambarwadi, palak wada, Gila wada many more and roam near by places like Melghat tiger sanctuary, chikhaldara, malkhed, shiv tekdi,bhim tekdi, bamboo guarden, vadali talav, holy places of sant tukdoji maharaj and saint gadge baba. ",
            "date": "Answered June 1, 2019",
            "views": "509",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shubham Mishra",
                    "user_href": "/profile/Shubham-Mishra-375"
                },
                {
                    "user_id": "Ruchika Kolitkar",
                    "user_href": "/profile/Ruchika-Kolitkar"
                },
                {
                    "user_id": "Raja Sekhar Telagathoty",
                    "user_href": "/profile/Raja-Sekhar-Telagathoty-1"
                },
                {
                    "user_id": "Adarsh Srivastva",
                    "user_href": "/profile/आदर्श-श्रीवास्तव-Adarsh-Srivastva"
                },
                {
                    "user_id": "Abhishek Vayase",
                    "user_href": "/profile/Abhishek-Vayase-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ankit Naphade",
                "href": "/profile/Ankit-Naphade"
            },
            "answer_text": "In fact, its one of the safest city. Safe in all aspects. No religious rebel destructions as it happens in nearby cities and towns, no rape cases and no open robbery on roads. You will see late night hang outs of people here. Couples roam for free and safely. Nobody harms. Some famous food joints and restaurants are open till mid night 12.30 for people and families, couples and groups all kinds of people enjoy. Police check posts are regular in city during day and night. Patrolling is very strict in city and its there in every area whole night. When I roam outside at late nights even I was questioned many times by police. They ask you the reason and check for drunk cases. No one will harass you unnecessarily. Its safe and cool. ",
            "date": "Answered May 5, 2018",
            "views": "657",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ruchika Kolitkar",
                    "user_href": "/profile/Ruchika-Kolitkar"
                },
                {
                    "user_id": "Nishigandha Ingle Patil",
                    "user_href": "/profile/Nishigandha-Ingle-Patil"
                },
                {
                    "user_id": "Radhika Gadve",
                    "user_href": "/profile/Radhika-Gadve-1"
                },
                {
                    "user_id": "Kaustubh Ramteke (कौस्तुभ रामटेके)",
                    "user_href": "/profile/Kaustubh-Ramteke-कौस्तुभ-रामटेके"
                },
                {
                    "user_id": "Saurabh Lunge",
                    "user_href": "/profile/Saurabh-Lunge"
                },
                {
                    "user_id": "Krushikesh Gawande",
                    "user_href": "/profile/Krushikesh-Gawande"
                },
                {
                    "user_id": "Akshay Khule",
                    "user_href": "/profile/Akshay-Khule"
                },
                {
                    "user_id": "Pooja Gadve",
                    "user_href": "/profile/Pooja-Gadve"
                },
                {
                    "user_id": "Ujwal Bhagat",
                    "user_href": "/profile/Ujwal-Bhagat"
                },
                {
                    "user_id": "Jayshree Harinkhede",
                    "user_href": "/profile/Jayshree-Harinkhede"
                }
            ]
        }
    ]
}