{
    "title": "Is a Sikkim Manipal degree accepted abroad? - Quora",
    "tags": [
        "Sikkim Manipal Institute of Technology",
        "Sikkim Manipal University",
        "Manipal Institute Of Technology (MIT)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shrikant Umarye",
                "href": "/profile/श्रिकांत-उमरय-Shrikant-Umarye"
            },
            "answer_text": "India is the only country that has implemented gurukulsystem and has written words in Sanskrit, even before any dialect was created. This just emphasizes the importance of learning in our system. So here we list the top universities of India that have proven to be the best over the period of years. Government-aided Universities There are universities across India that gets financial aid or funds from the government for maintaining their education system. These funds help the institutes with various purposes like infrastructural development and academic activities. The main advantage of aided universities is that the fees structure is inexpensive. there is a controversy of sikkim manipal university there are two mopinions’i place them below : wsQuestion & Answer  ambush trivandrum India 1 Review BEWARE! SMU DE is unrecognized. Jul 26, 2015 10:50 AM 22179 Views Academics: Administration: Extracurricular Programs: Alumni Network: I am doing final year BA form sikkim manipal. I recently found out that my course is wholly unrecognized. 1) SMU is unrecognized from 2012. In 2012 Distance education council, which was in charge of regulating distance education was dissolved and the responsibility was taken up directly by the UGC. They inspected and asked sikkim manipal to shut down all study centres outside the state becuase it was against UGC and DEC regulations which doesn't permit any university other than IGNOU to provide distance education outside its own state. SMU moved the sikkim high court. Who stayed the order. So SMU continued to take students under the weight of this stay order. But on 26 june 2015 judgement came from the sikkim high court that SMU is bound by the order of UGC to shut down off campus study centers. So anyone who joined after 2012, doesn't have a valid degree. But all this is not important because// 2) SMU is not recognized by anybody. I am not talking about universities, PSUs, or Private companies. You won't get job as an rickshaw driver with the degree. SMU is not accepted by IGNOU or any recognized university in India or abroad for higher education. It is not recognized by any state PSC or SSC. This is not just for students who joined after 2012. Even students who got degree before 2012 don't have a degree with any value. I don't think even sikkim PSC accepts SMU. It carries no weight in the private sector. If anything, listing SMU in your resume will be seen as a negative when applying for jobs. SMU has bad reputation among recruiters, listing this degree would invite hard questions from the interviewers who would be trying to discredit you. Sikkim Manipal UniversitySikkim Manipal University was established in 1995, is a co-educational public-private funded university. It was founded in accordance with the Sikkim Manipal University of Health, Medical and Technological Sciences Act, 1995. The motto was for imparting exemplary education opportunities and medical services in the State of Sikkim and country wide. Note of caution – There are many universities those might be registered and seem legit, but the consent to award accredited certification may not be given, making their certificates stand void of recognition. Before choosing a college or a specialization subject, it is necessary to look for the best universities that offer your required subjects and related facilities. ",
            "date": "Answered December 1, 2018",
            "views": "649",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Krishnendu Chakrabarty",
                "href": "/profile/Krishnendu-Chakrabarty"
            },
            "answer_text": "Sikkim Manipal is an ideal institute. It helps to develop as a complete human values. It is a great place of learning. Alumnus from SMIT are very well placed in India and abroad. ",
            "date": "Answered November 30, 2018",
            "views": "272",
            "upvotes": "0"
        }
    ]
}