{
    "title": "Is a 3.8 unweighted GPA and 8 APs good enough for top tier schools? - Quora",
    "tags": [
        "Advanced Placement (AP) Courses",
        "Grade Point Average and University Admissions",
        "Grade Point Averages"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hunter Whaples",
                "href": "/profile/Hunter-Whaples-1"
            },
            "answer_text": "I have to agree with Eric Eng in his answer to this question. It is difficult to get admitted to top tier colleges today because of the large number of applicants from all over the world. The days are over where you could simply get good grades in grade school and college college acceptance letters. What I want to make clear is: For modern college admittance - grades are not enough. And to be completely honest, classes are not enough either. Do not think that you will not get admitted to a top tier school because of your classes/GPA. You obviously have done well in your studies, but undergraduate college admissions are looking for more. You meet the baseline for a top tier undergraduate admissions committee to consider your application, but I have a feeling you want more than … consideration. When you are applying make sure that you make it clear that something sets you apart from the application pool - grades cannot be that something. Write good personal essays explaining who you are and why you would be a good match for a top tier institution. Get great letters of recommendation demonstrating a good relationship with mentors. And most importantly - get out of your books and do something. Find something you like, anything, and get outstanding at it. In the end these institutions are looking for motivated and exceptional students - not a number or set of classes. ",
            "date": "Answered January 20, 2018",
            "views": "23",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eglah Belizor",
                    "user_href": "/profile/Eglah-Belizor"
                },
                {
                    "user_id": "Alexis Raymond",
                    "user_href": "/profile/Alexis-Raymond-14"
                },
                {
                    "user_id": "Lakshay Sood",
                    "user_href": "/profile/Lakshay-Sood"
                },
                {
                    "user_id": "Syed Hasan",
                    "user_href": "/profile/Syed-Hasan-82"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Eng",
                "href": "/profile/Eric-Eng-3"
            },
            "answer_text": "The 3.8 UW GPA is a little low, especially if you earned those B’s in the core courses. I recommend a 3.9+ to be competitive. Though to be honest, I’ve helped students get into the Ivy League with as low as a 3.3 GPA. When your GPA is low, you really have to craft together a powerful application to give yourself a fighting shot at getting in. ",
            "date": "Answered October 3, 2017",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Benjamin Van Setters",
                    "user_href": "/profile/Benjamin-Van-Setters-1"
                },
                {
                    "user_id": "Shivani Balaji",
                    "user_href": "/profile/Shivani-Balaji-5"
                },
                {
                    "user_id": "Olivia Louie",
                    "user_href": "/profile/Olivia-Louie-1"
                },
                {
                    "user_id": "Siyan Kabir",
                    "user_href": "/profile/Siyan-Kabir"
                }
            ]
        }
    ]
}