{
    "title": "Is a Coursera certificate useful? - Quora",
    "tags": [
        "Coursera",
        "Education and Career Advice",
        "Professional Certifications",
        "Colleges and Universities",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew Morris",
                "href": "/profile/Matthew-Morris-22"
            },
            "answer_text": "A2A... The existing answer by Waquar is reasonably comprehensive.  There's also several very similar questions in the 'Related Questions' -- which probably also have reasonable answers.  I'll give it a shot nonetheless. The 'correct' answer to your question hinges on the definition of 'useful'. If 'useful' to you means companies falling all over themselves offering to hire you because you have several Coursera certificates on your resume, the answer would be a resounding 'No'. I would give the same answer if you consider 'useful' to mean that employers would consider Coursera certificates equivalent to having a four-year degree. I think a better question wording would be 'In what situations would a Coursera certificate be useful?\" A couple of days ago in response to a Quora question, I recommended Coursera as part of my answer. A DBA wanted to learn more about financials in order to be able to offer suggestions for improved analysis and reporting of the information in the database he supported. Finance was not really his job, so pursuing a degree at a university would not have made sense for him. However, taking a few classes in Financial Accounting, Operations Management, or Intro to Finance could meet his needs. Coursera would be an excellent choice for that. For a job-seeker at the start of their career, listing some Coursera certificates on a resume can be used as \"white-space filler\" to keep the resume from looking quite so blank. I would never use them on my resume because after 25 years... I must spend time cutting mine down in order to fit on a single page. Even if you don't use the certificates on the resume, they might be useful during the interview. For example, if asked whether you have any knowledge of accounting, you could respond that you took these three Accounting classes on Coursera and can provide the certificates if they would like. In the end -- companies hire employees based on the skills and knowledge they can bring to the position. Coursera can be used to add to the knowledge you have. As such -- it can make you a more valuable employee. That knowledge may or may not help you to get hired, but if you've chosen the correct courses to take, it will help you to be more productive once you are hired. ",
            "date": "Answered April 19, 2016",
            "views": "1183",
            "upvotes": " View 223 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ajay Tanwar",
                    "user_href": "/profile/Ajay-Tanwar-136"
                },
                {
                    "user_id": "Yashwanth Sai",
                    "user_href": "/profile/Yashwanth-Sai-83"
                },
                {
                    "user_id": "Adesh S Badami",
                    "user_href": "/profile/Adesh-S-Badami"
                },
                {
                    "user_id": "Deepti Gupta",
                    "user_href": "/profile/Deepti-Gupta-35"
                },
                {
                    "user_id": "Shreyan Bose",
                    "user_href": "/profile/Shreyan-Bose-1"
                },
                {
                    "user_id": "Hamlaoui Skander",
                    "user_href": "/profile/Hamlaoui-Skander"
                },
                {
                    "user_id": "Sabelo Mayisela",
                    "user_href": "/profile/Sabelo-Mayisela-3"
                },
                {
                    "user_id": "Abhishek Sreekumar",
                    "user_href": "/profile/Abhishek-Sreekumar-2"
                },
                {
                    "user_id": "Amjad Nablsi",
                    "user_href": "/profile/Amjad-Nablsi-1"
                },
                {
                    "user_id": "Helen Wen",
                    "user_href": "/profile/Helen-Wen-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Sydor",
                "href": "/profile/Mike-Sydor"
            },
            "answer_text": "You get a reproduction certificate on your LinkedIn profile - which makes it at least as valuable as any other career information that you have listed there. MOOCs like Coursera are in their infancy, in terms of certifications and acceptance. The immediate challenge is the incredibly high drop-out rate - the percentage of folks that start but don’t finish. So a certificate is actually not at all a guaranteed outcome!! And conversely, it has to have more value than someone who simply ‘claims’ to have studies a particular topic. It is not like your university transcripts are on LinkedIn - it would be a privacy violation! But the whole world can see that I probably know more about Data Mining and Data Science than most folks because I have a certificate (and you don’t!). The certificate strategy is to generate a revenue stream. It is nice to have freely accessible learning but somebody has to pay for the time in the Amazon cloud to host a course for 10,000 students, and deliver the content. But it also needs to become convertible to University credit - for it to have real meaning in the long run. Then we will know that the online experience and outcomes, are equivalent to the physical University experience and outcomes. For sure, the physical experience has many advantages and represents a more understood form of education. But is the knowledge achieved really any different? I don’t so - but this is from someone who has a BS and MS from physical universities, and has supplemented their learning with many online certificate programs. I think I would have a very different outcome, career-wise, if I had never attended physical university. So I say: “go for it” Earn as many certificates as you are able, where it makes a rational part of your education and career plans. Most are only $50 - cheap! And I’m seeing a trend towards much more expensive pricing now and in the near future. Universities have their own infrastructure to pay for too. For sure, until the price of education is brought under control, MOOCs are putting positive pressure on Universities to open access to their learning materials. Certifications are here to stay and actual University-recognized credit is really the next piece to fall into place. The end result - better prepared students only serves to reinforce to postive outcomes for Universityies - more candidates, better prepared. And more graduates (with less debt) at the end. There is room for both approaches - and more. But the reality remains: motivated students will find a way to advance themselves. Weak students will drop off. The marketplace needs to respond appropriately. ",
            "date": "Answered March 6, 2017",
            "views": "118",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eunice Leparto",
                    "user_href": "/profile/Eunice-Leparto"
                },
                {
                    "user_id": "Srikanth Neelamraju",
                    "user_href": "/profile/Srikanth-Neelamraju-1"
                },
                {
                    "user_id": "Saad Shuaib",
                    "user_href": "/profile/Saad-Shuaib"
                },
                {
                    "user_id": "SHIYA ISMAIL",
                    "user_href": "/profile/SHIYA-ISMAIL"
                },
                {
                    "user_id": "Prameet Upadhyay",
                    "user_href": "/profile/Prameet-Upadhyay"
                },
                {
                    "user_id": "Nyore Achoja",
                    "user_href": "/profile/Nyore-Achoja"
                },
                {
                    "user_id": "Avinash Mohan",
                    "user_href": "/profile/Avinash-Mohan-2"
                },
                {
                    "user_id": "Agboli Victor",
                    "user_href": "/profile/Agboli-Victor"
                },
                {
                    "user_id": "Jonathan Reynaldo",
                    "user_href": "/profile/Jonathan-Reynaldo"
                },
                {
                    "user_id": "Arturo Lopez (US - IFS)",
                    "user_href": "/profile/Arturo-Lopez-US-IFS"
                }
            ]
        }
    ]
}