{
    "title": "Is a B.Com compulsory for becoming a CA? - Quora",
    "tags": [
        "Bachelor of Commerce Degrees",
        "Chartered Accountants (CA)",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sagar Patil",
                "href": "/profile/Sagar-Patil-467"
            },
            "answer_text": "It is depend on how you are doing CA through CPT or direct entry. If you are through direct entry then Yes doing Bcom benefit CA to some extent. But if you are through CPT rout then NO doing Bcom will not benefit CA. rather doing CA will benefit Bcom. I am through CPT route and when I cleared CPT with 100 marks in 2nd attempt with self study I left bcom for IPCC as there was no one to guide me it was my decision. When I joined classes for IPCC i saw that more than 90% students were pursuing Bcom but I was dedicated to only IPCC. What I was thinking that time is I don't need Bcom degree to earn money my knowledge is enough for me to earn money i don't wanted to do it just because of degree and back up plan. With my dedication i cleared IPCC group 1 in first attempt thought I failed to clear both group. But my best friend failed in both group though he has got very good marks in CPT. Main reson he told me that his Bcom exam. Bcom exam comes just before 1 month of IPCC exam. If those 15 days of Bcom exam he could have given to his weak subject then there was chance that he could have cleared it but his father forced him to give Bcom exam though he don't wanted to give. You need to set priority in your life. Don't follow croud instead create your own identity in croud. If you need Back up plan go for Bcom. If you believe in yourself then give 100% to CA Course. If you need both then set priority and give time. At the end you are the creator of your own journey. It is your choice. Thanks….. ",
            "date": "Answered July 5, 2017",
            "views": "69",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tenzin Choesang",
                    "user_href": "/profile/Tenzin-Choesang-22"
                },
                {
                    "user_id": "Pragesh Singh",
                    "user_href": "/profile/Pragesh-Singh-2"
                },
                {
                    "user_id": "Kailas Kale",
                    "user_href": "/profile/Kailas-Kale-27"
                },
                {
                    "user_id": "Rohit Samanta",
                    "user_href": "/profile/Rohit-Samanta-27"
                },
                {
                    "user_id": "Prasanna Reddy",
                    "user_href": "/profile/Prasanna-Reddy-361"
                },
                {
                    "user_id": "Monisha Gowda",
                    "user_href": "/profile/Monisha-Gowda-99"
                },
                {
                    "user_id": "Aditya Sawant",
                    "user_href": "/profile/Aditya-Sawant-237"
                },
                {
                    "user_id": "Tech World",
                    "user_href": "/profile/Tech-World-366"
                },
                {
                    "user_id": "PAVITHRA SURESH",
                    "user_href": "/profile/PAVITHRA-SURESH-49"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ARTIFLY-NET"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anurag Uppal",
                "href": "/profile/Anurag-Uppal-3"
            },
            "answer_text": "Its good to hear that you have been planning to go for CA course and make a career in this reputed profession. As far as we consider options in India for Commerce students CA is considered as one of the best career option available and hence many students after their commerce plan to make a career in the CA. Now there are 2 options available through which you can enter in CA Course: By appearing for Foundation Course for students after completing your class 12th.By Direct Entry Scheme for students who are Graduates/ Post Graduates with prescribed percentage marks conducted by any recognized University.For Foundation course students: Foundation Course comprises of four papers, out of which two are subjective and two are objective type. Negative marking for choosing wrong options is there in objective papers. Foundation Examinations are held twice a year in the months of May and November. Subjects covered in Foundation Course Paper-1: Principles and Practice of Accounting (100 Marks)Paper-2: Business Law & Business Correspondence and Reporting (100 Marks)Section A: Business Law (60 Marks)Section B: Business Correspondence and Reporting (40 Marks)Paper-3: Business Mathematics and Logical Reasoning & Statistics (100 Marks)Part I: Business Mathematics and Logical Reasoning (60 Marks)Part II: Statistics (40 Marks)Paper-4: Business Economics & Business and Commercial Knowledge (100 Marks)Part I: Business Economics (60 Marks)Part II: Business and Commercial Knowledge (40 Marks)For Direct Entry Scheme Students: Students who have completed their Graduation or who are going to complete can apply for the CA course through the Direct Entry Scheme. Under this scheme a student who has completed Graduation from Commerce need to have at least 55% marks in the graduation and should have studied any 3 subjects of 100 marks each - Accounting,Auditing,Costing, Taxation, Management Accounting, Business Administration. Through Direct Entry Scheme student do not need to give a Foundation exam and gets directly admitted for the IPCC group. After taking an admission under the Direct Entry Scheme a student can complete the CA course in 3 to 4 years. Whereas you also consider the 3 years of Internship. If we count together it will take around 5 - 6 years to complete the CA course. I hope you find this information useful and helpful. Feel free to get in touch again. Here are some other answers that might help you for your future: Which 3 tips do you recommend to students preparing for the Chartered Accountancy? What are some good career backup plans if a student is not able to complete the CA course? Why do most people fail to complete CA? ",
            "date": "Answered March 2, 2020",
            "views": "32",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sreshtha Chakraborty",
                    "user_href": "/profile/Sreshtha-Chakraborty-4"
                },
                {
                    "user_id": "Dhruvin Magdum",
                    "user_href": "/profile/Dhruvin-Magdum-1"
                },
                {
                    "user_id": "Rakeshshukla Rakeshshukla",
                    "user_href": "/profile/Rakeshshukla-Rakeshshukla"
                },
                {
                    "user_id": "Renu Uppal",
                    "user_href": "/profile/Renu-Uppal-6"
                }
            ]
        }
    ]
}