{
    "title": "Is Amity University a good college for any course? - Quora",
    "tags": [
        "Amity University"
    ],
    "response": [
        {
            "author_info": {
                "name": "Oshin Sharma",
                "href": "/profile/Oshin-Sharma-13"
            },
            "answer_text": "What do you mean by any course? Out of the 300+ courses it offers, Yes, Amity University is good for any course. Eligibility: You must be willing to spend 8 hours on campus and around 2 hours commuting.You must attend all classes because for every lecture you miss, you’ll lose a fraction of your internal assessment marks.Your parents must be willing to pay a handsome amount of money as academic fees.Desirable: To make your time at Amity the most productive and beneficial, you must: Be presentable, have friendly relation with the CR, have a laptop, and have at least one talent. Best of Luck.",
            "date": "Answered September 12, 2017",
            "views": "211",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ankit Gautam",
                    "user_href": "/profile/Ankit-Gautam-59"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vinita Goyal",
                "href": "/profile/Vinita-Goyal-9"
            },
            "answer_text": "See the course you want to pursue should be your priority rather than choosing the college you want to pursue it in. First of all, decide which course you want to go for, keeping in mind your interest and the course's scope. Then look out for the colleges' that allow you to pursue that very course. I've been a Delhi University as well as an Amity University student. According to me DU provides you with better knowledge and education of the subject than Amity does, as DU is a government aided one and Amity isn't. Talking about the infrastructure, DU lacks it and Amity has it all. Besides this, there's a huge attendance issue in Amity(has to be above 75 in each subject otherwise you won't be allowed to take exams in that very semester and eventually will be debarred) and timings too long(9am–5pm) In Du youngsters usually enjoy as there are no such long study hours nor such attendance issue. Also DU charges you just 4–15k annually whereas Amity fee is pretty high. You basically enjoy the luxury at Amity, and it also provides you placement if you rank high. ",
            "date": "Answered September 10, 2017",
            "views": "312",
            "upvotes": "0"
        }
    ]
}