{
    "title": "Is American Exceptionalism bad? Why or why not? - Quora",
    "tags": [
        "American Exceptionalism",
        "Bad",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christian Winter",
                "href": "/profile/Christian-Winter"
            },
            "answer_text": "Is American exceptionalism harmful or helpful? Clearly harmful. It’s the default excuse right wing politicians use to reject solutions to their problems that demonstrably work because the current system benefits them. That way perfectly fine solutions are never tried and the US suffers from massive problems that have been solved elsewhere decades ago. Typical examples are health care and higher education, where the US still insists on an exploitative system, the penitantiary system, where the mindless law and order approach makes everything worse, and drug policies, where criminalizing drugs creates massive problems with drug related crime while it in no way reduces drug use. US Americans could have universal health care, free higher education, a penitantiary system that concentrates on rehabilitation instead of punishment and which actually reduces crime and legal possession of drugs where addicts are treated as patients instead of criminals, which reduces crime and drug use. But some of them won’t have any of that because they want to believe in the US being so star spangled special that none of that would work for no proper reason at all. ",
            "date": "Answered February 19, 2020",
            "views": "11",
            "upvotes": " View 102 Upvoters ",
            "upvoters": [
                {
                    "user_id": "The Black Raven",
                    "user_href": "/profile/The-Black-Raven-1"
                },
                {
                    "user_id": "Rodrigo Serra",
                    "user_href": "/profile/Rodrigo-Serra-6"
                },
                {
                    "user_id": "Kristi Nochka",
                    "user_href": "/profile/Kristi-Nochka"
                },
                {
                    "user_id": "Derrik Pates",
                    "user_href": "/profile/Derrik-Pates"
                },
                {
                    "user_id": "Nev Anderson",
                    "user_href": "/profile/Nev-Anderson"
                },
                {
                    "user_id": "John Murphy",
                    "user_href": "/profile/John-Murphy-899"
                },
                {
                    "user_id": "Jan Verschueren",
                    "user_href": "/profile/Jan-Verschueren"
                },
                {
                    "user_id": "Ken Eng",
                    "user_href": "/profile/Ken-Eng-1"
                },
                {
                    "user_id": "Peter van Hooft",
                    "user_href": "/profile/Peter-van-Hooft"
                },
                {
                    "user_id": "Dean Jay Smith",
                    "user_href": "/profile/Dean-Jay-Smith"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chrys Jordan",
                "href": "/profile/Chrys-Jordan"
            },
            "answer_text": "Is American exceptionalism harmful — to whom? In the long term, it will be harmful to the USA. As Trump pushes the notion, he gets his crowds to cheer him. But his foreign policy is alienating Other Countries. In the future, America will no longer have the influence it once had. America will no longer have the prestige it once had. And American citizens will no longer be respected or even liked. Domestically, America will slide further behind. Americans will no longer have the know-how to keep up with the rest of the world, not with the Trump administration gutting public schools. That’s where American exceptionalism will lead the USA. At which point we can expect Trump’s followers to reject everything they’ve read because they want to feel that the USA is the best and to feel otherwise would be humiliating. So we can expect them to double down on their current isolationism. And we can expect future generations of Americans to be very sorry that they did so. ",
            "date": "Answered February 19, 2020",
            "views": "731",
            "upvotes": " View 43 Upvoters",
            "upvoters": [
                {
                    "user_id": "The Black Raven",
                    "user_href": "/profile/The-Black-Raven-1"
                },
                {
                    "user_id": "Mick Holland",
                    "user_href": "/profile/Mick-Holland-8"
                },
                {
                    "user_id": "Ana Aguilera",
                    "user_href": "/profile/Ana-Aguilera-4"
                },
                {
                    "user_id": "Shawna Ford",
                    "user_href": "/profile/Shawna-Ford-3"
                },
                {
                    "user_id": "Tom Borland",
                    "user_href": "/profile/Tom-Borland-1"
                },
                {
                    "user_id": "David Hansen",
                    "user_href": "/profile/David-Hansen-126"
                },
                {
                    "user_id": "Carl Lambie",
                    "user_href": "/profile/Carl-Lambie"
                },
                {
                    "user_id": "Sandra Hardy",
                    "user_href": "/profile/Sandra-Hardy-1"
                },
                {
                    "user_id": "John Richards",
                    "user_href": "/profile/John-Richards-190"
                },
                {
                    "user_id": "Johannes Walter",
                    "user_href": "/profile/Johannes-Walter-5"
                }
            ]
        }
    ]
}