{
    "title": "Is an online degree really considered an education by an employer? - Quora",
    "tags": [
        "Online Degrees",
        "Academic Degrees",
        "Employers",
        "E-learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jay Clark",
                "href": "/profile/Jay-Clark-189"
            },
            "answer_text": "Well, an online degree provides an education, so I suppose it doesn’t really matter what an employer thinks. Most “online” degrees don’t outright state that they are online. For example, if I get a bachelor’s from ASU, my degree will say: “Bachelor of Arts - Arizona State University” - it will have no indication that it was taken online. The reason for that is simple, if it showed any indication that the degree was online, that would mean that the university doesn’t view the degree as equal to their normal degrees. Essentially, if you want to get an online degree, get one; if you choose to follow this route, make sure the university you get it from treats it as an equivalent degree to their on-campus program. ",
            "date": "Answered March 10, 2020",
            "views": "53",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Huff",
                    "user_href": "/profile/Michael-Huff-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian McDonald",
                "href": "/profile/Ian-McDonald-23"
            },
            "answer_text": "Depends, in the UK the government set up the Open University. It’s degrees are accredited to professions such as the Unstitute of Physics and the Institute of Engineering and Technology. Professional bodies such as these work with the OU to shape degrees so they meet the needs of professions. Courses, standards and exams are all moderated by other universities, who in turn are also moderated. Employers will pay OU fees because they get degree educated staff with no loss of work time. Students learn to juggle work, study and family. So again better than a normal university. I studied at the OU plus London, Westminster and Portsmouth universities. The OU is incredible! I even got a lecturer who taught at Oxford University. ",
            "date": "Answered March 10, 2020",
            "views": "81",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Phillip Ross",
                    "user_href": "/profile/Phillip-Ross-14"
                }
            ]
        }
    ]
}