{
    "title": "Is an age of 21 late for college? - Quora",
    "tags": [
        "Early 20s (age)",
        "20s (age)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sam Joe",
                "href": "/profile/Sam-Joe-97"
            },
            "answer_text": "No its not, there are plenty of students (international and american) who don’t start college until they are 19–21. This could be because they either decided to take a gap year, go to community college first, work to save up money, do military service (certain countries like S. Korea and Singapore require all males to do 1–2 years of mandatory military service after high school), or any other variety of reasons. Honestly going to college straight out of high school isn’t really the best thing anyway as most people aren’t mature enough to handle college work and make important life decisions when they are 18. I would say being in your early 20′s is actually a good thing, you have had some time to think about what you want and may find yourself more mature than your peers but at the same time you are not too old to miss out on the social aspects (like a 30 year old going to college would). In fact you will probably do really well academically and socially given the maturity and wisdom a few years can provide and everyone will think you are cool- just have confidence in yourself! Also I don’t know why you are so dead set on Harvard but be open to other colleges as well, there’s a lot of really good ones out there besides just Ivy Leagues - you will do well in life going to most any college so don’t worry too much about that either. ",
            "date": "Answered May 18, 2016",
            "views": "272",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Clint Potts",
                "href": "/profile/Clint-Potts-1"
            },
            "answer_text": "For many reasons, graduating from high school and advancing directly into college is becoming less and less the norm. Whether there is a need for the student to earn additional money before starting school, or a desire to serve the country in the military; the “traditional” college student has now been joined by those choosing to delay entry. If you are 21 or 22, you will probably still be younger than many of your class mates. The best thing you can do is to speak with an admissions counselor at the schools of your choice. ",
            "date": "Answered May 18, 2016",
            "views": "170",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sarthak Lalchandani",
                    "user_href": "/profile/Sarthak-Lalchandani"
                }
            ]
        }
    ]
}