{
    "title": "Is Baluni Classes, Kotdwar good for coaching? - Quora",
    "tags": [
        "Baluni Classes, Kotdwar",
        "Coaching Classes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Parminder Singh",
                "href": "/profile/Parminder-Singh-258"
            },
            "answer_text": "Hello, Well certainly i don't know about them but one thing I know is they are coaching institute. Don't go for coaching centres.Coaching center creates lots of pressure in the student mind. Some time students are get affected by this. Coaching centres have some limitation like, You have to go to there place to learn the things, no matter how far away it from your home whether it is 7 k.m. or 50k.m. , And with so many students in one batch they couldn't able to focus on each and every student. You can choose a very​ unique and efficient way of learning i.e. through self study via video lectures and notes. With video lectures,students can learn anywhere from your mobile devices laptops, tablets or smartphones. And for this way there is no one better than M learning India. They have there website you can search it over the internet. Just sitting at home you can watch offline videos at your convenience.Prepare a timetable and at least watch 4-5 hours daily video lectures and also solve the study material for a couple of hours You can get their offline course directly through their site, You can also subscribe on YouTube. They also have an app on Google store. Through which you can study anywhere, anytime with your smart phone. Search M Learning India app on Google All the best ",
            "date": "Answered May 2, 2018",
            "views": "295",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Archana Bisht",
                    "user_href": "/profile/Archana-Bisht-30"
                },
                {
                    "user_id": "Priyanka Sharma",
                    "user_href": "/profile/Priyanka-Sharma-2000"
                }
            ]
        }
    ]
}