{
    "title": "Is becoming a Librarian worth it? - Quora",
    "tags": [
        "Librarians",
        "Libraries and Librarianship",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anthony Adam",
                "href": "/profile/Anthony-Adam-6"
            },
            "answer_text": "Naturally the answer depends on how you define “worth it.” Are you going to be a millionaire based on your salary and benefits? Maybe if you become director of a large library or system. Are you going to be able to travel the world on library business, at the library’s expense? Probably not, at least compared to the travel experienced in some corporations. Are you going to be extremely happy with your life every single day? I’d like to meet that person and see if he’ll share whatever stimulants he’s taking ;-) Was it worth it for me? Absolutely. I worked with a wide variety of librarians and staff over 25 years, and looking back it’s amazing the lives each of them had. Working with the public was almost always great - I was even pleasantly surprised to read the lengthy bio of one of our campus’ professors in an encyclopedia I recently reviewed (who knew he spent years in prison?). And working with patrons, equipment, software, and hardware over the years, I now have experience in DOS (ah, /f…), can talk about ruminants and broiler marketing, know how to unjam just about any type of copier, and met folks from all over the world. It’s not the life for everyone, but it was my life and worth it. ",
            "date": "Answered October 3, 2018",
            "views": "18",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kimberly Lund",
                    "user_href": "/profile/Kimberly-Lund-12"
                },
                {
                    "user_id": "Wardah",
                    "user_href": "/profile/Wardah-6"
                },
                {
                    "user_id": "Nancy Ashmore",
                    "user_href": "/profile/Nancy-Ashmore"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew McNulty",
                "href": "/profile/Matthew-McNulty-2"
            },
            "answer_text": "It can be worth it, as long as you keep your expectations reasonable. As the librarians who have answered this question have already stated, it’s not a good idea to go into the profession for the money, and the library field is not all it’s cracked up to be (see Kerry’s answer below). If you’re considering this profession, please know what you’re getting into first: Matthew McNulty's answer to When should you decide to become a librarian? A lot of library jobs require a master’s, but not all of them: Matthew McNulty's answer to Why do job listings for information related professions ask for an undergraduate degree in Library and Information Science when there is no such undergrad degree? If you aren’t in it just for the money, and you want to sincerely help people find the information they need, whether it is a good book, or where to find a shelter for abused women, it’s a wonderful profession to get into. Just keep your expectations in check. ",
            "date": "Answered October 3, 2018",
            "views": "16",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wynette Schwalm",
                    "user_href": "/profile/Wynette-Schwalm"
                },
                {
                    "user_id": "Charlotte Yim",
                    "user_href": "/profile/Charlotte-Yim-3"
                },
                {
                    "user_id": "Nancy Ashmore",
                    "user_href": "/profile/Nancy-Ashmore"
                }
            ]
        }
    ]
}