{
    "title": "Is becoming a Librarian challenging? - Quora",
    "tags": [
        "Librarians",
        "Libraries and Librarianship",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lisa (Liz) Bosarge",
                "href": "/profile/Lisa-Liz-Bosarge"
            },
            "answer_text": "I want to say yes and no, but it's just yes. The research, hours of work, and level of professional disrespect make it difficult. I have always wanted to be a librarian, and I can tell you that makes me part of a unique minority. It's not what my family wanted and it's not what my professors wanted. Everyone said that it was a waste of my potential. That's the most challenging thing to deal with --the people around you who don't respect the profession. It's bad because in your SLIS you start to think maybe they were right because so many people skate by or aren't as passionate about their work. My personal struggle is waking up everyday ready to do my job and be the best librarian and realizing that so many of my classmates just thought it would be a whatever job because they didn't make it in their original field of study. It's disheartening and stressful. LIS course work for the MLIS will only challenge you if you really work at it. I work at it everyday and I do research, so it is intellectually stimulating and challenging. Problem solving, understanding patrons' needs, the technological curve, technical proficiencies --these are challenged and they put a kink in your life, but they are easy enough to get past. Even the slumping job market and ridiculous application requirements are something you can eventually get through (definitely with a little disappointment). It's that whole emotional aspect of not being respected by your faculty peers and the self-discipline to make yourself the very best librarian that you can be that will really challenge you. ",
            "date": "Answered October 30, 2015",
            "views": "19",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arianne Gyle Montilla",
                    "user_href": "/profile/Arianne-Gyle-Montilla"
                },
                {
                    "user_id": "Alivia Jones",
                    "user_href": "/profile/Alivia-Jones"
                },
                {
                    "user_id": "Aaron Brown",
                    "user_href": "/profile/Aaron-Brown-580"
                },
                {
                    "user_id": "Susan Kiley",
                    "user_href": "/profile/Susan-Kiley-3"
                },
                {
                    "user_id": "Max Abonado",
                    "user_href": "/profile/Max-Abonado"
                },
                {
                    "user_id": "Jessica Talisman",
                    "user_href": "/profile/Jessica-Talisman-1"
                },
                {
                    "user_id": "Francis DiMenno",
                    "user_href": "/profile/Francis-DiMenno"
                },
                {
                    "user_id": "Eiramsor Aerroc",
                    "user_href": "/profile/Eiramsor-Aerroc"
                },
                {
                    "user_id": "Kell Well",
                    "user_href": "/profile/Kell-Well"
                },
                {
                    "user_id": "Bee Rogers",
                    "user_href": "/profile/Bee-Rogers"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gabe Gossett",
                "href": "/profile/Gabe-Gossett"
            },
            "answer_text": "There are challenges to becoming a librarian, for sure, but I don't think that other answers have touched on the major reasons for this in my view. Yes, you will have to go through 2 years of graduate school work. But as Liz has already noted that graduate work is what you make of it. Plenty of people get a library degree with little effort and there are a number of library schools you can get into. However, all of that feeds into the real challenge to becoming a librarian. Library schools are overproducing graduates. There just are not nearly as many openings as there are graduates. If you really want to become a librarian you will be well-served to distinguish yourself somehow or start building a professional network that will lead to that first job.  My advice is that you take any opportunity to distinguish yourself in the work you do in library school. Work on a unique project. Connect with others doing work that is of interest. Do as many practicums as you reasonably can. All of these things will give you an edge in the hiring process. Keep in mind if you are applying for an academic position you will likely have an entire day of interviews with different people, and sometimes the same people more than once. If you have the same narrative as everyone else you will never even get to an interview, much less have some way to stand out once you are interviewing.  To sum it up, I suggest you make sure to challenge yourself beyond the minimum requirements of your library school coursework. It will pay off actually getting the job you want.  ",
            "date": "Answered December 30, 2015",
            "views": "712",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alivia Jones",
                    "user_href": "/profile/Alivia-Jones"
                },
                {
                    "user_id": "Kell Well",
                    "user_href": "/profile/Kell-Well"
                }
            ]
        }
    ]
}