{
    "title": "Is China still on lockdown due to COVID-19 pandemic? - Quora",
    "tags": [
        "Security",
        "COVID-19 (2019-2020)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Benson Pe Chua",
                "href": "/profile/Benson-Pe-Chua-1"
            },
            "answer_text": "There is no more lockdown within the chinese territory as far as I know. Altho am not inside china and I rely only on the news of CGTN. Also as you can see , they have a huge holidays of the moon festival same time as the china national day- golden week from Oct 1 to 8. Similar to the Chinese New Year , the chinese people went on holiday but within china for tourism - not like during the new year where some went overseas but visited their hometowns. Now, The covit cases are very minuscule- read from news of the other day discovering 10 cases out of the movement of most of 1.4 billion people . It’s fantastic recovery. The wearing of mask is now not being strictly implemented. And I think the golden week is a chance for china to celebrate their overcoming the covit. But they are giving grand recognition of the sacrifices of the frontliners and the very disciplined People. They deserved their self congratulations and also admiration of the world. Now there are among the few countries ( w many more developing) racing to bring out the vaccine. In the absence so few covit cases now inside china, they had to request and even offer favourable priorities and other conditions to other countries w many covit cases like Brazil, Italy etc for phase 3 testing. Fewer and fewer esp in America now are calling the covit china or Wuhan virus. But the worst has come to the USA, the top honcho ridiculing china and the democrats , Trump himself is now confined in Walter Reed hospital for covit. Let’s pray for him and hope he wins the next election, as half of the American do for AMERICA FIRST- ",
            "date": "Answered October 2, 2020",
            "views": "57",
            "upvotes": " Answer requested by Lisa Geddes",
            "upvoters": [
                {
                    "user_id": "Paris Qian Sen",
                    "user_href": "/profile/Paris-Qian-Sen"
                },
                {
                    "user_id": "Erika Chin",
                    "user_href": "/profile/Erika-Chin-3"
                },
                {
                    "user_id": "Strike Lyu",
                    "user_href": "/profile/Strike-Lyu"
                },
                {
                    "user_id": "Sam Zbib",
                    "user_href": "/profile/Sam-Zbib"
                },
                {
                    "user_id": "LIY Lv",
                    "user_href": "/profile/LIY-Lv"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tang Han",
                "href": "/profile/Tang-Han-23"
            },
            "answer_text": "April 27, 2020 The COVID-19 pandemic has called for unprecedented procedures in a worldwide attempt to control it. As of April 27, 2020, the People’s Republic of China is no longer in lockdown due to COVID-19. However, quarantine and anti-virus procedures still exist in order to prevent a second wave of infections. Lockdown: A state of confinement in a particular area During the entirety of the COVID-19 Pandemic, the central Chinese province of Hubei was on lockdown, meaning that all transportation out of the province was not allowed. This included the temporary halt of highspeed rail lines, airlines, and highways. Additionally, within the province itself, everyone was quarantined within their homes and food was delivered by a system of having community representatives purchase them and bring them to each residence. Furthermore, all public transportation had been halted, and private transportation (e.g family car) had heavy restrictions. However, because of the efforts of the Chinese people, primarily doctors, nurses, food deliveries, among many other essential workers, as well as the Chinese government, the citywide lockdown was finally ended after 76 days. On April 8, 2020 (Beijing time), 0:50 AM, the lockdown was officially ended, with the first outbound bullet train leaving at 0:50 AM. At the same time, highways and airports reopened allowing for the 2020 Hubei lockdown to finally come to an end. Below are images showing Wuhan after lockdown. Nurses and doctors sent from across China to help Wuhan return:  An airplane landing with the medical workers is greeted by a “watergate”, which is the highest level of honour.  CGTN Video showing Wuhan Medics returning home  Police escort for returning medics  Bullet trains preparing for service after lockdown ends  Skyscrapers and bridges lit up in celebration for the end of the lockdown  Anti-Virus Procedures: Although the lockdown has ended, provinces across China are still wary of the virus and are hoping to prevent a second wave. Due to this, the protocols for preventing the virus from spreading are still in effect. For example, when going out most people are still wearing masks, as well as other protective items (e.g gloves or eye protection), although the virus has nearly been fully annihilated, citizens in China are still wary, thus most still wear masks. Additionally, social distancing measures have not been eased. Furthermore, tests are being run on all passengers from flights heading into China followed by a 14 day quarantine period in order to decrease the risk of importing cases and risking a second outbreak. Young students wearing “1m” hats in order to socially distance  A commonly worn type of surgical mask in China and across the world  A health worker patrols an airport, awaiting the next flight of passengers to test.  Conclusion: Nowhere in China is still in a state of lockdown as of April 8th, 2020, however today (April 27, 2020), there are still significant protocols in place to prevent another outbreak. -Advance into the future ",
            "date": "Answered April 27, 2020",
            "views": "540",
            "upvotes": " View 5 Upvoters "
        }
    ]
}