{
    "title": "Is class 11 and class 12 biology sufficient for Neet? - Quora",
    "tags": [
        "Class 11th in India",
        "Class 12th in India",
        "National Eligibility cum Entrance Test (NEET)",
        "Academic and Educational Advice",
        "Biology",
        "Exam and Test Preparation",
        "Studying",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Siddhant Bakshi",
                "href": "/profile/Siddhant-Bakshi-7"
            },
            "answer_text": "Actually biology sectoin of neet consists of 90 percent questions from ncert. If you read all your 38 chapters from ncert around more than 12 times.. you can easily get a 320+,but you may lose upto 40 marks since some questions from ncert are not too direct from it. So to score well (340+) in neet biology section….here are some tips and tricks and strategies that you may follow to score good. See.. biology is the most scoring in NEET/AIIMS that we all know but only when properly studied. The best way is to go step wise and in planned manner for each and every chapter out of the total 38 chapters - First of all you should have your own notes with you.. whether they are from school or from coaching or even from both. If you go to coaching centre..its the the best option , make the notes in the class register and use color pens to outline various diagrams and even to write headings of various topics..it even helps you to study efficiently and even retain longer. In case you don't go to a coaching centre make your school notes notes properly , well decorated and you could add to it various facts or even life cycles from books that are available in the market for these exams.The next step should be to recall the lectutere while studying your notes and read them at least 3 times.Then go on with your ncert. The reason to go through the notes before your ncert is that you can now easily comprehend each line of the ncert and retain longer..no need to put that extra effort to comprehend ncert the first time.Before any test for any particular topic .. read your ncert for that topic minimum 3 times. This will help you to understand and even learn ncert very well.After you are done with your ncerts and your notes for a particular topic ..now you can go for your coaching modules , you will see that 99 % of your coaching modules are written with ncert lines and diagrams ….but there are some concepts and terms and even facts which are written there that are neither present in your coaching modules nor in your notes..these things are very important. Just highlight them and keep these facts in mind . Whenever you revise your module .. go through only these highlighted points.But only knowledge can't let you through with good marks. You also need ample amount of mcqs. These can be practised from your module or form “ NCERT AT YOUR FINGER TIPS” by mtg.If you follow this kind of a strategy.. you can easily score 340+ ( out of 360) in your bio section of neet. HOPE IT HELPS !!! ALL THE BEST!! ",
            "date": "Answered July 7, 2019",
            "views": "887",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chandu Badapu",
                    "user_href": "/profile/Chandu-Badapu"
                },
                {
                    "user_id": "Gaurav Parashar",
                    "user_href": "/profile/Gaurav-Parashar-112"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arun Singh",
                "href": "/profile/Arun-Singh-3408"
            },
            "answer_text": "Thanks for A2A !!! Yes bro if you want to clear just neet exam because all my classmate who opted bio has clear their neet exam in first attempt but i don’t know that they will get any good college with that marks. They just focus on ncert and one of my friend clear neet just in fun. He didn’t get good marks in board bio exam but he got 180 marks in neet. So it was very shocking moment for us. He gave us treat. So coming to point i will say that nothing is outside the books so if you study well you will definately achieve your destination. I think it is helpful to you. Thanks for reading. Peace!!! ",
            "date": "Updated October 27, 2019",
            "views": "309",
            "upvotes": " Answer requested by Prabhash Chandra Yadav"
        }
    ]
}