{
    "title": "Is Donald Trump a Christian? - Quora",
    "tags": [
        "Trump Presidency (2017-21)",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gary Polodna",
                "href": "/profile/Gary-Polodna"
            },
            "answer_text": "If Trump is a Christian, one would never know it. Sure, he proclaims to be. I could proclaim to the world that I am a famous neurosurgeon , but that would not make it so. The Christian bible says “By their fruits shall you know them” (Christians) And Trump has no fruit, period. His fruit is in himself, as it is in his Christianity. He is the only one he believes in. He said he was smarter than all the Generals in the Armed Services. HMMM! this sounds like a certain WW1 German Corporal named Adolph Hitler who came to power in the 1930ties, and another guy that had all his Generals executed to purge the Army in the Soviet Union of dissenters to his policies or a threat to his power. This guy’s name was Josef Stalin. Now he is smarter than the Fed chairman. Wants to fire him too. Hates his fellow man, unless they are white men. He hates women, children, He only lives for praise. I would say that by the words of the Christian bible that Trump is about as Christian as this old 80 year old man is at becoming an astronaut. He, over the years has screwed people who performed services for him out of their money. They do not have the money to sue him for the pay due to them. His army of lawyers stand ready to stave off any lawsuit that is filed to get back pay from him. He has screwed the US Government and the men and women in the service to their country ( by his failure to pay the fair share of taxes owed by him). The NY Times says he paid $750 dollars in 2016, the year he was “elected” president. A kid washing toilets at a fast food joint paid a lot more than that. The people who voted for him think that this is a good thing. Knowing how to keep from paying their taxes owed to the government is fine with them. They also believe that the dictators of the world should be admired by Trump and he should kiss their keesters to get along with them disregarding his own intelligence agencies. May God protect us from this bad specimen of humanity until he leaves the office of POTUS No tears shed by this old man if I woke up in the morning and given the joyous news that he had died on a KFC bone during the night or a Colonel Sanders employee had put a dose of Putin and Un’s poisons in his KFC.. The people of the US literally elected a piece of doo doo when they bothered to go vote. Now they are to the point where they cannot and will not see the error of their judgement. ",
            "date": "Updated October 17, 2020",
            "views": "19",
            "upvotes": " View 54 Upvoters",
            "upvoters": [
                {
                    "user_id": "Patricia Callaghan",
                    "user_href": "/profile/Patricia-Callaghan"
                },
                {
                    "user_id": "K C Jobe",
                    "user_href": "/profile/K-C-Jobe"
                },
                {
                    "user_id": "George Olds",
                    "user_href": "/profile/George-Olds-1"
                },
                {
                    "user_id": "Anthony Mueller",
                    "user_href": "/profile/Anthony-Mueller-11"
                },
                {
                    "user_id": "Gary Miles",
                    "user_href": "/profile/Gary-Miles-49"
                },
                {
                    "user_id": "Sohail Buggan",
                    "user_href": "/profile/Sohail-Buggan"
                },
                {
                    "user_id": "Kelvin Brown",
                    "user_href": "/profile/Kelvin-Brown-192"
                },
                {
                    "user_id": "Mishpat Baqar",
                    "user_href": "/profile/Mishpat-Baqar"
                },
                {
                    "user_id": "Judi Ross",
                    "user_href": "/profile/Judi-Ross-1"
                },
                {
                    "user_id": "Dom Magister",
                    "user_href": "/profile/Dom-Magister"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Davis",
                "href": "/profile/Jim-Davis-57"
            },
            "answer_text": "Trump is a fake Christian, just as he is a fake populist president. He runs that queerly puckered mouth and twitters in the wee hours, but nothing that ever comes out is consistent with a Christian character. Christ called on us to love our neighbor, yet Trump may be the most hate-driven president in our history. Blessed are the peacemakers, but Trump is always petulant, respecting only strength. Blessed are the meek, but Trump is a hardcore narcissist, an obnoxious gas-bag, false pride incarnate. Blessed are the poor, but Trump is the very picture of greed (although he may not be as rich as he would like everyone to believe). Blessed are those who hunger and thirst for righteousness, but Trump pisses on civil rights and disadvantages the masses in favor of the rich. Blessed are the merciful, but Trump is cruel and vindictive out of sheer, petty meanness. Blessed are the pure at heart, but Trump ogles his daughter, grabs unwilling women by the pussy, cheats on his wives and brags about it, colludes with a foreign enemy, and routinely rips off small contractors on his developments. He almost always lies to get his way. Trump is one dirty-minded bastard. Mark goes on to say “Woe to the rich, for they have received their reward.” Woe also to the well-fed, to those who laugh now (but will weep later), and to those on the top of the heap, as they are like false prophets. Trump to a tee. Is Donald Trump a Christian? Hell, no. ",
            "date": "Answered April 18, 2017",
            "views": "912",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Patricia Callaghan",
                    "user_href": "/profile/Patricia-Callaghan"
                },
                {
                    "user_id": "Brittany Combs-Appold",
                    "user_href": "/profile/Brittany-Combs-Appold"
                },
                {
                    "user_id": "Paul Aegerter",
                    "user_href": "/profile/Paul-Aegerter-3"
                },
                {
                    "user_id": "Gary Miles",
                    "user_href": "/profile/Gary-Miles-49"
                },
                {
                    "user_id": "Sohail Buggan",
                    "user_href": "/profile/Sohail-Buggan"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Friday-Van-Defoe-1"
                },
                {
                    "user_id": "William Lee",
                    "user_href": "/profile/William-Lee-720"
                },
                {
                    "user_id": "Kelvin Brown",
                    "user_href": "/profile/Kelvin-Brown-192"
                },
                {
                    "user_id": "Shelby Spragins",
                    "user_href": "/profile/Shelby-Spragins"
                },
                {
                    "user_id": "Marce Bruce",
                    "user_href": "/profile/Marce-Bruce"
                }
            ]
        }
    ]
}