{
    "title": "Is ECE at NITK overrated? - Quora",
    "tags": [
        "National Institute of Technology Karnataka, Surathkal",
        "Overrated Things or People",
        "Computer Engineering"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anish Morakhia",
                "href": "/profile/Anish-Morakhia"
            },
            "answer_text": "The following are my personal opinions and should in no be treated as the opinion of the department or its students. I have tried to answer the questions you have raised and added a few more things that is necessary to gain a complete picture of the department- 1)Placements-I think it is unfair to say the placements are low in ECE.Why did NITK have such poor placements in 2012-13 compared to other good NITs?If you look at the answer above, you will see that NITK ECE had higher placements in my year of graduation(2013) compared to even Comps. And in terms of core jobs, ECE department prepares their students much better compared to EEE that tends to focus much more on the electrical than the electronics in an environment where most jobs offered are in VLSI. 2)Competition- Well there's a reason for the high competition. It's because your peers are that good. This is why you should choose such a program where you get to be with and learn from search great peers.  3)Grading- I think that the grading in our department is extremely fair in general. Our department routinely awards 10 pointers to the top 7-10 percent of the class, which is something that is unheard of in departments like Electrical. In fact, a lot of my friends in  Electrical complain that despite being in the top 10 of their class they are 8-pointers. This proves to be a problem with applications for higher studies. The low grades perception is probably due to the competition that I spoke of in 2). 4)Faculty- I think ECE has some of the best faculty in NITK. Most Profs are genuinely ready to help their students if they approach them. I know of instances where Profs have gone out of their way to help students with things like letters of recommendation. In terms of academic expertise, they routinely publish papers in internation journals/conferences. In fact, despite teaching being a very small component of their review process, most Profs put in a  lot of effort into their courses.  5)Facilities- The lab facilities of our department are very good. We have world class equipment in the fields of Microwaves and DSP. The Microprocessers Lab has great ARM based boards that are well maintained( Contrast this to Electrical who were only offered labs using the 8051 Microcontroller which came out in the 1980s). The Analog Labs are exceptional in their maintenance and routinely offer help and resources during ENGINEER. 6)Outcome- If you survive NITK ECE, you know you are a capable engineer that has quite a decent alumni network and great profs that are always happy to help you with your future endeavors.  I know this might not be the story that fits for all the 106 students in my batch, but I believe that the department has been criticized extensively, unfairly so on most occasions. ",
            "date": "Answered November 3, 2014",
            "views": "36",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Suhas Grama",
                    "user_href": "/profile/Suhas-Grama"
                },
                {
                    "user_id": "Rohan Katkam",
                    "user_href": "/profile/Rohan-Katkam-2"
                },
                {
                    "user_id": "Shashank Vijay",
                    "user_href": "/profile/Shashank-Vijay-6"
                },
                {
                    "user_id": "Rabindranath Jana",
                    "user_href": "/profile/Rabindranath-Jana-1"
                },
                {
                    "user_id": "Moha Mankad",
                    "user_href": "/profile/Moha-Mankad"
                },
                {
                    "user_id": "Arunjothi Vasanth",
                    "user_href": "/profile/Arunjothi-Vasanth"
                },
                {
                    "user_id": "Kamesh Mullapudi",
                    "user_href": "/profile/Kamesh-Mullapudi-2"
                },
                {
                    "user_id": "Ujjwal Dhusia",
                    "user_href": "/profile/Ujjwal-Dhusia-1"
                },
                {
                    "user_id": "Akhil Varghese Mathew",
                    "user_href": "/profile/Akhil-Varghese-Mathew"
                },
                {
                    "user_id": "Aamodh Kuthethur",
                    "user_href": "/profile/Aamodh-Kuthethur"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nitin Srinath",
                "href": "/profile/Nitin-Srinath"
            },
            "answer_text": "You don't judge a branch based on just placements or competition. It's the overall quality of the students there. ECE at Nitk is arguably one of the best branches because of the students. There isn't another branch with students being so focused in life. The extent of knowledge that these guys posses about their subject is definitely higher than any of the other branches. The senior-junior interaction is max at Ec. At the end of four years in college, a lot of EC guys would actually have accomplished something big unlike most other branch guys. So, to conclude, it's not overrated. P.S : I'm neither in EC nor do I like it :p ",
            "date": "Answered November 2, 2014",
            "views": "2",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rabindranath Jana",
                    "user_href": "/profile/Rabindranath-Jana-1"
                },
                {
                    "user_id": "Donthineni Jyothirmayee",
                    "user_href": "/profile/Donthineni-Jyothirmayee"
                },
                {
                    "user_id": "Arunjothi Vasanth",
                    "user_href": "/profile/Arunjothi-Vasanth"
                },
                {
                    "user_id": "Ashwin Kumar G V",
                    "user_href": "/profile/Ashwin-Kumar-G-V"
                },
                {
                    "user_id": "Ujjwal Dhusia",
                    "user_href": "/profile/Ujjwal-Dhusia"
                },
                {
                    "user_id": "Vikas Saini",
                    "user_href": "/profile/Vikas-Saini-3"
                }
            ]
        }
    ]
}