{
    "title": "Is Esperanto used nowadays other than for the purpose of using Esperanto? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Philip Newton",
                "href": "/profile/Philip-Newton"
            },
            "answer_text": "Yes, it is. There are quite a few couples who met through Esperanto and who speak Esperanto to one another. For them, it is simply their daily language of communication. It may be their only shared language. There are also many Esperanto social events during which Esperanto is spoken as the normal means of communication. This might be considered a case of ‘Esperanto used for the purpose of using Esperanto’, but not everyone shares another language (in particular, not everyone speaks English well enough for that to be the common language). Also other cases where people met someone in an Esperanto-speaking context and so Esperanto is the natural langauge to speak with them even if another language would be available: possibly even if another language would be more suitable. For example, some of the Slovaks I met at SES also speak good German, from what I have read, but it would be most natural for me to speak Esperanto to them not for any philosophical reason but simply because Esperanto is what I spoke to them there and so I associate them with that language—just as I speak to my father in English, for example, since that is the language he has always spoken to me in, even though I was born and grew up in Germany and he also speaks excellent German. It is also, I believe, possible to study some subjects at a university level through Esperanto, in at least Akademio Internacia de la Sciencoj San Marino (the International Academy of Sciences in San Marino) and in a university in Poland, studying interlinguistics through Esperanto at the Adam Mickiewicz University (UAM) in Poznań: Interlingvistiko - UAM . There may be others. Another case that comes to mind is Sennacieca Asocio Tutmonda , the World Non-National Association, which uses Esperanto as its working language less for philosophical and more for practical reasons: as something that is easily learnable, widely understood or understandable, non-national, or something along those lines. As I understand it, Esperanto was not chosen for this role because it is Esperanto, so this is an interesting case pertaining to the question. ",
            "date": "Answered December 8, 2015",
            "views": "626",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rohan Dahiya",
                    "user_href": "/profile/Rohan-Dahiya-22"
                },
                {
                    "user_id": "George Partlow",
                    "user_href": "/profile/George-Partlow"
                },
                {
                    "user_id": "John Meisinger",
                    "user_href": "/profile/John-Meisinger"
                },
                {
                    "user_id": "Dany Nafatyuk",
                    "user_href": "/profile/Dany-Nafatyuk-1"
                },
                {
                    "user_id": "Santiago Renteria",
                    "user_href": "/profile/Santiago-Renteria"
                },
                {
                    "user_id": "Ravikumar K",
                    "user_href": "/profile/Ravikumar-K-43"
                },
                {
                    "user_id": "André Müller",
                    "user_href": "/profile/André-Müller-1"
                },
                {
                    "user_id": "Madsen Sparler",
                    "user_href": "/profile/Madsen-Sparler"
                },
                {
                    "user_id": "Ananda Das",
                    "user_href": "/profile/Ananda-Das-4"
                },
                {
                    "user_id": "Clarissa Lohr",
                    "user_href": "/profile/Clarissa-Lohr"
                }
            ]
        },
        {
            "author_info": {
                "name": "An Jinsim",
                "href": "/profile/An-Jinsim"
            },
            "answer_text": "Yes, it is.  Although it will be hard to come up with statistics, in my experience you can use Esperanto for practical purposes.  Here are three instances, where I used Esperanto for practical purposes in the past six months.   This year in July, a Chinese friend visited us. He spoke little English and my Chinese has never moved beyond A2. So we spoke in Esperanto throughout his 7-day trip. I have a friend in Russia. He is a programmer. He is helping me learn C++ for game development. Although I speak Russian a lot better than Chinese, we prefer to communicate in Esperanto; he is a perfectionist and does not like the mistakes I make in Russian.A couple of weeks ago, a Singaporean blogger asked something about Korean grammar. I translated her question into Esperanto and mailed it to my Korean teacher. The teacher replied with an answer the next day. I translated her answer into English. And voilà! The Singaporean blogger is happy. I can cite more instances, but I think these three suffice for the time being. ",
            "date": "Answered December 8, 2015",
            "views": "229",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cvi Solt",
                    "user_href": "/profile/Cvi-Solt"
                },
                {
                    "user_id": "George Partlow",
                    "user_href": "/profile/George-Partlow"
                },
                {
                    "user_id": "Joan Hoffman",
                    "user_href": "/profile/Joan-Hoffman-1"
                },
                {
                    "user_id": "Jedidiah Le Mere",
                    "user_href": "/profile/Jedidiah-Le-Mere"
                },
                {
                    "user_id": "Ruth Kevess-Cohen",
                    "user_href": "/profile/Ruth-Kevess-Cohen"
                },
                {
                    "user_id": "Clarissa Lohr",
                    "user_href": "/profile/Clarissa-Lohr"
                }
            ]
        }
    ]
}