{
    "title": "Is federal student loan interest charged as simple interest or compound interest? - Quora",
    "tags": [
        "Student Loans and Debt"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Kantrowitz",
                "href": "/profile/Mark-Kantrowitz"
            },
            "answer_text": "Yes and no.  In most circumstances the interest on student loans is charged as compound interest.  But in some cases it is charged as simple interest. With the federal government's Direct Loan program interest during a deferment or forbearance is capitalized once at the end of the deferment or forbearance period. Thus it is simple interest during the deferment and forbearance period, compound interest thereafter. FFELP lenders would capitalize more frequently (monthly, quarterly, annually and at status changes). With income-based repayment the interest is compounded until it reaches 10% of the loan balance, and simple interest after that until the borrower is no longer eligible for income-based repayment or opts to no longer participate in income-based repayment. With subsidized Stafford loans, the government pays the interest during deferments, such as the in-school deferment and economic hardship deferment. But that is not a matter of simple interest or compound interest. Rather, it is the equivalent of temporarily setting the interest rate at zero, which yields the same result regardless of whether the interest is simple or compound. ",
            "date": "Answered July 26, 2012",
            "views": "89",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ricardo Batista",
                    "user_href": "/profile/Ricardo-Batista-12"
                },
                {
                    "user_id": "Pradeep Kumar",
                    "user_href": "/profile/Pradeep-Kumar-66"
                },
                {
                    "user_id": "Suraj Kumar",
                    "user_href": "/profile/Suraj-Kumar-430"
                },
                {
                    "user_id": "Matthew Glatzel",
                    "user_href": "/profile/Matthew-Glatzel"
                },
                {
                    "user_id": "Tenzin Ngodup",
                    "user_href": "/profile/Tenzin-Ngodup"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Rice",
                "href": "/profile/George-Rice-3"
            },
            "answer_text": "Federally insured student loans in the USA use a simple daily interest formula currently set by law at 4.29% (for undergraduate studies, slightly higher for graduate students or parents): Balance of loan x number of days since last payment x (interest rate / days in the year) = interest amount The outstanding principal balance is the money you borrowed, not the money you received. The lender keeps part of what you borrow for themselves as a loan origination fee. For undergraduate loans, the fee is about 1% of the loan, for graduate students and parents about 4%. For a (needs-based) Perkins Loan, the fee is waived. See Interest Rates and Fees for additional information on the costs for federally insured student loans. ",
            "date": "Answered April 27, 2016",
            "views": "76",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Dan Funk",
                    "user_href": "/profile/Dan-Funk-2"
                }
            ]
        }
    ]
}