{
    "title": "Is going to a top university for an MBA really worth it? - Quora",
    "tags": [
        "Business School Admissions Advice",
        "Master of Business Administration Degrees",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kent Aldershof",
                "href": "/profile/Kent-Aldershof"
            },
            "answer_text": "Sure, go ahead and save your money by getting an online degree. Some of the best schools are offering online programs these days. It gives lots of people a warm, fuzzy feeling to brag “Oh yes, I have an MBA”. Almost none of them is willing to add “I got in online. It was very cheap to do.” Why do you suppose that is true? Why do you see none, absolutely zero, employment advertisements seeking persons with “MBA degree earned online”? Yet there is abundant advertising for people having an MBA degree. An enormous portion of what is learned during an MBA program comes from the classroom experience, particularly the interaction among the students in analyzing and debating the cases and the actual company experiences. Anyone can read textbooks on marketing and business finance and human relations and manufacturing, and corporate strategy and all the rest. All of that does little to enable one to function effectively as a manager or a business leader. At most, knowledge picked up from textbooks enables one to function in entry-level jobs, but not to handle anything at a higher level. Such people do inventory management and order entry and basic accounting and servicing customer complaints. MBA graduates from universities are allowed either to skip those jobs and become responsible for something complex and challenging, or to pass through those jobs very rapidly. Nevertheless, you are absolutely right. An MBA degree from a university involves great stress, high costs, travel, and generally changing one’s residence for a couple of years. You can take online most or all of the courses offered in the schools, and you can be given a handsome printed diploma. People who approach a classroom MBA without a burning conviction that being in a school environment justifies all of that stress and cost and travel and relocation, don’t get much out of it. They often do not even complete the program. They return home, having thus saved some money, and they are voluble in their derision for such programs. It sounds as if you could be one of those, and so I would encourage you to stay home and turn on your computer instead. ",
            "date": "Answered February 24, 2017",
            "views": "23",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rabih El Assadi",
                    "user_href": "/profile/Rabih-El-Assadi"
                },
                {
                    "user_id": "Dillon Fornia",
                    "user_href": "/profile/Dillon-Fornia"
                },
                {
                    "user_id": "Shane Ryoo",
                    "user_href": "/profile/Shane-Ryoo"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Cochran",
                "href": "/profile/David-Cochran-33"
            },
            "answer_text": "Of course it varies based on your career goals but more often than not the answer for a career changer is “absolutely”. I wanted to switch from technical sales (engineering undergrad at a pretty standard state school) to consulting. This was extremely unlikely to happen unless I went to a top25-top30 school. I was targeting Deloitte S&O but ended up at one of the MBB firms (McKinsey/Bain/BCG, or the “Big 3”). I went from making $100k with little growth potential to making $150k-$180k in a place that I feel not only cares about me as a person but care enough to spend a significant amount of time and resources developing me as a leader, problem solver, and client counselor. For what it's worth, with a 740 GMAT I was offered a full scholarship to multiple schools. That likely won't happen in the top10 but is quite common in the 20–30 range where they need high GMATs to move up in the rankings. There are many things I learned in the classroom that I could have duplicated online with some initiative. There are many more things I learned outside of the classroom that you simply can't reproduce online. Business school was a transformative experience for me and for those looking to make a big change, I can't imagine a better opportunity than a full time MBA. ",
            "date": "Answered February 24, 2017",
            "views": "366",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Michael E. Cohen",
                    "user_href": "/profile/Michael-E-Cohen"
                }
            ]
        }
    ]
}