{
    "title": "Is getting a verified certificate from edx MITx worth the money? Do I really need a verified one? - Quora",
    "tags": [
        "MITx",
        "Certificates and Certifications"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Davey",
                "href": "/profile/John-Davey-82"
            },
            "answer_text": "Having taken a few ones I can tell they are not difficult to complete. Mind you some courses from top Universities like MIT, Harvard, etc are somehow a little bit more difficult yet not that much. Although there has been research from MIT and Harvard on their created EDX platform where they mentioned that now that their certificates are not honoured ones but only verified ones the drop out rate has somehow decreased because now students that enrol do actually want to take a specific course and engage more and dedicate time to it and on the other side of the coin less people join the courses. (No one wants to lose money by not completing anything and dedicating a little effort) So basically it is a little bit more difficult for someone to cheat, yet not impossible. So I would say the newly verified certificates only show academic discipline and insight on the topic. I would in any case recommend the following: 1. Get online platform courses from Top Universities in any case. Better having your prospective boss finding you actually did take an online course from a top University if he/she does care about making the homework of calling them and finding out is true. 2. Even better. Do a Further Education diploma course directly with any University. Ivy or not Ivy league. However these are longer courses that can take from a few weeks to a few months to complete and are more difficult and you get proper homework to do and some times proper exams. Some are online and some are on campus. Classes are very limited and you actually interact with the instructors from their faculties through Skype, Hangout, etc as the class is very limited on number of students. Nevertheless some do cost a lot of money from $400 - $1,000 and specialty courses cost even way more but you get actual top teaching and research from any University. I believe any Edx course is worth it as long as it is from a top University but even better and more valid is a Further Education diploma course from any University. As a little tip top companies keep on sending their corporate officers to take this courses on campus. see point No 2. ",
            "date": "Answered July 19, 2016",
            "views": "1837",
            "upvotes": " View 117 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ramesh R",
                    "user_href": "/profile/Ramesh-R-443"
                },
                {
                    "user_id": "Tiffany Edens",
                    "user_href": "/profile/Tiffany-Edens-1"
                },
                {
                    "user_id": "Juhii Jd",
                    "user_href": "/profile/Juhii-Jd"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/A-C-3075"
                },
                {
                    "user_id": "Dheeraj Fuke",
                    "user_href": "/profile/Dheeraj-Fuke"
                },
                {
                    "user_id": "Snigdha Chakraborty",
                    "user_href": "/profile/Snigdha-Chakraborty-70"
                },
                {
                    "user_id": "Astha Singh Chauhan",
                    "user_href": "/profile/Astha-Singh-Chauhan-2"
                },
                {
                    "user_id": "Udayan Mitra",
                    "user_href": "/profile/Udayan-Mitra-4"
                },
                {
                    "user_id": "Lanchenbi Loitongbam",
                    "user_href": "/profile/Lanchenbi-Loitongbam-2"
                },
                {
                    "user_id": "Aseem",
                    "user_href": "/profile/Aseem-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erik Doey",
                "href": "/profile/Erik-Doey"
            },
            "answer_text": "My answer would be you don't need, but if you can afford and enjoy the courses, it's nice to do so. Some thoughts: The honor code certs were already phased out. There are only verified certs left. edX was smart enough to know Honor Code certs were just candies that provide some appreciation to learners, but worth none. They knew this, but the problem is, too many people are trying to misrepresent those Honor code certs as valid credentials, which hurt both the verified certs' credibility and also edX credibility.Professionalism: verified certs look better. Even though I know the verified certs don't really provide 100% proof against cheating, I still purchase them because they are the real proof of my commitment to helping both my credibility and also the credibility of the providers.Fairness to the institution: I feel they are entitled to being financially supported, after they deliver so much of their content and expertise to the world, they deserve to be compensated, even though they didn't ask to. I took the first few courses free. Hell, I felt bad. I spent 30 hours of my life on the first course, benefited from their knowledge for 30 hours, but didn't give anything back. I just felt bad. In real life I spent like 50 bucks on one frivolous weekend dinner. From that point on, I went out for expensive dinners less, and purchase some certificates from them to show my appreciation and as a way of thank-you to them.Fairness to other verified cert pursuers: this is the thing I feel most strongly about. Even though I haven't completed 10+ courses on edX, I was very quick to realize that the existence of Honor Code certs, even though providing great joy to many people, are actually hurting the credibility of the verified certs. Why? Simple: confusion. Imagine I'm an employer and suddenly 2 candidates show up: one show me the honor code cert and verified cert. I would have a headache and basically dismiss both. Well, that's just unfair to the people who invested in the verified certificate..Conclusion: whether you're on edX or Coursera or MITx or whatsoever: if you have the money, and the course justifies the cost (I admit there are courses that are flat-out not worth it, I will not say which ones), by all means, the verified cert is the best thing to go for. ",
            "date": "Updated July 31, 2016",
            "views": "1808",
            "upvotes": " View 205 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Juhii Jd",
                    "user_href": "/profile/Juhii-Jd"
                },
                {
                    "user_id": "Ivan Joshua Alvarez",
                    "user_href": "/profile/Ivan-Joshua-Alvarez"
                },
                {
                    "user_id": "Pranavi Ramineni",
                    "user_href": "/profile/Pranavi-Ramineni"
                },
                {
                    "user_id": "Ramesh Saraswathy",
                    "user_href": "/profile/Ramesh-Saraswathy"
                },
                {
                    "user_id": "Varun Kaushal",
                    "user_href": "/profile/Varun-Kaushal-20"
                },
                {
                    "user_id": "Muhammad Rizaldi Farsah",
                    "user_href": "/profile/Muhammad-Rizaldi-Farsah"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/A-C-3075"
                },
                {
                    "user_id": "Sree Subhiksha",
                    "user_href": "/profile/Sree-Subhiksha"
                },
                {
                    "user_id": "Snigdha Chakraborty",
                    "user_href": "/profile/Snigdha-Chakraborty-70"
                },
                {
                    "user_id": "Pratyasha Priyadarshini",
                    "user_href": "/profile/Pratyasha-Priyadarshini-1"
                }
            ]
        }
    ]
}