{
    "title": "Is going to bed at 4:00 AM worth it? - Quora",
    "tags": [
        "Sleep Advice",
        "Waking Up",
        "Sleep Science",
        "Sleep Habits"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shivani Puri Gaur",
                "href": "/profile/Shivani-Puri-Gaur"
            },
            "answer_text": "Sleeping late is not a problem, but sleeping for a fixed and adequate duration (i.e 7.5 hours on an average) has to be ensured. The quote advocated by Benjamin Franklin doesn’t hold today. Actually it should be Early to bed, early to rise will not make you healthy, wealthy and wise. Studies have proven that night owls(people who sleep after 12) are richer,smarter and risk-takers than the morning birds. For more detail, check out the article I have published few days back It will give you full insights on how and why going to bed at 4:00 am worth it Early to bed and rise won't make you wealthy and wise(Larks vs night Owls)-EagerQuestions Hope it helps !! ",
            "date": "Answered May 23, 2017",
            "views": "733",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Soumya Dash",
                    "user_href": "/profile/Soumya-Dash-7"
                },
                {
                    "user_id": "Mukul Dhiman",
                    "user_href": "/profile/Mukul-Dhiman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Aylworth",
                "href": "/profile/Charles-Aylworth"
            },
            "answer_text": "Sure, now and then. You will have two or maybe three sleep cycles before you have to get up. That’s enough sleep to get by on, now and then. Always assuming you aren’t drunk. It is not enough time to cleanse the body of alcohol, and its metabolites. Nor is it time to re-hydrate. If you want to go through your day, a little drunk, dehydrated, and feeling like crap, that’s the way to do it. It is not a good practice on a regular basis. You need more sleep than that provides. A2A. ",
            "date": "Answered August 12, 2017",
            "views": "283",
            "upvotes": " Answer requested by Abigail Laura"
        }
    ]
}