{
    "title": "Is it possible to take an MBA online? What are some genuine universities for the same? - Quora",
    "tags": [
        "E-learning",
        "Master of Business Administration Degrees"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anurag Amuka",
                "href": "/profile/Anurag-Amuka-2"
            },
            "answer_text": "University of Illinois Urbana Champaign, Illinois is offering an IMBA, which is fully digital. The interesting fact is that the degree which you will be getting after graduation is same to those who complete it physically. I meant the graduation certificate will have the same course name for students of both physical and online batches. Their intention is that learning is exactly the same, whether you do it remotely or by physically attending the classes. I feel it is a very good opportunity for those who can't leave their place for a PG. Also, the online course is cheaper by around 12k dollars. I am not sure about the exact difference in the fees, but there is a significant difference. We can also pay the fee on a monthly basis. Which is AMAZING! After a few classes, you will know whether you want to go further or not. POCKET FRIENDLY. ",
            "date": "Answered August 5, 2020",
            "views": "54",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Em Arr",
                    "user_href": "/profile/Em-Arr"
                },
                {
                    "user_id": "Silpa Varghese",
                    "user_href": "/profile/Silpa-Varghese-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Em Arr",
                "href": "/profile/Em-Arr"
            },
            "answer_text": "Yes. Look at UT Dallas (they are ranked #33 in MBA programs overall now by US News 2021). For online programs they are listed here along with other notable genuine universities. https://www.usnews.com/education/online-education/mba/rankings ",
            "date": "Answered August 9, 2020",
            "views": "4",
            "upvotes": "0"
        }
    ]
}