{
    "title": "Is it better to study business in undergrad or as an MBA? - Quora",
    "tags": [
        "Master of Business Administration Degrees",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Mannet",
                "href": "/profile/Paul-Mannet"
            },
            "answer_text": "Obviously most people who look at MBA programs are thinking in terms of how it will help them in the job market. It's gotten harder than ever to make a judgement call on this since 2008, as the banking and finance industries - the \"dream\" employers for many MBA students - have gradually imploded, laying off as many or even more people than they've hired. Because an MBA can be a very expensive proposition, it's important, I think, to start by trying to balance some competing facts, which I've gleaned more from my years in business (both large companies and startups) than from any statistics. 1) Employers often list an MBA as a baseline necessity for even getting interviewed for many positions nowadays.  The flip side is that, quite often, there's little real need for a business school education to succeed in many of these jobs. 2) Companies tend to see MBA holders as more seriously committed to business than those with only an undergrad degree. Again, however, the contrasting truth is that so many people go out and get MBA's today that they've become \"a dime a dozen\" - almost as commoditized as a bachelor's degree. Dealing with perceptions like these out in the job market can really drive you crazy, but it's a reality to be dealt with. 3) A general management MBA can be impressive, but a specialized bachelor's degree in accounting or marketing can also show of commitment to a particular specialty in business. 4) An MBA might get you in the door with a good company, but on the other hand, if you can get hired with a bachelor's degree and move up the ladder to the point where you really need an MBA, your company may pay for you to get it. That could save you $25,000. or more. Beyond the ROI, it's not terribly easy to decide how to actually get the MBA degree done, if you're already out in the work world earning a living. I thought this chart was kind of interesting, as it shows (from a brand new study) what kinds of MBA programs people are signing up for. This one looks at students who are planning to start an MBA within the next six months:   It's pretty obvious that the more flexible programs, both online and offline, are attracting the more interest than the traditional 2 year MBA programs on campus. I do have to say that some of the most successful people I've met - not just in business but in law and even medicine, have told me that graduate school was valuable to them not because it taught them how to do anything specific, but because it taught them to THINK like a financier, an attorney or whatever. I do think that's something worth considering. Another way of looking at it is this: Because college and graduate school together make up a long slog, the first question to consider might be \"how can I get the most out of having only a bachelor's degree in business and not an MBA?\" Here's a little piece I published last year on that topic:http://collegedegreecomplete.com/the-value-of-a-bachelors-degree-in-business-vs-a-full-mba/ ",
            "date": "Answered April 11, 2012",
            "views": "41",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Penelope Shay",
                    "user_href": "/profile/Penelope-Shay"
                },
                {
                    "user_id": "Pamela D'Luhy",
                    "user_href": "/profile/Pamela-DLuhy"
                },
                {
                    "user_id": "James Fisher",
                    "user_href": "/profile/James-Fisher-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Fisher",
                "href": "/profile/James-Fisher-1"
            },
            "answer_text": "Here's my perspective as a B-school professor. Most undergraduate business school students have the general perception that a business degree is a more, shall we say, marketable degree. Given the high cost of a college education one can hardly blame these students (or their parents) for making this calculation and deciding accordingly. But these students--and there are many, many of them--vary in their passion and interest in the business profession and the larger landscape of economic activity. This intrinsic motivation is a crucial ingredient to maximize your investment in a business undergraduate degree. You will learn more and your curiosity and sense of purpose is more likely to be attractive to potential employers. I had one undergraduate who was boiling with ambition and just loved the relational challenge of doing business and the big ideas connected with strategy and entrepreneurship. He wanted to do an MBA, but his own success interfered with that plan. Now in his mid-thirties, he is a CEO of a medium-sized business. Turning to MBAs, I see two camps there as well. Those who want to re-invigorate or re-direct their careers and then those who have had some measure of success in a particular business or discipline and now find that they need some general management skills. This latter group often consists of scientists and engineers that are now running product lines or business divisions or managing a staff. Both groups have their reasons and they are entirely legitimate. But for both undergraduate and graduate programs, if the degree is not sought for some intrinsic value--if it is perceived strictly as a means to an end--then the so-called payoff is frequently less than imagined. ",
            "date": "Updated December 3, 2013",
            "views": "34",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yang Kathy",
                    "user_href": "/profile/Yang-Kathy"
                },
                {
                    "user_id": "Akarshi Khare",
                    "user_href": "/profile/Akarshi-Khare-1"
                },
                {
                    "user_id": "Khuong Ho",
                    "user_href": "/profile/Khuong-Ho-1"
                },
                {
                    "user_id": "Daniel Wang",
                    "user_href": "/profile/Daniel-Wang-175"
                },
                {
                    "user_id": "Brandon Hiller",
                    "user_href": "/profile/Brandon-Hiller-2"
                },
                {
                    "user_id": "Alex Chang",
                    "user_href": "/profile/Alex-Chang-76"
                },
                {
                    "user_id": "Paul Meng",
                    "user_href": "/profile/Paul-Meng-1"
                },
                {
                    "user_id": "Mohammed Ibrahim",
                    "user_href": "/profile/Mohammed-Ibrahim-36"
                },
                {
                    "user_id": "Cherry Chen",
                    "user_href": "/profile/Cherry-Chen-13"
                },
                {
                    "user_id": "Gautam Shah",
                    "user_href": "/profile/Gautam-Shah"
                }
            ]
        }
    ]
}