{
    "title": "Is it good to do a B.Ed. after a B.Com.? - Quora",
    "tags": [
        "Bachelor of Education Degrees"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aaliya",
                "href": "/profile/Aaliya-28"
            },
            "answer_text": "Why Not !! Yes you can do B.Ed course after Completing your Bcom. The Basic Educational Qualification to Apply for B.Ed Course is, the Aspirant should have Completed Bachelor degree in any discipline from recognized University .The Eligibility Criteria for B.Ed Course differs From institution to Institution . To apply for this B.Ed Course you should Complete Under graduation Courses like, BA BCom,Bsc,BBA from recognized University . Minimum 55% Percentage marks are required in UG program .There is no Age Limit for B.Ed Course. You need to Crack the B.Ed Entrance Examination . Cut off varies from university to university. A few good universities are: Indira Gandhi National Open University (IGNOU), New Delhi Jamia Millia Islamia Centre for Distance and Open Learning (JMI-CDOL), DelhiBangalore University Directorate of Correspondence Courses and Distance Education Lovely Professional University , Punjab Bharathiar University - School of Distance Education Andhra University School of Distance Education (AUSDE), Visakhapatnam, Andhra Pradesh Annamalai University Directorate of Distance Education (DDE) Bharathidasan University - Center for Distance Education Himachal Pradesh University International Centre for Distance Education and Open Learning , Shimla, Himachal Pradesh Kakatiya University School of Distance Learning & Continuing Education, Warangal, Andhra Pradesh Utkal university,Odisha ",
            "date": "Answered February 24, 2018",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kaushik Joshi",
                "href": "/profile/Kaushik-Joshi-19"
            },
            "answer_text": "Yes, If you want to become school level sir/teacher. The thing is you'll be not hire in school sections as sir because you're male and your salary expectations is higher then females. I've tried more then 10 schools and the good thing is i rejected from all the school the answer i get for being not selected was “ sorry you've capabilities to teach students but we can't hire you because we need females not males” You can do BEd for the degree after b.com And if you want to be Professor in future then rather then going for BEd go for NET or SET. My fingers are paining now so if you have any problem regarding this then Direct message me . ",
            "date": "Answered April 10, 2017",
            "views": "114",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shashikant Patel",
                    "user_href": "/profile/Shashikant-Patel-134"
                },
                {
                    "user_id": "Simran Gupta",
                    "user_href": "/profile/Simran-Gupta-599"
                },
                {
                    "user_id": "Prajakta Zaware",
                    "user_href": "/profile/Prajakta-Zaware"
                },
                {
                    "user_id": "Venu Gopal",
                    "user_href": "/profile/Venu-Gopal-3178"
                },
                {
                    "user_id": "Divya Bhati",
                    "user_href": "/profile/Divya-Bhati-31"
                },
                {
                    "user_id": "Sajjad Afzal",
                    "user_href": "/profile/Sajjad-Afzal-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/P-V-DILLIBABU"
                },
                {
                    "user_id": "Priya Thakur",
                    "user_href": "/profile/Priya-Thakur-105"
                },
                {
                    "user_id": "Yasmin Shaikh",
                    "user_href": "/profile/Yasmin-Shaikh-85"
                },
                {
                    "user_id": "Amit Singh",
                    "user_href": "/profile/Amit-Singh-3695"
                }
            ]
        }
    ]
}