{
    "title": "Is it too late to go to college at 21? - Quora",
    "tags": [
        "Early 20s (age)",
        "Life Advice for People in Their 20s",
        "College and University Life Advice",
        "20s (age)",
        "Studying",
        "Education",
        "College Advice",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Davis Luke",
                "href": "/profile/David-Davis-Luke"
            },
            "answer_text": "I started college at 21 and I turned 22 during my first semester, here is what I can tell you about starting college late. My Story: I have a Fall birthday so I graduated from High-school at age 18. I graduated in the top 10% of my class with above a 1300 composite SAT score. In Texas, there used to be a $10k / year annual scholarship for students who graduate in the top 10% and they get auto admin to public universities, I planned on doing a mission trip abroad so I didn’t even apply for college or the scholarships. After graduating, my family moved and I started to work at Wingstop. I needed to save money and I had never had a job before. I would walk ~50 minutes to work and on the days my mom couldn’t pick me up I would walk another 50 minutes back home. I did this for about 3 months until I got a job at Amazon. This time I worked a set schedule, 7:30 AM til like 5 PM (or something like that). I loved it. I learned a lot about warehousing and industrial automation and the pay was pretty good for an 18 year old kid. I did this for another 3 months til I left to South America to do missionary work. I had studied German in high-school so I had to learn Spanish on the fly. I spent 2 years down there meeting new people, learning their culture, learning how to read the body language specific to their culture and learning Spanish. I also did some logistics and leadership work while I was down there which helped me grow. After about 2 years, I came back to the states and was accepted into Texas A&M’s College of Engineering. By this time, legislators had done away with the scholarship for the top 10% so now I was going to go to A&M with little money to support my education. I immediately got a job at Chuys (a Tex-Mex restaurant) and began to save money. The anxiety killed me, I was a host at the restaurant and I made just above minimum wage and I knew there was no way I would make enough money to support myself past my first semester. After waiting for awhile, I got another warehouse job (the time between applying and getting hired was like 6 weeks) and I continued to work there while working part time at Chuys. Shortly after, I tore my pectoral and my ability to work long hours was wrecked leaving me hindered in my ability to make money. Needless to say, I have worked for most of my time in college. I had enough to cover my first semester and I wanted to make sure I acclimated correctly so I put off working til my second semester. In the Spring, I got a job waiting tables overnight and eventually transitioned into working for a startup company where I was allowed to work whatever hours fit my schedule. Being able to afford tuition and rent became so important that at times it felt like they were more important than getting A’s. Having to manage an Engineering Degree and being financially responsible isn’t something that I wish on anyone. When you work 30 - 50 hours a week and then have a full course-load on top of that the lines between your priorities can get pretty blurred. Now, I am 25 years old and my expected graduation date is in 2021. I will be 26 when I graduate from college and I will turn 27 shortly after starting my first ‘career’ job. Here is what I can say about Starting College Late: Sometimes I wonder if my financial situation would have been different if I had gone to college right after high-schoolIf I didn’t start college late, I would have never lived in South America, learned Spanish or met the amazing people whom I grew to love.I wish I would have saved more money before going on my mission trip. Before I left, I was interested in Bitcoin and Amazon stock. Both of them were valued between $100 - $200 at the time, If I had worked 1 - 2 more months and invested a few hundred dollars in both of them I would have come home to a substantial fund to help pay for my education.After coming home from South America, I wish I didn’t move back in with my parents. I was 21 years old and I had basically just spent 2 years in a foreign country by myself. I felt like I grew a lot and when I came home my parents still treated me like a 17 / 18 year old.Sometimes I struggle with accepting that college is the best path to a career. When you analyze the cost of college in addition to the opportunity cost of missed income, college usually comes out to cost between $100,000 - $150,000. There are several coding boot-camps online that can land you an entry level developer position at a fraction of the time and cost. Had I not fallen victim to the societal pressures and those form my parents I would have probably done some kind of coding boot-camp and would already have a job as a software / web developer.I hate micromanagers and a lot of professors micromanage their courses. They do all kinds of weird things to exercise control over their students such as: Releasing a homework assignment that is due on Wednesday on Monday, Having students take reading quizzes before every class in a 24 hour window, forcing students to attend their lecture over talking with a recruiter or having an interview. Basically, most professors want their ego to be validated and so they impose weird methods of control so that they feel that students validate their need to teach a course. The truth is, students could learn all of the same material with a textbook and Youtube and even though professors acknowledge this, they won’t change how their courses are taught. In the end, these weird methods of control make it harder for students who work while in school to keep up with students whose parents fund their education as the professors don’t allow adequate time to make it a fair learning environment.Every time I get on social media, I see friends from high-school getting married, getting masters degrees, buying houses, etc. I acknowledge that everyone has their own path however sometimes it makes me wonder if I chose the optimal path or what just seemed best at the time.Having had some gap years between high-school and college, I forgot most of the important things I learned like: Calculus, Stats, Different Writing Styles, etc. I had to relearn everything I forgot with a smaller time window than my peers who came straight from high-school and have parents funding their education. Basically, I had to make 1 of my hours studying be more efficient than 2 - 3 of their hours. Needless to say, I can learn things relatively fast however most of the time it isn’t fast enough.I’ve had to change my expectations since starting college. Initially, I had a goal of a 3.8 GPA. Had I had financial stability and came to college straight from high-school, this would have been an achievable goal however experience has informed me that to achieve such in my situation wasn’t worth the self destruction it would cause and so I have lowered my standards to above a 3.0 as that is what most employers require for recent grads. The difference between a 3.3 and a 3.1 is minimal at best and so I do what I can without sacrificing my financial stability.One of the things that’s always creeping in the back of my mind is that I have fallen short of my own expectations due to the fact that I started college late. I remember being a Junior in high-school and envisioning myself going to college, graduating after 4 years and then going on to get an MBA or JDA immediately after. I wanted to set myself up for success and at that moment, time was still on my side. Now looking at what I want to do in life knowing that I will graduate at 26, I’m more focused on getting a job and working for a few years. I would love to get a masters degree in something analytical like data science, global supply chain or cyber-security however money brings stability and I need to put myself on a good financial foundation before I could consider paying for such a degree on my own. Basically, starting college late makes it even harder to make the decision to go to grad school.Another thing to note about starting college late is that other students notice. I fit in my university credits and those with no impact on my graduation timeline over several semesters so occasionally I’m in a class full of 18 and 19 year old students as a 25 year old. You’ll strike out often in trying have meaningful interactions with most of your classmates and so typically I keep to myself in those courses until someone gets wise and decides it would be smart to interact with one of the more mature people in the room.This is somewhat of a rant, I hope everyone who reads this can find something relatable. ",
            "date": "Answered December 24, 2019",
            "views": "125",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alang",
                    "user_href": "/profile/Alang-5"
                },
                {
                    "user_id": "Bernie",
                    "user_href": "/profile/Bernie-66"
                },
                {
                    "user_id": "Gabe Johnson",
                    "user_href": "/profile/Gabe-Johnson-58"
                },
                {
                    "user_id": "Dylan Parsons",
                    "user_href": "/profile/Dylan-Parsons-28"
                },
                {
                    "user_id": "Jay Minakhom",
                    "user_href": "/profile/Jay-Minakhom-1"
                },
                {
                    "user_id": "Lulu Likes Oreo",
                    "user_href": "/profile/Lulu-Likes-Oreo"
                },
                {
                    "user_id": "Vishesh Winsome",
                    "user_href": "/profile/Vishesh-Winsome-2"
                },
                {
                    "user_id": "Moazam Tariq",
                    "user_href": "/profile/Moazam-Tariq-1"
                },
                {
                    "user_id": "Louis Xavier Sheid III",
                    "user_href": "/profile/Louis-Xavier-Sheid-III"
                },
                {
                    "user_id": "Dagim Teriessa",
                    "user_href": "/profile/Dagim-Teriessa"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lukasz Laniecki",
                "href": "/profile/Lukasz-Laniecki"
            },
            "answer_text": "You feel you should have started right out of high school because everyone else believes that that’s the way it should be/ that the only time to go to college is in your late teenage years or when you just turned 20. Will people ask questions and think you’ve fallen behind? Of course they will! Because they all believe that the way to build your career is to decide in your teenage years what you want to be in life, apply for college ASAP, before you turn 20, get a job that is line with the subject that you majored in and start building your career (climbing up that ladder). All because of a ludicrous expectation almost all adults have. The expectation that you should know what you want to do in life even before you got your chance to try anything. And why do they have this expectation and continue to sell young adults on this bullshit rule? Because they didn’t have their chance to be unsure either. Recognize that it is a bullshit rule everyone follows without giving it any consideration at all. And then what? You will be 60 and still telling yourself “Oh, if only I went to that college in my late teenage years, just like everybody else did. It’s such a pity that I slept through this time / didn’t know what I wanted to study and then when I was 21 it was too late”? Is this the little bullshit story you want to tell your grandchildren or friends when you’re in your 50s and 60s? It’s a very limiting belief that if you want to be something in your life you have only this short time period between your late teens and your mid 20s. That the quality of your life is predicated on whatever you did or didn’t in our early 20s. And the most important part. Are you sure you need college? Maybe you can self-educate on the Internet. There are myriad possibilities nowadays. College is just one of many options. Ponder that before you make this costly move! You have plenty of time to master a skill / craft on your own or learning from someone else as in an apprenticeship model. - Part of it appeared in my previous answer Lukasz Laniecki's answer to Is it too late to start a college at the age of 23? ",
            "date": "Answered October 4, 2017",
            "views": "282",
            "upvotes": " View 44 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alastait Barker",
                    "user_href": "/profile/Alastait-Barker"
                },
                {
                    "user_id": "Joyce Solany",
                    "user_href": "/profile/Joyce-Solany"
                },
                {
                    "user_id": "Vishesh Winsome",
                    "user_href": "/profile/Vishesh-Winsome-2"
                },
                {
                    "user_id": "Abreyah Sanft",
                    "user_href": "/profile/Abreyah-Sanft"
                },
                {
                    "user_id": "Rick Sanchez",
                    "user_href": "/profile/Rick-Sanchez-165"
                },
                {
                    "user_id": "Julie",
                    "user_href": "/profile/Julie-1936"
                },
                {
                    "user_id": "Do Minhye",
                    "user_href": "/profile/Do-Minhye"
                },
                {
                    "user_id": "Destiney Rodgers",
                    "user_href": "/profile/Destiney-Rodgers-4"
                },
                {
                    "user_id": "I Am Dappi",
                    "user_href": "/profile/I-Am-Dappi"
                },
                {
                    "user_id": "Xavier Wells",
                    "user_href": "/profile/Xavier-Wells-9"
                }
            ]
        }
    ]
}