{
    "title": "Is it possible to get an accredited online bachelor's degree? - Quora",
    "tags": [
        "Online Degrees",
        "Academic Accreditation",
        "Bachelor's Degree Advice",
        "Bachelor Degrees",
        "E-learning",
        "Higher Education",
        "Colleges and Universities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chuck Matthews",
                "href": "/profile/Chuck-Matthews"
            },
            "answer_text": "Question: Is it possible to get an accredited online bachelor’s degree? There are many accredited colleges and universities that are working hard to attract new students - as well as modernizing delivery of instructional content. Most of these traditional universities are public institutions; that is, they are state universities and state colleges. Most of these are also regionally accredited, as would be their traditional classroom courses. From the perspective of a prospective employer, the diploma reads the same, such that we don’t know the difference. And we really don’t care, either. How do you find these programs? Check with your local state college or university. If you’re in Washington State or Arizona, check out their state universities (WSU, UW, UA, ASU). All of them have on-line classes. Call the admissions office at each institution to learn what degrees may be pursued without attendance in a lab or classroom. I am aware that state universities in other states offer similar programs, and it’s important to call and learn about their programs and opportunities. Visit their websites for information, too. ",
            "date": "Answered March 17, 2020",
            "views": "69",
            "upvotes": " Answer requested by Milt Hankins"
        },
        {
            "author_info": {
                "name": "Thomas B Walsh",
                "href": "/profile/Thomas-B-Walsh"
            },
            "answer_text": "Of course it is. There have to be at least a 1000 colleges and universities in the US that offer accredited bachelor’s degrees. For example, all of the following schools offer accredited online degrees. Penn StateArizona State UniversityUniversity of PhoenixColorado State UniversityUniversity of FloridaWestern Governors UniversityOregon State UniversityUniversity of AlabamaThe only degree an employer would know for sure was online would be from Western Governors University. I was in management for thirty years, hiring (and firing) people. I don’t know how many candidates I interviewed for jobs during that time—had to be a least a thousand. I never asked a candidate, “Is this an online degree listed on your resume?”  If I had ever seen their actual diploma, I don’t think it would have had a big red stamp, “Beware, online degree.” Notes That degree from the University of Phoenix might be online, and it might not. I think that many people who have strong negative feelings about online degrees are mistakenly conflating online with for-profit. ",
            "date": "Answered March 17, 2020",
            "views": "92",
            "upvotes": "0"
        }
    ]
}