{
    "title": "Is it necessary to go to school to experience real life? - Quora",
    "tags": [
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roberta King",
                "href": "/profile/Roberta-King-11"
            },
            "answer_text": "Of course it’s not necessary to go to school to experience real life. Real life just happens when we least expect it. However, in our society, for you to experience life to the fullest and have more control over your life, going to school helps to inform you about many things you might never have thought of reading about or researching. When you go to school, go with an open mind to think about, question and learn every subject you take. The more you know, the more you may want to know and knowledge is power. If you think ‘real life’ is easier than school or easier to live without schooling, I’m afraid you are mistaken. We read about people who have become very successful without an education. How many of them are there compared to the number of people who have been fortunate enough to have an education? Today, I meet many young people who believe all they need to succeed in life is a channel on YouTube. How many thousands of people are on YouTube and how many succeed in making a lot of money? Ask people who have not had the opportunity to go to school why they wish they had had an education. So, while you may not need an education to experience real life, not having an education may limit the experience far more than you might think. ",
            "date": "Answered December 25, 2019",
            "views": "33",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gene Rick",
                    "user_href": "/profile/Gene-Rick-1"
                },
                {
                    "user_id": "Robert Pattison",
                    "user_href": "/profile/Robert-Pattison-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Victoria Smith",
                "href": "/profile/Victoria-Smith-225"
            },
            "answer_text": "That would depend on the kind of life you would like to have: (1) a life spent asking, “Do you want fries with that?” or (2) a life enriched by a higher paying job, a happy, healthy family made possible by the knowledge gained in school. Your choice. ",
            "date": "Answered December 25, 2019",
            "views": "14",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gene Rick",
                    "user_href": "/profile/Gene-Rick-1"
                },
                {
                    "user_id": "Robert Pattison",
                    "user_href": "/profile/Robert-Pattison-4"
                },
                {
                    "user_id": "Kate Moore",
                    "user_href": "/profile/Kate-Moore-149"
                }
            ]
        }
    ]
}