{
    "title": "Is it possible to change schools in LUMS from SDSB to SSE? I got admitted into BSc class of 2024. Will I have to transfer after the first year or is it possible for me to receive a revised offer? - Quora",
    "tags": [
        "Lahore University of Management Sciences",
        "College Transfers",
        "Bachelor of Science Degrees",
        "College and University Admissions",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aimen Durrani",
                "href": "/profile/Aimen-Durrani"
            },
            "answer_text": "It is possible. You may not have to take additional time to graduate since any courses you take outside your intended school can be counted towards out-groups later on. However, from what I know, you will have to avail the offer you have been made and do well academically to be considered for a transfer. Please also keep in mind that you may totally change your mind with regards to what major you wish to pursue once you have taken a couple of courses from each school. Best of luck. P. S. You can read stories about school transfer at LUMS Graduate Diaries on facebook and @lumsgraddiaries on Insta. ",
            "date": "Answered June 14, 2020",
            "views": "92",
            "upvotes": " Answer requested by Shafay Kashif",
            "upvoters": [
                {
                    "user_id": "Habiba Faisal",
                    "user_href": "/profile/Habiba-Faisal-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saqib Anjum",
                "href": "/profile/Saqib-Anjum-6"
            },
            "answer_text": "You cannot change schools in LUMS. You can change Your major. Not Your school. And it is highly unlikely that You will get a revised offer either. On the other hand, any degree from LUMS is way more reputable than the finest degree from any other institution in Pakistan. Make your choice but keep in mind that this choice would reflect on your career for all your life. ",
            "date": "Answered April 24, 2020",
            "views": "82",
            "upvotes": " View 1 Upvoter"
        }
    ]
}