{
    "title": "Is it possible to transfer from a US community college to a UK university? - Quora",
    "tags": [
        "Colleges and Universities in the United Kingdom",
        "College Transfers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jason Miller",
                "href": "/profile/Jason-Miller"
            },
            "answer_text": "Yes, it is possible.  But, as is the case whenever someone transfers between educational institutions, a student is wise to do some advanced planning.  Find out in advance which credits will transfer to the new institution.  If possible, do this before you take any community college classes so that you can limit your courses to those that will transfer. Be aware that the US and UK higher education systems are very different.  Be prepared to learn that that many early US courses would not transfer to UK schools.  This fact compounds the importance of communicating with a target school in the UK to find out what courses will transfer. It's worth mentioning that getting this information might be rather difficult.  The UK school might not have easy answers to the questions, and to answer them might require a description of each course you're asking about along with a course syllabus from the instructor.  That information might then go to a faculty member at that school for evaluation.  And it could take a while for the UK folks to come to a decision. So advanced planning is key if someone wants to make the most out of taking community college courses in the US and transferring them to a UK University. ",
            "date": "Answered June 18, 2012",
            "views": "195",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Robert Stevens",
                    "user_href": "/profile/Robert-Stevens-61"
                },
                {
                    "user_id": "Fariha Mohamed Hilmy",
                    "user_href": "/profile/Fariha-Mohamed-Hilmy"
                },
                {
                    "user_id": "Kaliopeta Taufalele",
                    "user_href": "/profile/Kaliopeta-Taufalele-1"
                },
                {
                    "user_id": "Greg Kemnitz",
                    "user_href": "/profile/Greg-Kemnitz"
                },
                {
                    "user_id": "John Gordon",
                    "user_href": "/profile/John-Gordon-43"
                },
                {
                    "user_id": "Dango Onigiri",
                    "user_href": "/profile/Dango-Onigiri"
                },
                {
                    "user_id": "David Tal",
                    "user_href": "/profile/David-Tal-7"
                },
                {
                    "user_id": "Jeremy Miles",
                    "user_href": "/profile/Jeremy-Miles"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alun Palmer",
                "href": "/profile/Alun-Palmer"
            },
            "answer_text": "Yes and no. A US Associate’s degree would probably be accepted to get into a Bachelor's degree in England. Whether it would get you any advanced standing is debatable. OTOH, Bachelor's degrees in England only take 3 years not 4, because the usual entrance qualification is 2 A levels in 2 subjects, each worth 10 credits in the US. A friend of mine who we called Rotten Rich, who was from Trinidad, got into the second year of a 3 year degree at Loughborough University with a diploma from Seneca College, which is a community college in Canada, but it was a 3 year diploma. In case you think calling him rotten might be a racist comment, Rotten Rich identified as white, although I'd say he was not 100%. ",
            "date": "Answered September 22, 2020",
            "views": "340",
            "upvotes": "0"
        }
    ]
}