{
    "title": "Is it okay to prepare for the NEET 2021 after stopping studying in 2010? - Quora",
    "tags": [
        "NEET Advice",
        "National Eligibility Cum Entrance Test 2019",
        "NEET Preparation",
        "Exam and Test Advice",
        "Bachelor of Medicine and Bachelor of Surgery Degrees",
        "National Eligibility cum Entrance Test (NEET)",
        "Exam and Test Preparation",
        "Studying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ankit Yadav",
                "href": "/profile/Ankit-Yadav-69-1"
            },
            "answer_text": "Bro, Its my first answer on Quora. Please pardon for grammatical mistakes. In your present scenario a number of factors are considerable. 1.Age: You stopped studying after 2010. I would consider you were in 10th class. Age:15 In 2020, you would be probably 25. But it's never too late to start. People crack NEET at 28. 2.Interest and Dedication. If you are interested and maintain a lebe of dedication, you will and can do it. Motivation apart, practically it gonna to be tough path but great attempts meet great results even on failing. “”A DEFEAT IN A BATTLE CAN TEACH YOU A NEW WAY TO WIN THE WAR.”” Do comment me if it found to be helpful. LOL ",
            "date": "Updated March 11, 2020",
            "views": "199",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jayes",
                    "user_href": "/profile/Jayes-4"
                },
                {
                    "user_id": "Sahil Sindhu",
                    "user_href": "/profile/Sahil-Sindhu-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saloni Gupta",
                "href": "/profile/Saloni-Gupta-766"
            },
            "answer_text": "You stopped studying after 2010. I would consider you were in the 10th class. Age:15 In 2020, you would be probably 25. But it's never too late to start. People crack NEET at 28. 2.Interest and Dedication. If you are interested and maintain a level of dedication, you will and can do it. Motivation apart, practically it gonna be a tough path but great attempts meet great results even on failing. “” A DEFEAT IN A BATTLE CAN TEACH YOU A NEW WAY TO WIN THE WAR.” Do comment me if it found to be helpful. TOPPR will guide the best ",
            "date": "Answered July 7, 2020",
            "views": "134",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mayank Kashyap",
                    "user_href": "/profile/Mayank-Kashyap-73"
                },
                {
                    "user_id": "Karthik Karthik",
                    "user_href": "/profile/Karthik-Karthik-1357"
                }
            ]
        }
    ]
}