{
    "title": "Is it hard to get into Chavara Public School, Pala? How are the hostel facilities, teaching, etc.? - Quora",
    "tags": [
        "Hostel Facilities",
        "Facilities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Allen Sunil",
                "href": "/profile/Allen-Sunil"
            },
            "answer_text": "To get into CPS special batch, you will have to write an entrance conducted by brilliant study centre. This exam is generally between moderate and hard. You can attempt this exam thrice a year for NRIs and twice for the rest. If you have performed really really well in your 10th board's, the exam wouldn't be much of a problem as its solely based on your 10th and 9th syllabus, but mind you it is not for the happy go lucky. To get into CPS regular batches, there is an entrance by the school itself which is of easy-moderate difficulty;again solely based on 10th and 9th and is comparatively easier than the special batch entrance. It is also conducted in Dubai and later on in the school campus itself. I was here from 2018-20 and I stayed in the hostel outside campus in Mutholy. It is pretty decent in terms of infrastructure as the building had been constructed not more than 2 years ago. Food is not bad and will take a week or two to adjust. The no. of occupants in a room is 8 and will go uptown 14-16 when ur in 12th. Overall, the study ambience is decent for those with the desire and it also gives a great experience in terms of exposure as students come from all over kerala, in fact the from outside it too. Special batch is taught mainly by the brilliant faculty whereas the school has it's own set of teachers for the others. They'r all well qualified and provide great support in terms in learning If you are joining for leisure, this isn't your best choice; but if ur looking forward to join the special batch and have an aim to get into a premier institute, this could be ideal for you. ",
            "date": "Answered May 26, 2020",
            "views": "366",
            "upvotes": "0"
        }
    ]
}