{
    "title": "Is it important to learn math? - Quora",
    "tags": [
        "Mathematics Education",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Susan Bertolino",
                "href": "/profile/Susan-Bertolino"
            },
            "answer_text": "It is extremely important to learn math. It is even better to be skilled at math. It is perhaps the most important subject taught in any school, next to language skills. Math has its own vocabulary, but mathematical relationships influence everything from language grammer to determining your daily schedule. Artists turn to math for understanding spatial relationships. Contrators use math to determine how to rehab a kitchen. The internet wouldn't exist without math. Astronomers discover planets through mathematical estimations as well as telescopes. That same telescope is created with a focus decided by a mathematical formula that renders clarity of vision to the object it seeks.  A lot of people say that they are bad with math, but they are not good with school related mathmatics. Everyone uses math. If you have a fight with a significant other, usually math, along with memory take a front seat as one person says: \"I did _______ x amount of times for you and you never returned the favor\", while the other says: \"That's not true! Last week I did ____ a bunch of times, then I texted you and you never acknowledged it.\" So we go from counting to a perceived constant to the imaginary number. Fights would be nothing without math! So yes, math is very important. If you are having a tough time with it in school, you aren't alone. Math is too often taught poorly, and that isn't always on the instructor, but on the system that the school uses to impart mathmathics en masse. A lot of students don't discover the beauty of mathematics until they leave the classroom and no longer have the threat of the BIG TEST hanging over their heads. So try to embrace math on its own terms, as it is worth the effort. ",
            "date": "Answered October 2, 2015",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pavel Dunin",
                    "user_href": "/profile/Pavel-Dunin"
                },
                {
                    "user_id": "MickeyKim",
                    "user_href": "/profile/MickeyKim"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Campbell",
                "href": "/profile/Nick-Campbell-4"
            },
            "answer_text": "TL;DR but utterly unsatisfying answer: Yes.  Okay so let's explore why math is important to learn in a more indepth manner. First, I'll provide a list of resources that I invite you to go to for further exploration of the topic. Next, I'll try to define the parameters of this conversation, because the question of learning math takes into account many different aspects such what does important mean and the distinction between arithmetic and mathematics. Then, I'll try to describe the basic arguments that many of the various thinkers on the topic will say. Finally, I'll conclude by being specific about how someone who doesn't go into a mathematical field can benefit from learning math and essentially summarizing the argument that learning math is important. ONE - RESOURCES[book] How Not to be Wrong by Jordan Ellenberg[video] How Not to be Wrong - synopsis and stories from the book  [book] A Mathematician's Lament by Paul Lockhart - can be found at Page on maa.org[web] Numberphile - just fun examples of why understanding math is important Videos about Numbers and Stuff[web] Why Do We Learn Math?[web] Top 11 Reasons Kids Need To Learn Math TWO - DEFINITIONSThe question 'is learning math important?' has somewhat subjective factors that are loose and in need of defining before I start. When you ask that my first reaction is what do you mean by math? and my second is what do you mean by important? In the course of this answer, I'm going to address both of those factors, but maybe not in the way you intended, so I'm going to define what I mean now so we can both understand where we are throughout the conversation.  Important? When I read that question, I make a presumption. That presumption is that you want to understand the value that mathematics has for you. Unfortunately, I do not know what you value most, so I'll try to explore a bunch of different ideas. Typically, the importance has a degree of significance or profoundness included in it, but I'm going to ignore that and only address does math have value and hope that I build a strong enough argument that you think, yes, it is important.  Math?In my experience teaching or tutoring math at the university, when people say math, they tend to mean one of two things, algebra or arithmetic. When I talk about math though as a teacher, I tend to embrace both of those topics along with all the other forms of mathematics, but especially including mathematical thinking and logic formulations. Why? Because those are just as much a part of math as the others. THREE - THE ARGUMENTSMath is solving problems.The first argument often espoused is that math is about solving problems. It's true, math can be used to solve problems, but that's not all it does. Besides, if you ask designers what design is, they will tell you that design is solving problems. Wait, what? How can they both be solving problems while featuring completely different toolsets? The answer is too vague. I think we can both agree that solving problems is really important to ensure the survival of the human race from this century to the next. We face all sorts of problems from radicalism to environmental changes to energy/food/<insert thing> shortages. Those problems need solving or we may not continue living. Plus, we know everyone wants that super ability to directly plug into the internet to escape life. Someone has to invent that too. While true and important, the answer is unsatisfying because it's too vague and doesn't explain how math fits into the context of the problems we face. Math is beautiful.This argument runs into the same issue as math is solving problems. What does it really mean? And it suffers a significant failure. It doesn't explain math's value to the user. What the argument is trying to express is that, you do not have to think of math as something that's practical and pragmatic only. Math has a fascination all of its own and if you beat that out the teaching math in favor of practical pragmatic teaching focuses, the lack of creativity and playfulness will turn students off from learning math. This is more of a pedagogy argument, but it is one that is important to understand in that it helps to open the possibility of the questions that math can answer or describe. Which leads us to... Math is practical and pragmatic.You've heard someone say, it's important that you learn math so that you can balance a check book or maintain your budget or calculate a tip, right? These practical examples of the uses of math are an important aspect of why you should learn math. Your financial health could depend on it. But that doesn't really justify learning calculus or differential equations or upper levels of math, it only explains (in a boring way) why we should learn arithmetic. Blech.  Math is rational.This argument is a weird one to justify sometimes and people use it to suggest that math can be easy. Yes, math features strict logic symbolism and systems of movement , but if I told you that there are irrational numbers and ideas that seem logically flawed, you would call me crazy for thinking that math was rational. For instance, before the advent of zero (0), there was serious debate over where there was nothing or zero, what that difference meant, and whether or not we should acknowledge it, because the concept is crazy. Now we think that it's crazy not to have a zero numeral or null set, but there are other branches of math that hypothesize things that seem intuitively irrational and until we can solve those problems, we can't prove that it is or isn't.  Math is the language of explanation.Usually, when someone says this, they mean that mathematics can be used to describe a relationship between two or more objects. For instance, x = 9 + y describes the relationship between x and 9 + y by equating them as equivalents. But that's a really boring example. Super boring. I prefer this one: Let's suppose I'm a professional baseball player.  I have 1 at bat during a baseball game, it is the only professional game I ever play in, and I knock the ball out of the park. WHOOOOOO! Homerun. I'm circling the bases and cheering, because my batting average is 1.000. It's perfect. If we compared my batting average to that of the great baseball players of all time, I clearly have their averages beat so I must be the better player... or was I just lucky? Math can explain the relationship by providing equations and assumptions for us to test. Because, I'll be honest. I'm no where near as good as Babe Ruth or Hank Aaron and you know that even if my average looks better than theirs. Math is important because it explains that intuition you have that I'm not better than them. How? Well, first we can establish a minimum standard of you must have played 10 games. We can also provide probabilities for how likely a batter is to hit the ball during their first at bat. Etc.  This may seem like an insignificant factor, but I disagree. We process a lot of information every day and understanding the relationship between things is important to understand when numbers are being reported improperly or not. It also let's us go, that doesn't seem right when we are predicting how something should function at work. Coders, man they program in math nearly.  FOUR - SUMMARYSo what does this mean for someone who graduates without math? In my opinion, it means you're handicapped for life because you will have difficulty understanding correlations and causations that pop up in the news, work, and our lives. It means those relationships between two or more objects may seem foreign and you'll make incorrect associations. For instance, what is the difference between 'Buy 2 and get both half off' and 'Buy 1 Get 1 Free?' Nothing really. They are considered equivalents. What about if we change the first to '1/2 off?' Well those aren't equivalents because I can now buy 1 to get the savings instead of buying 2. They are similar. If that tedium can make the difference between making or breaking my budget for the month, what could it do if someone was a manager for a corporation and couldn't distinguish between two solutions that appeared the same but weren't?  Math is important for lots of reasons.  I recommend learning a little bit more about math by either reading or watching youtube videos on the subject and looking for the patterns (hey, that's a math skill!) or contacting a math professor and asking them how you might apply math in your life and career of choice. They should be able to explain many aspects that help you as you go forward through life. ",
            "date": "Answered October 2, 2015",
            "views": "38",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kat",
                    "user_href": "/profile/Kat-844"
                },
                {
                    "user_id": "Betsy Megas",
                    "user_href": "/profile/Betsy-Megas"
                }
            ]
        }
    ]
}