{
    "title": "Is it worth studying business at a university? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Mausam Shah",
                "href": "/profile/Mausam-Shah-3"
            },
            "answer_text": "This is a very subjective question and largely depends on the target country where you are looking to work in future or start your business. I can give you examples from India and Europe because I am aware of these places. In India, where business schools are in plenty it is mandatory by peer pressure to study business at a University (Premier ones) to start or succeed in Business. Moreover, with a business degree on your CV you earn trust that “he is a B school grad, he must be doing it right”. There are few exceptions who have done good in Entrepreneurship without a business degree but that ratio is small. Moreover studying in a business school helps you to make contacts with like minded people and it helps in future. Sometimes people help you even without knowing you just because you are from the same college or were a contemporary but in another department. In Europe, It really doesn't matter having a business degree till you know your business well. Learning on the job is given more weight than having a degree. So you can either get a business degree or learn on the job and then start your Entrepreneurship. And if you can get both it will be icing on the cake. People don’t judge you in Europe for the lack of a Business degree. I would suggest you to do a profile research of successful entrepreneurs in your target area on LinkedIn. See if they have a degree and from what college. Sometimes you just need to imitate successful people to be successful. All the best! ",
            "date": "Answered March 23, 2017",
            "views": "1",
            "upvotes": " Answer requested by Evgeny Orman"
        },
        {
            "author_info": {
                "name": "William Lambert",
                "href": "/profile/William-Lambert"
            },
            "answer_text": "Compared to what degrees? If a science degree; No. If an art degree; Yes. B.S. No; B.A. Yes. In the final analysis, it depends on the individual. My daughter received her Bachelor in Accounting and her Master in Business. She was hired and accepted in a major corporation executive training program for her Master. ",
            "date": "Answered December 15, 2016",
            "views": "488",
            "upvotes": "0"
        }
    ]
}