{
    "title": "Is it right to conduct the exams in the current situation of covid? Are exams really necessary? - Quora",
    "tags": [
        "COVID-19 (2019-2020)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jagdip Madaan",
                "href": "/profile/Jagdip-Madaan"
            },
            "answer_text": "Exams are necessary or not is more controversial than demonization.Well we have only one parameter to send the kid to next class or select the kid for a course. There is no way except to hold exams. In PGI Chandigarh for PG admissions at long time back after theory there was a practical exam but we saw so much bias in that theory toppers were selling tea before PGI and lowest rankers were doing PG so we r very happy with only theory exams ( for those people who after doing potty suddenly give gyan that medical education is bad and students entry should be by proper assessment because they donot know the history). Well when alcohol shops have opened and every other activities have started and colleges are asking for fees even of lockdown periods you canot expect logic in india. Jaihind ",
            "date": "Answered October 22, 2020",
            "views": "104",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ashish Kadam",
                    "user_href": "/profile/Ashish-Kadam-210"
                },
                {
                    "user_id": "Atul Roy",
                    "user_href": "/profile/Atul-Roy-68"
                },
                {
                    "user_id": "Ansuman Sahu",
                    "user_href": "/profile/Ansuman-Sahu-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Krishnamoorthy Ramachandran",
                "href": "/profile/Krishnamoorthy-Ramachandran-5"
            },
            "answer_text": "Exams are necessary to evaluate a student's grasp of what has been taught so that it will help the student to improve upon his performance further.This is general assumption and is accepted worldwide.Some exceptions may be there.But let us not politicise ( politicians are clever to make one exception as rule for all or one bad thing they wil make it universal)With proper safety protocol in place exams are conducted.Ceylon,Newzealand are countries which have conducted elections amidst Covid -19.Calculated risk has to be taken.Otherwise there will be only stagnation. ",
            "date": "Answered October 21, 2020",
            "views": "14",
            "upvotes": " Answer requested by Venkat M"
        }
    ]
}