{
    "title": "Is it possible to complete college without math? - Quora",
    "tags": [
        "Mathematics Education",
        "The College and University Experience",
        "Mathematics",
        "Education",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sarthak Patipati",
                "href": "/profile/Sarthak-Patipati"
            },
            "answer_text": "If you are currently a high school student in the US, then no. You should take at least two years of high school math before you graduate according to the requirements set by the California Department of Education. Note that these requirements are standard amongst most high schools in the US, with minor differences.  Some colleges require at least three years of math before you apply, and some STEM majors require even more. However, I am not sure what the math requirements are for universities in other countries. I would highly recommend you check in personally with the colleges you are interested in. If you're planning to go to trade school, then even they want you to graduate high school or have an equivalent degree. If you still have no math background, then you can take classes from nearby community colleges for almost no cost. Good luck! ",
            "date": "Updated May 8, 2020",
            "views": "371",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emily Willmoth",
                    "user_href": "/profile/Emily-Willmoth"
                },
                {
                    "user_id": "Alan Zoller",
                    "user_href": "/profile/Alan-Zoller-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tanya Ahuja",
                "href": "/profile/Tanya-Ahuja-65"
            },
            "answer_text": "Hey! Yes you can get into MANY Universities without maths but it depends on many criterion The subject or course you chooseYour educational backgroundThere are many courses in which mathematics is a compulsory subject such as commerce. But there are many courses related to the Humanities stream which do not require mathematics. Similarly it depends on whether you are a Commerce student or an Arts student but you can always opt for the course of your choice according to your own preferences. I hope I've been able to answer your question. All the best! ",
            "date": "Answered July 21, 2020",
            "views": "183",
            "upvotes": "0"
        }
    ]
}