{
    "title": "Is it necessary to still have reservation based education and job system in India? - Quora",
    "tags": [
        "Reservation in India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nikhil Awadhiya Kurmi",
                "href": "/profile/Nikhil-Awadhiya-Kurmi-1"
            },
            "answer_text": "Yes it is necessary to have caste based reservations for jobs and educational institutions. Reservations are meant to ensure representation of those castes which have been discriminated in the name of caste since thousands of years and are still being discriminated. Reservations is not a poverty removal tool but it is a simple tool to ensure representation. OBC SC ST are the real majority in India with the combined population more than 80% of India's total population. Hence, minority should respect the wishes of the reserved community which is in majority. Proper representation is necessary for the unity, progress and speedy development of the nation. Hence any educated person will support it. Also, why was Simon commission boycotted? Because it did not had representation of Indians in it! Same thing is here with reservations. Majority of Indians must have representation in all sectors including sports, private sector, media, military, Bollywood etc. ",
            "date": "Answered June 17, 2019",
            "views": "199",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hema Arun",
                    "user_href": "/profile/Hema-Arun-1"
                },
                {
                    "user_id": "Sejal Das",
                    "user_href": "/profile/Sejal-Das"
                },
                {
                    "user_id": "Chetan Ghavri",
                    "user_href": "/profile/Chetan-Ghavri"
                },
                {
                    "user_id": "Pankaj Kumar",
                    "user_href": "/profile/Pankaj-Kumar-18500"
                },
                {
                    "user_id": "Sanidhya Singh",
                    "user_href": "/profile/Sanidhya-Singh-89"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sripal K Jain",
                "href": "/profile/Sripal-K-Jain-2"
            },
            "answer_text": "Reservations should be for financial backward classes of Urban and Village people. for some Jobs and Education Reservation should not be entertained where ability matters the most rather than your class and condition. for ex:- IAS, IIT Mains/Advance, etc. and Reservation should be helping the need one not to give benefits to a particular caste and depriving others. Thank You. ",
            "date": "Answered June 16, 2019",
            "views": "63",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sutanu Chakraborty",
                    "user_href": "/profile/Sutanu-Chakraborty-12"
                }
            ]
        }
    ]
}