{
    "title": "Is learning Esperanto worth your time? - Quora",
    "tags": [
        "Auxiliary Language",
        "Esperanto Culture",
        "Esperanto (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony Mechelynck",
                "href": "/profile/Tony-Mechelynck"
            },
            "answer_text": "I don’t know it you’ll find it worth your time — your centers of interest may be different than mine — but it definitely was worth my time. Esperanto allowed me to get into contact, on an equal foot, with people from all over the world, including not only people from all over Europe and both Americas, but also people from Israel, Uzbekistan, China and Japan, where the least you can say is that their mother language isn’t Indo-European. When a Japanese tries to say something to me in English, I usually have to ask him three times to repeat more slowly before I start guetting a vague idea of what he is driving at. In Esperanto I understand him immediately, even though I have to allow for the fact that the Japanese often confuse the L and R sounds when speaking. Esperanto congresses are the only world congresses where people from all language backgrounds come together and where they all understand each other perfectly without the need for interpreters and translators. In addition, if you speak no other language than your mother language, or only a few of them, learning Esperanto first will help you learn additional languages later, see Propaedeutic value of Esperanto - Wikipedia Where knowledge of Esperanto won’t help you is get into a position of power by putting it on your resume, because people in power regard Esperanto as subversive; and they do so because you can learn Esperanto fast with hardly even a teacher, and then use it to talk across language barriers without the need for an interpreter bureaucrat — or for Google Translate for that matter, though it does offer Esperanto as one of its languages. So these people in power labeled Esperanto with a lot of bad names throughout history, without even looking at what it really was: for the Czarists it was a language of Tolstoyan socialists, for the Nazis it was a language of Jews, for the McCarthyists it was a language of Commies, for the Stalinians it was a language of cosmopolitan petit-bourgeois, and so on and so forth. So is learning Esperanto worth your time? Maybe: judge for yourself after looking into what it really is (not only by listening at the lies its opponents spread about it). All I can say is that it certainly was worth my time. ",
            "date": "Answered December 15, 2019",
            "views": "11",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elyse Chambers",
                    "user_href": "/profile/Elyse-Chambers"
                },
                {
                    "user_id": "Michael Hein",
                    "user_href": "/profile/Michael-Hein-6"
                },
                {
                    "user_id": "Matthew Barnes",
                    "user_href": "/profile/Matthew-Barnes-250"
                },
                {
                    "user_id": "Angelos Tsirimokos",
                    "user_href": "/profile/Angelos-Tsirimokos"
                },
                {
                    "user_id": "Courtenay Rule",
                    "user_href": "/profile/Courtenay-Rule"
                },
                {
                    "user_id": "Kato Oyama",
                    "user_href": "/profile/Kato-Oyama"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cesar Gil",
                "href": "/profile/Cesar-Gil-1"
            },
            "answer_text": "Esperanto was the first effort at creating an artificial human language that succeeded, in terms of being simple enough. The previous efforts produced complex languages. Whether it is worth or not depends on what you consider worth.Some people say it is worth it because you can communicate with other esperantists, but this community is not so big. Others say it is good as a standard for international communication, but this hasn't caught on too much, either.Esperanto is extremely regular, in phonetics, and every grammar aspect, with little or no exceptions. The vocabulary has been from the most common roots of several compared languages. Dog, for example, is 'hundo', which is taken from 'hound'.Esperanto uses a rich set of prefixes and suffixes that can be combined to make more words. So instead of having different words for horse, mare and colt, you have one word for 'horse', and with suffixes you can reuse that word to convey 'feminine horse' or 'small horse'. You can even make 'small feminine horse' which is a wealth of detail that English cannot convey in one single word. So you have a small vocabulary to learn (only one tenth of what another language would require) and you can use it expressively and progress fast, because there are no exceptions (you don't have to memorize, for example, that the plural of man is men, and that of ox is oxen, etc since all plurals will follow the same basic rule in Esperanto).So to me the main reason to learn Esperanto is to appreciate the design of a language that succeeded in being simple, as a parameter for comparison with other languages and further efforts in creating successful articial languages, from a linguistic point of view. ",
            "date": "Updated May 29, 2019",
            "views": "66",
            "upvotes": " View 28 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tricia",
                    "user_href": "/profile/Tricia-170"
                },
                {
                    "user_id": "Zara Luo",
                    "user_href": "/profile/Zara-Luo-2"
                },
                {
                    "user_id": "Ismael A Zaragoza V",
                    "user_href": "/profile/Ismael-A-Zaragoza-V"
                },
                {
                    "user_id": "Vjera Lopina",
                    "user_href": "/profile/Vjera-Lopina"
                },
                {
                    "user_id": "Courtenay Rule",
                    "user_href": "/profile/Courtenay-Rule"
                },
                {
                    "user_id": "Theodore Wren",
                    "user_href": "/profile/Theodore-Wren"
                },
                {
                    "user_id": "Roman Bolshakov",
                    "user_href": "/profile/Roman-Bolshakov-1"
                },
                {
                    "user_id": "Ann Moody",
                    "user_href": "/profile/Ann-Moody-6"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Terry-Cupboards"
                },
                {
                    "user_id": "Wm Borg",
                    "user_href": "/profile/Wm-Borg"
                }
            ]
        }
    ]
}