{
    "title": "Is nursing or teaching more stressful? - Quora",
    "tags": [
        "Nursing (college major)",
        "Nurses",
        "Nursing",
        "Teachers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jim Anderson",
                "href": "/profile/Jim-Anderson-494"
            },
            "answer_text": "Nursing . I worked in a mental hospital first then a general hospital 2nd . I was working in the O R. Loved working there. Now I wasn’t a nurse I was a orderly. I was on one night they brought in a 14 year old boy. He was playing with a steel pipe. He dropped it and it started to spark al . He thought is was fun. Till it blew up taking his hand. When he got to the hospital they needed to put him under because of the pain. They called in a surgeon . But another came in and tried to take him. He wanted to cut his arm off from the elbow . But the other in and had him sent to the O R. The room was set up the scrub tech was already but the nurse looked at the boy and and couldn’t touch him, He was under a long time and needed to be taken out of it. To get another nurse be about 45 min. The boy could die. So the doctor said ask him if he got a strong stomach. Said yes I once operated on a dead possum . Doctor ask why you did that. Told him her belly was moving. He asked did you find out why. Said yes, she was dead but her babies were still alive. They were hanging in her pouch. So the milk stopped. He said what you do. Said found the hole to the pouch and put my hand in and pulled 4 babies out. He said he wouldn’t be able to do that. So he said you got experience to asst me. So I was cutting into the hand getting out lose bone and tenons . He was able to save the kids hand. A few days later was sent to the floor to scrub his chest to get the power out of the skin. So I told the kid why I was there. Then asked him do you know what happened that night ? He said yes and told me what was on the report. I told him it wasn’t gun power. He said yes it was . Asked him if he ever heard of chemical reaction with gun power. He said no. When you pack gun powder in a steel cylinder and leave it in a damp garage the dampness gets into the gun power and turns it to liquid . So when it went off you wasn’t alone. He said yes I was . Said you won’t believe me but god was with you. He held your hand. If he didn’t you wouldn’t be here. Him and his friends started to laugh. I asked did you ever hear about nitroglycerin. He said no. I said when you have a chemical reaction in gun powder it turns to nitroglycerin. Its about 300 times more powerful than gun power. The steel cylinder held enough to blow the top of a mountain. So what you think a bast like that will do to skin and bone. Just look at your hand. If you didn’t get help you should be in little pieces on the floor of the garage. I had finished his chest and told him to get better. I left none of them had a smile on their face. This happens all the time in a hospital. You could be on a floor and be called in to the O R or E R . In a classroom the worst thing to happen a kid don’t make it to the bathroom. He will take a fit because other students will laugh at him. So what you think is less stressful . ",
            "date": "Answered February 12, 2020",
            "views": "204",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Elizabeth Carms",
                "href": "/profile/Elizabeth-Carms"
            },
            "answer_text": "Quite frankly I’m not a teacher but I am a nurse so I can tell you some of the stresses I face each day in my Job. Having been a nurse now for the past 15 years as you’d imagine I’ve experienced quite a lot. And that’s true I’ve experienced most if not all scenarios by now. Nothing surprises me. But being a nurse isn’t easy. Nursing requires a unique individual. Someone who’s physically in shape and mentally in shape. You have to work long hours. And when I say long hours I mean long hours, like 12 hour shifts. You have to work weekends, holidays, night or day. You May get breaks yes of course but it’s no justice to how much work goes into nursing. Physically by the end of a working day you’ll be tired not just your feet but also your entire body. And then the next day you have to repeat that all over again. When you do get a break you need to make the most of them and also what support your employers got in place. Now that’s more the physical side of nursing. If we look at the mental side of nursing again it’s ram packed. At times it’s unpleasant, upsetting and get quite emotional. You have to be not just a nurse but a support. You have to support victims who’s maybe lost a loved one. Or you may have to support those suffering from mental health. This can be all quite draining. Also the long hours of work doesn’t help with this as you become fatigue both mentally and physically. Being a nurse can be challenging but that’s what keeps me motivated. It’s that challenge. Knowing what I do today, tomorrow or next Tuesday won’t be dull keeps me motivated to keep working as a nurse. For sure the are challenges but it’s how you overcome them challenges is what makes nursing a fun and highly enjoyable Job. Now I’m positive teaching isn’t easy, quite frankly I imagine. In fact I know they’ve got a tough job but again I can’t speak on behalf of the teaching community or from a teachers perspective. I can only tell you what it’s like being a nurse and challenges that I face. But to conclude I think both have the own unique challenges but from what I’ve experienced by no stretch of the imagination is nursing a easy job that anyone could do. It takes a unique person and set of skills to deal with all the challenges that you’ll face in nursing. ",
            "date": "Answered February 19, 2020",
            "views": "191",
            "upvotes": "0"
        }
    ]
}