{
    "title": "Is NITK a good choice? - Quora",
    "tags": [
        "National Institute of Technology Karnataka, Surathkal",
        "Career Choices"
    ],
    "response": [
        {
            "author_info": {
                "name": "Madhu Sudan",
                "href": "/profile/Madhu-Sudan-5"
            },
            "answer_text": "Not all all!! Nitk is really the worst choice you can make. Let's discuss why. Firstly academics, IIT Patna was established at the year 2008 and NITK at 1960. The faculty at nitk are really experienced and their teaching habits have survived the test of time. But what difference does experience make? New is better isn't it?? Nitk has many active student clubs both cultural and technical. Clubs like IEEE, IE, ISTE, rotaract, and some cultural groups like the Artist forum, music club, and the dance club are prominent. But what are these clubs if not a waste of time. Nitk had two fests, one cultural and technical names Incident and Engineer. The cultural fest incident offers pro shows by the likes of Sonu Nigam, Kailash Kher, Shreya Ghoshal etc. But you can see them on TV too isn't it?? One other thing is that these fests are completely managed by the student body. But, why take all the trouble when you can sit back and relax. The sports facilities here are supposedly top notch. The gym, the sports arena, the cricket and football field, the hockey field are some distractions which will affect your studies and get you low grades. There's almost 100% placements happening every year in the college. But who cares about the placement?? Last but the not the least, the college claims to have a private beach. But it's just sand and water isn't it?? And the sunset people brag about here is just scattering of sun light across the atmosphere isn't it? All the sarcasm aside, according to MHRD ratings, nitk is ranked at 22nd place where as IIT Patna is at 19. Since you didn't get into IIT Patna, getting into NITK is actually a genuinely good idea. The atmosphere here is amazing. If you get a seat here in a branch of your choice, accept it without any second thoughts. Hope it helped. And don't forget to upvote ",
            "date": "Answered June 14, 2017",
            "views": "21",
            "upvotes": " View 42 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gaurav Ahlawat",
                    "user_href": "/profile/Gaurav-Ahlawat-14"
                },
                {
                    "user_id": "Darshan Venkatesh",
                    "user_href": "/profile/Darshan-Venkatesh-2"
                },
                {
                    "user_id": "Vinay Rahul",
                    "user_href": "/profile/Vinay-Rahul-1"
                },
                {
                    "user_id": "Rohith Jaina",
                    "user_href": "/profile/Rohith-Jaina"
                },
                {
                    "user_id": "Rahul Naraniya",
                    "user_href": "/profile/Rahul-Naraniya-2"
                },
                {
                    "user_id": "Zen Sagar",
                    "user_href": "/profile/Zen-Sagar-1"
                },
                {
                    "user_id": "Kripakara Mn",
                    "user_href": "/profile/Kripakara-Mn"
                },
                {
                    "user_id": "Gurjot Singh",
                    "user_href": "/profile/Gurjot-Singh-983"
                },
                {
                    "user_id": "Likhitha Nanda",
                    "user_href": "/profile/Likhitha-Nanda-1"
                },
                {
                    "user_id": "Dhruv Banerjee",
                    "user_href": "/profile/Dhruv-Banerjee-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bharat Sharma (भरत शर्मा )",
                "href": "/profile/Bharat-Sharma-भरत-शर्मा"
            },
            "answer_text": "Brother tag wise IIT tag is very big and according to society NITs are like nothing. But if want to compare things other then tag then no doubt NITK >>> IITP. NITK is very old established and a tier 1 college whereas IITP is newly developed and is famous only because of IIT fame earned by old IITs. Alumini network of NITK is way better than that of new IITs. Infrastructure of IITP is new and is excellent but NITK have all kind of buildings some are old some are new. And if you compare campus beauty our campus falls among the top 10 most beautiful campus of India and one and only Indian college with private beach. As you said it take intake through state quota and DASA quota too, ya it hurts in starting but in the end its good because now you can compete in all fields , let me clearify you maybe you think that thoes guys are not like you JEE guys but they all are talented in their respective fields and you’ll get chance to explore all of them. Now coming to campus site, if you love travelling or photography just come here, you’ll find a lot to explore in south. Its beauty. NITK is near to GOA (~400Km), banglore(400km),coorg,kerla etc etc. All tech and non tech clubs are well established and are working smoothly. You’ll feel sometime there are alot to do other than studies. One thing is bad that is politics,people are from different different region hence they land up by making their own group, I suggest avoid that. Just step out of your comfort zone , and then you’ll freely enjoy and will explore their culture too. We ourself have group of 10 people where we are from 7 different states. Apart from that if I include my wingmates too it will be like bharat darshan. Ya our campus is small in size(300 acre approx), and buildings are old too but its way beautiful than this new colleges. One more thing if you’ll come here and just sit and regret than brother NITs are not for you, here you have to step out from your rooms to have fun and we work too as we are not known for tag but for our work. Have a look at our campus too: Which has a better campus, NITK or NITT? Brother stop comparing top NITs with new IITs. Remove their tag and then see where they stand. If you want to earn respect of thoes uncle and aunties or lets say you want to brag infront of them go for new IITs. Best of luck. ",
            "date": "Answered June 13, 2017",
            "views": "12",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeevan Addepalli",
                    "user_href": "/profile/Jeevan-Addepalli"
                },
                {
                    "user_id": "Tejas Gowda",
                    "user_href": "/profile/Tejas-Gowda-117"
                },
                {
                    "user_id": "Balaji Rao",
                    "user_href": "/profile/Balaji-Rao"
                },
                {
                    "user_id": "Pavan Pruthiv",
                    "user_href": "/profile/Pavan-Pruthiv"
                },
                {
                    "user_id": "Abhinav PY",
                    "user_href": "/profile/Abhinav-PY"
                }
            ]
        }
    ]
}