{
    "title": "Is probability 'real' math? - Quora",
    "tags": [
        "Teaching Mathematics",
        "Probability (statistics)",
        "Mathematics Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jayesh Lalwani",
                "href": "/profile/Jayesh-Lalwani"
            },
            "answer_text": "Probably.  Sorry. Lame joke. When you say something is \"real math\", it brings up the question, what is math? Is math numbers? Is math merely being able to perform computations? Is it being able to perform those computations fast? After all when you say John is good at math.  You could mean any of those things, right? But actually it's neither of those things. Math is a language. It's the language that we use to describe and predict the effects of observed phenomena. So, when we say the earth goes around the sun, what we do is describe in mathematical terms how exactly the earth goes around the sun. Just like language, the power of math lies in how well it can express the underlying concepts. An Equation that describes a phenomena succinctly and completely is better than one that doesn't. Now there are some phenomena that are deterministic in nature. For example you roll a ball on a wooden floor. It rolls and comes to a stop. You do the same thing again and the ball does the same thing. That's deterministic behavior. Deterministic math can be used to describe the motion of the ball. Essentially Newton's equations provide exactly the math that describes the motion of the ball. However, certain phenomena are probabilistic in nature. You flip a coin. Sometimes it lands head, sometimes it lands tail. There's no way to describe this using deterministic math. You need probabilistic math to describe probabilistic phenomena. So, probabilistic math is real because probabilistic phenomena is real ",
            "date": "Answered October 1, 2015",
            "views": "27",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ahmed Alhashmy",
                    "user_href": "/profile/Ahmed-Alhashmy"
                },
                {
                    "user_id": "Phil Palmintere",
                    "user_href": "/profile/Phil-Palmintere"
                },
                {
                    "user_id": "Vaibhav Verma",
                    "user_href": "/profile/Vaibhav-Verma-19"
                },
                {
                    "user_id": "David Joyce",
                    "user_href": "/profile/David-Joyce-11"
                },
                {
                    "user_id": "John Samaklak",
                    "user_href": "/profile/John-Samaklak"
                },
                {
                    "user_id": "Karen Tiede",
                    "user_href": "/profile/Karen-Tiede"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Lamar",
                "href": "/profile/Michael-Lamar"
            },
            "answer_text": "Until Kolmogorov created one in 1933, there was no formal axiomatic foundation for probability theory that was general enough to support the field as we know it today.  Long before that, of course, people had thought a lot about randomness and how to model it mathematically, but the modern mathematical field of probability theory was really born less than a century ago.  But a real mathematical theory it certainly now is.  It is a collection of theorems and proofs based on a list of axioms.  That it is spectacularly useful in a way that some other branches of modern mathematics are not should not be held against it.  It is as \"real\" as its forefather analysis or abstract algebra or topology or geometry... ",
            "date": "Answered September 29, 2015",
            "views": "21",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tina Müller",
                    "user_href": "/profile/Tina-Müller-1"
                },
                {
                    "user_id": "Bob Amy",
                    "user_href": "/profile/Bob-Amy"
                },
                {
                    "user_id": "Gary Teo",
                    "user_href": "/profile/Gary-Teo-17"
                },
                {
                    "user_id": "Abdul Alsolami",
                    "user_href": "/profile/Abdul-Alsolami"
                },
                {
                    "user_id": "Abhinav Maurya",
                    "user_href": "/profile/Abhinav-Maurya"
                },
                {
                    "user_id": "Matthew DeGraaf",
                    "user_href": "/profile/Matthew-DeGraaf"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta"
                },
                {
                    "user_id": "Caleb Oki",
                    "user_href": "/profile/Caleb-Oki"
                },
                {
                    "user_id": "Arup Ghoshal",
                    "user_href": "/profile/Arup-Ghoshal-1"
                },
                {
                    "user_id": "Greg Price",
                    "user_href": "/profile/Greg-Price"
                }
            ]
        }
    ]
}