{
    "title": "Is remote learning effective? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Kirsten Schuder",
                "href": "/profile/Kirsten-Schuder"
            },
            "answer_text": "Yes, it can be very effective, but it depends on how it is delivered. I learned everything I needed for my masters degree via remote learning with two occasions I had to show up for residency for my program, mental health counseling. The program is accredited, so that was a big step for the school I attended. The learning was always asynchronous, which means that the teacher and students were not attending class. In-person instruction is called synchronous. I found asynchronous learning to be quite effective. If you do it right, students have access to books, supplementary “lectures,” which is just written materials, resources, and guided assignments that help students learn the materials step by step. However, now that the pandemic has occurred, some traditional schools are having a lot of trouble with remote learning. They are stuck on the fact that students have to attend class every day. I believe elementary and high schools have the opportunity to study what is most effective in remote learning and how to best deliver the content via remote learning. Most schools have only begun their journey. If they evolve, hopefully we can see more teachers give remote lectures and record them to be made available for later. This way, students can listen to them over and over again. Also, assignments will be fashioned in a way where students can learn the materials thoroughly. I go through a lot of remote learning strategies in my book, Schooling Your Kids Through a Pandemic. It’s available on Amazon to read for free in the Kindle Library. ",
            "date": "Answered October 21, 2020",
            "views": "7",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Deepak Patidar",
                "href": "/profile/Deepak-Patidar-316"
            },
            "answer_text": "Well, colleges have been practising remote learning for a long time now and there is no denying that due to covid-19, remote learning has been popularised not even by private colleges but also by government colleges as well, as it is the only way to keep the education sector normalised and keep our students safe and secure without delaying their career advancement. Remote learning is very effective specially for cities which are in the red zone like Mumbai, Indore, Pune as these cities have unusually large proportion of students heading their way from other small cities to study and hence, remote learning for colleges which is prominent in the above mentioned cities or other red zones cities should be preparing themselves for it. If we particularly talk about Indore, many colleges have already prepared for the crisis and have made and designed their curriculum suitable for remote learning so that they can be ahead and grab this opportunity to the fullest! Colleges like Indore Management Institute (IMI), have taken steps towards the remote learning programme, all details mentioned on their official website : click here IMI offers the following courses BBA, BCOM, MBA, LLB, BALLB, PGDM. So if you’re a student who is still in graduation final year or a 12th class student awaiting results, then you should definitely start with the program and not delay or take a year drop in your education. Remote learning is here to stay for a long time, and with corona being so active and dangerous, it might be our only option to keep alive our education sector so it’s an advice to all the colleges, that you should adapt it before it’s too late, as many colleges have done it and are doing it very successfully from years even before the crisis came and made it mandatory. Indore Management Institute offer following courses BBA, BCOM, MBA, LLB, BALLB, PGDM and some additional programmes like DATA ANALYTICS, DIGITAL MARKETING, PERSONALITY DEVELOPMENT IN INDORE ",
            "date": "Answered June 9, 2020",
            "views": "94",
            "upvotes": "0"
        }
    ]
}