{
    "title": "Is self study or studying with tutors better? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Yusra Naaz",
                "href": "/profile/Yusra-Naaz-1"
            },
            "answer_text": "Many people would say the second option is better, but, according to me, self-study is best.  Reasons: It costs you less: As you may know, classes and private tutoring fees are constantly at rise, and believe me, in Mumbai, where I live, just for a year, in 10th or 12th class, the classes/private tutoring fees is 50k. So, I think here, self study costs us really less. It's almost free.If you don't understand something, internet is always there: The only cost for self study is the internet cost for the online lectures, or tutorials, and notes. You can get everything online, from chapter explanations to examples solved in videos, and lectures for every chapter in every subject, no matter what class, what field and what language, all for free. So many sites, so many channels, and if you have doubts, then you have apps like Quora. So, the internet can take place of that experienced teacher.Less disturbance: Noise and other kind of disturbances while studying in classes or taking private tutions are not present while studying by oneself. Less disturbance brings upon more concentration.Saves time: Getting ready, going to and fro tutions/classes, consumes almost 1 or 2 hours of a day. This is reduced when you study by your own self. Avoiding Tutions/classes= saving 4–5 hours a day. (Exception: Tutions/classes are not at a far distance from your home or the teacher visits your home to study).Saves energy: The energy used in travel to tutions and then studying can be added as plus energy when studying at home, alone.You can have holidays when you want😝: Well this can count as a plus point cuz when you study by yourself you can have holidays for free, without anybody's permission and “burden”.This concludes how convenient and better is self study. The only condition here is, you have to be serious. You can do self-study only when you're serious about your studies. Otherwise it may not be good for you. I have personal experience of the matter and believe me it's amazing. Hope that helps :) ",
            "date": "Answered March 1, 2020",
            "views": "547",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hira Hussain",
                    "user_href": "/profile/Hira-Hussain-13"
                },
                {
                    "user_id": "Aparna Ravi",
                    "user_href": "/profile/Aparna-Ravi-57"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Mathematics-Lover-8"
                },
                {
                    "user_id": "Rashida Multani",
                    "user_href": "/profile/Rashida-Multani"
                },
                {
                    "user_id": "Dev Asheesh Chopra",
                    "user_href": "/profile/Dev-Asheesh-Chopra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neil Britto",
                "href": "/profile/Neil-Britto-3"
            },
            "answer_text": " Self studies vs Classroom studies: Which one is better way to learn? Students need to adapt to different learning techniques to study well throughout their academic session. While in school students learn new concepts every day for all subjects from different teachers. The curriculum and learning style for every subject is different and students have to learn every technique to study well and keep track of every subject. Where students are advised to clarify their doubts with teachers at school, on the other hand, they are told to do self-studies if they want to learn effectively. School students are always confused about their study strategies and they need proper guidance from teachers and therefore, school teachers are only best option to study well. But some students do not consider self-studying so important rather they prefer taking tuition classes at coaching institutes for getting extra help with homework and exam preparation. But the question here arises is, whether students really learn effectively with classroom learning be it at school or at coaching institutes or they need to study themselves for better understanding and long-term learning. Here we are discussing both self-studies and classroom studies that will be helpful for students to decide what is better for their effective learning. Importance of Self Studies – Self-studies are better as compared to spoon feeding at school and coaching institutes because students focus on learning the subjects themselvesWhile studying themselves students also figure out the doubts and problems in concepts and they try to find answers by understanding the basic concepts on their own. It is called practical learning when students are involved in the thorough understanding of concepts then they can tackle different types of questions from the conceptSelf –studies help students in developing discipline and they feel motivated to study better and the studies seem smooth to themWhen students study themselves they explore various study material and are not just limited to certain subject books. They seek study notes, online study material as well as video tutorials, which is great for effective learningWhile in the classroom, there are various distractions which affect students while studying and hence, students could not pay attention properly. But when they are engaged in self-studies then they have minimum chances of getting disturbed as they will be scheduling their study time as per their convenience so that they can completely concentrate on studiesImportance of Classroom studies – New concepts can only be understood in the classroom at schools. Students will get to know basic understanding and implementation of learning techniques only in the classroom only. It is a fact that students need help from teachers to understand new concepts, as they are not able to understand everything by reading books.Students can clarify their doubts from teachers in the classroom only. Which they won’t be able to get during self-studiesStudents not only understand new concepts in the classroom, they also get to know different learning styles from teachersStudents get an engaging environment in the classroom as they are interacting with their teachers and classmates while studying which is really important for learning and also they develop interpersonal skillsClassroom studies are effective as compared to self-studies because classroom studies have a routine which cannot be skipped by students, where there are maximum chances of them becoming lethargic during self-studies and hence, negligence of studiesConclusion – Both self-studies and classroom studies are essential for students’ effective learning. Students need to practice the new concepts in the classroom on their own while doing self-studies. ",
            "date": "Answered September 20, 2019",
            "views": "684",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hira Hussain",
                    "user_href": "/profile/Hira-Hussain-13"
                }
            ]
        }
    ]
}