{
    "title": "Is SBI smart scholar plan good from investment point of view? If not, what other plans should I consider for my kid’s education? I am 35 and my child is 4? - Quora",
    "tags": [
        "Personal Finance Investment Advice",
        "Personal Savings",
        "State Bank of India (SBI)",
        "Investment Strategies",
        "Mutual Funds",
        "Investment Advice",
        "Personal Finance",
        "Children",
        "Investing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bala V",
                "href": "/profile/Bala-V-82"
            },
            "answer_text": "You mentioned two things in your question SBI Life Smart Scholar Plan and Investment Point of View SBI Life Smart Scholar plan is a Unit Linked Insurance Plan or ULIP. You should never consider any Insurance Scheme for Investment purpose as they give dismal returns compared to other schemes. Please read the article at Say no to endowment policies and ULIPs which gives more details and also compares similar investment plans. What other plans or Alternatives? You need to do this in 2 steps after estimating the Corpus you want to build for your Kids Education. STEP 1: Just to take care of any eventuality, take a simple term Insurance for your Life. Total Cover amount should be equal to the amount you want your dependents to get for leading their life in the absence of your financial support. Term Insurance just provides life cover at the least possible premium. In case you have already taken any Life Cover that exceeds that amount just leave it Else take additional cover using Term Insurance. This only covers Risk and should not be seen as Investment. STEP 2: Conservative method - open a PPF account in your childs name. Using calculators available online find out how much you need to deposit in PPF every year to reach the target Corpus for education. But PPF has lock in of 15 years so the child can get the full amount only at the age of 19 If you already have a PPF account in your name the best thing would be to deposit the amount in that and close it anytime after 15 years. PPF is most tax Efficient compared to FD RD etc Not so Conservative Method - Choose 2 or 3 equity Mutual Fund schemes and start investing using SIPs. Returns you will get for periods longer than 10 years will be phenomenally higher compared to other schemes. Review portfolio of MF schemes every 2 or 3 years and change the choice of MF scheme for SIP as needed The best and in between method will be to build the corpus by using a combination of PPF and MF Schemes ie build 30 or 40% of Corpus using PPF and remaining 70% using Equity MF Schemes. ",
            "date": "Answered July 3, 2019",
            "views": "28",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Vidya Barath",
                    "user_href": "/profile/Vidya-Barath-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dev",
                "href": "/profile/Dev-805"
            },
            "answer_text": "SBI smart scholar plan is a ULIP. Personally I do not recommend anyone to invest in ULIPs. Insurance and investment must be kept separate. I will suggest that you buy a term plan of adequate cover for yourself. With term insurance you will get a high life cover at low premium which you will not get in ULIPs. So in case of any unforseen event, your family is taken care of. For your son's education requirements which will be about 15 years down, you can invest in a good equity MF via SIP. With the long time frame, your investment has sufficient time to grow and build you a good corpus. A couple of years from when your corpus is required, shift your investment into a good short term debt fund or a bank FD ",
            "date": "Answered June 30, 2019",
            "views": "13",
            "upvotes": " Answer requested by Vivek"
        }
    ]
}