{
    "title": "Is telling a manager that something is below your pay grade considered insubordination? - Quora",
    "tags": [
        "Salary Negotiation",
        "Managers",
        "Compensation",
        "Salary and Wages Advice",
        "Salaries for Specific Jobs and Careers",
        "Management",
        "Salaries and Wages",
        "Psychology of Everyday Life",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rand Knight",
                "href": "/profile/Rand-Knight-1"
            },
            "answer_text": "Every employment contract I’ve ever signed has the clause ‘and other duties as required.’ That literally means my job is whatever they say it is. So as long it’s legal, safe, I’m qualified and am supplied with the necessary and appropriate PPE and tools, then I’m doing it. If my boss tells me to clean the toilets and tells me where the gloves and cleaning products are, then I’m one overpaid toilet cleaner! If I can’t bear it, then I can always quit and find another job. To answer the question, yes, refusing to do the work assigned is insubordination unless you’ve got a much better reason than ‘it’s below my dignity’. ",
            "date": "Answered March 17, 2019",
            "views": "296",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gina Hall",
                "href": "/profile/Gina-Hall-2"
            },
            "answer_text": "It depends on HOW you tell him. “Thats below my pay grade. I refuse to be belittled like that.” Boss is thinking “your job is to do what I tell you. Why are you complaining? You’ll still get paid” ”I’ll do that if you want me to. But you hired me because I have specific skills that you needed for specific jobs. Do you think that’s the best use of the time you pay me for?” That gives the boss a moment to think about what he needs you doing most, and hopefully he remembers someone who is in the paygrade for the thing he wants done. Even if he still tells you to do the thing, you didn’t piss him off and you still get paid. ",
            "date": "Answered March 14, 2019",
            "views": "434",
            "upvotes": "0"
        }
    ]
}