{
    "title": "Is there a way to become an archaeologist without a degree? - Quora",
    "tags": [
        "Archaeologists",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barbara Dysonwilliams",
                "href": "/profile/Barbara-Dysonwilliams"
            },
            "answer_text": "In short, no, at least not recognized as one. To be a true archaeologist you have to have studied about the culture you’re interested in as well as the principles of how to dig, etc., Without that knowledge, every artifact you find is suspect to the actual age because you have to be able to identify the layer from which it came (provenance) from which it came. The earliest “archaeologists”, for example Schulman who discovered Troy was not an archaeologist but is looked upon by the archaeological community as more of a grave-robber as were the others of his time & before. As mentioned below, you can work as a ‘digger’ at a site but you would be under the supervision of an archaeologist who would tell you where and how to uncover your square. ",
            "date": "Answered September 1, 2018",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Georgene Wickstrand",
                    "user_href": "/profile/Georgene-Wickstrand-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Harrison",
                "href": "/profile/Paul-Harrison-69"
            },
            "answer_text": "UK My boss did not have one at a unit, nigh on impossible now. He left to go to Oxbridge to get one in Saxon Studies. You can be a digger without one, its a tough, insecure, poorly paid, interesting life Not all archaeologists dig every day of their working life , as a finds specialist in 40 years about 150 days I think I calculated once have I been on site ",
            "date": "Answered November 13, 2016",
            "views": "19",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Al Kirmani Ahmad",
                    "user_href": "/profile/Al-Kirmani-Ahmad"
                },
                {
                    "user_id": "Dinesh Arjuna",
                    "user_href": "/profile/Dinesh-Arjuna-1"
                }
            ]
        }
    ]
}