{
    "title": "Is there a 34th degree in Freemasonry? - Quora",
    "tags": [
        "Freemasonry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Donald Daly",
                "href": "/profile/Donald-Daly"
            },
            "answer_text": "Absolutely, it is so secret, so hidden so super dooper secret that very few have been granted access into the sacred precincts. The only way one can be considered for it is that they must labor many years of toil and travail in the kitchen, providing sustenance for their brethren when they are called from Labor to Refreshment. Setting the menu, shopping and conveying it to the Lodge, arriving early, long before anyone else is there, you don your apron, start up the dishwasher, convection ovens and go to work. When recalled to Labor. The work of those who pearl dive begin their work, sometimes everyone has left, yet the kitchen denizens finish. The 34th degree is only for those who have borne the heat and burden of the ovens, stoves and dish machines. Past Ilustrious Chief Cook and Bottle Washer Essex Lodge Salem, MA. The kitchen crew, all three of us were kicking around the idea of a kitchen degree. Here's to all those brothers who work in the kitchens. ",
            "date": "Answered October 19, 2020",
            "views": "83",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lawrence Ransom",
                    "user_href": "/profile/Horselips"
                },
                {
                    "user_id": "John Thwaites",
                    "user_href": "/profile/John-Thwaites-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lawrence Ransom",
                "href": "/profile/Horselips"
            },
            "answer_text": "Regular Masonry tops out with the Master Mason or 3rd degree. Appendant bodies have their own rituals and degrees or orders, but they are peculiar to those bodies alone and have no formal recognition in the Blue Lodge or in other separate appendant bodies. The Ancient and Accepted Scottish Rite offers their 4th-32nd degrees, which are numbered for convenience, not ranking or importance. The degrees are grouped within four bodies - the Lodge of Perfection (4–14), Chapter Rose Croix (15–18), Council of Kadosh (19–30), and Consistory of Kadosh (31,32). The Scottish Rite also rewards its most meritorious brothers with the honorary 33rd degree. The 33rd degree is an honor, but carries with it no office or authority aside from eligibility to be a member of the Supreme Council governing your particular Jurisdiction. It is, essentially just a well-deserved pat on the back. The York Rite consists of 3 independent bodies - Royal Arch Chapters, Cryptic Councils, and Knights Templar Commanderies. Each body offers its degrees by name instead of number. Other appendant Masonic organizations like the Shriners, the Grotto, Eastern Star, DeMolay, etc., have their own traditions as well. No member of any appendant body outranks any member of any other appendant body. Your jurisdiction’s Grand Lodge has authority over all the Blue Lodges and appendant bodies within it, and your Grand Master is the “highest ranking” Mason, although his job is not so much to rule or govern his Brethren as it is to serve them. ",
            "date": "Answered October 23, 2020",
            "views": "41",
            "upvotes": "0"
        }
    ]
}