{
    "title": "Is veterinary medicine hard? - Quora",
    "tags": [
        "Veterinary Medicine (college major)",
        "Learning About Veterinary Medicine"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Hawkins",
                "href": "/profile/David-Hawkins-28"
            },
            "answer_text": "Veterinary medicine is hard. I am not a veterinarian, but now own my private practice that I have managed since 1991. People get very emotional about their pets, just like any sick or injured family member.People worry they are being judged, when it was something they didn’t know. Lack of knowledge does not make you a bad pet owner.Animals can’t speak, so are unable to tell us when and where they hurt, or to describe any other symptoms they are feeling. We have to figure that out from owner descriptions and the physical examination.Veterinarians have to learn all species. There are significant differences between dogs, cats, birds, rodents, horses, cows, pigs, goats, sheep, etc.Not just the medicine, but also the economics differ for each situation. You may be willing to mortgage your house for your dog or cat, but someone else may be very limited in funds, and can barely manage the basics.Most pets don’t have insurance, so every service is paid out of pocket. We struggle to keep our fees affordable, so veterinarians and their teams earn far less than their colleagues in human healthcare. An MD and a DVM have comparable school debt, but the MD starts at double the salary of the DVM. Many veterinary employees don’t even make the $15 minimum wage now being sought in many states.Like human healthcare, veterinary medicine is becoming increasingly corporate, removing the flexibility from many veterinarians in how they treat a sick pet, and affecting the way clients are treated in many practices.We have to help clients with end of life decisions, and end the suffering of patients we have known and loved for many years. It’s hard, but we know we are able to help them pass gently.On the other hand, I can be having a really stressful day, and in comes a client beaming with pride and eager to introduce to us their new puppy or kitten. Of course, these need socializing, and we pass them around. Everyone gets an emotional lift, especially the proud new parents of this kitten or puppy. ",
            "date": "Answered August 20, 2018",
            "views": "29",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Julie Morrow",
                    "user_href": "/profile/Julie-Morrow-25"
                },
                {
                    "user_id": "Melis SJ",
                    "user_href": "/profile/Melis-SJ"
                },
                {
                    "user_id": "Evelyn Waugh",
                    "user_href": "/profile/Evelyn-Waugh-13"
                },
                {
                    "user_id": "Ashley Ow",
                    "user_href": "/profile/Ashley-Ow-1"
                },
                {
                    "user_id": "Shruti P.S.",
                    "user_href": "/profile/Shruti-P-S"
                },
                {
                    "user_id": "Dacelle Peckler",
                    "user_href": "/profile/Dacelle-Peckler"
                },
                {
                    "user_id": "Mia Hammett",
                    "user_href": "/profile/Mia-Hammett"
                },
                {
                    "user_id": "Monica Sloan",
                    "user_href": "/profile/Monica-Sloan-3"
                },
                {
                    "user_id": "P. Rose",
                    "user_href": "/profile/P-Rose-28"
                },
                {
                    "user_id": "Katie Brown",
                    "user_href": "/profile/Katie-Brown-1034"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julia Lewis",
                "href": "/profile/Julia-Lewis-48"
            },
            "answer_text": "Yes, it’s hard, but the rewards are great! The hardest part comes from veterinarians realizing that veterinary medicine is not just working with animals. It’s working with people. Most of us go into veterinary medicine because we love animals and maybe not so much people. So we end up having to work with something we’re not so fond of so that makes it hard. Vet school is hard. Most people going into veterinary medicine are Type A personalities push themselves hard to achieve, to be the best. After all, that’s how they were able to get into vet school. At some point though, to survive, they have to let go and acknowledge that not everyone in a vet school class can be the best, just passing is enough. That’s really hard to do. Medicine is hard work. Being responsible for the health and well being of another living being is stressful. We share that trait with physicians. But, at the other end of life, we have the responsibility and the privilege of helping to ease the pain and/or suffering that may come with illness. Sometimes, though, we are expected to end of the life of a perfectly healthy but unwanted pet. That is really, really hard. But, when you’ve been able to diagnose a particularly mysterious illness, or perform a complicated surgery successfully, or just provide proper advice to a client for their pet, and you see the healthy, happy pet at the end of your hard work. That’s joy! ",
            "date": "Answered August 23, 2018",
            "views": "66",
            "upvotes": " View 25 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Julie Morrow",
                    "user_href": "/profile/Julie-Morrow-25"
                },
                {
                    "user_id": "Evelyn Waugh",
                    "user_href": "/profile/Evelyn-Waugh-13"
                },
                {
                    "user_id": "Mich Chen",
                    "user_href": "/profile/Mich-Chen"
                },
                {
                    "user_id": "Susan E. Fore",
                    "user_href": "/profile/Susan-E-Fore"
                },
                {
                    "user_id": "Cathy Sneezed",
                    "user_href": "/profile/Cathy-Sneezed"
                },
                {
                    "user_id": "Shruti P.S.",
                    "user_href": "/profile/Shruti-P-S"
                },
                {
                    "user_id": "Liviu Singher",
                    "user_href": "/profile/Liviu-Singher"
                },
                {
                    "user_id": "Ye",
                    "user_href": "/profile/Ye-49"
                },
                {
                    "user_id": "Yasaman Kashefi",
                    "user_href": "/profile/Yasaman-Kashefi"
                },
                {
                    "user_id": "X-Kid",
                    "user_href": "/profile/X-Kid-6"
                }
            ]
        }
    ]
}