{
    "title": "I’m currently failing 2 classes in 6th grade. What should I do? - Quora",
    "tags": [
        "6th Grade",
        "Grades (education)",
        "Failure",
        "Studying Advice",
        "Academic and Educational Advice",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Just Viv",
                "href": "/profile/Just-Viv-1"
            },
            "answer_text": "Well first figure out why you are failing them. Do you hate those subjects? Have you put in enough hours to try and master them? Once you know you can go from there. If it's a hard subject for example… Cheimstry or Maths,( subjective I know, but for the purpose of advice ) you could hire a tutor online and take private lessons to get better. I had 6 hours tutoring a week when I was falling behind . If you look on less searched websites you could find tutors who are just happy to teach and won't ask for much money. I think my one asked for €20 per the whole week!! Make it fun! Do research on the topics. For Chemistry there are a dosen videos up on Youtube where people explain the same topics in a million ways. Besides it's a lot more colourful than dull textbooks! Try and discover your passion in those subjects. There is always something, maybe just a bit of it that awes you; I always had this awe for math thinkers who seem to get off on doing calculations and it makes them happy- I'm a visual thinker and for me their mind’s an inspiring mystery. Befriend people like that. STUDYING WITH A FRIEND MAKES IT FUN!! If all else fails, look at your marks and the score you need to get to go into university where you can finally study whatever your heart desires … with occasional additional topics… and work for that mark, if your chosen course college course would be your true passion then you need no other motivator to study! Good luck! ",
            "date": "Answered October 24, 2020",
            "views": "73",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rich Kern",
                "href": "/profile/Rich-Kern-5"
            },
            "answer_text": "There’s an old saying about doing the same thing and expecting a different result is insane. I think you have to change your ways. Any possible change in your grades will have to come from a total change in how you are handling yourself. Look at your attitude first. Do you even want to change or do you just want better grades? You have to want to change. Do you pay attention in class? Do you take notes? Do you do your homework? Do you ask for help? All of these are pieces that you can work on. Then, how do you study? Again, it is not working! Find a way that does work for you. Study alone, study with friends, have your parents quiz you, write important things down on paper, make yourself flash cards, teach the lesson to someone else, whatever it is, find it and use it. This all takes work, is that the problem? Long story short, unless you put in the work, you are doomed to continue to fail. ",
            "date": "Answered October 23, 2020",
            "views": "64",
            "upvotes": "0"
        }
    ]
}