{
    "title": "My counselor discourages me from applying to highly competitive colleges. Should I still apply? - Quora",
    "tags": [
        "College and University Life Advice",
        "College and University Admissions Advice",
        "Holistic Career Advice",
        "College Advice for Careers",
        "College and University Admissions",
        "College Advice",
        "Life Advice",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lawrence Chiou",
                "href": "/profile/Lawrence-Chiou"
            },
            "answer_text": "(Adapted from Lawrence Chiou's answer to Even if my counselor does not believe I can get into Stanford and isn't letting me apply, should I try and can I still apply?) It depends on why you think your counselor is discouraging you from applying. First and foremost, I would keep in mind that you have only one good shot at a  process that will have a significant bearing on your life  (re-applications are possible but are only advisable under certain  circumstances). The cost for trying is relatively low (and you can apply for waivers for the application fee if you need them) compared  to the potential benefits, as well as the sunk costs in terms of the thousands of hours you've probably spent studying for exams and participating in extracurricular activities and competitions. If you know that your counselor is knowledgeable and very experienced with the process, especially if you go to a competitive high school that has sent many students to highly competitive universities and colleges, he or she probably assess that your chances of getting into those schools are extremely slim. After all, it is his or her responsibility to complete the school report portion of the Common Application—why would your counselor want you to apply if he or she would just write a negative report? In this case, I would take your counselor's advice in the context of the parts of your application that you've shown him or her. If your counselor is knowledgeable, knows your entire application well, and somewhat intent in discouraging you from applying, then it may be a good idea to take his or her advice and not apply. It may save you a few bucks and, more importantly, not make someone who's going to have to complete your secondary school report for all of your other applications more frustrated than he or she needs to be. However, if you suspect that your counselor's experiences might be limited (or perhaps you have a bad relationship with your counselor for some reason external to academics), I wouldn't necessarily take his or her opinion wholesale. Some counselors forget that they shouldn't be \"chancing\" students based on where the students will likely get in. Rather, a student's decision to apply to one of his or her top choices should be based on whether that student has a chance, even a small one, of getting in; as everyone knows, luck is an important part of the process. There's a difference between realistic advice (e.g., suggesting admissions chances might be low) and overly aggressive advice (e.g., suggesting that admissions chances are zero). Secondly, counselors sometimes fail to anticipate the fact that the rest of a student's application (outside of grades, test scores, and extracurriculars) may be unusually strong given that student's academic record: recommendations and application essays won't offset an absolutely terrible academic record, but they can make a surprisingly big difference. The impact of having extremely rare talents or achievements in certain non-academic extracurricular activities may also be underrated (compared to other extracurricular activities and honors listed on a student's resume). Particularly significant also is status as an economically disadvantaged applicant or underrepresented minority. Many applicants in these categories often forgo applying to highly selective colleges simply out of the sometimes unwarranted assumption that their applications wouldn't be competitive (oftentimes discouraged by their mistaken counselors), and nowadays top colleges are ramping up their efforts to recruit these students. Most counselors are reasonable people and should be willing, at a minimum, to complete the necessary paperwork for the Common Application if you insist. If your counselor is mistaken and you are indeed a remotely competitive applicant, admissions officers will see that discount (to some degree) negative comments from a possibly inexperienced counselor. I had a friend who was ranked outside the top three at his (relatively unknown) public high school. His counselor strongly discouraged him from applying to Harvard, but he did so anyway. He got in. ",
            "date": "Updated May 2, 2015",
            "views": "11",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andrew Watts",
                    "user_href": "/profile/Andrew-Watts"
                },
                {
                    "user_id": "Kashish Jagga",
                    "user_href": "/profile/Kashish-Jagga"
                },
                {
                    "user_id": "William Chen",
                    "user_href": "/profile/William-Chen-6"
                },
                {
                    "user_id": "George Anders",
                    "user_href": "/profile/George-Anders"
                },
                {
                    "user_id": "Urja Lakhani",
                    "user_href": "/profile/Urja-Lakhani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Urja Lakhani",
                "href": "/profile/Urja-Lakhani"
            },
            "answer_text": "If you have the time and the money, I say why not! There is nothing wrong in applying and there is always a chance that they will love your essay or some part of your application will impress them or make you stand out. The highly competitive colleges already receive hundreds of students with great grades and stupendous SAT scores. They look for something different. Sometimes it is also a matter of luck. One of my friends got into UC Berkley with a 1950 and his counsellor believed that he would not even be able to make it to University of Illinois- Urbana Champaign. So, ALWAYS TRY!  However, keep some target and safety colleges too and don't compromise on the quality of essays for your target/safety school. ",
            "date": "Answered April 4, 2015",
            "views": "299",
            "upvotes": "0"
        }
    ]
}