{
    "title": "My English teacher praised me in front of the whole class saying that 'this boy is most beautiful boy of the class'. Everyone was jealous, even my friend. What should my reaction be? - Quora",
    "tags": [
        "Jealousy and Envy",
        "Teachers",
        "Dating Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michiel van der Blonk",
                "href": "/profile/Michiel-van-der-Blonk"
            },
            "answer_text": "Your reaction to this should be to forget about it and focus on girls that are available and within your age group. To the teacher such a remark can mean anything: from trying to boost the boy's self confidence to subtle flirting. But remember that any actual relationship or sexual act can get the teacher fired, burned, and marked for life. This is is something no teacher wants, no matter how 'beautiful' the boy. Also, the only teachers interested in sex or romance with a very young student are pedophiles, who are sexual deviants with serious issues. You don't want to get involved in that. At a young age (12-18) hormones go wild in the body and everything is sexualized. For the teacher this is not the case. That's why such a remark could have been made as a mistake, or a joke, and it doesn't mean anything. ",
            "date": "Answered June 9, 2015",
            "views": "15",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Usama Bhalli",
                    "user_href": "/profile/Usama-Bhalli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan P. Long",
                "href": "/profile/Ryan-Long-8"
            },
            "answer_text": "You might try staying after class, waiting for the other students to leave, and explaining that the teacher really embarrassed you. You could thank her for the compliment and then ask her to please not embarrass you anymore. ",
            "date": "Answered June 9, 2015",
            "views": "912",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Usama Bhalli",
                    "user_href": "/profile/Usama-Bhalli"
                }
            ]
        }
    ]
}