{
    "title": "My exams are near but I am not studying at all, I want to study but it's just not happening. What should I do? - Quora",
    "tags": [
        "Study Habits",
        "Studying Advice",
        "Exams and Tests"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashish Chugh",
                "href": "/profile/Ashish-Chugh-8"
            },
            "answer_text": "Now that you are NOT studying, #SitBackAndRelax and see if the following helps. Mozart met Kalidas over a dart game in a juice bar. The bartender was eagerly watching them giving trash talk to each other. Kalidas said, “You don’t know what it is to be known as Shakespeare of the east even when you were born hundreds years before him.” Mozart hits the dart board and says, “Oh really! I wish life was this simple. You don’t know what it is to watch people getting crazy over your compositions after your death when while you were alive, nobody gave a heck to you.” “Ok, you win,” says Kalidas hitting the final dart in the center. Bartender exclaimed, “Kalidas wins.” My friend, that’s NOT called a win-win situation. The game was dart, not trash talk. Here is a strategy. If you fail this, there is no go. The strategy won’t fail for sure. Transform the lifestyle. To start with, fix the sleeping, waking, eating, and leisure time according to nature. Night calls for sleeping without mobile phone in the vicinity.Add meditation and eat less oily, less spicy food. Make your study area conducive. It will aid to correcting your procrastination. (See a photograph of my room. The centerpiece is the knowledge I want and surrounding is the leisure. It also has a plant, you know, just to look environmentalist.)Study. As Khurshed Batliwala said, “Come to reality or else you will fail.” Failure is good only in one condition: When you have given your 100%. I tell you, after everything that you do (including food and SEX) ask yourself, “could I do it better?” If the answer comes as YES, man you failed yourself and guilt will not let you sleep. you’ll become an irritating popper who blames everyone and everything. Failure after 100% frees you from guilt and helps you bounce back with valor. Let me conclude here my mentioning what my centerpiece means. It says, “स तु दीर्घकाल नैरन्तर्य सत्कारसेवितो दृढभूमिः Sa tu deerghkaal nairantarya satkaarsevito dridhbhoomih It means: Anything of value to culture and firmly establish requires constant practice, for a long time, without gaps, and with honor & respect. This is your scale. Measure your every action on these four parameters. Under no circumstances you will fail. And if you do, you didn’t give your 100%. All the best. ",
            "date": "Answered January 21, 2018",
            "views": "1564",
            "upvotes": " View 813 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aiswarya Karunan",
                    "user_href": "/profile/Aiswarya-Karunan"
                },
                {
                    "user_id": "Satya Sourav",
                    "user_href": "/profile/Satya-Sourav-5"
                },
                {
                    "user_id": "SUNDHALE AISHWARYA",
                    "user_href": "/profile/SUNDHALE-AISHWARYA"
                },
                {
                    "user_id": "Trivikramaadithya",
                    "user_href": "/profile/Trivikramaadithya"
                },
                {
                    "user_id": "Anjum Jafri",
                    "user_href": "/profile/Anjum-Jafri-1"
                },
                {
                    "user_id": "Arunangshu Garai",
                    "user_href": "/profile/Arunangshu-Garai"
                },
                {
                    "user_id": "Liton Paul",
                    "user_href": "/profile/Liton-Paul-19"
                },
                {
                    "user_id": "Barath Booshan",
                    "user_href": "/profile/Barath-Booshan"
                },
                {
                    "user_id": "Eshitha Vimalan",
                    "user_href": "/profile/Eshitha-Vimalan"
                },
                {
                    "user_id": "Sumit Singh",
                    "user_href": "/profile/Sumit-Singh-1933"
                }
            ]
        },
        {
            "author_info": {
                "name": "Achsah Joneja",
                "href": "/profile/Achsah-Joneja"
            },
            "answer_text": "First I would like to give you a tip ,that will help you,and then tell why you aren't studying .But please read the whole thing to benefit from it. *TIP* Follow “The 5:5 Rule” , that rule means that if what you are doing isn't going to benefit you in next 5 years you shouldn't spend more than 5mins on that thing! ..so if you are playing games or binge watching webseries rather than studying ask yourself will playing and binge watching webseries benefit me in the next 5 years? If no is the answer .. Studying is what you are supposed to do ,also study to increase your knowledge and not merely your marks. *Why you aren't studying when you need to?* The act you are doing is called Procrastination ,which means you delay what you need to do. Procrastination isn't completely bad , see there are 2 types of procrastination :- 1)Active Procrastination :- Active procrastination means you choose to delay working on a task because you like to work under pressure and that lets you perform better. So if you are an Active procrastinatior it might have benefits. 2) Passive Procrastination :- Passive procrastinators are often crippled by indecision and an inability to self-regulate – that gets in the way of completing a task. For traditional (passive) procrastinators, failing to begin work is further loaded by anxiety which causes additional stress and inaction. Passive Procrastination is No No! I myself am a Active procrastinator when it comes to college assignments supposedly if I have a test in 2 days and assignment to submit in 3 days,I actively procrastinate on assignments because I know I am most creative in the last few hours of deadline, but I don't delay the the test because it's more important than the assignment. ",
            "date": "Answered September 18, 2020",
            "views": "887",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shruti Singh",
                    "user_href": "/profile/Shruti-Singh-2169"
                },
                {
                    "user_id": "Rishi Kar",
                    "user_href": "/profile/Rishi-Kar-7"
                },
                {
                    "user_id": "Nimesha Samarakoon",
                    "user_href": "/profile/Nimesha-Samarakoon-2"
                },
                {
                    "user_id": "Mansur Ahmed",
                    "user_href": "/profile/Mansur-Ahmed-91"
                },
                {
                    "user_id": "Aditya Tawade",
                    "user_href": "/profile/Aditya-Tawade-7"
                },
                {
                    "user_id": "Sibi Nandhan",
                    "user_href": "/profile/Sibi-Nandhan"
                },
                {
                    "user_id": "Kinjal Mehta",
                    "user_href": "/profile/Kinjal-Mehta-139"
                },
                {
                    "user_id": "Shabangu Lunga",
                    "user_href": "/profile/Shabangu-Lunga"
                }
            ]
        }
    ]
}