{
    "title": "My math teacher marked a question wrong that I know I got right and she made a stupid excuse for why she is right. How should I handle this situation? - Quora",
    "tags": [
        "Teachers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kate Hayes",
                "href": "/profile/Kate-Hayes-19"
            },
            "answer_text": "I know how you feel to be cheated by a teacher. I was in 10th grade BIOLOGY and we were required to go outside and do a four paragraph report on nature. I wrote about bugs—rolly pollys and cockroaches—inhabiting a dying piece of tree. Not a masterpiece, but done well enough to earn an A. I turned in the paper. It comes back with a big red X through the second paragraph and a -25 beside it. Why? Because the dimwit of a teacher (she was probably about 24—fresh out of college) wrote that “dying” is spelt “dieing”. Well, that is all fine and great….if I had been writing about finding bugs while tie-dieing (as “dieing” has to do with dye, not death). Considering I spent a lot of time reading dictionaries growing up (I was bored, sue me!), I knew the difference. She didn’t. I didn’t have the support of my parents, or from my school, so I was forced to take the grade. Since Texas changed the grading system the summer before the fall semester, a 75 was this side of a D+. I failed BIOLOGY. That .25 of a credit followed me to my new school (in a new state) and wasn’t discovered until 10 weeks before graduation. I dropped out. I tried to go back and finish, but I had to drop out again. I tried once more. Again, I had to drop out. Eventually I took my GED. The HS felt stupid and awarded me the credits (three years after the fact). I graduated from high school while I was in my first week of boot camp. I wish I had known then what I know now and avoided this whole mess. So, what do you do? You don’t let it go. Follow your chain of command. Go to your school counselor. Go to the Vice-Principal. Go to the Principal. Let your parents know what is happening. You were wronged and it will be reflected in your overall GPA. You stand and fight for what is rightfully yours. ",
            "date": "Answered May 13, 2019",
            "views": "160",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Celbel Ca",
                "href": "/profile/Celbel-Ca"
            },
            "answer_text": "I would not purse the grade personally, School does a great job making you hate learning You are in an injust situation where what you did was marked accordingly with randomness outside your control How do you deal with this? If you tell the random outside forces they are injust. Well they are random and outside your control, so they will respond accordingly And in the end you will dislike the teacher class subject school etc a little bit more if it goes bad, If it Goes good and your perception of control in this situation is one where you do believe you bave enough influence or connection with the teacher to easily win this one then do it. If the teacher is being difficult id let it go, enjoy life and learn to love to learn. on the other hand this is an opportunity for you to really dig into the unfairness and you can deal with life being life. As you get older you realise the forever empty is always there and that life is vanity and unfair. Its nice to learn this early and experience it more often so you can stop lying that life is fair and ahould be fair. Life is unfair but we live in it, so deal with this how you beleive is best Gl :) ",
            "date": "Answered May 13, 2019",
            "views": "81",
            "upvotes": "0"
        }
    ]
}