{
    "title": "Schooling: What are the implications of changing from American to British curriculum and viceversa? - Quora",
    "tags": [
        "Secondary School Education",
        "Elementary School and Elementary Schools",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brittany Cornett",
                "href": "/profile/Brittany-Cornett-2"
            },
            "answer_text": "I’m not extremely familiar with the UK curriculum, however I do believe that the subject matter in grades in the U.S. may not match up with what students do in Britain. For example, we have U.S. History in 6th and 7th grade and again in 11th grade to coincide with our standardized testing or Common Core curriculum requirements. In Britain, I imagine they would have UK history or an equivalent. We also have a Civics class and a U.S. Government class requirement. And that’s just for History and Social Sciences courses in middle and high school. I also think age difference may be a slight factor when changing curricula. In the States we start formal schooling at age 5 in Kindergarten. Most students attend preschool or Head Start before then and we graduate from 12th grade at 17 or 18 years old. There is a student at another school from the one I coach at that transferred here to Virginia two years ago from Canada (I’m not sure exactly where from). Because of the curriculum difference between here and Canada, he was entered into the school system as a freshman (9th grade) at 17 years old. If students progress through the U.S. school system according to plan, then most freshman are 14 years old upon entering that year of school and a 17 year old should be a junior (11th grade) or senior (12th grade). But because of the difference in schooling between Canada and the U.S. (I believe they start at a later age), he is technically considered behind what the rest of his age group is here. I don’t know if this would be the case for a student coming from a British curriculum or not, but it could be a possibility. ",
            "date": "Answered January 3, 2017",
            "views": "960",
            "upvotes": " Answer requested by Leonidas Hernández"
        },
        {
            "author_info": {
                "name": "Rod Rishworth",
                "href": "/profile/Rod-Rishworth"
            },
            "answer_text": "The first and by far the most important thing to be aware of is that they use a different notation for multiplication in secondary school. Americans use a dot (3 dot 4 = 12) and British use a cross (3 dot 4 = 3.4). I’m not joking! The other thing to be aware of is that the British system is not “liberal arts” after roughly the age of 16 - the final two years of school. Up until then, though, it is normal to study English and Mathematics as well as at least one language, at least one science, and around 10 subjects in total (which is fairly normal, anywhere, apart from English in some countries). So second to 3.4–1.2 = 2.2 rather than 10, don’t change systems in the very last year of school (between grade 11 and grade 12, per your terminology). ",
            "date": "Answered January 3, 2017",
            "views": "478",
            "upvotes": "0"
        }
    ]
}