{
    "title": "Should Malala Yousafzai have won the 2013 Nobel Peace Prize? - Quora",
    "tags": [
        "2013 Nobel Prizes",
        "Malala Yousafzai (activist)",
        "Nobel Peace Prize"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Moszczynski",
                "href": "/profile/Michael-Moszczynski"
            },
            "answer_text": "Giving Malala Yousafzai the Nobel Peace Prize is like giving the Nobel Prize for Literature to the winner of the National Spelling Bee. This is nothing to take away from her; she is a tremendously courageous person and, in my opinion, a force for good in the world. She is an inspiration, and everyone in the world should see her as such. It is completely possible – and perhaps even likely, based on her activism so far – that in the decades to come she will have an impact on the world that is worthy of the Nobel Prize. It is also possible she will retire to obscurity, or simply devote her life to projects that turn out to be unsuccessful. We simply don't know; but as courageous a person as she is, she hasn't done much to further the lot of children in the world yet. She was thrust into the international spotlight by a brutal attack, and has impressed us all with her perseverance, intelligence and principles, but she hasn't yet had the time to accomplish much. Winning the Spelling Bee is a tremendous accomplishment, something only a truly exceptional person could achieve – but it's not the same as writing a great work of literature, nor should one of its contestants be judged by that standard. This is a problem that has dogged the Nobel Peace Prize in recent years – the awarding of speculative prizes in the hope that the recipient will eventually do something to deserve them, the most obvious example being that of Barack Obama when he was elected. In every other field, the prize is awarded to those who have spent a lifetime excelling in their fields, and it is often given only many years after the work it rewards, after the effects of that work have been seen – it takes years for a paper to have a major impact on the world of physics, and it takes years for a person or an organisation to do something that truly makes the world a better place. In every news story I've seen, Yousafzai gets top billing while Satyarthi is relegated to a subheadline, sometimes not even getting a picture. Yet his organisation has helped, if the reporting is correct, tens of thousands of children in a very tangible way. This is an achievement worthy of the prize; Yousafzai, meanwhile, has done very little on the ground, having mostly completed books and speeches for a Western audience. No knock against her - no one could have accomplished much in such a short time at such an age! - but the fact is the prize is supposed to be a reward for accomplishments, not a statement of support for someone who might have them in the future. The standards of the Peace Prize aren't really appropriate for someone like her who is only just starting out her humanitarian activist career ­– none of us know if that career will be worthy of such an award, though of course we hope it is. There's a larger point, however, that has nothing to do with Yousafzai or Satyarthi, and that's the obsession with 'awareness' that has gripped so much of the West – there seems to be a belief that making Westerners aware of the injustices of the world is more important than helping the victims of those injustices. Many recent recipients of the prize have been these kinds of symbolic nods to Western public opinion, as though the committee was using the prize as a million-dollar upvote, wanting to indicate that they like Obama's speeches, they like speaking out against the PRC, they like inspirational schoolgirls. And those were all good things! But ultimately, people are being judged by the media impact they have in the West, not by what they accomplish for the people they're trying to help. Satyarthi has organised to help children in India escape child labour, and lobbied his government to change its laws. Yousafzai may be an inspiration, but her impact on Western public opinion has been far, far greater than her impact on schooling in Pakistan, but it seems that nowadays, the former is far more important than the latter. Malala Yousafzai may one day deserve the Nobel Peace Prize, but she certainly doesn't today.  Edit to respond to some of the more upvoted themes in the comments. On Malala Yousafzai's character: First of all, as I thought was clear from my answer, I am in no way a critic of her or her work. I think she is doing great work and I think she is an incredibly brave person worthy of all of our admiration. I merely disagree with the awarding of this particular prize at this particular moment. She won the Sakharov Prize last year, and she is a richly deserving winner, and the access of women to education around the world is one of the great moral issues of our time. I simply believe that the Nobel, in its capacity to greatly amplify the efforts of humanitarians, would be better awarded to those who have already shown tremendous success in their efforts. I believe that a better use would be to amplify those efforts, as with Satyarthi, rather than to kickstart them, as with Yousafzai. On the purpose of the Nobel Peace Prize: Nobel wrote in his will that this prize should be awarded to \"done the most or the best work for fraternity between nations, for the abolition or reduction of standing armies and for the holding and promotion of peace congresses.\" Needless to say, we no longer heed that definition, but to say that she deserves it because they chose her is a tautology: the criterion is being selected by the committee, therefore anyone who receives it deserves it. And I do understand that it is ultimately a political symbol – but choosing a Pakistani to \"balance out\" the Indian and send a message about those two countries is a bit cynical (not that Yousafzai is merely a \"token\" choice, which she most definitely isn't). Again, I think the best direction for the Peace Prize would be to promote and amplify existing efforts, not future ones. On Obama and Kissinger: These are obviously much, much worse choices than Yousafzai. They have been actively detrimental to world peace and should have their prizes rescinded based on their subsequent action. A case can be made for Arafat and Kissinger that they signed peace agreements, but obviously those agreements didn't stick. If the Oslo Accords had genuinely resulted in peace, Arafat and Rabin would have deserved the prize despite any history of violence they had had, because it would have been such a monumental achievement. But the prize was vastly premature – again, symptomatic of 'aspirational' prizes, what we hope will be achieved rather than what was. On feminism: A few comments suggest that I'm against Yousafzai's prize because she is a woman, which could not be further from the truth. I applaud the prizes of Wangari Maathai, Tawakkul Kerman and others whole-heartedly. And I consider myself a feminist without reservation. Being able to go to school in safety is in many places a male privilege, and there is no doubt that this has to change. I merely contend that her accomplishments in the field of increasing access to education have not yet had enough time to be worthy of this prize, and I don't think there was anything anti-feminist in my answer. I think some people look to take offence where there is none – and this is supported by the fact that many of these comments contain random, YouTube-style personal attacks suggesting that I'm some sort of envious, video-game playing (?) shut-in. I'm not terribly offended, but it's odd and not germane to the topic. Also, I really object to everyone referring to her by her first name, which is an infantilisation that only happens to women; she's a symbol, not a human being – we might vote for Hillary, but we voted for Clinton, not Bill, and Obama, not Barack. On Western awareness: A lot of commenters take the assumption, as I stated above, that Western attention is the primary prerequisite for tackling problems of global import. They say Yousafzai has changed the world, but she didn't for Pakistani girls – thousands upon thousands of them still are denied their basic right to education. I hope she can change this, but she hasn't yet. What she did change was the issues the Western world currently sees as important – she changed the way Westerners perceive the world, but that's not what the world really is. Moreover, as someone who works in the aid field, I can say categorically that it's a myth that Western attention is correlated with humanitarian success. We have short attention spans for problems that require decades of aid. The greatest successes – such as the tremendously successful fight against malaria – never made headlines, and many that do get forgotten the second the next news cycle rolls around. What ever happened to Joseph Kony anyway? I assume the Western attention caught him and solved the problem of child soldiers forever.   Anyway, those are some of my responses to the comments below. I want to thank everyone who upvoted, downvoted, or left comments both positive and negative. I think it's a topic worthy of legitimate debate, and I think the discussion here has been far more civil than it would be in other corners of the internet. ",
            "date": "Updated October 26, 2014",
            "views": "4212",
            "upvotes": " View 16.5K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nidhi Sharma",
                    "user_href": "/profile/Nidhi-Sharma-31"
                },
                {
                    "user_id": "Matias Gazzarri",
                    "user_href": "/profile/Matias-Gazzarri"
                },
                {
                    "user_id": "Devashree Tulankar",
                    "user_href": "/profile/Devashree-Tulankar"
                },
                {
                    "user_id": "Brad Siur",
                    "user_href": "/profile/Brad-Siur"
                },
                {
                    "user_id": "Revati Chavan",
                    "user_href": "/profile/Revati-Chavan-13"
                },
                {
                    "user_id": "Prachi Agrawal",
                    "user_href": "/profile/Prachi-Agrawal-182"
                },
                {
                    "user_id": "Harshul Gupta",
                    "user_href": "/profile/Harshul-Gupta-9"
                },
                {
                    "user_id": "Mayukh Biswas",
                    "user_href": "/profile/Mayukh-Biswas-20"
                },
                {
                    "user_id": "Debayan Nath",
                    "user_href": "/profile/Debayan-Nath-3"
                },
                {
                    "user_id": "Satya Mishra",
                    "user_href": "/profile/Satya-Mishra-48"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ravi Teja C",
                "href": "/profile/Ravi-Teja-C"
            },
            "answer_text": "I am sure that more than half of the world's thoughtful people would agree with this. \"Obama and Malala don't deserve a Nobel Peace prize whereas the most deserving person on earth was Gandhi, who was left behind\". Nobel Committee was criticized for its greatest omission in its history Nobel Prize controversies .Nobel peace prize is deserved for those who strongly impacted the world like Mahatma Gandhi and Mother Teresa but not for Barack Obama, who is a war lover and Malala Yousafzai who is a 17 year young girl and needs to impact a lot more on the ground level. Regardless, in case of Gandhi- please do not ignore or belittle the role of British imperialists in having it blocked the years previously. And by falling prey to their desires, the Nobel committee lost credibility and has continued to do so by awarding it to the likes of Kissinger, and recently Obama.  The fact that Gandhi never won the peace prize has been discussed often - to the effect that the Nobel website has posted an article as to why.Gandhi never received the Nobel Peace Prize, although he was nominated five times between 1937 and 1948. A decades-later Nobel Committee publicly declared its regret for the omission. Geir Lundestad, Secretary of Norwegian Nobel Committee in 2006 said, \"The greatest omission in our 106 year history is undoubtedly that Mahatma Gandhi never received the Nobel Peace prize. Gandhi could do without the Nobel Peace prize, whether Nobel committee can do without Gandhi is the question\". The Nobel Committee of the time may have tacitly acknowledged its error, however, when in 1948 (the year of his death), it made no award, stating \"there was no suitable living candidate\". A later committee awarded the prize posthumously to the Swedish diplomat Dag Hammarskjöld in 1961, who died after being nominated while Mahatma Gandhi was never awarded posthumously after being nominated. Many scholars view it as 'Discrimination' against a person who fought against British empire/interests. Moreover the Nobel Committee was often criticized for awarding the West and Euro centric issues but don't care the rest of the world. ",
            "date": "Updated March 14, 2016",
            "views": "37",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ronit Rajesh",
                    "user_href": "/profile/Ronit-Rajesh-1"
                },
                {
                    "user_id": "Lakshmi Prasad",
                    "user_href": "/profile/Lakshmi-Prasad-21"
                },
                {
                    "user_id": "Molly Parker",
                    "user_href": "/profile/Molly-Parker-130"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shelly-476"
                },
                {
                    "user_id": "Shubhangi Garg",
                    "user_href": "/profile/Shubhangi-Garg-5"
                },
                {
                    "user_id": "Rajitha Krishnan",
                    "user_href": "/profile/Rajitha-Krishnan-3"
                },
                {
                    "user_id": "Wei Xu",
                    "user_href": "/profile/Wei-Xu-92"
                },
                {
                    "user_id": "Ravi Gautam",
                    "user_href": "/profile/Ravi-Gautam-29"
                },
                {
                    "user_id": "Govardhan N(கோவர்தன். என்)",
                    "user_href": "/profile/Govardhan-N-கோவர்தன்-என்"
                },
                {
                    "user_id": "Aranyak Singh",
                    "user_href": "/profile/Aranyak-Singh"
                }
            ]
        }
    ]
}