{
    "title": "Should boys wear girls’ underwear to school? - Quora",
    "tags": [
        "Women's Underwear"
    ],
    "response": [
        {
            "author_info": {
                "name": "Julia Reece",
                "href": "/profile/Julia-Reece-2"
            },
            "answer_text": "This is one of those “Can I have permission to wear X, Y, or Z” questions. I’m pretty permissive, so my answer is going to be yes. Yes because you should wear anything you want to wear, and yes because you clearly want to wear girl’s underwear. Is your question a simple case of idle curiosity? I sincerely doubt it. Though the word “should” seems to complicate this question unnecessarily. People should do whatever they want unless it’s illegal or would cause harm to someone else, or infringe upon the rights of others. In this case, your wearing girl’s underwear to school isn’t illegal (at least here it isn’t) and no one is harmed unless your secret gets discovered, in which case the “harm” might be school-wide embarrassment should someone post your panty pics on their Facebook page. Having said this, how would you deal with changing in the school locker room where your classmates can all see what you’re wearing? This might be one reason why you shouldn’t wear them. ",
            "date": "Answered November 19, 2017",
            "views": "91",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elmer Whetzel",
                    "user_href": "/profile/Elmer-Whetzel"
                },
                {
                    "user_id": "Phil Holland",
                    "user_href": "/profile/Phil-Holland-7"
                },
                {
                    "user_id": "Emil Sandal",
                    "user_href": "/profile/Emil-Sandal"
                },
                {
                    "user_id": "Spencer Sawtelle",
                    "user_href": "/profile/Spencer-Stevens-43"
                },
                {
                    "user_id": "James Dunford",
                    "user_href": "/profile/James-Dunford-13"
                },
                {
                    "user_id": "Michael Lanphier",
                    "user_href": "/profile/Michael-Lanphier-2"
                },
                {
                    "user_id": "Patrick Martin",
                    "user_href": "/profile/Patrick-Martin-333"
                },
                {
                    "user_id": "Christopher Torres",
                    "user_href": "/profile/Christopher-Torres-114"
                },
                {
                    "user_id": "Jason Sauer",
                    "user_href": "/profile/Jason-Sauer-3"
                },
                {
                    "user_id": "David Warrick",
                    "user_href": "/profile/David-Warrick-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brandyn Keller",
                "href": "/profile/Brandyn-Keller"
            },
            "answer_text": " So not to sound like over dramatic but clothes do NOT have a gender, and that includes panties, thongs, and g-strings! There is no reason, whatever gender you are, that you like need to be restricted in the kind of underwear you wear. Girls can wear boxers if they want, and guys can wear panties if they want! Sorry had to just say that haha, but I think it’s really super important! That said, I have been wearing panties openly since I was little, and while my mom wasn’t like thrilled about it initially, she knew it made me happy, and supported me fully by buying girls undies for me. By high school I was wearing girls underwear almost exclusively, and it was really not a secret at all to any of my female friends, or anyone who really knew me or saw me undressed in the locker room. I basically like chose to get caught or be seen by guys! It also like totally helped being openly gay and feminine, and while I did have to put up with some teasing, most everyone wasn’t all that surprised by my choice of undies lol. Even after school nothing is different. My boss who is super duper cool, and most all of my coworkers know I wear panties, and she and the other girls even give me a heads up on fabulous sales going on! Don’t get me wrong, I do get second looks sometimes, but I dont give af. If you think I’m a freak then maybe you just need to open your mind a little hun! And by freak I mean in a good way lol. Besides, my cute little butt looks way better in a shiny thong than a boring pair of plaid boxer shorts yawn! Like I always say, anyone can be normal, most people are. But normal is boring! Dare to be different! But most importantly just be you! And if wearing panties to school is you and makes you happy, than do it! Don’t get caught wearing them, just wear them proudly and confidently like me in the picture! And pay no attention to close minded people who throw shade! They are just jealous I think lol. ",
            "date": "Updated October 19, 2018",
            "views": "109",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lorin Bagley",
                    "user_href": "/profile/Lorin-Bagley"
                },
                {
                    "user_id": "Robin Walker",
                    "user_href": "/profile/Robin-Walker-208"
                },
                {
                    "user_id": "Mike Bell",
                    "user_href": "/profile/Mike-Bell-117"
                },
                {
                    "user_id": "Shubh Sharma",
                    "user_href": "/profile/Shubh-Sharma-18"
                },
                {
                    "user_id": "Spencer Sawtelle",
                    "user_href": "/profile/Spencer-Stevens-43"
                },
                {
                    "user_id": "Fons Rutten",
                    "user_href": "/profile/Fons-Rutten"
                },
                {
                    "user_id": "Steven Evans II",
                    "user_href": "/profile/Steven-Evans-II"
                },
                {
                    "user_id": "David Jenkins",
                    "user_href": "/profile/David-Jenkins-446"
                },
                {
                    "user_id": "Rupai",
                    "user_href": "/profile/Rupai-1"
                },
                {
                    "user_id": "Patrick Martin",
                    "user_href": "/profile/Patrick-Martin-333"
                }
            ]
        }
    ]
}