{
    "title": "Should it be concerning that at age 22 I still don't have a girlfriend? - Quora",
    "tags": [
        "20s (age)",
        "Girlfriends",
        "Dating Advice",
        "Dating and Relationships"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nathan Lloyd Hewitt",
                "href": "/profile/Nathan-Lloyd-Hewitt"
            },
            "answer_text": "Actually, I think it should be concerning. And for this reason: If you don’t have the skills and experience to pull a girl right now, it’s not going to come with age. Being 22 is a great opportunity to perfect your social skills with women. Don’t waste it. Time isn’t going to make you superior or special when it comes to meeting and dating women. In fact, dating can get more complicated with age because people collect and carry emotional baggage. And unfortunately, most men and women don’t know how to deal with their own shit let alone the people they are trying to date. Also, if you feel you don’t have the energy to put yourself out there in social environments, again, it’s not going to come with age. You’ve gotta want to do it. And that requires effort and periods of discomfort. Honestly, right now is the time to get better. Don’t BS yourself into thinking it doesn’t matter. Because the fact is: getting better with women is one of the best journeys a man can embark on. It’ll bring you a lot more happiness and self-esteem than possessions and status. You don't want to be like most nice guys who try to use money and status to attract girls. Instead, strive to be the kind of guy that is more focused on building his character, working on his goals, and overall being Real with himself. When you know who you are and what you want from life, and display that level of certainty in the presence of women. You’ll soon find that women WANT to be your girlfriend. Intimacy and companionship is fucking beautiful for the mind and body. And when you get good at connecting with women, magically, you’ll improve in other areas of life. So it's not a waste of time by any means. P.S You shouldn’t feel like shit for not having a girlfriend. Instead, you should only feel like shit if you want a girl but aren’t willing to work for it. ",
            "date": "Answered August 1, 2017",
            "views": "66",
            "upvotes": " View 51 Upvoters",
            "upvoters": [
                {
                    "user_id": "Muskan Mishra",
                    "user_href": "/profile/Muskan-Mishra-156"
                },
                {
                    "user_id": "Jeroen Verreyken",
                    "user_href": "/profile/Jeroen-Verreyken"
                },
                {
                    "user_id": "Kaushal Nandan",
                    "user_href": "/profile/Kaushal-Nandan"
                },
                {
                    "user_id": "Alex Mann",
                    "user_href": "/profile/Alex-Mann-121"
                },
                {
                    "user_id": "Rahul Mohta",
                    "user_href": "/profile/Rahul-Mohta-1"
                },
                {
                    "user_id": "Sanket Bilagoji",
                    "user_href": "/profile/Sanket-Bilagoji-1"
                },
                {
                    "user_id": "Emily",
                    "user_href": "/profile/Emily-5492"
                },
                {
                    "user_id": "Krishna",
                    "user_href": "/profile/Krishna-2044"
                },
                {
                    "user_id": "Paul Prager",
                    "user_href": "/profile/Paul-Prager-1"
                },
                {
                    "user_id": "Stefan Maksimovic",
                    "user_href": "/profile/Stefan-Maksimovic"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aman Sehgal",
                "href": "/profile/Aman-Sehgal-8"
            },
            "answer_text": "I am a little surprised that no one really wants to be candid and break it down to you. Pursuing your career and being in a relationship don’t have anything to do with each other. You can pursue your dreams and still be in a relationship as long as you are honest about your intentions and speak candidly about your ambitions. Yes, it is concerning. It means you haven’t yet learnt the nuanced differences between interacting with men and interacting with women.It means you do not know the social dynamics that are in play when men and women feel attracted to each other. In a situation like this, almost always the man must lead and make the moves while taking social cues from women.It means that you haven’t learnt how to identify potential love interest towards you, pick up on that and act on it.It means you are sexually inexperienced which can be quite a turn off for a lot of women and initially frustrating if you’re not in charge.It means you haven’t mastered the art of listening and empathy. Women have a very high EQ and when meeting a man with the same level of emotional intelligence, they definitely feel a stronger connection.It also means that you probably haven’t developed a certain amount of confidence that exuberates from your personality when you are present around women. Women can really pick up on someone who is comfortable, confident and charismatic. This does not imply being arrogant or cocky. That is a turn off for almost everyone.It means you haven’t met enough women to know what you would like in a woman, which could be anything from physical and emotional to intellectual and professional.The fact that you say that you can’t get a girl to like you, means that you acknowledge the above. Perhaps there have been women who like you and have given you the social cues but you may have not picked up on it. This probably led the women to think that you’re either not interested or not looking to date. This generation of men has many avenues to be exposed to women. There is the bar and social events scene, e- dating, university classes and student circles, meetups and local urban spots where people usually hang out. There are many single women out there looking for potential relationships but its your job to become good at casual conversations and learn the art of witty banter. You need to shed the fear of approach and talk to women as if they are normal people. It will be hard in the beginning and you will fail but eventually you will figure it out. But overall, you will have to become an interesting person and cultivate some confidence and charm. ",
            "date": "Updated August 20, 2017",
            "views": "39",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeroen Verreyken",
                    "user_href": "/profile/Jeroen-Verreyken"
                },
                {
                    "user_id": "Selin Tarık",
                    "user_href": "/profile/Selin-Tarık"
                },
                {
                    "user_id": "Mahadev Parab",
                    "user_href": "/profile/Mahadev-Parab-13"
                },
                {
                    "user_id": "Rahul Mohta",
                    "user_href": "/profile/Rahul-Mohta-1"
                },
                {
                    "user_id": "Samiksha Khatiwara",
                    "user_href": "/profile/Samiksha-Khatiwara"
                },
                {
                    "user_id": "Paul Prager",
                    "user_href": "/profile/Paul-Prager-1"
                },
                {
                    "user_id": "Harish Kumar",
                    "user_href": "/profile/Harish-Kumar-8841"
                },
                {
                    "user_id": "Stefan Maksimovic",
                    "user_href": "/profile/Stefan-Maksimovic"
                },
                {
                    "user_id": "Sameer Vats",
                    "user_href": "/profile/Sameer-Vats"
                },
                {
                    "user_id": "Kai Rune",
                    "user_href": "/profile/Kai-Rune"
                }
            ]
        }
    ]
}