{
    "title": "Should I study till late at night, or sleep early and wake up early to study instead? - Quora",
    "tags": [
        "Waking Up Early",
        "Mornings",
        "Waking Up",
        "Sleep Science",
        "Sleep Habits"
    ],
    "response": [
        {
            "author_info": {
                "name": "Craig Anderson",
                "href": "/profile/Craig-Anderson-45"
            },
            "answer_text": "You should do both - with a focus on getting up earlier.  To cut a long story short, our willpower (and ability to focus) is a finite resource - which degrades throughout the day. When you’re tired late at night, the quality of your study drops. However, we do also form memories in our sleep. [1] A perfect way to utilise study time at night is for light revision of topics that you’re already familiar with - something that will be easy and comfortable for you to do, but which would also benefit you to remember better. Spaced repetition [2] style flash cards are the simplest and most efficient way to get some light but super effective studying at night  Mornings are where we’re freshest and most ready to take in new information (specifically, 2–4 hours after you wake up) - so use them to tackle your hardest (or scariest) subject. This is when your mind will be clearest and your ability to focus at peak levels. Taking down the task you were dreading most will also give you a huge confidence boost to ride on the rest of the day, and make working on the rest of your topics seem much easier!  Just to wrap things up - I’ll also mention afternoons. As the sort of balancing point between the freshness of the morning and required relaxation of the evening - an afternoon is typically best spent revising material more thoroughly than you would at night. Ideally, this would be in the form of past exam papers. Revising something that does require effort - but that you’re already familiar with - is a far easier task to get to work on during the afternoon: when you’ve still got enough thinking power, but not quite enough to start taking on those scary exam topics that you wish would just somehow go away. Footnotes[1] Sleep and memory[2] Spaced repetition",
            "date": "Answered September 20, 2016",
            "views": "364",
            "upvotes": " View 45 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Prabha Ghildiyal",
                    "user_href": "/profile/Prabha-Ghildiyal"
                },
                {
                    "user_id": "Sampada Sinha",
                    "user_href": "/profile/Sampada-Sinha-3"
                },
                {
                    "user_id": "Kristen Nguyen",
                    "user_href": "/profile/Kristen-Nguyen-58"
                },
                {
                    "user_id": "Christina Tina",
                    "user_href": "/profile/Christina-Tina-23"
                },
                {
                    "user_id": "Djamel Benali",
                    "user_href": "/profile/Djamel-Benali"
                },
                {
                    "user_id": "Lee Ji Eun",
                    "user_href": "/profile/Lee-Ji-Eun-19"
                },
                {
                    "user_id": "Dominion Taiwo",
                    "user_href": "/profile/Dominion-Taiwo"
                },
                {
                    "user_id": "Kai Jun",
                    "user_href": "/profile/Kai-Jun-7"
                },
                {
                    "user_id": "Jordan Jones",
                    "user_href": "/profile/Jordan-Jones-129"
                },
                {
                    "user_id": "Erina Azmi",
                    "user_href": "/profile/Erina-Azmi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maya Deva Kniese",
                "href": "/profile/Maya-Deva-Kniese"
            },
            "answer_text": "That really depends on you. I’m a morning person, and if I go to bed late I’m tired all the next day. But if I get up early, I feel refreshed and alert. But you might be more of a night owl who happily stays up past midnight but gets grumpy when he has to wake up early. The only adivse I CAN give is to study in 15-minute intervals, then have a 5-minute break during which you get up and walk around to get your blood moving again. And of course, to begin studying way earlier next time so you can afford to go to bed on time AND wake up at a normal hour! ",
            "date": "Updated September 8, 2020",
            "views": "168",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Olivia Ashley",
                    "user_href": "/profile/Olivia-Ashley-13"
                },
                {
                    "user_id": "Liam Eastwood",
                    "user_href": "/profile/Liam-Eastwood-4"
                },
                {
                    "user_id": "Atharva Kapade",
                    "user_href": "/profile/Atharva-Kapade"
                },
                {
                    "user_id": "Sarah Ferro",
                    "user_href": "/profile/Sarah-Ferro-5"
                },
                {
                    "user_id": "Jasmyn Smith",
                    "user_href": "/profile/Jasmyn-Smith-3"
                }
            ]
        }
    ]
}