{
    "title": "Should I get an Associates in Arts in medical sonography and then pursue neuroradiology? - Quora",
    "tags": [
        "Neuroradiology",
        "Diagnostic Sonography",
        "Medical Sonography",
        "Ultrasound",
        "Neurology",
        "Higher Education",
        "Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tuan Nguyen",
                "href": "/profile/Tuan-Nguyen-355"
            },
            "answer_text": "A degree in medical sonography let’s you perform ultrasound procedures. You then take additional courses and testing for certificates in ob/gyn, vascular, neurosonography, echocardiography, abdomen/small parts, opthalmic etc. Asides from performing newborn head ultrasound or carotid doppler, there is not much neuro work in sonography. There are ways to get involved in Neuroradiology as a technologist. You need initial training as a registered technologist - 2–4 yrs curriculum. Then additional training in CT/MRI or Interventional Radiology. These technologists do neuro work, only part of the time. They also work on other parts of the body. To become a neuroradiologist takes much longer. You need a Bachelor degree (4 yrs), MD degree (4 yrs), internship (one year), radiology residency (4 yrs) then fellowship training in neuroradiology (1–2 years). There is no pathway that allows you to go directly into neuroradiology. ",
            "date": "Updated November 11, 2016",
            "views": "311",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gregory Kim",
                    "user_href": "/profile/Gregory-Kim-12"
                },
                {
                    "user_id": "Karla Corro",
                    "user_href": "/profile/Karla-Corro"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Chalpin",
                "href": "/profile/David-Chalpin"
            },
            "answer_text": "Your question appears sort of “schizophrenic” to me. How about thinking through or researching, first, what is involved in becoming a neuroradiologist? Do you realize how many additional steps are required after obtaining an AA degree? Think about it first, then rephrase your question from scratch. Good luck. ",
            "date": "Answered November 1, 2016",
            "views": "66",
            "upvotes": "0"
        }
    ]
}