{
    "title": "Should computer science be taught in schools? - Quora",
    "tags": [
        "Computer Science Education",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lio Lee",
                "href": "/profile/Lio-Lee-3"
            },
            "answer_text": "I will assume you mean primary and secondary schools and I will also assume that you refer to making CS courses mandatory since they are already offered nationally as two AP courses. No, CS classes should not be mandatory. CS is extremely useful for many fields, but it is not an essential as math and reading. Some people don't enjoy/understand it, and that's fine. Now, on the other hand, the need to read is omnipresent not only in the workforce but in our diurnal lives. If you ask whether or not they should be offered, there is no reason to say no other than a lack of demand for the class. As I previously said, CS is useful everywhere. ",
            "date": "Answered April 27, 2019",
            "views": "247",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Larry Pyeatt",
                "href": "/profile/Larry-Pyeatt"
            },
            "answer_text": "First answer me this: Why should football be taught in school? After that, answer this one: Between Computer Science and Football, which will result in more people getting a job? Now answer this one: Between Football and Computer Science, which one will contribute the most to society? Finally, please answer this: Between Football and Computer Science, which one gets the most funding? ",
            "date": "Answered June 14, 2019",
            "views": "102",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matthew Jeremy",
                    "user_href": "/profile/Matthew-Jeremy-3"
                },
                {
                    "user_id": "Tanza Erlambang",
                    "user_href": "/profile/Tanza-Erlambang"
                }
            ]
        }
    ]
}