{
    "title": "Should sex education be taught at schools or be left to parents? - Quora",
    "tags": [
        "Sex Education",
        "Teaching",
        "Schools",
        "Parents",
        "Parenting",
        "Sex"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kyle Booke",
                "href": "/profile/Kyle-Booke-1"
            },
            "answer_text": "I’m 17. I know pretty much all I can know about sex and I learned it… all on my own. I would have loved to actually have been taught about. I never received “The Talk” from my mother or father until I was around 15 but at that point it was useless since my… “innocence” had already been taken. Sure sometimes when I learned a new “word” I would ask my dad what it meant or just look it up but I didn’t go into this new world with really any knowledge of it. I took 1 sex ed class when I was in like 5th grade and it was stupid as hell, they didn’t teach much of anything. They showed us a diagram of the human body (male and female) then described biology but nothing really about sex. Don’t leave it to the parents, please please just teach it in schools for the love of all that is holy so that kids can actually learn something before it’s too late. If a parent doesn’t want their kid taking a class on it then they should be teaching it to their kids themselves. Don’t make your kids fend for themselves it won’t help anyone and it certainly won’t keep them from not doing what is on a teenagers mind like 60% of the time. ",
            "date": "Answered December 1, 2018",
            "views": "149",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Piyush Mishra",
                    "user_href": "/profile/Piyush-Mishra-136"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bridget McCrea",
                "href": "/profile/Bridget-McCrea-1"
            },
            "answer_text": "What are the chances of being pregnant if you do anal and use a condom? He did not ejaculate, and we did it for about 30 seconds. I kissed my boyfriend after performing oral sex on him. He then licked his fingers before fingering me. Could I be pregnant? Is it true that wearing underwear all the time is hampering one’s penis from growing bigger? Isn’t blue balls caused by the underwear pressing up against the balls rather not ejaculating an erect penis? Why do people keep spreading misinformation that can be easily disproven? Why does a butt plug or even a finger in my bottom make my penis more sensitive? What angle does the penis go into a woman? What is the possibility of a lady getting pregnant when she doesn't have sex but does makeouts? Yes, these questions are from Quora. Some of them may have been trolls asking random questions. But if even one of them came from someone asking a serious question, I have to ask about the state of our education system. In fact, I know that the last question was asked honestly because someone contacted me as a followup to my answer. Some parents shouldn’t be parents. They barely notice if their kids are home or not. Other kids grow up in single parent homes where the parent needs to work multiple jobs to pay the rent. Then other parents are too prudish to even approach the topic of sex. I fully support the idea that sex education should be taught in schools because otherwise, some teens will know nothing before they start experimenting. That only leads to more pregnancies, more confusion, more abortions. Better education leads to being more prepared. We can’t take the risk that parents won’t teach their kids the birds and the bees. I’m all for improving sex education so that forewarned is forearmed. ",
            "date": "Answered December 6, 2018",
            "views": "12",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Himanshu Prasad",
                    "user_href": "/profile/Himanshu-Prasad-23"
                },
                {
                    "user_id": "Richard Carvalho da Silva",
                    "user_href": "/profile/Richard-Carvalho-da-Silva"
                },
                {
                    "user_id": "Evangelina Thomas",
                    "user_href": "/profile/Evangelina-Thomas"
                },
                {
                    "user_id": "Jonathan Buttall",
                    "user_href": "/profile/Jonathan-Buttall"
                },
                {
                    "user_id": "Ameen Abou-Rjaily",
                    "user_href": "/profile/Ameen-Abou-Rjaily"
                },
                {
                    "user_id": "Brett Dee",
                    "user_href": "/profile/Brett-Dee-1"
                },
                {
                    "user_id": "Lloyd Gairns",
                    "user_href": "/profile/Lloyd-Gairns"
                },
                {
                    "user_id": "George Sawyer",
                    "user_href": "/profile/George-Sawyer-1"
                },
                {
                    "user_id": "Douglas L Acker",
                    "user_href": "/profile/Douglas-L-Acker"
                },
                {
                    "user_id": "Dan Brännmark",
                    "user_href": "/profile/Dan-Brännmark"
                }
            ]
        }
    ]
}