{
    "title": "Should students be asked to evaluate their teachers? - Quora",
    "tags": [
        "Teacher Evaluations",
        "Teaching Methods",
        "Teaching"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jesse Fletcher",
                "href": "/profile/Jesse-Fletcher"
            },
            "answer_text": "In a non-binding, non-contractual way? Absolutely. I ask my students for feedback many times a year, and I solicit even more feedback from them after they reach high school. If I have time and space left at the end of the year, heck, sometimes I even ask them to write a letter to the next class about “What you should know about Mr.Fletcher’s class” that I absolutely peruse for data points. For contractual, legally obligating, potentially pay-and-rank evaluations? Hell. No. You want to base my family’s welfare - my mortgage on the home that keeps my kids warm and dry, the food that they eat, the cars that keep them safe on the way to school, my ability to plan for their college, my retirement, and so on - on a teenager’s judgment? You want to base this on the judgment of an individual whose hormones are absolutely out of control - completely without their blame - who is prone to wildly erratic sets of actions, does not fully understand or recognize some lessons until considerably later, may not prize parts of the education that the state mandated I give them, may be prone to highly biased (positive or negative) reactions simply because of my disciplinary policies, and may even not take such an evaluation seriously? THAT, my friend, is truly the height of insanity. I teach middle school. The kids at this age, by their own admission, are verifiable fruitcakes. They are petty, snide, arrogant, backstabbing creatures who also happen to be capable of acts of great sagacity, kindness, motivation, passion, and wisdom. I think sometimes people forget that teachers really are people with hopes, dreams, and lives, too. When a kindergartner can evaluate the work of their pediatrician and dictate the course of his career, and when a third grader can evaluate and judge the quality of their dentist and determine whether he remains licensed, then sign me up for students having binding evaluations of teachers. Standardized testing is already more than close enough, thanks. ",
            "date": "Answered May 1, 2017",
            "views": "23",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Kelemen",
                    "user_href": "/profile/Thomas-Kelemen-1"
                },
                {
                    "user_id": "Greg Overmyer",
                    "user_href": "/profile/Greg-Overmyer"
                },
                {
                    "user_id": "Bret Yeilding",
                    "user_href": "/profile/Bret-Yeilding"
                },
                {
                    "user_id": "Drew Boucher",
                    "user_href": "/profile/Drew-Boucher-1"
                },
                {
                    "user_id": "Faisal Khan",
                    "user_href": "/profile/Faisal-Khan-2657"
                },
                {
                    "user_id": "Client Info",
                    "user_href": "/profile/Client-Info"
                },
                {
                    "user_id": "Beverly Gustafson",
                    "user_href": "/profile/Beverly-Gustafson"
                },
                {
                    "user_id": "Michael Vanlandingham",
                    "user_href": "/profile/Michael-Vanlandingham-2"
                },
                {
                    "user_id": "Jennifer Hu",
                    "user_href": "/profile/Jennifer-Hu-1"
                },
                {
                    "user_id": "Sahil Sen",
                    "user_href": "/profile/Sahil-Sen-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bion Michael Shelden",
                "href": "/profile/Bion-Michael-Shelden"
            },
            "answer_text": "I believe that there should be a formal mechanism for collecting student input on teachers starting in middle school, and continuing on until the end of college. Currently, most universities and colleges do this, but it is a rarity at younger ages. Many of my colleagues in the past have expressed apprehension at the idea of 12-year olds or 14-year olds participating in teacher evaluation, but I think that, if designed properly, it could help students to be reflective of themselves, not just the teachers. At the younger ages, I would not have many (or any) open ended questions, I would have questions that rated the teacher on a scale only. Questions like: Read the following statements. If you agree strongly with the statement, rate it “4”. If you agree somewhat, rate it “3”. If you disagree somewhat, rate it a “2”, and if you disagree strongly with the statement, rate it a “1”. This class taught me a lot, and I feel I learned a lot about the subject this year.This teacher came to class nearly every day with a plan for the hour, and we followed that plan.I understand this teacher’s grading system.This teacher kept control over discipline in the classroom.This teacher knows a lot about the subject he or she is teaching.This teacher made me feel like he or she cared about teaching me.These are just sample questions off the top of my head, but I would trust 12-year olds to answer them honestly, and I think the administration should at least be interested in their input. By the way, I purposely left out a middle “neutral” rating, which would roughly correspond to “I’m undecided” or “Unsure”. If you give that option to a 12-year old, they’ll pick the “Not sure” option, straight down the line. ",
            "date": "Answered May 18, 2016",
            "views": "504",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Simon Antonietti",
                    "user_href": "/profile/Simon-Antonietti"
                }
            ]
        }
    ]
}