{
    "title": "Should I take the NDA II 2020 when I'm in 12th class and my age falls under the required one? - Quora",
    "tags": [
        "NDA (National defence academy)",
        "National Defence Academy (NDA)",
        "Class 12th in India",
        "Exam and Test Advice",
        "Academic and Educational Advice",
        "Exam and Test Preparation",
        "Education",
        "Exams and Tests"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vikrant Reddy",
                "href": "/profile/Vikrant-Reddy-8"
            },
            "answer_text": "Yes brother!!! You should go for it because NDA is the finest and youngest oppurtunity we get to become the commisioned officers in Indian armed forces. And age limit for this is 16.5–19 years. The first part of this is clearing the entrance exam conducted by UPSC which comprises two papers. 1.MATHS( CLASS 11&12 syllubus) 2.ENGLISH & GENERAL STUDIES. Now if you are preparing for Maths it will be helpful for your boards too. And English easy to practice and now coming to GS paper(which most of them couldnt clear) if you are through with class 11&12 basics of Chemistry and physics it will easy for you to clear it and to be very honest social studies(History, Geography, civics, Economics) is very tough and needs a rigrous study and practice. Now coming to your question why you should go for 2020 NDA II- If you make it in this attempt and will face SSB and MEDICALS in the months of january and feburary. And can directly join academy in the month of july.After 12 you will not have any dilemma about your career.If you are going for next attempts you will be in college and may loose focus on it.I wrote the above suggestions based on my experience. “Realisation is always better than regret”. So realise what is good for you so that you will not feel regret later. All the best!!!! ",
            "date": "Answered December 31, 2019",
            "views": "119",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paramjeet Singh",
                    "user_href": "/profile/Paramjeet-Singh-1450"
                }
            ]
        },
        {
            "author_info": {
                "name": "Solanki Himalay",
                "href": "/profile/Solanki-Himalay-1"
            },
            "answer_text": "I am going to give my class 12th board exams this March and on 28th March 2020 I have my NDA AFSB at Mysore. I gave NDA 2 2019, I was in 12th at that time. Even in the application form, in qualification section, they have, “applied/applying for 10+2 or equivalent exam…………” So it is obvious that you can also give the exam, just the thing is that when we go to SSB and if get recommended then we have to submit our class 12th marksheet but it would not have came by then so I have to submit it by earliest to the Air force HQ or wherever they mention. ~Regards ",
            "date": "Answered December 31, 2019",
            "views": "239",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Armaan Yadav",
                    "user_href": "/profile/Armaan-Yadav-13"
                }
            ]
        }
    ]
}