{
    "title": "Sometimes, I lose concentration in class. Till the time my focus is back, its already too late. What're some tips which I can use to remain focussed? - Quora",
    "tags": [
        "Focusing and Concentrating",
        "Studying Advice",
        "Understanding Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mohit Bansal",
                "href": "/profile/Mohit-Bansal-99"
            },
            "answer_text": "The method that I am going to tell you will not only help you to focus in class but it will also help you to grasp the concepts faster. I have tried it myself throughout my school life and it has proven to be very very effective. The method Look directly in the teacher's eyes and keep looking as if you were trying to intimidate them. Keep following the teachers eyes as she moves around the room. Keep looking .It may seem a bit awkward at first but as you get used to it the teacher will also get used to it and you will never lose your focus. And if you find yourself looking down or somewhere else you'll get to know that you are distracted and you can immediately get your eyes to back in the right direction (in the direction of your teachers eyes). I hope this method helps you . Thank you ",
            "date": "Answered September 20, 2016",
            "views": "208",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eashan Aneja",
                    "user_href": "/profile/Eashan-Aneja"
                },
                {
                    "user_id": "Shiveha Verma",
                    "user_href": "/profile/Shiveha-Verma-2"
                },
                {
                    "user_id": "Nitasha Garg",
                    "user_href": "/profile/Nitasha-Garg-4"
                },
                {
                    "user_id": "Chahat Kalsi",
                    "user_href": "/profile/Chahat-Kalsi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Praveenkumar Goudar",
                "href": "/profile/Praveenkumar-Goudar"
            },
            "answer_text": "The power of concentration can be developed through constant practice. The most important requisite for increasing concentration is purity of mind. It may be expressed in the form of a mathematical formula: concentration of mind (C) is directly proportional to Purity of mind (P).\tPurity of mind comes from following Yama and Niyama, a set of two basic disciplines mentioned in the Yoga Sutras.* Yama means control. It consists of five disciplines:(a) Satya (truthfulness): One should be honest in all dealings and actions. (b) Ahimsa (non-violence): Non-injury of any living creature. (c) Asteya (non-stealing): One should not steal or grab what rightfully belongs to others. (d) Aparigraha(non-acceptance of gifts): Non-possession or non-covetousness means not to expect anything from any body. (e) Brhmacharya (continence): Extolling the practice of chastity, Swami Vivekananda said, “Complete continence gives great intellectual and spiritual power”. Brhamacharya also means control of all senses, especially the palate.* Niyama means self purification through regulating one’s time and energies. Niyama too consists of five disciplines:(a) Shaucha (pavitrata): Purity of body, mind, diet, clothing and surrounding. (b) Santosh (contentment): Means reducing one’s needs and being happy in whatever one has. This helps to curb anger, ambition and greed. (c) Tapas (austerity): It refers to control with regard to body, mind and speech. Control of body includes not seeking too much of body comforts. Control of mind means not getting agitated and maintaining a peaceful and pure attitude towards life. Controlled speech means limited, meaningful, sweet and truthful words. (d) Swadhyaya (self-study): It is the regular and sincere stud of positive and helpful books. To study one’s mind is another meaning of swadhyaya. (e) Isgwara Pranidhana (devotion to God): Means offering the results of one’s actions to a Higher Power or the collective team spirit, and practicing humility.\tThe above mentioned yama and niyama are like the Ten Commandments for developing power of concentration. One has to practice them for a long time, with respect and interest.\tFollowing a regulated life, with a timetable for all activities, is a great help in making control of mind easier. One should have fixed routine for rising, exercises, prayer, study, eating, playing, and entertainment. While studying, preparing proper notes helps in retaining what one has learnt. One should choose a congenial and clean environment for study. There should be proper light, ventilation, seating arrangements, orderliness and ready access to all necessary materials in our study place. This helps to concentrate better.\tLiving a life of positive thinking and spiritual contemplation purifies and channels the mind in the right direction. We should take care to hear and see only what is good and noble. The famous three monkeys may be remembered here. One monkey keeps its hands on mouth, another on eyes and the other one on ears. The idea is ‘see no evil, hear no evil and speak no evil’. A similar sculpture, however, shows the three monkeys with a little difference. In this piece, one monkey keeps his one eye open and ear open and one closed. Another monkey keeps on ear open and another closed. And the last one has its hands partially covering the mouth. This is the Vedantic idea: ‘See good things, don’t hear bad things; speak good things, don’t speak bad things; speak good things, don’t speak bad things.’ The idea is that our mental food in the form of what we hear or see through books, TV programmes and so on should be positive and mentally nutritious. We should listen to auspicious or good things about others, and avoid listening to bad things or criticism of others behind their back. Similarly, we should speak good things about others and avoid speaking ill or finding faults of others. We should constantly cultivate pure thoughts in every possible manner and fill up our minds. All these together help improving concentration of mind. ",
            "date": "Answered December 8, 2016",
            "views": "235",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Akshata Baddi",
                    "user_href": "/profile/Akshata-Baddi"
                }
            ]
        }
    ]
}