{
    "title": "Was high school the best time or the worst time in your life? - Quora",
    "tags": [
        "High School Education",
        "The High School Experience",
        "Schools",
        "Experiences in Life",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Travis Tassy",
                "href": "/profile/Travis-Tassy-1"
            },
            "answer_text": "The worst because of special ed. Everyone I knew in middle school wasn’t placed in it but me. It was the most fiasco time of my life so far. There was regular ed, and regular ed part 2 as study skills which I wasn’t placed in while those others were in. I dealt with five bossy teachers and wanted to get out of there since freshman year. I work my way through and found out that once I turn 18, I can make my own decisions with education which is what I did. The one that put me in this program before I started and middle school graduation was so damn bossy she called me that and cocky that I wanted to get out of it. I’ve done my best to be cold as possible because I felt very uncomfortable with this person. I’ve known her since the middle of 6th grade when I was first placed in special ed after I move to NC from NY. I was supposed to go her appointments for speech but always missed it due to discomfort and not to miss class. I have OCD so understand. In addition, on a class attendance, I have to be placed in another section because of class numbers. Other students were in this just so know but none I knew in middle school but most out of my grade. It was also a job program (OCS - Occupational Course of Study) to get work hours to prepare for a job I don’t know for a career though but I felt iffy because that was more important than school to them. I was supposed to get a job but just volunteered instead. You were supposed to get 900 hours to graduate, I got a 1,000 so they can’t say shit due to all that hard work. After graduation, they wanted me to go to a recommended college which I refused and went elsewhere because I didn’t want to live with the same BS. I’m glad I did because that was very strong of me, gotten good grades and will never take no for an answer!! So eventually I went on Facebook and Instagram to give my revenge of blocking them and never communicating with them again. I haven’t seen or spoken to those teachers in at least a year especially the speech lady it’s been since shortly prior to graduation which I’m glad and a blessing. I started high school in 2010 and left in 2014, don’t miss it one bit. So you can see I’ve had a terrible beginning of last decade but now I’m ready for a refresh and that it’s been 10 years since I started high school. I’ve been nothing but successful and I’ve lived my life to the fullest!! ",
            "date": "Answered January 11, 2020",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ronald Kovacs",
                "href": "/profile/Ronald-Kovacs-1"
            },
            "answer_text": "No absolutely neither. And I am glad. Today, 38 years after leaving I am not reliving those days in order to feel good about myself. I am thankful that I did not attempt anything to imprint myself on the collective memories of students and faculty, people that I did not care about or no longer care about. It is an important time in our lives, when we make decisions as to what we will likely be doing in our adult lives. It does make an impression on us and has some influence on the adults we become. But it is over. A smaller and smaller dot in my rear view mirror. It sinks farther and farther down on the trash heap of history as time goes on. We grow up and away, we move onto bigger and better things. Now I watch my grand children mature. And I am thankful that I have something in my life that is happening now that far outweighs the significance of anything from those days gone by. Fond memories are good to have, maybe lifelong friendships from high school, but those days should not be relived, in either a positive or overly negative way. ",
            "date": "Answered November 17, 2018",
            "views": "873",
            "upvotes": "0"
        }
    ]
}