{
    "title": "What’s the average amount of units to take each semester in college? - Quora",
    "tags": [
        "The College and University Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Leo Sha",
                "href": "/profile/Leo-Sha-3"
            },
            "answer_text": "Depends on major, but the average full time student is taking 12 to 15 units. For a 4 year plan, 2 semesters a year. Over 4 years, 15 units would be required to graduate on time if your major required at least 120 units. However a majority of people take longer for a variety of reasons. Either not enough classes, more than 120 unit major requirement, requiring more classes to take for the prerequisites. I would say the average college student takes either a liberal arts or business program. So 120 units with minimal prerequisites and requirements. 15 units a semester would probably be ideal, but more than likely they fall close 12 units due to the average student taking more than 4 years to graduate. ",
            "date": "Answered November 24, 2018",
            "views": "55",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rygis King",
                    "user_href": "/profile/Rygis-King"
                },
                {
                    "user_id": "Priscylla Mera",
                    "user_href": "/profile/Priscylla-Mera"
                },
                {
                    "user_id": "Mohammad Fahim",
                    "user_href": "/profile/Mohammad-Fahim-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gabriel Ong",
                "href": "/profile/Gabriel-Ong-30"
            },
            "answer_text": "I think this question is rather subjective culturally. In the US, its often noted that 12–15 units is the average for undergrad degrees, whereas it can actually go up to 18–21 units in other Asian cultures for instance. This, of course, isn’t to disregard the students who choose to underload or overload and such. Many students take less than 12 units, in order to do work while studying or perhaps to have more time to themselves. Similarly, many students overload in order to move quicker into graduate studies. I, for instance, took 26–30 units every semester when I was in college. Granted, I didn’t have much time for friends or hobbies, though I did manage to finish my degree in just 2 and a half years. ",
            "date": "Answered June 28, 2020",
            "views": "807",
            "upvotes": "0"
        }
    ]
}