{
    "title": "What requirements do you have to meet to be homeschooled in Texas? - Quora",
    "tags": [
        "Requirements",
        "Homeschooling",
        "Meetings",
        "Meeting New People",
        "Texas (state)",
        "Schools",
        "Higher Education",
        "Parenting",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Reina Maehata Shelby",
                "href": "/profile/Reina-Maehata-Shelby"
            },
            "answer_text": "Texas is very open about homeschooling. Unlike some other states, there is no place to register or to check in with your curriculum. So there’s NO requirement whatsoever. Nobody even knows that you’re homeschooling. I have a son who is an honor student at Texas A&M and a daughter who just applied to A&M. I never even had to show the university what we did for school. I did submit transcript but no question asked on what curricula I used. FYI I’m very eclectic and I DO NOT use a boxed curriculum. When in doubt, check with HSLDA for specific details of legality of homeschooling in different states. ",
            "date": "Answered September 23, 2019",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Liz Harkin",
                "href": "/profile/Liz-Harkin-2"
            },
            "answer_text": "You have to be able to prove that the curriculum you’re using is legit, and it’s a good idea to keep records of the curriculum used, grades, tests, etc. I never went to public school, so my parents didn’t have to contact the school system. If I had gone to public school, then there would have been a withdrawal process to go through (I don’t know the details of that). Edit: Quora decided to delete my credential, I was homeschooled since first grade. ",
            "date": "Answered September 23, 2019",
            "views": "15",
            "upvotes": "0"
        }
    ]
}