{
    "title": "What are subjects in B.Sc chemistry? - Quora",
    "tags": [
        "Bachelor of Science Degrees",
        "Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rohit Jayaprakash",
                "href": "/profile/Rohit-Jayaprakash-3"
            },
            "answer_text": "My friend , The question whose answer you seek is actually relative. The subjects may vary from university to university. Being a chemistry graduate from the University of Kerala I can say that the subjects are actually multi-dimensional. You will have to study complementary subjects such as Physics and Mathematics ,English as a compulsory language and a complementary language along with your core subject (Chemistry in this case) upto the first four semsters. Your labs will start from the fourth semester onwards. In the fifth and sixth semesters you’ll have only the core subjects along with the labs, with the only exemption in the fifth semester that, in this semester you’ll have to choose an optional subject as well. ",
            "date": "Answered May 31, 2018",
            "views": "93",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tishar Chander",
                    "user_href": "/profile/Tishar-Chander"
                },
                {
                    "user_id": "Reghu Pillai",
                    "user_href": "/profile/Reghu-Pillai-5"
                },
                {
                    "user_id": "Prakash Yadavannavar",
                    "user_href": "/profile/Prakash-Yadavannavar-1"
                },
                {
                    "user_id": "Ami K",
                    "user_href": "/profile/Ami-K-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shatakshi Mishra",
                "href": "/profile/Shatakshi-Mishra-9"
            },
            "answer_text": "I suppose you are talking about B.Sc. Honors in Chemistry. It includes the branches of Chemistry like physical, inorganic, organic and analytical chemistry, theoretical and practical. This covers study of atomic structure, chemical bonding, thermodynamics, chemistry of various elements, classes of organic compounds, electrochemistry, coordination chemistry, quantum mechanics, spectroscopy, computer applications in chemistry, a method of chemistry, a method of chemical analysis, environmental and biochemistry, etc. ",
            "date": "Answered July 24, 2018",
            "views": "36",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Arif Chaudhary",
                    "user_href": "/profile/Arif-Chaudhary-19"
                }
            ]
        }
    ]
}