{
    "title": "What are some websites similar to Coursera? - Quora",
    "tags": [
        "Coursera"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gerard Danford",
                "href": "/profile/Gerard-Danford"
            },
            "answer_text": "Is Self-directed Learning for You? Education (learning) is not a mass customer industry: its a personal industry. Therefore, authentic learning requires a significant personal investment on the part of the learner. Despite what many may think, learning is not only about access, affordability, degrees, or certificates. Education is fundamentally about learning concepts and skills that we do not acquire naturally through our normal interaction with the world. Authentic learning therefore, takes a great deal of time, personal effort, and is often very uncomfortable. Traditional brick-and-mortar institutions work best for learners who are often seeking value other than knowledge (a degree, a door opener to a job etc.). Furthermore, the traditional model has scaled to a rather rigid and formalized process of learning. By the way, that traditional model of education was invented hundreds of years ago, has not adapted much to modern learning principles, and may be even less relevant today. There is however, a small group of learners out there (self-directed), who do not benefit as much from the traditional model. Moreover, self-directed learners are not always fully-engaged even within the so called 'modern' MOOC style learning environments. Are You A Self-directed Learner? Answer the following seven questions. If you answer six or more of the questions YES, then self directed learning might be better for you.  If you are already a self-directed learner, you probably don't need to be told where to find content to support your personal learning agenda. However, sometimes we can miss a gem or two and therefore, have a look at the following. Self-directed Learning Resources AcademyBridge: Curated Business Education Video site delivering FREE access to 1,000's of business education videos and learning modules (updated daily). Academy Bridge is great for learners who benefit most from video content. Carnegie Mellon University: Open Learning Initiative has 27 online courses available FREE. Each course also offers a unique target feedback process for learners. MERLOT: Curated collection on online FREE multimedia educational resources for learning and online teaching. MIT OpenCourseware: MIT OpenCourseWare (OCW) is a web-based publication of virtually all MIT course content. OCW is the Grand Daddy of all Open Educational Resource Initiatives. Open Washington: Open Educational Resources Network. Open textbooks, course material, video and images. University of Wisconsin: Open Textbook Library has FREE textbooks covering many different disciplines.  The author has curated thee above resources related to open education and is associated with AcademyBridge ",
            "date": "Updated September 2, 2017",
            "views": "191",
            "upvotes": " View 34 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Xavier Yap",
                    "user_href": "/profile/Xavier-Yap-1"
                },
                {
                    "user_id": "Anish Bhola",
                    "user_href": "/profile/Anish-Bhola"
                },
                {
                    "user_id": "Aziz Al Roumi",
                    "user_href": "/profile/Aziz-Al-Roumi"
                },
                {
                    "user_id": "Sujaya Kumar",
                    "user_href": "/profile/Sujaya-Kumar-6"
                },
                {
                    "user_id": "ZhiWei Chiang",
                    "user_href": "/profile/ZhiWei-Chiang"
                },
                {
                    "user_id": "Protais Nira",
                    "user_href": "/profile/Protais-Nira"
                },
                {
                    "user_id": "Zuwwar Jadoon",
                    "user_href": "/profile/Zuwwar-Jadoon"
                },
                {
                    "user_id": "Aditya Kaushik",
                    "user_href": "/profile/Aditya-Kaushik"
                },
                {
                    "user_id": "Nishith Ghetiya",
                    "user_href": "/profile/Nishith-Ghetiya"
                },
                {
                    "user_id": "Ola Hola",
                    "user_href": "/profile/Ola-Hola-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paula Castillo",
                "href": "/profile/Paula-Castillo-2-1"
            },
            "answer_text": "Treehouse Review I have found Treehouse (Start Learning at Treehouse for Free) to be fun and easy to use, especially if you are a novice coder. They have more than 300 courses and 278 workshops to keep you busy. There are also 23 topics to choose from and a video player to use. All of that makes it pretty easy to see why they have more than 50,000 students right now. Busy Life? If you are trying to learn a new skill you shouldn’t have to worry about if it is going to interrupt your busy day-to-day life. I love their platform because they offer on-demand videos and interactive code challenges that are available to you when you are needing them, meaning that there is no deadline for how long you can take before they are gone. Support System And Value There are over 50,000 students working with their platform right now, and that means that there are a lot of students taking advantage of the online community available. These students are always there to offer their support along with being there to help you keep going. Their platform comes loaded with many different plans that were built to go along with your goals as well as your budget. You can first go ahead and check out their 7 day free trial before you decide if you want to start paying monthly. There is certainly no need to pay thousands of dollars up front as you would have to with college. What I Love My favorite part about this platform is that there are many different coding classes to choose from. The curriculums are very simple and anyone would be able to understand them. Of course, another thing I love is their 7 day free trial. I also love that you have the ability to pause and renew enrollment any time that you want to, and that they support major mobile platforms. What I Don’t Love I really only have to things that I don’t love about their platform. The first thing is that their monthly fees can start to seem a little bit much if you are on a strict budget. The second thing is that their free trial does require that you have a credit card. However, I think that the credit card requirement for the free trial is kind of normal for these days. Final Thoughts I believe that Treehouse (Start Learning at Treehouse for Free) is a thrilling and simple to use platform, especially for anyone who is new to the world of coding. With more than 300 courses and 278 workshops to keep you busy, it is easy to see why they have over 50,000 students working with them right now. However, the platform does come with two downfalls (but they are quite small of cons) so make sure that you check out their 7 day free trial before you go spending your money every month with them. All in all, I would say that their platform is very easy to recommend. ",
            "date": "Updated October 4, 2019",
            "views": "777",
            "upvotes": "0"
        }
    ]
}