{
    "title": "What are the differences between learning and acquiring a second language? - Quora",
    "tags": [
        "Second Language",
        "Learning Languages",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jaigobin Shivcharran",
                "href": "/profile/Jaigobin-Shivcharran"
            },
            "answer_text": "The difference between “language acquisition” and “language learning” lies in the fact that whereas, on the one hand, “language acquisition” is done naturally, unconsciously, and painlessly, “language learning,” on the other hand, is done consciously and painfully. According to Stephen Krashen, America’s premier second-language learning theorist, there is a critical period for language acquisition which extends from birth to the age of ten or twelve. This means that, if a child is introduced to a new language, that child will be able to acquire the second language as long as he interacts with speakers of the language on a daily basis. If, on the other hand, a child is introduced to a new or second language after the age of twelve, that is, after the critical period of language acquisition, that child will not be able, so to speak, to acquire the second language. Accordingly, that child will have to undergo the strenuous and painful way of learning the second language. It is for this specific reason that children within the critical period of language acquisition are able to acquire a new or second language. Adults, on the other hand, who have long past this critical age for learning acquisition, have to undergo the hardship and pain to actually learn the language in question. NOTE: Second- language learning is called ESL: English as a Second Language, or ENL: English as a New Language. Learning “English as a Foreign Language” is called EFL (English as a Foreign Language). A child who is learning English as a new or second language is called ELL: English Language Learner. In sum, “ Language Acquisition” and “Language Learning” are on two different linguistic tracks. As we have seen, whereas “Language Acquisition” comes naturally, “Language Learning” entails a lot of pain and hard work: linguistic pain and hard work. ",
            "date": "Answered April 28, 2019",
            "views": "237",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jyothikrishna KB",
                    "user_href": "/profile/Jyothikrishna-KB"
                },
                {
                    "user_id": "Rea Baldivino",
                    "user_href": "/profile/Rea-Baldivino"
                },
                {
                    "user_id": "Lebohang Mokoena",
                    "user_href": "/profile/Lebohang-Mokoena-5"
                },
                {
                    "user_id": "Omed A. Ahmad",
                    "user_href": "/profile/Omed-A-Ahmad"
                },
                {
                    "user_id": "Mitra Gusmeni Hia",
                    "user_href": "/profile/Mitra-Gusmeni-Hia"
                },
                {
                    "user_id": "Izzatuddini Islamiati",
                    "user_href": "/profile/Izzatuddini-Islamiati"
                },
                {
                    "user_id": "Haris Umar",
                    "user_href": "/profile/Haris-Umar-1"
                },
                {
                    "user_id": "Yanina Chávez",
                    "user_href": "/profile/Yanina-Chávez"
                },
                {
                    "user_id": "L M",
                    "user_href": "/profile/L-M-2-2"
                },
                {
                    "user_id": "Rushi Arif",
                    "user_href": "/profile/Rushi-Arif"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Peterson",
                "href": "/profile/Andrew-Peterson-277"
            },
            "answer_text": "As Ali says, acquisition implies an unconscious process. I would say, not to put too fine a point on it, that the main difference between “learning and acquisition, in terms of languages” is that the one works and the other doesn’t. It seems a bit harsh to say it like this; but that’s what it comes down to. You can’t learn a language like you can learn some other skill. You get used to a new language. You “learn” the words by understanding messages in context. The best way to do that is to use massive compelling comprehensible input – which means in practice: read and listen a lot. What is the main obstacle when learning a language? Many people would probably say: Learning the rules. This is wrong. The rules and patterns are important and they are what enable us to speak clearly and elegantly, differentiate time and relationships etc. The main obstacle to speaking a language fluently, however, is the words. There are thousands and thousands of them and we need to understand many thousands of these passively and also use a smaller yet still considerable number of them actively, while expressing ourselves, in order to speak fluently on a wide range of topics. Canadian polyglot Steve Kaufmann likes to compare the words to the metallic rabbit chased by dogs in hunting. Words are what we must constantly focus on and chase. While we observe the language in our listening and reading, while we focus on patterns, phrases, different tenses and whatnot, the real challenge is to pick up as many words as possible. Without them we can neither understand nor say anything. If we were to use bad grammar or even only talk in primitive infinitives and in the present tense, we would still be able to communicate basic meaning, if at the same time we knew the words. More importantly, we can almost always understand the gist of what someone says to us, when we know the words they use, even if we are not familiar with all the finer shades of the tenses and grammatical relationships in a given sentence. This does not work the other way around. If you were to learn the different tenses and rules without knowing thousands of words, you wouldn’t be able to understand what most people say most of the time, let alone speak yourself. This is why working with massive amounts of input, listening and reading a lot, is the most efficient technique. By reading interesting texts, listening to audio of stuff that you like, you are exposed to hundreds and even thousands of words in mere minutes. By seeing them over and over in context, you come to understand them. That is why you acquire a language rather than learn it. ",
            "date": "Answered November 22, 2019",
            "views": "7",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rea Baldivino",
                    "user_href": "/profile/Rea-Baldivino"
                },
                {
                    "user_id": "Jaigobin Shivcharran",
                    "user_href": "/profile/Jaigobin-Shivcharran"
                },
                {
                    "user_id": "Andrzej Owsikowski",
                    "user_href": "/profile/Andrzej-Owsikowski"
                },
                {
                    "user_id": "Hosam Hollah",
                    "user_href": "/profile/Hosam-Hollah"
                },
                {
                    "user_id": "Ahmed Abdulrahman",
                    "user_href": "/profile/Ahmed-Abdulrahman-34"
                }
            ]
        }
    ]
}