{
    "title": "What can I do to make up for my low GPA in high school? - Quora",
    "tags": [
        "Grade Point Averages",
        "High School Education",
        "The High School Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrea Martin",
                "href": "/profile/Andrea-Martin-27"
            },
            "answer_text": "Here are your steps, though I’m not listing them in any particular order because I need to write quickly to make my next appointment: If you suspect you may have a hidden learning issue, get evaluated, treated and accommodated. For that, you go to your doctor first or ask a 504 coordinator or school counselor for recommendations about how to go about that.Always get 8–9 hours of sleep, every night.Always get 4 hours of strenuous exercise per week, as a minimum.Avoid all junk food, most sugar and saturated fat, alcohol, recreational drugs, tobacco, and other things that are not good for you.Give up videogames and other time wasters. You can pick them up later, but for now just quit cold turkey.Read voraciously and include library books about science, math books, classic novels, philosophy, etc. If you don’t read when you don’t have to, you won’t be the best student you can be. Your first reading focus should be your textbooks, though. If you have a hard time concentrating, outline each chapter in detail with sentence outlining and including all the important points. Then, do all the exercises in the back of each chapter.Get a great private tutor, and don’t go by concierge type features—their willingness to come to your home, their eagerness to give you discounts, letting you cancel at the last minute, etc. You might have to go online to find a great tutor rather than limiting yourself to whoever works close to you. Live video chat tutoring can work better than in-person tutoring because it gives you everything you have in person except the distraction of nearby people at tutoring centers, coffee shops, or libraries and let’s you work with anyone in the country. You’re usually more comfortable and focused as well. Live video chat is completely different than programmed or recorded tutoring delivered online. Again, DO NOT pressure a professional, effective tutor to come to your home, give you discounts, let you bail at the last minute, or conform to your schedule. You must conform to their schedule if you want to get the best tutor. If you can’t find a super-genius who can help you in multiple subjects, be prepared to hire more than one tutor. Hint: A great tutor does NOT give you answers or do your work for you. They also don’t talk at you and expect you to learn. They know how to lead you by asking questions so that you actually solve problems by thinking through the steps as they lead you. These tutors are rare. I developed a method when I was in college and spent years teaching my son to use it. The hardest thing to do when getting a tutoring is to resist the professional salespeople and somehow find a professional tutor. Remember that there are always smart people who are nice and helpful, but they are not usually trained (no matter what they say) and are not usually highly skilled at private tutoring (though they might help). If you can find a great tutor, treat them well or you may not have them for long. We hate to let clients go, but we know that difficult clients cost us money and we can have a waiting list full of cooperative clients easily. So, we find polite ways to disengage with difficult clients. So, be good to great tutors.Attend every class.Sit in the front center of the class, making a case to your teacher as needed to get that privilege. If you can’t get that spot, try for the front row or second row. Don’t sit in the back.Ask your school counselor if you can repeat any classes for which you made a D or below.Find summer classes that are equal to classes where you made a C or below and find out if you can take them in the summer and have the summer grade earned replace your low grades on your current record. Get it in writing from the school before you do this, but even if you did not get the grade replaced, you can show documentation to colleges to prove that you made a B+ in Algebra II in a rigorous summer program after making a D the previous year in your regular school. That should make some difference, though it would not affect your GPA. You’d just have to point it out and make sure the admissions offices took note. It’s better to get that course to replace your lower grade, though.If you have the money or can get a scholarship, go to a private school that has high quality education if they will allow you to take another year and repeat some courses you didn’t do well in previously.Take summer classes at the community college to improve your skill mastery and knowledge, even if it doesn’t change your GPA. It can improve your future grades and also prove to colleges that you wanted to improve your performance, especially if you point it out. Tell them you had a turning point when you got serious about school and wanted to do everything possible to accelerate your improvement.If you’re late in your high school career, consider taking one year of community college and doing everything in your power to make straight A’s legitimately to demonstrate your potential. Make sure you take challenging courses, though, as easy courses are easier to make A’s in. Then, apply to 4-year colleges. The downside of this is that some colleges don’t accept a lot of transfers every year and some don’t accept transfers at all. However, I’ve seen this transform options for students who had poor records in high school. Then explain that you simply were more focused “in a college environment” and were more mature at that time as well. Say you “look forward to a vigorous college education.”Consider how you spend your time. Grades are more important than extracurricular activities, social media, gaming, TV, sports, etc. You’re not going to make much progress if you don’t give up major time-gobblers. I’ve had students who literally spend 35 hours per week on extracurricular activities, have undiagnosed learning issues and refuse to take more than two hours of tutoring per week but can’t understand why they are struggling to make A’s. Your best bet is to give up all or almost all of your extracurricular activities and focus on grades only, in addition to health-related activities like daily exercise, sleep, nutrition, and basic minimal socializing (not hours every day, though). A college will respect it when you say, “I realized that in order to reach my goal of improving my academic profile, I had to make sacrifices and completely devote myself to my studies, and the results were worth it.”If you do all these things, you will improve your academic profile. The fastest way to improve is to somehow find the very best tutor—a full time professional with intensive, long-term training—and a hardcore educational consultant with experience helping students transform their academics then DO WHAT THEY SAY. When I take students in such circumstances and mom won’t let them reduce their extracurricular activities, study on minor holidays when they have a test coming up, get 8 hours of sleep, etc., I can’t help but shake my head. They are paying me and my son to perform miracles, and they are working against what needs to happen. I usually ease those clients out so that I can work with clients who will cooperate with our advice and get the very best results. If you get an educational consultant, you should avoid those who use the same formula and schedule for every student. Avoid those that merely want you to check in once a week. Get one who is going to set up a custom program for you and demand you follow it. Yes, you have a say, but don’t waste their time if you’re not going to follow their advice. Just meeting with them won’t gain you anything. It’s what you do with the advice you get that matters. ",
            "date": "Updated December 12, 2019",
            "views": "34",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Scott Snyder",
                    "user_href": "/profile/Scott-Snyder-223"
                },
                {
                    "user_id": "Jose Cruz",
                    "user_href": "/profile/Jose-Cruz-163"
                },
                {
                    "user_id": "Kuai Cheng",
                    "user_href": "/profile/Kuai-Cheng-3"
                },
                {
                    "user_id": "Jai Bhatnagar",
                    "user_href": "/profile/Jai-Bhatnagar-2"
                },
                {
                    "user_id": "Mily Gupta Dahlke",
                    "user_href": "/profile/Mily-Gupta-Dahlke"
                },
                {
                    "user_id": "Erick",
                    "user_href": "/profile/Erick-72"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jin Kim",
                "href": "/profile/Jin-Kim-130"
            },
            "answer_text": "Cut out the bull-crap like excessive video gaming, binge watching on Netflix, and texting partin with your friends.Make a dedication to your studies. Set aside 4–5 hours each day for preparing for classes.Use your high school’s online grading site and know where you stand at all time and what you need to do in remaining assignments/tests to improve each class. It’s like you trying to lose weight - you have to step on the scale to know how much you weigh currently how you are improving.Find study groups. Not being able to contribute to your group will become a great motivator to keep up.Use all of your resources. If there are tutoring program available in your high school, use it. If not, go make friends with a smart kid and ask if he/she can help you. If text books and classes are not enough, go check out if any of the topics are covered on Khan’s Academy.Take notes in classes. If you don’t understand something, ask the teacher. That implies that you prepare and pay attention.Take full advantage of your summer. Take some hard classes during the summer term so that you can focus on it, instead of juggling them with other classes during your school year.“A journey of thousand miles begins with a single step.” -Lao Tzu. You take this this single step is when you decide you are going to grow as a person and change. Unless you do, nothing will change. So take this important single step! ",
            "date": "Answered January 25, 2018",
            "views": "19",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bailey Nelson",
                    "user_href": "/profile/Bailey-Nelson-79"
                },
                {
                    "user_id": "Scott Snyder",
                    "user_href": "/profile/Scott-Snyder-223"
                },
                {
                    "user_id": "Kuai Cheng",
                    "user_href": "/profile/Kuai-Cheng-3"
                },
                {
                    "user_id": "Tommy",
                    "user_href": "/profile/Tommy-336"
                },
                {
                    "user_id": "Kathy Peterson",
                    "user_href": "/profile/Kathy-Peterson-19"
                },
                {
                    "user_id": "Erick",
                    "user_href": "/profile/Erick-72"
                }
            ]
        }
    ]
}