{
    "title": "What chapters are in 11 class physics? - Quora",
    "tags": [
        "Class 11th in India",
        "Studying",
        "Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amisha Rathore",
                "href": "/profile/Amisha-Rathore-6"
            },
            "answer_text": "I Physical World and Measurement 23 Chapter–1: Physical World Chapter–2: Units and Measurements II Kinematics Chapter–3: Motion in a Straight Line Chapter–4: Motion in a Plane III Laws of Motion Chapter–5: Laws of Motion IV Work, Energy and Power 17 Chapter–6: Work, Energy and Power V Motion of System of Particles Chapter–7: System of Particles and Rotational Motion VI Gravitation Chapter–8: Gravitation VII Properties of Bulk Matter 20 Chapter–9: Mechanical Properties of Solids Chapter–10: Mechanical Properties of Fluids Chapter–11: Thermal Properties of Matter VIII Thermodynamics Chapter–12: Thermodynamics IX Kinetic Theory of Gases Chapter–13: Kinetic Theory X Oscillation & Waves 10 Chapter–14: Oscillations Chapter–15: Waves Total 70 Unit I: Physical World and Measurement Chapter–1: Physical World Physics - scope and excitement; nature of physical laws; Physics, technology and society. Chapter–2: Units and Measurements Need for measurement: Units of measurement; systems of units; SI units, fundamental and derived units. Length, mass and time measurements; accuracy and precision of measuring instruments; errors in measurement; significant figures. Dimensions of physical quantities, dimensional analysis and its applications. Unit II: Kinematics Chapter–3: Motion in a Straight Line Frame of reference, Motion in a straight line: Position-time graph, speed and velocity. Elementary concepts of differentiation and integration for describing motion.Uniform and non-uniform motion, average speed and instantaneous velocity. Uniformly accelerated motion, velocity time and position-time graphs. Relations for uniformly accelerated motion (graphical treatment). Chapter–4: Motion in a Plane Scalar and vector quantities; Position and displacement vectors, general vectors and their notations; equality of vectors, multiplication of vectors by a real number; addition and subtraction of vectors. Relative velocity. Unit vector; Resolution of a vector in a plane - rectangular components. Scalar and Vector product of vectors. Motion in a plane, cases of uniform velocity and uniform acceleration-projectile motion. Uniform circular motion. Unit III: Laws of Motion Chapter–5: Laws of Motion Intuitive concept of force. Inertia, Newton's first law of motion; momentum and Newton's second law of motion; impulse; Newton's third law of motion. Law of conservation of linear momentum and its applications. Equilibrium of concurrent forces. Static and kinetic friction, laws of friction, rolling friction, lubrication. Dynamics of uniform circular motion: Centripetal force, examples of circular motion (vehicle on a level circular road, vehicle on banked road). Unit IV: Work, Energy and Power Chapter–6: Work, Engery and Power Work done by a constant force and a variable force; kinetic energy, work-energy theorem, power. Notion of potential energy, potential energy of a spring, conservative forces: conservation of mechanical energy (kinetic and potential energies); non-conservative forces: motion in a vertical circle; elastic and inelastic collisions in one and two dimensions. Unit V: Motion of System of Particles and Rigid Body Chapter–7: System of Particles and Rotational Motion Centre of mass of a two-particle system, momentum conservation and centre of mass motion. Centre of mass of a rigid body; centre of mass of a uniform rod. Moment of a force, torque, angular momentum, laws of conservation of angular momentum and its applications. Equilibrium of rigid bodies, rigid body rotation and equations of rotational motion, comparison of linear and rotational motions. Moment of inertia, radius of gyration.Values of moments of inertia, for simple geometrical objects (no derivation). Statement of parallel and perpendicular axes theorems and their applications. Unit VI: Gravitation Chapter–8: Gravitation Keplar's laws of planetary motion.The universal law of gravitation. Acceleration due to gravity and its variation with altitude and depth. Gravitational potential energy and gravitational potential. Escape velocity. Orbital velocity of a satellite. Geo-stationary satellites. Unit VII: Properties of Bulk Matter Chapter–9: Mechanical Properties of Solids Elastic behaviour, Stress-strain relationship, Hooke's law, Young's modulus, bulk modulus, shear modulus of rigidity, Poisson's ratio; elastic energy. Chapter–10: Mechanical Properties of Fluids Pressure due to a fluid column; Pascal's law and its applications (hydraulic lift and hydraulic brakes). Effect of gravity on fluid pressure. Viscosity, Stokes' law, terminal velocity, streamline and turbulent flow, critical velocity.Bernoulli's theorem and its applications. Surface energy and surface tension, angle of contact, excess of pressure across a curved surface, application of surface tension ideas to drops, bubbles and capillary rise. Chapter–11: Thermal Properties of Matter Heat, temperature, thermal expansion; thermal expansion of solids, liquids and gases, anomalous expansion of water; specific heat capacity; Cp, Cv - calorimetry; change of state - latent heat capacity. Heat transfer-conduction, convection and radiation, thermal conductivity, Qualitative ideas of Blackbody radiation, Wein's displacement Law, Stefan's law, Green house effect. Unit VIII: Thermodynamics Chapter–12: Thermodynamics Thermal equilibrium and definition of temperature (zeroth law of thermodynamics).Heat, work and internal energy. First law of thermodynamics. Isothermal and adiabatic processes. Second law of thermodynamics: reversible and irreversible processes. Heat engine and refrigerator. Unit IX: Behaviour of Perfect Gases and Kinetic Theory of Gases Chapter–13: Kinetic Theory Equation of state of a perfect gas, work done in compressing a gas. Kinetic theory of gases - assumptions, concept of pressure. Kinetic interpretation of temperature; rms speed of gas molecules; degrees of freedom, law of equi-partition of energy (statement only) and application to specific heat capacities of gases; concept of mean free path, Avogadro's number. Unit X: Oscillations and Waves Chapter–14: Oscillations Periodic motion - time period, frequency, displacement as a function of time. Periodic functions. Simple harmonic motion (S.H.M) and its equation; phase; oscillations of a spring-restoring force and force constant; energy in S.H.M. Kinetic and potential energies; simple pendulum derivation of expression for its time period. Free, forced and damped oscillations (qualitative ideas only), resonance. Chapter–15: Waves Wave motion. Transverse and longitudinal waves, speed of wave motion. Displacement relation for a progressive wave. Principle of superposition of waves, reflection of waves, standing waves in strings and organ pipes, fundamental mode and harmonics, Beats, Doppler effect. ",
            "date": "Answered November 22, 2018",
            "views": "304",
            "upvotes": " View 46 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ayushi Mishra",
                    "user_href": "/profile/Ayushi-Mishra-528"
                },
                {
                    "user_id": "Yash Singh",
                    "user_href": "/profile/Yash-Singh-767"
                },
                {
                    "user_id": "Digvijay Yadav",
                    "user_href": "/profile/Digvijay-Yadav-152"
                },
                {
                    "user_id": "Ariz Akram",
                    "user_href": "/profile/Ariz-Akram-3"
                },
                {
                    "user_id": "Munesh Kumar",
                    "user_href": "/profile/Munesh-Kumar-515"
                },
                {
                    "user_id": "Subhash Tanaji Ravan",
                    "user_href": "/profile/Subhash-Tanaji-Ravan"
                },
                {
                    "user_id": "Dev Beradi",
                    "user_href": "/profile/Dev-Beradi"
                },
                {
                    "user_id": "Pandit Ji",
                    "user_href": "/profile/Pandit-Ji-154"
                },
                {
                    "user_id": "Amrit Purohit",
                    "user_href": "/profile/Amrit-Purohit"
                },
                {
                    "user_id": "Deepak Singh",
                    "user_href": "/profile/Deepak-Singh-3140"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashrit Kumar Dash",
                "href": "/profile/Ashrit-Kumar-Dash"
            },
            "answer_text": "Hi! The syllabus is as follows: I. Physical World and Measurement Chapter–1: Physical World Chapter–2: Units and Measurements II. Kinematics Chapter–3: Motion in a Straight Line Chapter–4: Motion in a Plane III. Laws of Motion Chapter–5: Laws of Motion IV. Work, Energy and Power Chapter–6: Work, Energy and Power V. Motion of System of Particles Chapter–7: System of Particles and Rotational Motion VI. Gravitation Chapter–8: Gravitation VII. Properties of Bulk Matter Chapter–9: Mechanical Properties of Solids Chapter–10: Mechanical Properties of Fluids Chapter–11: Thermal Properties of Matter VIII. Thermodynamics Chapter–12: Thermodynamics IX. Kinetic Theory of Gases Chapter–13: Kinetic Theory X. Oscillation & Waves Chapter–14: Oscillations Chapter–15: Waves Thanks:) ",
            "date": "Answered August 20, 2018",
            "views": "9",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pandit Ji",
                    "user_href": "/profile/Pandit-Ji-154"
                },
                {
                    "user_id": "Worldwide 18",
                    "user_href": "/profile/Worldwide-18"
                },
                {
                    "user_id": "Bhavika Bakhtar",
                    "user_href": "/profile/Bhavika-Bakhtar"
                },
                {
                    "user_id": "Radha Maheshwari",
                    "user_href": "/profile/Radha-Maheshwari-5"
                },
                {
                    "user_id": "VAIJANTA GAUTAM HANDE",
                    "user_href": "/profile/VAIJANTA-GAUTAM-HANDE"
                },
                {
                    "user_id": "Pankaj Chauhan",
                    "user_href": "/profile/Pankaj-Chauhan-996"
                },
                {
                    "user_id": "Abhishek Khode",
                    "user_href": "/profile/Abhishek-Khode-3"
                },
                {
                    "user_id": "Ninad Gandhi",
                    "user_href": "/profile/Ninad-Gandhi-5"
                },
                {
                    "user_id": "Isha Jain",
                    "user_href": "/profile/Isha-Jain-482"
                },
                {
                    "user_id": "Purohit Rajesh",
                    "user_href": "/profile/Purohit-Rajesh-2"
                }
            ]
        }
    ]
}