{
    "title": "What can we do to understand studying? - Quora",
    "tags": [
        "Understanding and Comprehension",
        "Studying Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhijeet Golliwar",
                "href": "/profile/Abhijeet-Golliwar"
            },
            "answer_text": "“It happen because we never corelate theory to practical applications”. The computer that guided human to moon in apollo-11 spacecraft, to astronauts was AGC ( apollo guidance computer) that piece of technology motivate enough me to choose electronics engineering as my career. Because whatever I learned in past 24 years of life, I always try connect those dots to real life scenario. Since childhood, My dad only gives permission to watch TV, if channel was Discovery & National Geography. So at very early age, I was attach to technology. First, if you are able to read this answer is because of greatest minds of all time. Every discovery & experiment we did was for benefit of our society. The common things in those great people, is “ do something for people & for the society\". These drives them do something extraordinary from ordinary things. The things that make them differentiate is curiosity & hunger to understand the world around them. Whatever you are studying, no matter what is it, whether its hard or easy. Just try to understand the practical purpose of that that subject to real life scenario. Everything we study, has come from practical life scenario & hard work of human society. Starting from letter’s A,B,C,D…. to number’s 1,2,3…. to different languages, Every number system, language, technology & every machine, we created to understand the world around us. Its curiosity which drives human limit to infinity. You know, “ what is greatest supercomputer human has ?, Its our brain,” There are billions of neuron in our brain specifically evolved to understand world around us. We as species has achieved so much compared in last millions year that no species able to achieve in earth. Create curiosity among you related to that subject, ask question. Why it happen ? what ? when ? who ? where ?. I don’t know what type student who you are, but in general I will give you some of the best proven method to create curiosity among yourself. Try to watch documentaries.Read books, I know its boring.Read related articles, as internet full of it.Travel as much as you can, it gives solution to understand the world.Observer your surroundingCreate your passion.Always try to do something different people, you will automatically get curiosity. Till then enjoy what you are studying, Don’t quit. Follow your passion. ",
            "date": "Answered January 31, 2020",
            "views": "13",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Satvik Dharavath",
                    "user_href": "/profile/Satvik-Dharavath"
                },
                {
                    "user_id": "Vignesh Kumar",
                    "user_href": "/profile/Vignesh-Kumar-220"
                },
                {
                    "user_id": "Shiven Saini",
                    "user_href": "/profile/Shiven-Saini"
                },
                {
                    "user_id": "Priya Suthar",
                    "user_href": "/profile/Priya-Suthar-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Aleki",
                "href": "/profile/Robert-Aleki"
            },
            "answer_text": "My advice is to not take the easy way out. The easy way out is to ask your teacher or classmates for help. These options should be your last resort. Instead, I urge you to go and research the subject/topic you don’t understand. Research in this instance means reading your textbook or given notes, going to the library and find a book on the topic or even better you can take a survey of the internet for relevant information and explanations. Sometimes the explanations on the internet are way better than the teachers. Why this is important is that you need to get used to going in search of information instead of always relying on other humans (teachers and classmates) because they will not be with you 24 hours a day. Instead the internet and books will always be by your side to help you understand anything that you wish to learn. ",
            "date": "Answered March 25, 2020",
            "views": "686",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Filipe Vasconcelos",
                    "user_href": "/profile/Filipe-Vasconcelos-8"
                },
                {
                    "user_id": "Ivan Castillo",
                    "user_href": "/profile/Ivan-Castillo-59"
                }
            ]
        }
    ]
}