{
    "title": "What are the creative methods of teaching for primary teachers? - Quora",
    "tags": [
        "Primary School Teacher",
        "Teaching Methods",
        "Teachers",
        "Teaching"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gopal Krishna",
                "href": "/profile/Gopal-Krishna-88"
            },
            "answer_text": "In my government school , I am not doing teaching to students whole the time. I will just make 20% of time to explain the topic to pupil. And I will sure make the students utilise the 80% of the time in self learning. Yes it is. SELF LEARNING . HOW? A question how is answered simply by giving an example. So I will pickup a topic - MULTIPLICATION And now the solution:- [math]NAPIER RODS[/math] 20% OF TIME:-I will use this time to teach on blackboard. I will use chalkpiece and duster and blackboard and make the students sitting in front of me looking at that giant black board all the time to watch and listen my class . I too know that a student can't aquire knowledge by just staring / listening at blackboard/me respectively. But no problem, he will gain atleast a primary knowledge on that topic which will make him interested in that topic when I use my next step.2. 80% OF TIME:- And now comes the magic ones which I use. It is already known with all of us but it is not known for those students. We know Napier rods and so we don't think that it is creative one. But creative feeling should not be in your heart, but a creative feel should be started in student heart when he sees it and how it functions. So with that Napier bones, he starts to play with it, he starts to think about it. Because the topic MULTIPLICATION has came to physical property. I changed MULTIPLICATION topic from abstract thinking to reality. So students thinks over it. He does more and more calculations as he don't think that he is learning but he is playing. It's called creativity. In simple slogan it speaks like - LEARNING BY DOING.Therefore my task to make pupil learn multiplication is completed successfully and with a little effort from me . I just avoided using blackboard and chalkpiece and eating all the dust from chalk. Now, in my school , a 3rd class student can do a multiplication of 6354*34987 within 5 minutes without using Napier bones. Because he self taught the insight of multiplication . He knows what and why we use multiplication in real life of his own. I can't achieve this if I follow the routine method, which is using chalk, duster and blackboard and eating all the chalk dust. As LEARNING BY DOING method is being implemented by a minimum teachers in our country and in Montessori, this method must be adopted by every teacher in this country which will make the student to explore the world by sitting in his classroom. Hence , any method you choose to teach the pupil, which will take 20% of time to teach on blackboard and 80% of time to make pupil self taught within their peer group using TLM(TEACHING LEARNING MATERIALS) is the best creative method ever. According to psychology, As we teach pupil he gets - 25% of subject As student self learns he gets - 25% of subject As student discuss with his peer group, he gets-25% of subject and As student gets self experienced about the topic , he gets -25% of subject. That's why , there is no use if you use whole the time to teach him using chalk and blackboard and eating dust all the time. He will get subject of only 25%. That's why I use only 20% of time to teach on blackboard and i use 80% of time to create situations/experiences to students in which he self learns and discuss with peer group and gains 25%+25%=another 50% of subject in the time of class. So he gains total of 75% of knowledge what he learns. And if he faces the real life experiences about the topics he learnt, he will gain 100% knowledge. And if doesn't faces, he just remains with 75% of knowledge only about that topic all the life. Give less time for teaching.Give more time for self learning by creating situations/experiences in classroom.Anything you do for a student to make him self learn is a absolutely creative method which mirrors LEARNING BY DOING!!! A government Teacher!!! ",
            "date": "Answered July 11, 2017",
            "views": "14",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Medarametla Sreeram",
                    "user_href": "/profile/Medarametla-Sreeram"
                },
                {
                    "user_id": "Vignesh Tamilmani",
                    "user_href": "/profile/Vignesh-Tamilmani"
                },
                {
                    "user_id": "Dillip Sahoo",
                    "user_href": "/profile/Dillip-Sahoo-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jyotipuspa Das ( ଜ୍ୟୋତିପୁଷ୍ପା ଦାସ)",
                "href": "/profile/ज्योतिपुष्पा-दास-Jyotipuspa-Das-ଜ୍ୟୋତିପୁଷ୍ପା-ଦାସ"
            },
            "answer_text": "Primary kids are like buds. They will bloom the way we want them to. Teaching primary kids are one of the skillful and tough task to do. Here are somè tips- First and foremost rule is you have to be patient with them. One can't force a primary level kid to study. It will make them fearful and they will drive away from learning.Always try to explain things with certain stories or funny incidents. That makes them interested towards study.Always while giving example use the class kids’ name. Thats is humorous to them.Start giving innovative awards like , extra 1 mark for good handwriting, good compliment for obedience or smiply name the day as the kid’s name if he/she does anything very good.While teaching humanities let them be actively participate.Example- Teaching about states of India. Let 29 kids to be one state each. If you have more kids call other 29 to be capital of each city. Now let them find correct state for each.Teaching math or scinece would be helpful with models,diagrams and counting toys.There are thousands of innovative ideas to make teaching a fun to primary kids. Thanks for reading. Thanks for A2A. ",
            "date": "Answered July 10, 2017",
            "views": "19",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Padmapriya Ernest",
                    "user_href": "/profile/Padmapriya-Ernest-1"
                },
                {
                    "user_id": "Kumud Kohli",
                    "user_href": "/profile/Kumud-Kohli"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Bagad-billa-11"
                },
                {
                    "user_id": "Abhi Mishra",
                    "user_href": "/profile/Abhi-Mishra-39"
                },
                {
                    "user_id": "Dhanwani Chandni",
                    "user_href": "/profile/Dhanwani-Chandni"
                },
                {
                    "user_id": "Utsav Vij",
                    "user_href": "/profile/Utsav-Vij"
                },
                {
                    "user_id": "Syeda Naghma",
                    "user_href": "/profile/Syeda-Naghma"
                },
                {
                    "user_id": "Priyanka Bora",
                    "user_href": "/profile/Priyanka-Bora-20"
                },
                {
                    "user_id": "Dillip Sahoo",
                    "user_href": "/profile/Dillip-Sahoo-18"
                }
            ]
        }
    ]
}