{
    "title": "What's the most useful skill that everybody should learn? - Quora",
    "tags": [
        "Practical Life Skills",
        "Tips and Hacks for Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhinav Garg",
                "href": "/profile/Abhinav-Garg-177"
            },
            "answer_text": "Some of them which i can think of right now are: You should know how to perform CPR: Do you want to save a life?70 percent of Americans feel helpless during a cardiac emergency, and here’s another surprising statistic- the life you save is most likely the life of someone you love, because 4 out of 5 cardiac arrests occur at home. You should know how to manage your time: Time management is a precise art and science, and if you haven’t studied it yet, you should. Applying these principles of time management to your life can get you back precious hours you didn’t know you had, and completely eliminate much of your productivity destroying behavior. You should know how to approach and meet new people: Even if you’re an introvert, it is important to have the ability to walk up to a new person and hold a nice conversation. Meeting people is a great way to learn new things, expand your network, and gain new opportunities in life. You should know how to talk in front of lots of people: Public speaking is the number one fear in the world (ranking higher than the fear of death.) It’s a fear, but if you practice, it’s not that scary. Learning to say a few words in front of a large or small group is a huge asset that can be used in so many instances, professional and personal. You should know how to shut up and listen genuinely: If you learn to do this well, you will be loved and admired, and you will understand people better. It can improve relationships drastically,and ultimately make you a more compassionate person. Learn to stay silent sometimes and observe as much as you can. Be aware of your surroundings: This is the most underrated thing or in other words most neglected by the youth. I’ve seen many school pass outs who don’t know basic things like their country’s President or Prime Minister or the Chief Minister of their state. And they are those people who score heavily in their boards. In my opinion, these marks are useless if one cant answer basic questions like these. Be updated. You should know how to be happy: There is a method to this, it’s not an automatically occurring thing- people who are genuinely happy are happy despite their circumstances, not the other way around. Stop overthinking imaginary situations which you know would never happen. You should know how to have a conversation with someone of any age: It’s a sign of true maturity and humanity when a person can hold a quality conversation with a 5 year old or a 92 year old person without flinching. You will also learn so much about life if you do this regularly. For this you need to have content. You can’t talk about GOT(Game of thrones ) to a 92 year old or a 5 year old. Try to understand different people of all age groups. You should know how to say “I’m sorry” and “I was wrong: ”You know who you are! Being able to admit your faults once in a while takes effort, practice, and a change of attitude. It can repair broken relationships, heal scars, and bring the conversation back to the important things in life. You should know the correct way to respond to criticism: Learn this skill to avoid looking defensive, unprepared and immature. Criticism is a good thing (most of the time), and it can help you improve and develop yourself if you can learn how to take it objectively and reflect on yourself and your work. You should step out of your comfort zone: Learning takes place only out of your comfort zone. Personality only develops outside your comfort zone. If you want to push your limits a little, step out of this comfort zone. Learn to adjust in almost every situation and accept it as a challenge. ",
            "date": "Answered June 7, 2017",
            "views": "22",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pabitra Nanda",
                    "user_href": "/profile/Pabitra-Nanda-2"
                },
                {
                    "user_id": "Dang Nguyen",
                    "user_href": "/profile/Dang-Nguyen-322"
                },
                {
                    "user_id": "Jamila Muradova",
                    "user_href": "/profile/Jamila-Muradova-1"
                },
                {
                    "user_id": "Ayshz",
                    "user_href": "/profile/Ayshz-1"
                },
                {
                    "user_id": "Sowmya",
                    "user_href": "/profile/Sowmya-484"
                },
                {
                    "user_id": "Anil Kumar",
                    "user_href": "/profile/Anil-Kumar-16063"
                },
                {
                    "user_id": "Hazrath Ansar",
                    "user_href": "/profile/Hazrath-Ansar"
                },
                {
                    "user_id": "Ambati Jagan",
                    "user_href": "/profile/Ambati-Jagan"
                },
                {
                    "user_id": "Priyansh Acharya",
                    "user_href": "/profile/Priyansh-Acharya-4"
                },
                {
                    "user_id": "Sneha Verma",
                    "user_href": "/profile/Sneha-Verma-299"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lukas Schwekendiek",
                "href": "/profile/Lukas-Schwekendiek"
            },
            "answer_text": " Today is not a good day. You walk away from the bank, having just checked your balance, and it is at an all time low. An extra bill here, an extra payment there, and somehow you lost track of it all until the reality set in this morning as you checked your balance. Seeing the statement initially feels like a punch to the gut. Of course you expected it, but you still tried to convince yourself that maybe you were wrong. Reality, however, is not that kind. “It’s fine” you tell yourself now as well, just like you did when you avoided checking in on the balance, “I will just keep working and save a little bit more. It should not be a problem.” A week later you are asked into your bosses office. It’s a relatively short conversation. There is not much to say. You simply did not perform to the requirements of the company. You are let go. And while this hits again like a punch in the gut, you expected this as well. You know how much time you wasted. But, then again, you didn’t like the job anyway, so who cares? “It’s fine” you tell yourself once more, “I will simply have to work really hard until I find a job.” A couple more weeks go by, money is becoming a real issue now, and, in an attempt to not feel as terrible about your situation you isolate yourself and procrastinate more often. You keep saying that this is fine, that you will figure it out somehow and, at the end of the day, you keep turning a blind eye towards the things you did not do, saying you’ll do better the next day. But it never gets better; it just gets worse… You will likely be able to relate to the example above, although the problems may have been different, the feeling and the realizations, at least to some extend, you know. The question I have for you right now is: Why does this happen? Was it the lack of trying with everything you’ve got? Was it a false sense of optimism that told you mistakenly that everything would be okay? What made you fall so far without stopping?  Nowadays there is this huge talk about respecting everyone, being kind to one another and everyone watches what they say and do. This has resulted in us being nicer and more accepting, but there is a time and a place for that. When you are at the end of your ropes, when you are not doing what you should be doing, and when life goes down the drain, that is not the time to be the ‘feel-good’ person to yourself. The life around you is on fire! Telling yourself that it will be fine will just get you burned. Kick yourself in the butt and get a move on! Get out of that burning room! It is NOT fine! What if, at any point during that plan, you would have stood up, walked towards a mirror, looked yourself in the eye and had been blunt and honest with yourself? What if you hadn’t tried to sugarcoat it? What if you had taken a closer look at why this had happened when it did? What if you had allowed for it to suck, and recognized and took responsibility for your own mistakes? Do you think the same things would have happened? Take, for example, a best friend vs. a good friend. A good friend will tell you everything is fine. They will hold you tight, tell you how great you are and that you should not worry for everything will be fine. They will try to convince you things aren’t that bad, and that you are better than your problems, all of which is great, but none of which will really change anything! They want to be perceived well by you more than they want your life to get better. A best friend, however, knows you well enough not to pity you. If you screw up they look at you asking “What the heck did you do?” If you are not doing what you need to do they’ll take you by the scruff and lead you to what needs to be done. And if you keep lying to yourself long enough, they might slap you to get you back to your senses. They do this not because they hate you, but rather because they care so much about you that they want you to succeed and be happy regardless of the consequences to the relationship you have with them! They value you more than how you perceive them! It’s the same things parents do, why they tell their children “No” so often, and also why most teenagers resent them so much; they care more about the childs life and future than their relationship. It’s that direct and blunt honesty that is missing in today’s world and that we clearly miss when we talk to ourselves. We want to feel good so badly that we hide from any and all negativity, avoid responsibility wherever we can, and try to fit in so much more than ever before. We are so stuck in this mindset that we ask our partner 16 times what they want to go eat because we are too afraid of taking responsibility ourselves. Because, if they don’t like it then they will leave us and we will be all alone! We will feel terrible if that were to happen so we put our own desires on the back burner and keep putting them in the front; using them as a meatshield against the responsibility and the possibility of negative feedback. We do this with ourselves as well, procrastinating on life so much that we can use our lack of trying as an excuse for why we could have made it if we had tried. This acts like a shield to our ego but is nothing more than a lie. Because, at the end of the day, either you did what you needed to or not, either you succeed or you didn’t, and either you went to bed with a smile on your face of satisfaction or you go to bed still pretending. When you are honest with yourself it will not be easy. You will have to take responsibility for some tough things, but it will drastically increase the chance that you succeed in the end! Learn to become more honest with yourself and develop that skill, for it is the best way to show that you truly care about your life! Do this with your friends and family too, especially the ones you care about, and do not let them get away with less than they wish to have. Believe in yourself and them so much that you are willing to be blunt, like a best friend or a parent would and do not hold anything back. For if you messed up or if they messed up then that is exactly what they need to hear.  Stop lying to yourself. Stop pretending that everything is okay and stop saying that you are fine. Learn to be straight-forward, blunt and honest. Are you truly happy right now? Yes or No? Are you doing everything you can to get there? Yes or No? Are you at least satisfied with your progress? Yes or No? Remember that your life is what it is, for better and for worse, because of the actions that you took. Everything you have is on you, and everything you do not have is on you too. The question is now; if you truly want to lead a better life: What will you do about it? ",
            "date": "Answered August 17, 2020",
            "views": "834",
            "upvotes": " View 463 Upvoters ",
            "upvoters": [
                {
                    "user_id": "MangiaLibri Yep",
                    "user_href": "/profile/MangiaLibri-Yep"
                },
                {
                    "user_id": "Arif Vakil",
                    "user_href": "/profile/Arif-Vakil"
                },
                {
                    "user_id": "Cristian Radu",
                    "user_href": "/profile/Cristian-Radu-8"
                },
                {
                    "user_id": "Karen King",
                    "user_href": "/profile/Karen-King-365"
                },
                {
                    "user_id": "Rayan Nayar",
                    "user_href": "/profile/Rayan-Nayar-1"
                },
                {
                    "user_id": "Dinsky Luther",
                    "user_href": "/profile/Dinsky-Luther"
                },
                {
                    "user_id": "Aarthi Rao",
                    "user_href": "/profile/Aarthi-Rao-2"
                },
                {
                    "user_id": "Dulce Escobar",
                    "user_href": "/profile/Dulce-Escobar"
                },
                {
                    "user_id": "Priya Vardhani",
                    "user_href": "/profile/Priya-Vardhani-1"
                },
                {
                    "user_id": "Kim Smith",
                    "user_href": "/profile/Kim-Smith-1749"
                }
            ]
        }
    ]
}