{
    "title": "What are the new trends in music education? - Quora",
    "tags": [
        "Music Education",
        "Trends",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ryan Burnette",
                "href": "/profile/Ryan-Burnette"
            },
            "answer_text": "I actually know one new trend! I don’t like it. But it’s a trend! I can’t remember a lot about the origins of it, but it’s being implemented in schools a lot more lately, and it was mentioned to me by my college’s choir director during my Vocal Methods course last semester. He said some woman big into researching effective sight-singing techniques had come up with a slightly newer version of the Takadimi method for reading rhythms. I’m not actually sure how old Takadimi is, itself, as a system, but I only started hearing about it when I started college, as its the system taught at Brevard, in our Aural Skills classes. For those who don’t know what Takadimi is, it’s a way of counting out rhythms in music, but instead of the usual “1 & 2 & a 3 e a 4 &” sort of counting, you’ve got “Ta di Ta dimi Taka mi Ta di.” I think if I remember correctly the different syllables are supposed to help with grounding better diction and accuracy than the numeric counting, so that the rhythms are cleaner and, for me at least, sound a little more like what they’re supposed to sound like, whatever that means. What was changed, however, was the addition of “To” and “Tu” to the mix, representing a half note and a whole note, respectively. So where you might have a quarter note, two eighths, and a half note before, you would have said, “Ta, Ta di, Ta,” holding the third Ta for two beats, now you have “Ta, Ta di, To,” with To for two beats. Not a really big change, but it seems pretty handy for distinguishing between long notes and shorter ones. I still like the long Ta’s that I spent four semesters drilling into my brain, and I’m glad we aren’t switching to the new system outside of choir stuff, which still felt weird. It feels weird singing to when you want to sing ta. It really does. So there you have it! A relatively minor pedagogical trend, but it’s a trend nonetheless! ",
            "date": "Answered January 25, 2017",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matthias Klampfl",
                    "user_href": "/profile/Matthias-Klampfl"
                },
                {
                    "user_id": "Atsuko Masuyama",
                    "user_href": "/profile/Atsuko-Masuyama"
                }
            ]
        },
        {
            "author_info": {
                "name": "Noel Walker",
                "href": "/profile/Noel-Walker-18"
            },
            "answer_text": "A trend that I have watched grow over the past few years is the use of student devices in class- such as chrome books and iPads. Most my students have a chrome book during music, and with that, we log in to Quavermusic.com. It’s a subscription site that my school district pays for, and students compose using easy to us notation software, they can play with different apps built on creating music, and stuff like that. Now this isn’t all we do- but the use of personal devices in one way or another does represent a good portion of what we do. I don’t know if universities realize this yet or not- they tend to be a bit behind in the times- but as a new music teacher, you’ll want to know about the different strategies we can do with personal computing devices in the music classroom- it is a growing trend. ",
            "date": "Answered March 28, 2018",
            "views": "544",
            "upvotes": "0"
        }
    ]
}