{
    "title": "What is the admission procedure in Kendriya Vidyalaya? - Quora",
    "tags": [
        "Admissions",
        "Kendriya Vidyalaya Admissions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Manisha S",
                "href": "/profile/Manisha-S-26"
            },
            "answer_text": "Any Self-employed persons, persons in private jobs and those from floating population are also eligible to apply for admission of their wards to Kendriya Vidyalayas. However, admission will be granted in order of priority specified in Guidelines for Admission to Kendriya Vidyalayas. The order of priority is as under:- Category 1- Central Govt. Employees Category 2- Employees of Autonomous Bodies under Central Govt. Category 3- State Govt. Employees Category 4- Employees of Autonomous Bodies under State Govt. Category 5- Self-employed/Private Job/Floating Population. Eligibility For KVS Admission :- A child must be 5 years old as on 31st March of the academic year of admission to Class I . (Child born on 1st April should also be considered.) Age as on 31st March of the year of admission: Class - Minimum age as -Maximum age as I - 05 years - 07 years II - 06 years - 08 years III - 07 years - 09 years IV - 08 years - 10 years V - 09 years - 11 years VI - 10 years - 12 years VII - 11 years - 13 years VIII - 12 years - 14 years IX - 13 years - 15 years X - 14 years - 16 years Age Relaxations: •The age limit is relaxable by 02 years in case of physically handicapped candidates. •There is no age restriction for Class IX candidates provided the candidate is seeking admission into class X in the same year. Similarly there is no age limit for Class XII candidates provided there is no break in continuous study. Relaxation in terms of seats: 1. 15 percent for SC candidates 2. 7.5 per cent for Scheduled candidates 3. 3 percent for differently abled candidates. 4. 25 percent for student belonging to Economically weaker sections of society (EWS). Documents to be attached to the registration form:- • For Class I, certificate of proof of age in the form of a birth certificate issued by the authority competent to register births. This will include certificates from Notified Area Council / Municipality / Municipal Corporation extract about the date of birth from records of Village Panchayat, Military Hospital and service records of Defence personnel or Affidavit. •For other classes, the date of birth recorded in the transfer certificate issued by a school recognized by the State Education Department would be accepted. The original certificate of date of birth should be returned to the parent after verification. •Admissions up to class-VIII may be granted without any school transfer certificate provided the child is otherwise eligible and his birth certificate has been issued by a Govt. body or affidavit. •For grandchildren of the Honorable Members of Parliament and PSU Employees a certificate of relationship must be produced. •This is also applicable for grandchildren of KVS employees. •Children belonging to SC/ST/EWS/OBC and BPL categories are required to produce a certificate issued by a state or union government. •Handicapped or physically disabled candidates are required to produce a certificate from a civil surgeon or rehabilitation center. •In case of children whose parents have been transferred a service certificate showing the number of transfers in the last seven years, duly stamped by the Head office with name designation and other relevant particulars in bold letters should be produced. •A certificate of retirement for uniformed Defense personnel. •A certificate of retirement for uniformed Defence employees. •Proof of Residence. Note: The process of application is absolutely free of charge. ",
            "date": "Answered November 2, 2017",
            "views": "22",
            "upvotes": " View 26 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ranjit Kumar Bisoi",
                    "user_href": "/profile/Ranjit-Kumar-Bisoi"
                },
                {
                    "user_id": "Archana Vijay",
                    "user_href": "/profile/Archana-Vijay-27"
                },
                {
                    "user_id": "Karunakar Kammari",
                    "user_href": "/profile/Karunakar-Kammari-1"
                },
                {
                    "user_id": "Vinod Kumar",
                    "user_href": "/profile/Vinod-Kumar-8308"
                },
                {
                    "user_id": "Aditya Varma",
                    "user_href": "/profile/Aditya-Varma-150"
                },
                {
                    "user_id": "Vaishali Bajanya",
                    "user_href": "/profile/Vaishali-Bajanya"
                },
                {
                    "user_id": "Sankari Arun",
                    "user_href": "/profile/Sankari-Arun-1"
                },
                {
                    "user_id": "Abhigyan Sahu",
                    "user_href": "/profile/Abhigyan-Sahu"
                },
                {
                    "user_id": "Govardhan Golla",
                    "user_href": "/profile/Govardhan-Golla"
                },
                {
                    "user_id": "Nitesh Sharma",
                    "user_href": "/profile/Nitesh-Sharma-328"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shekhar Singh Rathore",
                "href": "/profile/Shekhar-Singh-Rathore-3"
            },
            "answer_text": "The procedure for admission in 1st class is. In february form will out and anybody can fill up the form and then after sometime the school in which you filled up the form they display merit according to category like- Central government serviceState government servicePrivate job andBusinessThen if your child name is in merit they verify your documents and after that they take small interview of your daughter/son in which some normal question will be asked like for example- What is your name?What is your father name?Ask color by showing them that which color is this?Then showing them square, triangle or circle. Ask which shape is this? etc.And for 2nd class to 10th there are exams taken by authorities in which basic question asked according to for which class you are giving exam. Thank you. ",
            "date": "Answered March 4, 2017",
            "views": "376",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ranjit Kumar Bisoi",
                    "user_href": "/profile/Ranjit-Kumar-Bisoi"
                },
                {
                    "user_id": "Sampath Kumar S",
                    "user_href": "/profile/Sampath-Kumar-S-6"
                },
                {
                    "user_id": "Saurabh Kumar Sahoo",
                    "user_href": "/profile/Saurabh-Kumar-Sahoo"
                },
                {
                    "user_id": "Dinesh Babu G (Training)",
                    "user_href": "/profile/Dinesh-Babu-G-Training"
                },
                {
                    "user_id": "Abhigyan Sahu",
                    "user_href": "/profile/Abhigyan-Sahu"
                },
                {
                    "user_id": "Mrityunjay Shukla",
                    "user_href": "/profile/Mrityunjay-Shukla-20"
                },
                {
                    "user_id": "Raj Funny Studio",
                    "user_href": "/profile/Raj-Funny-Studio"
                },
                {
                    "user_id": "Siddharth Ghosh",
                    "user_href": "/profile/Siddharth-Ghosh-47"
                },
                {
                    "user_id": "Shib Kumar Saraf",
                    "user_href": "/profile/Shib-Kumar-Saraf"
                },
                {
                    "user_id": "Zeba Ansari",
                    "user_href": "/profile/Zeba-Ansari-44"
                }
            ]
        }
    ]
}