{
    "title": "What 4-year college degree earns the most? - Quora",
    "tags": [
        "Academic Degrees",
        "The College and University Experience",
        "Salaries and Wages",
        "Wanting and Making Money",
        "Higher Education",
        "Money",
        "College Advice",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Moe",
                "href": "/profile/David-Moe-9"
            },
            "answer_text": "Petroleum Engineering pays the best, averaging $136,000 for graduates. The #2 degree is Pharmaceutical Science, but all of the rest of the top 10 degrees are Engineering degrees. My own top degree, Computer Science ranked #11. Realistically, the careers that pay the best require STEM majors (Science, Technology, Engineering, and Mathematics). However, engineering degrees will put you into the top ranks of salary earners. I was kind of down in the second tier. Not only do STEM majors have the highest salaries, but they also enjoy the largest wage growth over their careers. If you want to not make much money in your life, get a Liberal Arts degree. You will find that plumbers and welders make more than you do. I remember someone saying that his secretary has a Masters degree in English Literature, and he felt she should make more money because of her education. I pointed out you get paid for making money for the company, not for being able to criticize Shakespeare's plays. Typing and filing doesn’t make that much money for the company, producing more oil does. ",
            "date": "Answered January 2, 2020",
            "views": "938",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christopher Brown",
                    "user_href": "/profile/Christopher-Brown-355"
                },
                {
                    "user_id": "Jaron Frost",
                    "user_href": "/profile/Jaron-Frost-1"
                },
                {
                    "user_id": "Jenish Patel",
                    "user_href": "/profile/Jenish-Patel-264"
                },
                {
                    "user_id": "Aaron Edward Morris",
                    "user_href": "/profile/Aaron-Edward-Morris"
                },
                {
                    "user_id": "Peter Gel",
                    "user_href": "/profile/Peter-Gel-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marvin Giang",
                "href": "/profile/Marvin-Giang"
            },
            "answer_text": "It seems math/economics/engineering/comp sci/finance are the best. These degrees lead to great paying jobs and will equip you with the skills that employers seek. Avoid physics/chem/bio if you seek money. Studying the arts sadly is just not a good investment. Remember that you will be studying this stuff strenuously for 4 years so pick something that you will find interesting!!! If you don’t it may be challenging to motivate yourself ",
            "date": "Answered January 2, 2020",
            "views": "139",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaron Edward Morris",
                    "user_href": "/profile/Aaron-Edward-Morris"
                },
                {
                    "user_id": "Ashley Needles",
                    "user_href": "/profile/Ashley-Needles"
                }
            ]
        }
    ]
}