{
    "title": "What are great examples of virtual reality in education? - Quora",
    "tags": [
        "Virtual Reality (VR)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Fyodorov",
                "href": "/profile/Alex-Fyodorov"
            },
            "answer_text": "Augmented reality is exactly what the name implies — a medium through which the known world fuses with current technology to create a uniquely blended interactive experience. While still more or less a nascent entity in the frequently Luddite education industry, more and more teachers, researchers, and developers contribute their ideas and inventions towards the cause of more interactive learning environments. Many of these result in some of the most creative, engaging experiences imaginable, and as adherence grows, so too will students of all ages. Second Life:Because it involves a Stephenson-esque reality where anything can happen, Second Life proved an incredibly valuable tool for educators hoping to reach a broad audience — or offering even more ways to learn for their own bands of students. Listing the numerous ways in which they utilized the virtual world means an entire article on its own, but a quick search will dredge up the online classes, demonstrations, discussions, lectures, presentations, debates, and other educational benefits.Augmented Reality Development Lab:Affiliated with such itty-bitty, insignificant companies as Google, Microsoft, and Logitech, the Augmented Reality Development Lab run by Digital Tech Frontier seeks to draw up projects that entertain as well as educate. The very core goal of the ARDL — which classrooms can purchase in kits at various price levels — involves creating interactive, three-dimensional objects for studying purposes.Reliving the Revolution:Karen Schrier harnessed GPS and Pocket PCs to bring the Battle of Lexington to her students through the Reliving the Revolution game, an AR experiment exploring some of the mysteries still shrouding the event — like who shot first! Players assume different historical roles and walk through everything on a real-life map of the Massachusetts city.PhysicsPlayground:One of the many, many engines behind PC games received a second life as an engaging strategy for illustrating the intricate ins and outs of physics, in a project known as PhysicsPlayground. It offers up an immersive, three-dimensional environment for experimenting, offering up a safer, more diverse space to better understand how the universe drives itself.MITAR Games:Developed by MIT’s Teacher Education Program and The Education Arcade, MITAR Games blend real-life locations with virtual individuals and scenarios for an educational experience that research proves entirely valid. Environmental Detectives, its first offering, sends users off on a mystery to discover the source of a devastating toxic spill.New Horizon:Some Japanese students and adults learning and reviewing English lessons enjoy the first generation of augmented reality textbooks, courtesy of publisher Tokyo Shoseki, for the New Horizon class. As a smartphone app, it takes advantage of built-in cameras to present animated character conversations when aligned with certain sections of pages.\\5 ways virtual reality will change education Virtual Reality and Gamification, Biggest Trends in EdTech ",
            "date": "Answered March 1, 2017",
            "views": "953",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alvi Syahrin",
                "href": "/profile/Alvi-Syahrin-2"
            },
            "answer_text": "It actually depends on the subject you teach I’ll give you three great examples of virtual reality in education: 1. English Class Let say, today’s class is about creative writing, such as poems or short stories. We’ve learned all the technical things at school, but one thing we never learn is about how to get the inspiration, how to “feel” our story. Virtual reality will help us to get out of our seats at school without leaving our class. You can use Google Cardboard to show your students beautiful scenery, such as. When they take off the Google Cardboard, they’ll get a new experience, and a new experience leads to a new ideas. So, there goes they’re writing their best. :) This could be a great source if your students need some inspiration. 2. Science Class YouTube is a charm. You can find a lot of 360 videos related to Science Class. You can enter a human’s body and learn how it’s going on, watch a total eclipse (remember when we use balls and flashlight to do this in our class?), floating in space and visiting planets. 3. History Class Write “Pyramid 360” on YouTube, and you can finally visit Pyramid with Google Cardboard. Or, if you want to teach about the history of the States, you can simply write “Name+of+a+City 360” on YouTube. Though it doesn’t show the old version of the city, well, that’s the task of a teacher to explain something like, “Could you please turn around? Do you see the bookstore? It was actually…. where a war began… bla, bla, bla.” For more great examples, read it here. This answer was inspired from that post. PS: All the examples above work with Android and iPhone. ",
            "date": "Answered July 25, 2016",
            "views": "743",
            "upvotes": "0"
        }
    ]
}