{
    "title": "What colleges or universities are you applying for 2020? - Quora",
    "tags": [
        "2020 (year)",
        "Colleges and Universities",
        "College and University Admissions"
    ],
    "response": [
        {
            "author_info": {
                "name": "K. Chandan",
                "href": "/profile/K-Chandan-2"
            },
            "answer_text": "This is the college that i am going to attend in 2020. IISc Bangalore also known as ‘Tata Institute’ locally was established in 1909 and is India’s leading institution of advanced education and research in the sciences and in engineering.  I have been offered an admission in the department of Materials Engineering through COAP this year. I look forward to an exciting period of 2 years at IISc. ",
            "date": "Updated August 6, 2020",
            "views": "189",
            "upvotes": " View 149 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ayush Sarma",
                    "user_href": "/profile/Ayush-Sarma-1"
                },
                {
                    "user_id": "Shashi Bhushan",
                    "user_href": "/profile/Shashi-Bhushan-208"
                },
                {
                    "user_id": "Rakshith Kumar",
                    "user_href": "/profile/Rakshith-Kumar-50"
                },
                {
                    "user_id": "Arkaprovo Acharya",
                    "user_href": "/profile/Arkaprovo-Acharya"
                },
                {
                    "user_id": "Arundhati Joshi",
                    "user_href": "/profile/Arundhati-Joshi-3"
                },
                {
                    "user_id": "Deepanshu Chaudhry",
                    "user_href": "/profile/Deepanshu-Chaudhry"
                },
                {
                    "user_id": "Ankit Verma (अंकित वर्मा)",
                    "user_href": "/profile/Ankit-Verma-अंकित-वर्मा"
                },
                {
                    "user_id": "Shaista Afrin",
                    "user_href": "/profile/Shaista-Afrin-3"
                },
                {
                    "user_id": "Gaurav Singh",
                    "user_href": "/profile/Gaurav-Singh-790"
                },
                {
                    "user_id": "Rajeeb Behura",
                    "user_href": "/profile/Rajeeb-Behura"
                }
            ]
        },
        {
            "author_info": {
                "name": "Preetam Sahoo",
                "href": "/profile/Preetam-Sahoo-9"
            },
            "answer_text": "Undoubtedly go for ‘CV RAMAN GLOBAL UNIVERSITY' Placements: The placements are well-enough for the students to get the good profile and good package. The decent placements are offering to the students. The companies like Infosys, IBM, Tech Mahindra, Wipro, etc., are visiting the campus for the computer science engineering department. The package offered is good as per the placement provided. Infrastructure: The infrastructure is world-class for the education with all the facilities like library, computer labs, Wi-Fi, cafeteria, sports complex, gymnastics, gymanasium are provided by the college to the students to make them enable. The infrastructure is useful to the students. Faculty: The faculty is fully experienced and are more focused on the practical experience of the industry interface, so they focus more on the practical part rather than the theory part. Mostly, the professors are more practical than the theory is concerned. The main aim is to make the candidate ready for the ",
            "date": "Answered July 17, 2020",
            "views": "128",
            "upvotes": "0"
        }
    ]
}