{
    "title": "What are the similarities between public policy and development studies? - Quora",
    "tags": [
        "Development Studies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sapna Ullal",
                "href": "/profile/Sapna-Ullal"
            },
            "answer_text": "Similarities: Both are focused on solving Economic and Social problems.They are both interdisciplinary and include insights from a wide range of fields like Sociology, Politics, Economics, Gender Studies, Biology, Management and History.They both focus more on how to increase social good than on how to increase profit. If profitable businesses increase social and economic good, they too form an object of study.But there are many differences too: While both prepare you for a government or non-profit career, study of Public Policy will prepare you better for a Government job while Development Studies is more likely to lead to Program Management jobs in NGOs.At some places, especially in the UK, Development Studies is a more theoretical discipline that leads to a PhD and academic roles while some Public Policy degrees include practical training like Data Analysis, Budgeting and Management.The study of Public Policy can be applied to any country, developed or developing whereas Development Studies is obviously more applicable to Developing countries.",
            "date": "Answered April 20, 2018",
            "views": "3",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anubhuti Sharma",
                    "user_href": "/profile/Anubhuti-Sharma-1"
                },
                {
                    "user_id": "Nina Karina",
                    "user_href": "/profile/Nina-Karina-3"
                },
                {
                    "user_id": "Gabrielle Gean",
                    "user_href": "/profile/Gabrielle-Gean"
                },
                {
                    "user_id": "Queena Chen",
                    "user_href": "/profile/Queena-Chen-7"
                },
                {
                    "user_id": "Atisha Banjare",
                    "user_href": "/profile/Atisha-Banjare"
                },
                {
                    "user_id": "Shoaib Shaikh",
                    "user_href": "/profile/Shoaib-Shaikh-53"
                },
                {
                    "user_id": "Priyadharshini R",
                    "user_href": "/profile/Priyadharshini-R-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Surendra Swami",
                "href": "/profile/Surendra-Swami-5"
            },
            "answer_text": "Societies elect their government to ease life of living. The govt therefore frame policies, programme and projects which fulfill gaps in the direction of making living comfortable. These cover virtually all aspects which affect society and it's constituents. Be it social security, health, education, infrastructure, power, defence, foreign policy, civic amenities and like. The study of public policy covers framing of policies, effective implementation, outcome and the gaps. Comparative study of various public policies followed by different govts is also an essential part. Since development of support systems is part of public policy and public administration, the developmental studies are essentially covered under it. However, specific study of evolution of different models and success or failure stories form core of developmental studies. The study is more on practical aspects than theoretical aspects. ",
            "date": "Answered February 12, 2018",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Omollo",
                    "user_href": "/profile/Michael-Omollo-2"
                }
            ]
        }
    ]
}