{
    "title": "What are the subjects in a BSc course? - Quora",
    "tags": [
        "Bachelor of Science Degrees"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sujeet Kumar",
                "href": "/profile/Sujeet-Kumar-1299"
            },
            "answer_text": "There are many subjects to choose in a bsc but it totally depends on some one interest.Only the course is not important but it is also equally important from where you are pursuing that course.Bsc course is more fruitful when it also include Theory as well as regular practicals in that subject which helps us to understand the subject in more broader way. Generally there are two types of Bsc course one is normal Bsc course and other is professional degree course. 1.Normal Bsc course:This course is mainly for those student who want to go for higher education like Msc and phd or mainly want to go in the field of academics.This course includes following subject:- Bsc(physics) Bsc(Chemistry) Bsc(Math) Bsc(botany) Bsc(zoology) Bsc(statistics) Bsc IT 2.professional bsc course:-These course are mainly job oriented and prepares for the industry.This course includes following subjects:- Bsc(agriculture) Bsc(animation) Bsc(information technology) Bsc(biotechnology) Bsc(Bio chemistry) Bsc( nursing) Bsc(forestry) Bsc( nutritional science) Bsc(Mass and media) Bsc(hotel and hospitality) Bsc(nautical science) Bsc( food technology) Bsc ( forensic science) Bsc(genetics) Bsc ( micro biology) Bsc (electronics) You can choose any of the subject according to your interest in Bsc. Moreover its more important that from which college or university you are pursuing that course.Its better to choose a good college with good lab facility and industrial exposure.But lastly passion matters. Hope it will help Thanks for reading. ",
            "date": "Updated May 26, 2019",
            "views": "707",
            "upvotes": " View 57 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Soma Dhole",
                    "user_href": "/profile/Soma-Dhole-1"
                },
                {
                    "user_id": "Elizabeth Elizabeth",
                    "user_href": "/profile/Elizabeth-Elizabeth-298"
                },
                {
                    "user_id": "Sourav Pathania",
                    "user_href": "/profile/Sourav-Pathania-21"
                },
                {
                    "user_id": "Diva Kumari",
                    "user_href": "/profile/Diva-Kumari-1"
                },
                {
                    "user_id": "Ayush",
                    "user_href": "/profile/Ayush-927"
                },
                {
                    "user_id": "Anshuman Singh",
                    "user_href": "/profile/Anshuman-Singh-1300"
                },
                {
                    "user_id": "Piyush Kumar",
                    "user_href": "/profile/Piyush-Kumar-508"
                },
                {
                    "user_id": "Unbox Anything",
                    "user_href": "/profile/Unbox-Anything-1"
                },
                {
                    "user_id": "Swati Mk",
                    "user_href": "/profile/Swati-Mk"
                },
                {
                    "user_id": "Sangeeta Nikhade",
                    "user_href": "/profile/Sangeeta-Nikhade-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manoj Rajapurkar .",
                "href": "/profile/Manoj-Rajapurkar"
            },
            "answer_text": "Hey good morning sorry for late answer ..Was busy with routines. Next time when you ask such questions don't forget to give your interests and something in brief about you as it helps to understand and answer. I am giving you the general aspect how to choose the subject /subjects for Bsc without considering the percentage & marks. First foremost understand that now you are stepping into the most important aspect of your life which is an foundation of your career …if you are not comfortable with science subjects i would say to analyse yourself and switch on to the degree which you can excel ..I apologize to say this but it's needed because Bsc is not as what you had the subjects till 12th and only Bsc is also not that economic output degree by this i mean once you step in Bsc then make yourself sure what I next after Bsc because you can't stop with graduation, stopping with Bsc won't fetch that financial stability . So here comes the matter of firm decision . As per your next option after Bsc you choose /plan as of now….ofcourse it may vary after 3yrs but hope you do what you have planned for…firm planning, strategic steps to achieve your aim is very important ..this is the perfect time of your life to create your stable basic foundation for golden tomorrow …if you are planning for any comp.exams then look to those subjects and your interests than the subjects which you have in the college or university where you are planning for Bsc .. choose the subjects which are of your interest, which has scope for masters and equally financial stability . When person speaks Bsc the first top combination subjects are PCM - Physics Chemistry Mathematics or CBZ- Chemistry Botany Zoology … this are most opt branches but today the world is not what it was in 90’s thus if you have firm focused goals as that of one particular subject and you are sure to make career in it than choose the odd combination such as CGCS- Chemistry Geology computer Science ,PGM - Physics Geology Mathematics, CZCS- Chemistry Zoology Computer Science…these are said odd combination because they are mixture of branches and students who are firm with one subject oriented choose this for eg the students who has interest in Geology particularly they opt for CGCS- as this process them to wide scope of Geology with boasting knowledge of Chemistry and technical aspects of computer science in future after Bsc .. Similarly other as stated above. So it's you who know better about yourself thus sit calmly and this what you want to do in your life then step towards Achieving your desired Aspirations not just a degree to land in unknown island with question mark on forehead what after Bsc and all. U will meet hundreds of people who may tell their interested subjects direct or indirectly to opt but I suggest you stay far from them and you choose your own focusing above written aspects as it's your life ,your career and only you are answerable to your making or breaking your life. Note - No assumption of attitude that lets see after Bsc what to do and all ,this attitude ruins the life as hell . All the best tc Manoj Rajapurkar . ",
            "date": "Answered September 28, 2017",
            "views": "193",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Soma Dhole",
                    "user_href": "/profile/Soma-Dhole-1"
                },
                {
                    "user_id": "Sunil Mandal",
                    "user_href": "/profile/Sunil-Mandal-32"
                },
                {
                    "user_id": "Rakesh Singh",
                    "user_href": "/profile/Rakesh-Singh-5825"
                },
                {
                    "user_id": "Satish Kumar",
                    "user_href": "/profile/Satish-Kumar-4436"
                },
                {
                    "user_id": "Khushbu Takodara",
                    "user_href": "/profile/Khushbu-Takodara-1"
                },
                {
                    "user_id": "Naroda Maheshwari",
                    "user_href": "/profile/Naroda-Maheshwari"
                },
                {
                    "user_id": "Amulya Arora",
                    "user_href": "/profile/Amulya-Arora-8"
                },
                {
                    "user_id": "Daniel Chettiar",
                    "user_href": "/profile/Daniel-Chettiar-3"
                },
                {
                    "user_id": "Ankit Yadav",
                    "user_href": "/profile/Ankit-Yadav-1427"
                },
                {
                    "user_id": "Marguerite Macdonald",
                    "user_href": "/profile/Marguerite-Macdonald-1"
                }
            ]
        }
    ]
}