{
    "title": "What are the disadvantages of free higher education? - Quora",
    "tags": [
        "Educational Systems",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas B Walsh",
                "href": "/profile/Thomas-B-Walsh"
            },
            "answer_text": " We have a presidential election coming up. The Democrats have more than twenty candidates vying for the privilege to be their party’s nominee. Since everyone loves Santa Claus, a popular tactic of the left is FREE STUFF. Most of the candidates are proposing, at a minimum, free tuition at public colleges and universities. What could possibly go wrong? Underemployment Today college grads are a dime-a-dozen. Every year around 1,900,000 shiny new bachelor’s degrees are conferred. These proud graduates find themselves in a fierce competition for a limited number of well-paying, professional jobs. About 1,100,000 are successful in “scoring” one of these jobs. The rest end up making lattes. I’m just going to make a wild guess. Let’s say making college free results in 200,000 more college graduates every year. Duh! There are still only about 1,100,000 suitable jobs. The Deterioration of a College Education Over the last sixty years there has been a steady deterioration in the quality of a college degree. I suggest you read Academically Adrift for the details. One of the major contributing factors is the decline in the academic ability of the average college freshman. In the US almost anybody, whose parents have a checkbook, can find a college that will accept them. Only seven percent of colleges and universities are selective to any great extent, i.e. an acceptance rate of less than 50%. I don’t have a breakdown between public and private, but you only have to skim down the list of the best public college and universities to #24. The acceptance rate is SEVENTY PERCENT. https://www.usnews.com/best-colleges/rankings/national-universities/top-public Sixty years ago only 7% went on to college. They tended to be the academically elite. The unwritten rule of thumb was the top 10%—an IQ of 120. Imagine you are teaching that class. Today every Tom, Dick, and Harriet (45%) goes to college.  Look over your right shoulder. That guy behind you in English 101 thinks Catcher in the Rye is a book about baseball. Now, imagine teaching that class. Opening up college to everyone is just going to exacerbate the deterioration of the quality of a college education. Every year twenty-five percent of the freshman class needs one or more remedial classes. What’s that number going to be when college is free. Closing of Many Private Colleges and Universities Many of our best schools are private. This sector competes with the public schools, largely based, on a tenuous “prestige” factor. When option A charges $30,000 a year for tuition, but option B is free tuition, hundreds of private colleges and universities will have to close. I’m not a big fan of paying for prestige, but the closure of these schools is not a good thing. Conclusion Repeat after me, “College is NOT for everyone.” “Free” college for all is a spectacularly bad idea. Thomas B Walsh's answer to What can be done to make college admissions in US purely merit based? Notes Thomas B Walsh's answer to Is Charles Murray correct that too many people are going to college? Thomas B Walsh's answer to How many people with college degrees are underemployed? ",
            "date": "Updated July 25, 2019",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ohemeng Michael",
                    "user_href": "/profile/Ohemeng-Michael"
                },
                {
                    "user_id": "Matthew Park Moore",
                    "user_href": "/profile/Matthew-Park-Moore"
                },
                {
                    "user_id": "Jerry Jacques",
                    "user_href": "/profile/Jerry-Jacques"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kupferman Judy",
                "href": "/profile/Kupferman-Judy"
            },
            "answer_text": "This can’t be answered in general. One question is: disadvantages for whom? If you can’t afford higher education at all, obviously it’s better to have it for free than not to have it. Conversely some people don’t work as hard when it’s free, and would work harder if they knew it was costing them (or their parents) thousands of dollars a year. So the question is: are you talking about people who could afford it if it weren’t free, or about people who couldn’t afford it at all? In some situations free higher education might mean the institution can’t afford expensive equipment (necessary for laboratory sciences for instance), while a university that’s expensive might be privately funded and wealthier. As for disadvantages of free higher education at a university with a sufficient public subsidy and private funds? Can’t think of any. ",
            "date": "Answered July 17, 2019",
            "views": "271",
            "upvotes": "0"
        }
    ]
}