{
    "title": "What could be long term effects of COVID-19 on the environment? - Editorial Shots for UPSC - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Srinidhi Reddy",
                "href": "/profile/Srinidhi-Reddy-47"
            },
            "answer_text": "The primary challenge of the government these days has been to tackle the problems like absence of equitable access to food, healthcare and housing while there is a major global problem that needs to be attended – the sacrifice of environmental resilience.This bigger issue remains uncovered even so the government is not accounting the long-term vulnerabilities and is considering multiple industrial, mining and infrastructure proposals in critical wildlife habitats, and life and livelihood-sustaining forests. This expansion of human settlements is a threat to the biodiversity. The Ministry of Environment, Forest and Climate Change (MoEFCC) has approved many projects in contravention of environmental laws, and without all necessary documents or site inspections and just based on video conference proposal. They also made it legal to start any project without obtaining environmental approvals, even for a class of projects they are allowed clearance without putting out any information public.These kind of actions are further degrading the environment of India. The priority of seamless growth over environment is going to create an impact on the future of the nation and create socio-economic shocks.",
            "date": "July 9, 2020",
            "views": "118",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "GARMIN EXPRESSER",
                    "user_href": "/profile/GARMIN-EXPRESSER"
                },
                {
                    "user_id": "Shruti Shukla",
                    "user_href": "/profile/Shruti-Shukla-175"
                },
                {
                    "user_id": "Apoorva Paliwal",
                    "user_href": "/profile/Apoorva-Paliwal"
                },
                {
                    "user_id": "Shunyay",
                    "user_href": "/profile/Shunyay"
                }
            ]
        }
    ]
}