{
    "title": "What does it feel like to be in 8th grade? - Quora",
    "tags": [
        "8th Grade",
        "Middle School Education",
        "The High School Experience",
        "Students"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jaelynn Parker",
                "href": "/profile/Jaelynn-Parker"
            },
            "answer_text": "Oh god, 8th grade… That was one hell of a year. It was the worst and best part of middle school. For my school 8th grade was the grade all the teachers hated. The grade sevens were still docile elementary kids and the grade nines were pretty mature. With grade eight, teacher's pets no longer existed. I was a horrible suck up through out grade seven, but when grade 8 rolled around I was just plain horrible. I just didn't care about being good or smart, I didn't care one bit. So I started being as awful as I possibly could without getting in huge trouble. Everyone started being bad kids, even my sweet, angelic friends. Now before I said it was also one of the best years of my life and right mow this doesn't sound to awesome, right? It was an amazing year, though, because it was fun. It's fun being a bad student, like really, really fun. It's fun getting revenge on the teachers you hate and the kids you despise. Once it's all over, the next year comes around and you can change completely. You can keep being bad, or you can become a lovely teacher's pet. Grade 8 is a trial year, not very important stuff to learn in class, but a year to have fun. ",
            "date": "Answered April 17, 2018",
            "views": "19",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael David Terrell",
                    "user_href": "/profile/Michael-David-Terrell"
                },
                {
                    "user_id": "Niharika Singh",
                    "user_href": "/profile/Niharika-Singh-265"
                },
                {
                    "user_id": "Clara Jones",
                    "user_href": "/profile/Clara-Jones-117"
                },
                {
                    "user_id": "Brandon Washington",
                    "user_href": "/profile/Brandon-Washington-85"
                },
                {
                    "user_id": "Aman Safeer",
                    "user_href": "/profile/Aman-Safeer-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Molly-Junior-1"
                },
                {
                    "user_id": "Natalie Kay",
                    "user_href": "/profile/Natalie-Kay-79"
                },
                {
                    "user_id": "Zaria J",
                    "user_href": "/profile/Zaria-J-1"
                },
                {
                    "user_id": "Niah Wilson",
                    "user_href": "/profile/Niah-Wilson-4"
                },
                {
                    "user_id": "Adaeze Nwogu",
                    "user_href": "/profile/Adaeze-Nwogu"
                }
            ]
        }
    ]
}