{
    "title": "What are the advantages and disadvantages of online studies during knockdown? - Quora",
    "tags": [
        "Online Study",
        "Pros and Cons",
        "Online Training"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vanshika Banerjee",
                "href": "/profile/Vanshika-Banerjee"
            },
            "answer_text": "Hello friends! Here are a few advantages of online studies: Online studies offer flexibility to access the course from anywhere at any time.Online studies are convenient as compared to offline courses.More individual attention is offered in online studies.You can get a chance to meet interesting people online via online courses.These classes offer real-world skills and knowledge.Lifelong learning is promoted via online classes.Online courses and studies are budget-friendly compared to offline courses.You can connect to people globally via online studies.Here are a few disadvantages of online studies: Online studies are more time consuming than offline studies.Online studies require proper time management.Online studies require the learner to be more active in nature.Online courses make it easier to procrastinate.Online studies at times create a sense of isolation.Online courses require you to be an active learner.Many online courses require you to be responsible for your own learning.I hope this helps! ",
            "date": "Answered June 30, 2020",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Utkarsh Khandelwal",
                "href": "/profile/Utkarsh-Khandelwal-79"
            },
            "answer_text": "I’ll start with the advantages of online studies first : A lot of time and energy is saved which was earlier wasted in commuting. This gives you more time to study and makes you more efficient.You can study at your own pace. There’s no rush and this helps you to grasp the content properly.You can learn more in a limited time.You have the privilege to choose any online course you like and complete it on your own terms.With emerging learning management system softwares (LMS), submitting assignments and conducting tests is hassle-free. As every coin has two sides, so does online studies. The disadvantages are : Not everyone has access to electronic devices and internet connection.Studying for longer hours online can strain eyes and affect health.While studying online, you may get distracted and waste time.Doubts are difficult to clear and may take time.",
            "date": "Answered June 29, 2020",
            "views": "47",
            "upvotes": "0"
        }
    ]
}