{
    "title": "What opportunities do I have after completing my MCom? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Rajiv Kumar",
                "href": "/profile/Rajiv-Kumar-1491"
            },
            "answer_text": "Master of Commerce or M Com is a postgraduate Master Degree which specializes in commerce, accounting, management and economics related subjects. just like the Bachelor of Commerce.The program is generally focused on different disciplines like accounting, actuarial science, business management, corporate governance, human resource management, economics, statistics, finance, marketing or supply chain management. In M Com, students are given a choice to major in any of the given specializations. Students who wants to go for further studies or courses like in research or doctorate level can get a bonus with this course.Many Companies and organizations in today’s life are looking for specialized and expert marketers to get higher profit in a smarter way. Here are some Courses in marketing that you can pursue to start a career in marketing. Other sectors where a M Com graduate can seek jobs include: AuditingBanking and financeElectronic marketingFunds managementManagement consultingStock BrokingIn addition to this, students of M Com can even apply for jobs within the Govt. sector. UPSC is a major recruiter of M Com students, providing a good post and package.With the use of latest technology business are expanding globally. The requirement of highly qualified & trained professionals is growing day by day . In today life, there are many companies & organizations those are looking for specialized & expert marketers to get higher profit in a smart way.There are lots of job opportunities in Private & Public sector. You can also apply for government sector jobs. You can also work in the corporate world.You can work as a teacher/lecturer in different colleges & universities. You have to clear the requisite exams such as UGC NET/JRF, etc.You can also join government & private banks such as State Bank of India (SBI), Punjab National Bank (PNB), Axis Bank, HDFC Bank, Union Bank of India etc as Customer Relationship Executive & Probationary Officer. institutions that offer these courses are:- Sri Ram College of Commerce(SRCC) - Delhi Lady Shriram College for Women (LSR) – Delhi Lovely Professional University, Jalandhar Hansraj College - Delhi Loyola College - Chennai ",
            "date": "Answered June 8, 2018",
            "views": "17",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ram Soni",
                    "user_href": "/profile/Ram-Soni-50"
                },
                {
                    "user_id": "Yogita Malviya",
                    "user_href": "/profile/Yogita-Malviya-2"
                },
                {
                    "user_id": "Vivek Krishna",
                    "user_href": "/profile/Vivek-Krishna-67"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aviva Friedman",
                "href": "/profile/Aviva-Friedman-1"
            },
            "answer_text": "This title is only a \"door opening\" it does not give a specific profession, so it is important to answer a the following questions . In fact, this are excellent questions you had to ask yourself before starting studying your degree. In any case, it is time to do three major actions: A. Find out what your true passions, dreams, desires are about the world of work; Do not give up, do not fear from people's negative advice nor from your downgrade thoughts . If you do not act according to your real passion you will not be able to pave your career path. So it's time to ask, what do you like, dream about your occupational life? What was in your mind when you decided to attend studying? 1. How can I be an excellent in my work? 2. In what fields of performance do people tell me that I am excellent and I feel that I am truly performing well? 3. When I look forward and imagine my life, how do I see the employment aspect in my life? 4. Am I depressing or preventing myself from thinking about an occupation that pleasantly excites me because I want to be practical? 5. What is the environment in which I want to work? B. Curriculum Vitae It is important that you prepare a curriculum vitae that includes practical experience if you have a clear specification of what you initiated, what you changed, and whether you can add quantitative measures to your business. Your studies in the degree are also considered, and every project you did, except what is new, what is its contribution, what you brought to efficiency and improvement. It is important. For example: Introduced a new way to reduce supply time in 20% by developing a new policy. Handled the 50% workload increase (YoY) by outsourcing processes while retaining ROI Imported 500 daily items and $20 M worth of goods… Do not describe your jobs definition’ describe your contributions. C. Create a networking system of relationships through social networks and direct employment directly to the list of companies you want to work in them. If these guidelines are too general, consult an employment counselor who understands the language of the modern business world. ",
            "date": "Answered August 3, 2018",
            "views": "11",
            "upvotes": "0"
        }
    ]
}