{
    "title": "What are some roles of a good teacher? - Quora",
    "tags": [
        "Teaching in Schools",
        "School Teachers",
        "Elementary School and Elementary Schools",
        "Teachers",
        "Teaching",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Britney Vu",
                "href": "/profile/Britney-Vu-6"
            },
            "answer_text": "Here are my expectations as a student towards to some or most teachers: I highly expect teachers to know what they're teaching. If they do not know what they are teaching to students, then why are you even teaching that particular subject.I expect my teachers to be passionate about what they're teaching. I know not every teacher is passionate about what they are teaching but the best teachers are the ones who are passionate about their profession and will help a student succeed.I expect teachers to be less bias and favour all students, and not that one particular special stand-out students. I know some teachers favour some students but the reason why I said that teachers should be less bias is that it can cause a hell level of jealousy, but also some students might hate that teacher for giving marks on that particular student.I expect teachers to be interactive and bubbly. This expectation may vary among students but I hate monotone teachers. They make the class like its a lecture that you’re most likely to fall asleep and won’t learn much. If teachers are very interactive and fun-like, they can at least entertain the class. As a Psychology teacher once told my class, students learn their best when they are awake, motivated, interactive, and feeling inspired.I expect teachers to grade fairly, and reasonably. Now I hate to brag, but there are some teachers who mark very harshly and don’t give a reason why they mark it that way. Ugh. If you’re a teacher grading a student’s work, make sure you politely give them a reason why they got the answer wrong and explain to them the right answer.I expect teachers to respect every student as diligent, intelligent scholar students. Not as immature babies. Every student should be respected as keen smart students and not in a low-class way.I expect teachers to not roast or mock a student. Teachers, you are wise adults and not us students. Stop trying to roast your students in front of the entire class. You know that roasting students can build a schema of you and they will remember you as “that teacher who make fun of me.” Who knows, maybe one day you will need to see them at the Doctor’s Clinic.I expect teachers to teach what is right, and not what is wrong. I know most teachers have to follow the curriculum of the school but if you have a degree in education and you’re teaching notes from Wikipedia, then you should re-read the textbooks that are assigned to your students and project what is right.I expect teachers to be patient. Similar answer to teaching by passion, as a student, teachers are expected to be patient towards their students since they are interacting with students of all kinds of mentality and disability. Some students are slow, some have Autism, some are inclined to act impatient, some are narcissistic. Brief, teachers are bombarded with every type of student and should be patient with one and another. As they say, treat students on how you want to be treated.I expect teachers to be organized and have discipline on themselves and the class. Teachers need to have some sort of organization and control. If they failed to do that, then they cannot succeed in a class with un-organized class and control.I expect teachers to teach different ways, like Visual, Auditory, Tactile, Olfactory (maybe?) and taste (maybe?). Every student learns class materials differently. We all have different ways we learn and acquire knowledge, just as you too. So please, when you are teaching, do not choose one particular method to teach the class, choose a variety of methods.I expect teachers to be open-minded. I had once a teacher who was very biased with their answer about the H&M controversy that my entire class had different opinions and perspective about the issue, that we ended up rebelling against the teacher. The teacher was furious with our answers that he wouldn’t accept our perspectives. Please be open-minded when students want to tell you something.I expect teachers to be cool with their students sometimes, and not too serious like. Many students have different opinions of what kind of teachers they like. I like some teachers who are chill towards their students. They make the class entertaining that they won’t bore you to death.I expect teachers to know everything in the meaning of life, from experiences to college, to advice… basically everything with a meaning. Teachers are not only there at school/college/university to teach, they can also help you out. Us students crave fellowship with teachers since we trust you. We want to learn many things in life. Teachers are the ones who can help us guide to a right path.I expect teachers to be nice, and approachable. We as students want to get to know you and not scared off.I expect teachers to tell their stories, sometimes to the class. We sure love a good storytelling that is off topic from the subject we are learning. When teachers tell us their own stories, we often could relate or connect with them.I expect teachers to admit, they too, have regrettable mistakes like we do. We all have something we regret in life. Its okay teacher if you regret that relationship several years ago, we do too as students regret the same feeling as you too.I expect teachers to give up their time for office hours. Sometimes we’re too shy to ask a teacher questions about our recent assignment or questions from the textbook that we don’t want to ask in front of the class. Sometimes we just want a one-to-one tutoring with the teacher to answer our deepest questions from the class.I expect teachers to sometimes challenge their students. We sure love a challenge!I expect teachers to be lenient with their due dates. Not every student likes to have three tests in one day or they have work and cannot finish their assignment on time. Sometimes we want some leniency from teachers, just sometimes. Not all the time.Lastly, I expect teachers to relate to us, students. Teachers were once students like us. I expect them to know how we feel about this and that just like when they are young. Teachers do similar activities as us, students when they were young. Anyways, teachers are human beings like us students.Hope this helps! My expectation of teachers may vary per person. ",
            "date": "Answered September 14, 2018",
            "views": "845",
            "upvotes": " View 33 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nerisa Javillonar",
                    "user_href": "/profile/Nerisa-Javillonar"
                },
                {
                    "user_id": "Inah Escote",
                    "user_href": "/profile/Inah-Escote"
                },
                {
                    "user_id": "Diana Elizabeth Arreza Catad",
                    "user_href": "/profile/Diana-Elizabeth-Arreza-Catad"
                },
                {
                    "user_id": "K Rivera",
                    "user_href": "/profile/K-Rivera-17"
                },
                {
                    "user_id": "Mae Cacherel Beniga",
                    "user_href": "/profile/Mae-Cacherel-Beniga"
                },
                {
                    "user_id": "Nikki Sanoy",
                    "user_href": "/profile/Nikki-Sanoy"
                },
                {
                    "user_id": "Zen Lascona",
                    "user_href": "/profile/Zen-Lascona"
                },
                {
                    "user_id": "Mohammad Anas Khan",
                    "user_href": "/profile/Mohammad-Anas-Khan-14"
                },
                {
                    "user_id": "Irina Wu",
                    "user_href": "/profile/Irina-Wu-2"
                },
                {
                    "user_id": "Philline Palmares",
                    "user_href": "/profile/Philline-Palmares"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Galvin",
                "href": "/profile/Stephen-Galvin-6"
            },
            "answer_text": "Well, here is a good try. Probably I will not give the whole list, but others are welcome to jump in. We are expected to highly qualified in our particular subject. In my case it is Fine Art. I have a BA in Art. I have a Single Subject K through 12 Art Credential. I also have a BCLAD credential that qualifies me to teach in an English as a Second Language setting and in multi-cultural classroom environments. I have to renew the Single Subject credential every 5 years, supposedly I have to take on-going education. But the reality is much easier. I am expected to serve “in loco parentis,” in the place of the parent at school. That means offer up my life in defense of my students. I am expected to serve as a designated Civil Defense worker and stay at the school so long as an emergency persists. Think the 1994 Northridge Earthquake happening mid day. I live in Simi Valley 19 miles from the epicenter of that quake. That service is under force of law, and I can be charge for abandoning my post if I leave before release. My family will have to fend for itself until I am released. I am required to learn and requalify regularly for CPR, I am expected to know and monitor and protect all of my students classes varying from 25 to 35 students. This includes knowing and dealing with all of their various Individual Education Plans as mandated by Special Ed regs. My classes usually include non or limited English speakers from Asia, Latin America, Eastern Europe and the Middle East. There a lesser form of “IEP<” called a 504 plan which is accomodations demanded by the parent but not mandated by Special Ed designation. Typical Special Ed and 504 challenges usually include students on the Asberger’s Spectrum, a wide range of learning disabilities, emotional challenges, and orthopedic challenges. For 7 years my classes included numerous deaf and DHH students. I learned some American Sign to help me help them. I am expected to swiftly and thoughtfully complete detailed evaluations and observation reports quarterly or twice yearly on each IEP and 504 student. The paper work runs and average of 6 pages single spaced. I am legally responsible to report any instance of child abuse or neglect that I think I am aware of The standard is “suspect abuse.” Failure to notice and report carries criminal penalties. I must report within 48 hours of suspicion. I must also take care to prevent and act to correct any kind of sexual misconduct by children on children. I must give grades to every student for academics, behavior and work habits every 5 weeks. I am expected to use Google Classroom and share access to all grades and projects in progress with both the students and their parents. I am expected to complete prompt responses to every email sent to my account by students and parents. There is more, but this gives a good idea. For this my starting wage with BA , Credentials and bonus pay for an earned MA in Art Education would be about $48,500 per year. The summer break is from early June to early August, about 9 weeks. The work day is supposed to be from 8 to 3, with 35 min for lunch, There are no breaks for bathroom or anything. And it is illegal to leave a classroom of students unattended. The office does try to send coverage if I must have a restroom break, and call to ask for coverage. After 25 years teaching and with the MA and extra post grad college units in upper division work if should earn $89,000 beginning in August 2019. There are now state legislatures trying to ask me to carry and deploy a side arm in my classroom in case of an active shooter. I must do that without hitting any of the kiddies. I am not kidding. This is real. ",
            "date": "Answered May 31, 2019",
            "views": "62",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Glaidyme Talaro",
                    "user_href": "/profile/Glaidyme-Talaro-2"
                }
            ]
        }
    ]
}