{
    "title": "What is it like to be in a women's prison? - Quora",
    "tags": [
        "Women",
        "Prisons and Prison Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "France Smith",
                "href": "/profile/France-Smith-2"
            },
            "answer_text": "What is it like to be in woman's prison. I have been in and out of jail and priosn since I was 17 so 1991 is when I was first arrested and now it 2017 so that's 26 years. The longest time I have ever been sentenced to prison was for for five felony convictions that chmaged my life. I was sentenced on October 24 2001 to 10–17 years in maximum secruity prison For woman, following my sentnceing I arrived at the prison and was adjusted for the new prison. Jumpsuits are a big problem in priosn and many inmates complain about them I am a heavy set female and the jumpsuits never fitted exactly right, when I had to wear a one piece jumpsuit it was a 3x to account for my breasts and butt, in 2009 when the prison switched to t shirts and swaet pants, I was glad because it fitted better and was more appeasing. The colors vary prison by priosn, but we wore orange and white stripes for 7 years, solid organe for two, and the switched to black and white strips. i had a cellmste in priosn that was sentenced to life in prison with the possibility for parole after 40 years, ste killed her husband. We were talking in day and compared are paperwork, she said wow you got of light, I said why and she said You were facing 25 years in prison. my release dates were either December 9 2012 something like that or March 25 2019, I arrived at the prison in 2002 and thats when the sentnce started, was given no credit for time served in jail. I have spent basically the whole 21rst centenary behind bars. I was released on March something 2012 and given 2 years on parole, I violated the parole two weeks later, and was sent to a Montana priosn for woman to serve 2–7 years in prison. I was sent to priosn in 2012 April, and was released December 29 2015, only to be arrested three times between now and then. I spend all of 2016 in jail, a midomener assualt led to a year stay, and a New Years dui led to a 90 day stay, and then a public disturbance led to 10 days. ",
            "date": "Answered March 29, 2017",
            "views": "123",
            "upvotes": " View 34 Upvoters",
            "upvoters": [
                {
                    "user_id": "Staci Burnett",
                    "user_href": "/profile/Staci-Burnett-1"
                },
                {
                    "user_id": "Michelle Torres",
                    "user_href": "/profile/Michelle-Torres-111"
                },
                {
                    "user_id": "Keeley-Jasmine Maxine Cavendish",
                    "user_href": "/profile/Keeley-Jasmine-Maxine-Cavendish"
                },
                {
                    "user_id": "Camryn Vieira",
                    "user_href": "/profile/Camryn-Vieira-1"
                },
                {
                    "user_id": "Jacalyn Trautman",
                    "user_href": "/profile/Jacalyn-Trautman"
                },
                {
                    "user_id": "Robert Grover",
                    "user_href": "/profile/Robert-Grover-20"
                },
                {
                    "user_id": "Vesta Torres",
                    "user_href": "/profile/Vesta-Torres"
                },
                {
                    "user_id": "Antônio Lacerda de Barros",
                    "user_href": "/profile/Antônio-Lacerda-de-Barros"
                },
                {
                    "user_id": "Sadie Hollez",
                    "user_href": "/profile/Sadie-Hollez"
                },
                {
                    "user_id": "Sofia Geller",
                    "user_href": "/profile/Sofia-Geller"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly Schorzman",
                "href": "/profile/Kelly-Schorzman"
            },
            "answer_text": "I was in Washington Correction Center for Women (WCCW/Purdy) from 2009 until 2019 on a first degree assault charge. It was like a college campus, even maximum security got to program, go to school, go to the gym, go to the library it's not like in the movies. Now, if you go to segregation that's a whole different thing. I'd say the biggest problem in women's prisons is relationships. I'm openly gay I've been out for over 40 years and all the sudden women are “gay for the stay” I was 44 when I got arrested so I called myself (“grey for the stay’”LOL ). Also, on a sad note, I would say the majority of the women in the prison are under 30 years old there's a lot of 18, 19, 20 year olds they're just babies and most of their crimes have to do with drugs and they're just following in the footsteps of their parents or their Guardian. They have an amazing baby program too it's astonishing that 85% of incarcerated women in that prison are mothers. But being in prison, unlike Orange is the New Black, there's opportunities to further your education you can get your degree in cosmetology, Horticulture, technical design etc., there's also plenty of opportunity to get involved with drama, gossip, relationships, violence it's all up to the offender what they want to do. You might even see a celebrity or two one day I was out in the yard and John Legend and his mother were walking through Brandi Carlile has been there a few times too. Now this is only speaking from my own experience at my prison, there are plenty of tougher women's prisons throughout the country for sure. I was very blessed if my crime had to happen ( which it did not obviously) I'm glad I was in Washington State where I could at least focus on bettering myself and now I Mentor at-risk Youth and I tell my story at various events. Thanks for the question. ",
            "date": "Answered October 8, 2020",
            "views": "692",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lindsay Conway",
                    "user_href": "/profile/Lindsay-Conway-3"
                },
                {
                    "user_id": "Mary Krupka",
                    "user_href": "/profile/Mary-Krupka"
                },
                {
                    "user_id": "Julia Watros Homard",
                    "user_href": "/profile/Julia-Watros-Homard"
                },
                {
                    "user_id": "Cherry Davis",
                    "user_href": "/profile/Cherry-Davis-9"
                },
                {
                    "user_id": "Njinxy Cat",
                    "user_href": "/profile/Njinxy-Cat"
                },
                {
                    "user_id": "David Demarco",
                    "user_href": "/profile/David-Demarco-24"
                },
                {
                    "user_id": "Stevan Ilic",
                    "user_href": "/profile/Stevan-Ilic"
                },
                {
                    "user_id": "Jessica Su",
                    "user_href": "/profile/Jessica-Su"
                },
                {
                    "user_id": "Jennifer Stone",
                    "user_href": "/profile/Jennifer-Stone-101"
                },
                {
                    "user_id": "Will Wister",
                    "user_href": "/profile/Will-Wister"
                }
            ]
        }
    ]
}