{
    "title": "What is the most important thing the college is looking for in a student? - Quora",
    "tags": [
        "Student Life at Jabalpur Engineering College",
        "Nightlife in Madrid",
        "Student Life at Algonquin College"
    ],
    "response": [
        {
            "author_info": {
                "name": "Reddy G",
                "href": "/profile/Reddy-G-17"
            },
            "answer_text": "Well, while this is a very broad and too general a question, any and every good or great academic institution looks and dreams for a new student to enhance and enlighten all the qualities that institution stands for and like to propagate to the academic community it is located in and then the wider world it likes to recruit in the future. Yes, every higher learning institution looks for something new that each prospective adamite may have, something unique talent, something special, something they have not seen or had at their place before, something a new individual may contribute in the future, etc etc. Yes, one great and very highly accomplished President or Chancellor of a world re-known university academic institution name expressed very eloquently to the parents sending their first child there that he is just borrowing the child, enlighten him/her for four yard and promised too send them back o the parents and the whole wide world a newly transformed individual that will contribute to the wide world in her/his field of expertise. Well, that is every parents dream and should be every youngster’s wish. What else we need in this world? Just go for it and make the best of it. ",
            "date": "Answered January 29, 2019",
            "views": "97",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dave Cramton",
                "href": "/profile/Dave-Cramton"
            },
            "answer_text": "Depending on the school: Glib answer: (actual answer below) A pulse and the means to pay tuition. Pulse optional.A pulse, the means to pay tuition, a decent high school GPA, and decent SAT/ACT scores.A pulse, excellent high school GPA/SAT/ACT, and tuition/scholarship arrangements can be made.No, really, there are many things that go into the matrix of what an admissions system considers a good candidate, and that may change year over year, depending on the school’s goals, candidate mix, availability of financial aid, etc. What they want is for all students to have a good experience and to succeed. Student success is the primary goal, so if you have mediocre grades or test scores but have significant life experience that you feel will help you excel in college, make sure that’s in your entrance essay. Colleges are finding that excellent test scores aren’t always an indicator of student success, so they’re broadening their criteria to include things like life experience, essays, the strength of the student’s intent (how often you visit or make contact, etc). ",
            "date": "Answered March 7, 2018",
            "views": "207",
            "upvotes": "0"
        }
    ]
}