{
    "title": "What is the best way to study a topic you have no interest in? - Quora",
    "tags": [
        "Study Strategies",
        "Boredom"
    ],
    "response": [
        {
            "author_info": {
                "name": "Skip Morrow",
                "href": "/profile/Skip-Morrow"
            },
            "answer_text": "That's always a tough one. Along the years, I have had to take several courses for which I had no interest. I know now that most of those courses were meant to improve me in different ways, but as a teenager in high school, and as a freshman/sophomore in college, that didn't mean anything to me. One possibility is that you are bored because the material is either too hard or too easy for you. It can be hard to tell the difference between this type of boredom and a true dislike for the topic. Have you met all of the prerequisites for the class? It takes discipline, on your part. It is hard. Get used to it. Get over the fact that you hate the class, and it doesn't make any sense that you have to take it. No one is going to listen to you and all of a sudden say \"you are right. This class is dumb. We will just go ahead and remove it from your curriculum right now.\" So try to make the best of it. Find something in the course that is interesting to you. Maybe find a friend in the class that is at least a little interested in the topic and see if they can help to show you what makes it interesting. I would try to stay away from other like-minded people when looking for study partners. You don't want to just have a giant pity party instead of studying. Ideally the teacher will do their best to inspire you and show you that the topic is interesting. They can show you the importance of the topic, and why it will help you and make you a better person. Sometimes it can be hard to understand when you are young, but try your best to understand. Good luck! ",
            "date": "Answered July 16, 2014",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rosebudz",
                    "user_href": "/profile/Rosebudz"
                },
                {
                    "user_id": "Aleem Mahabir",
                    "user_href": "/profile/Aleem-Mahabir"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Reiland",
                "href": "/profile/Robert-Reiland"
            },
            "answer_text": "Many things seem uninteresting when you don't see useful connections between them and what you are really interested in.  The important thing to know is that it is always possible to find such connections and develop a greater interest. Some people love art but think that science and math are boring.  But the best artists in history have typically used things from science and technology in their work.  Sometimes this has involved materials and other times they have been inspired by their understanding of the latest science.  Math is important in perspective and in many other ways of constructing images and sounds. Some scientists think that art is not interesting, but they are seldom among the better scientists.  There are many ways to get inspiration directly and indirectly from the visual arts, music and literature. I personally found history and French to be uninteresting when in high school and didn't do well in these subjects.  Later I thought about these in different ways.  History of ideas became one of my most serious hobbies, and it even helped me to remember more of the things about history that had seemed boring to me, such as dates of events.  To trace the development of important ideas, I had to know at least what the chronological order was. I have become more interested in how people express ideas differently in different languages.  Also I spent 2.5 weeks in the French part of Switzerland in 1984, and the little French I remembered became useful and much more interesting. Shortly after that time I started telling my students that no subjects are inherently boring and that they had the ability to find new ways of looking at things that had seemed boring.  With a little initial effort they could learn to enjoy studying any field.  One of these students surprised me by later remarked upon this advice in his commencement speech, as if it had helped him to become a better student.  At the time I was surprised because it had seemed to me that he was always great at learning just about anything.  Today he is a world leader in the area of internet law and is still interested in everything. Learning should never be tedious.  You may run into difficult challenges and times when your efforts to learn something new are frustrating, but by finding good connections between what you are studying and other things you like while persevering, you can generally replace boredom with excitement. ",
            "date": "Answered March 19, 2015",
            "views": "15",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Katia Fredes",
                    "user_href": "/profile/Katia-Fredes"
                },
                {
                    "user_id": "Kaustubh Patil",
                    "user_href": "/profile/Kaustubh-Patil-251"
                },
                {
                    "user_id": "Russell Austin",
                    "user_href": "/profile/Russell-Austin-27"
                },
                {
                    "user_id": "Anisha Saha",
                    "user_href": "/profile/Anisha-Saha-1"
                },
                {
                    "user_id": "Sarah K. Haddad",
                    "user_href": "/profile/Sarah-K-Haddad"
                }
            ]
        }
    ]
}