{
    "title": "What is it like being an ESL teacher? - Quora",
    "tags": [
        "Teaching English as a Foreign Language (TEFL)",
        "English as a Second Language (ESL)",
        "Teachers",
        "Teaching"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joseph McGinley",
                "href": "/profile/Joseph-McGinley-3"
            },
            "answer_text": "This is a profession that varies widely from outside perceptions to inside practices. Let me explain. In my career of ESL teaching, I have encountered a lot of opinions that are largely ignorant of the profession. ESL teaching isn’t a real job. You don’t need to have any special skills to teach English. People who teach ESL just want to travel. They don’t actually care about teaching English. When I started as an ESL teacher, I also had an opinion that teaching English abroad was just a way to go experience another culture and travel for a few years. After that, you come home and get on with your life. That was before I realized I liked teaching English, and my students liked me. From that point, I tried harder and took my profession more seriously. As it is with any profession, there is room for improvement and becoming the best you can be at doing that thing. You will also realize that it is, indeed, a real job and very demanding at times. It is a teaching job, after all. The perks: You will constantly be learning about not only other cultures, but also your own language. I learned more about English in my time as an ESL instructor than with years of English class in school.You are a cultural ambassador. If you teach at home, you are the point of contact and bridge between the foreign student and your culture. You have a responsibility to help your students get accustomed to their new home. If you teach abroad, you are responsible for giving a good impression of your country. They will think that the way you act is the way that every person from your country acts.If you teach adults, you will probably become friends with some of them. Eventually, you will have friends in a lot of different countries who you can visit someday.Ability to travel. Most of the world wants to learn English, which means English teachers are in high demand in a lot of places. Pick a place on the map and see if you can teach English there. Chances are, you probably can.Comfortable salary for where you live. Usually the job will pay you enough to live comfortably in that country. Don’t fret if the salary seems low. Chances are, the cost of living is much lower as well.The main responsibilities: Teaching English in a way that is easy to understand and allows the learner to effectively communicate verbally and in writing.Showing up to work on time, preparing your materials, administrative work, normal job stuff, etc…The negatives: No room to move up. Some countries might have a top tier ESL teacher job that requires a few certificates and special training, but for the most part you will be making a salary and working in a position that won’t change. Things will get more expensive, but you probably won’t get a raise. I’ve heard that ESL teaching in Japan used to be a lot better than it is now; Japan got more expensive and ESL teachers’ salaries did not.Not much respect for ESL teachers at home (at least in the States). A lot of people don’t understand what you do in the classroom and they might think it’s not “a real job.”No “real” responsibility in some programs. I’ve heard of JET (Japan) teachers being assigned to a school, only to find out the school doesn’t know what to do with them. Other times, I have heard of the ESL teacher just being for show. They aren’t really given responsibility over a class and it is just to show parents that “Look! We have a real westerner teaching here!”Racism. My experience is only in Asia, but I ran into a lot of attitudes that “English teacher = white face.” So, my German friend who has a thick accent is able to find an ESL teaching job at a kindergarten as a “Native English Teacher,” but hiring an Indian lady who has experience teaching English and is very good will cause backlash and parents may pull their children from the school. Attitudes are changing, but this seemed very common and unfortunate as it continued an attitude of ignorance. English-speaking countries are among the most racially diverse countries in the world, after all, so it makes sense that English teachers would be diverse as well.That is what it is like being an ESL teacher from my point of view. Currently, I am doing private tutoring for foreign employees in my area. I also do some online tutoring. I really enjoy it because I have a lot of flexibility in my schedule and am not always working in the same place. However, it really is the drive to earn more and have more control over my employment that has caused me to move towards private tutoring. ",
            "date": "Updated April 30, 2018",
            "views": "43",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gloria Villalon",
                    "user_href": "/profile/Gloria-Villalon"
                },
                {
                    "user_id": "Sabrina Velaro",
                    "user_href": "/profile/Sabrina-Velaro"
                },
                {
                    "user_id": "Elly Hong",
                    "user_href": "/profile/Elly-Hong-6"
                },
                {
                    "user_id": "Rian Rosevere",
                    "user_href": "/profile/Rian-Rosevere"
                },
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "Robyn Angela",
                    "user_href": "/profile/Robyn-Angela"
                },
                {
                    "user_id": "Jax Tan",
                    "user_href": "/profile/Jax-Tan-7"
                },
                {
                    "user_id": "Svala Jonsdottir",
                    "user_href": "/profile/Svala-Jonsdottir"
                },
                {
                    "user_id": "Ryan Schutter",
                    "user_href": "/profile/Ryan-Schutter"
                },
                {
                    "user_id": "Ramanujam Jagannathan",
                    "user_href": "/profile/Ramanujam-Jagannathan-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lee Wright",
                "href": "/profile/Lee-Wright-27"
            },
            "answer_text": "I stumbled into teaching ESL (English as a Second Language) in my first year of college, outside of Chicago, in 1983. A friend of mine was volunteering in our school’s language lab helping foreign students with their homework. I met some great people from all over the world. In the second semester, my same friend asked if I wanted to take a TESL (Teaching English as a Second Language) course, off-campus. After three months, I became certified to teach ESL. In my second year of college, with my TESL certificate in hand, I entered the ESL course as a teacher’s assistant. The students were professionals who needed to learn English to better their careers. There was a married couple who were doctors in Communist Poland and managed to escaped. There was a young guy my age who managed to flee the civil war in El Salvador. Another young refugee from Laos. Their stories of escape from war and repression captured my heart. Volunteering to teach these brave, young people English to improve their lives was the least I could do. I continued to teach immigrants privately for about five years until I went to São Paulo in 1990 to teach EFL (English as a Foreign Language). Again, my motivation was to help people better their careers, and I’m glad I went. I stayed only six months, but went back in 1999 as an emigrant and lived in Rio for seven years. Overseas, I always felt like a cultural embassador, and when I returned to the U.S. in 2007, I continued as an embassador for the Brazilian culture. I’m now teaching English online, specifically to Brazilians. I have such a passion for the English language, and a talent for teaching. ",
            "date": "Answered October 3, 2017",
            "views": "23",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carol Shetler",
                    "user_href": "/profile/Carol-Shetler-1"
                },
                {
                    "user_id": "Kate Tesol",
                    "user_href": "/profile/Kate-Tesol"
                }
            ]
        }
    ]
}