{
    "title": "What month and year does the high school class of 2021 graduate college? - Quora",
    "tags": [
        "High School Graduation",
        "High Schools",
        "High School Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrea McKinley",
                "href": "/profile/Andrea-McKinley-14"
            },
            "answer_text": "It depends. While most students take four years to graduate with a bachelors degree, some take three, while others take six. Many more take half year intervals graduating after fall instead of spring. Students can also decide to enter college at different times. At my school, one student in the class of 2020 decided to graduate in January and enroll in college for the spring semester. Many other students decide to work before college or take a gap year. If COVID-19 is not under control and many colleges are online for Fall 2021, then more students will be taking gap years. Assuming that a student enters college in the fall following highschool graduation and takes four years to graduate, that student will finish college in April, May, or June 2025 depending on the institution. ",
            "date": "Answered August 29, 2020",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Woloch",
                "href": "/profile/Michael-Woloch"
            },
            "answer_text": "In North America, the school year starts in the late summer (late August or early September) and ends near the end of April for college/university programs, and later for lower levels of school - the exact date and duration varies by locale, but let’s use most of the US as an example. High schools that graduate at the end of May, 2021, will have students start university in the fall of 2021. For a 4-year program, they will finish in May of 2025 - the date of the graduation ceremony usually soon after. ",
            "date": "Answered March 10, 2020",
            "views": "15",
            "upvotes": "0"
        }
    ]
}