{
    "title": "What happens if you fail 2 exams in the first semester in the 7th grade? - Quora",
    "tags": [
        "7th Grade",
        "Exam and Test Failure",
        "Grades (education)",
        "Failure",
        "Exam and Test Advice",
        "Academic and Educational Advice",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christie Brown",
                "href": "/profile/Christie-Brown-40"
            },
            "answer_text": "It sounds like you are in a bit of distress. On your side, the fact is that not everyone who encounters difficulties at your stage in life actually worries. I’d say you clearly want to do well. Your worry isn’t entirely a bad thing. The good news is that middle school grades affect stuff like college not at ALL. The bad news is you probably have to come up with a more effective way to study. So - Don’t be afraid of your grown-ups. They can help. Second, get someone who can help you understand why it went badly. This might be an academic advisor, or your teachers, but it also might be a counsellor or therapist. Take care of yourself first. if you don’t let your worry overcome you, you will be fine. ",
            "date": "Answered December 20, 2019",
            "views": "34",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jason Min",
                "href": "/profile/Jason-Min-15"
            },
            "answer_text": "Perhaps you will be considered to retake those classes or will be put in a lower level class to relearn the subject so you can do well in the future. It is worth noting that your grades will not affect your college admission chances and aren’t an indicator of how you will do in the future at this point in your education. High school really matters if you’re trying to go into the top school, so as long as you are determined and willing to work in high school your future will be bright. ",
            "date": "Answered December 20, 2019",
            "views": "36",
            "upvotes": "0"
        }
    ]
}