{
    "title": "What will be the educational impacts of COVID-19? - Quora",
    "tags": [
        "19 (age)",
        "Educational Technology",
        "Impact",
        "Education Reform",
        "Educational Systems",
        "Schools",
        "Higher Education",
        "Teenagers and Teenage Years"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashley Riggs",
                "href": "/profile/Ashley-Riggs-29"
            },
            "answer_text": "I’m a high school junior, so I’m not a kid but Covid-19 has affected my education. This is what my classroom looks like when Covid-19 started and my school closed.  Before I went to class, met up with my friends, had lunch with them and had after school activities. Now all I see are laptop, iPad and iPhone screens every single day. At first, things were all crazy with the teachers trying to figure out elearning, but now we have classes every day. It’s pretty much the same but sometimes up to 30 minutes shorter than being in school. My AP Biology class looks like this:  I use my iPad (on the right) to get on Zoom with everyone and I use my smaller laptop to go on Jamboard. My biology teacher talks on Zoom and sometimes writes on Jamboard. My Psych 2 and AP English lit class looks like this:  We only go on Zoom and my teachers do all the talking, so I only need one iPad for it. They e-mail us assignments we have to do and let us know when they’re due. Sometimes the entire class is to go over the answers to the assignments after everyone turned it in. My AP Calculus BC class looks like this:  It’s the same thing as my AP Biology class, but I use my bigger laptop for Jamboard. My calculus teacher writes a lot and he has a smart board. Sometimes the screen gets too filled up with his writing and he starts writing small, so I put it on my smart board so I can see better. He’s getting better at not cluttering up the Jamboard and writing bigger. He also calls on us to solve problems on Jamboard. My AP Micro economics and other classes looks like this.  My teachers for other classes doesn’t use Jamboard but they show videos and other things, so I put the videos on my left iPad and do Zoom or other video chat on the right one. When we first did this, there was echoing because people didn’t get muted, but now my teachers are getting better with muting everybody. But sometimes they forget to unmute everyone including themselves. They start talking and all we can see is their lips moving. I change my iPads so I can charge them up when the battery gets low. I don’t like plugging them in during class because the cord annoys me, and it’s easier for me to move to a quiet spot in the house especially when the lawn people show up with their big lawn mowers and noisy leaf blower, or when the garbage and recycle trucks rumble through the neighborhood. Some of my classmates use their phone and tablet, others use their gaming desktop and tablet, etc. We just use whatever we have to make it easier to do elearning. School is 5 days per week and classes are 30 to 40 minutes each. I have seven classes per day and we have a lunch break pretty much at the same time every day. Yup…my teachers take roll every day. There’s no penalty for missing class, but they send an email to the parents letting them know the missed classes. My grandma gets all over my case if I miss a class. ",
            "date": "Answered May 10, 2020",
            "views": "3",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tracee Newday",
                    "user_href": "/profile/Tracee-Newday-1"
                },
                {
                    "user_id": "Robert Boneheart",
                    "user_href": "/profile/Robert-Boneheart-1"
                },
                {
                    "user_id": "Leah Korzep",
                    "user_href": "/profile/Leah-Korzep-1"
                },
                {
                    "user_id": "Nan Waldman",
                    "user_href": "/profile/Nan-Waldman"
                },
                {
                    "user_id": "Martin Liu",
                    "user_href": "/profile/Martin-Liu-29"
                },
                {
                    "user_id": "Vishnu Vardhan",
                    "user_href": "/profile/Vishnu-Vardhan-1173"
                },
                {
                    "user_id": "Trevor Houston",
                    "user_href": "/profile/Trevor-Houston-2"
                },
                {
                    "user_id": "Sylvia Fornah",
                    "user_href": "/profile/Sylvia-Fornah"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kery Harrelson",
                "href": "/profile/Kery-Harrelson"
            },
            "answer_text": "I think this depends greatly. For younger children this could delay learning to read, etc., but likely nothing that can’t be overcome later. For high school students, this could be a blessing if they use the time wisely. Let me begin by defending our teachers. Most of them are doing the best they can the only way they know how. So many teachers have spent a career doing exactly what they were told exactly as expected and did it well. Some are using this opportunity to expand learning opportunities and try new and different things. That second group of teachers could profoundly affect, particularly high school students. If the teachers are leaning on Zoom or Google Meet to extend lecture-based classrooms into students’ homes, then we can probably expect poorer results than in a traditional classroom. As Linda Darling-Hammond spoke of traditional teaching in the film, “Most Likely to Succeed”, “One of the things that we know from cognitive science research is that… about 90% of the things that you might… memorize, use on a test and never use again disappear.” This is backed up by a study from Cleveland State University that found that after three years, people who never took a class on a subject had just as much knowledge of a subject as students who took a lecture-based class on the subject. In considering high school as it exists, getting away from it could be the best thing that could happen to those students. Let’s consider typical high school classes starting with history. History is typically a drill and kill, memorization-based class which, in a practical sense, given what we know from just the research previously mentioned, makes high school history classes about 10% useful. High school science classes are entrenched in memorization as well with the addition of calculations and “labs” that too often resemble recipes rather than experiments. Again, relatively useless in a practical sense. Then there’s what we call “Math” in the United States. This amounts to little more than calculating. Very little real math actually happens in high school math classes. As Jo Boaler points out at about 11:56 in the video, “The Nature of 21st Century Mathematics”, “The high school maths… is just filled with antiquated methods nobody will ever use again.” Rounding out the core subject is English. I am the son of and husband to English teachers (Not the same person!). From a purely economic perspective, it should not take twelve years for children to learn as little as they learn in English classes. Something is amiss and like the rest of school, should be re-evaluated. The specials: art, music, theater, etc. are classes that they are truly missing. In a world where computers and outsourcing are drastically reducing the need for human calculators and routine work, those right-brain skills are irreplaceable. In the end, getting away from the mundane, time consuming, “busy work” of traditional school could be incredibly helpful if those kids decide to look into; study what they are interested in. ",
            "date": "Answered April 14, 2020",
            "views": "781",
            "upvotes": "0"
        }
    ]
}