{
    "title": "What is a review on the Shaw Academy? - Quora",
    "tags": [
        "Shaw Academy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cameron Milne",
                "href": "/profile/Cameron-Milne-17"
            },
            "answer_text": "My honest experience with Shaw academy started optimistically, the courses seemed like they would be useful and interesting. However after a couple of weeks of attempting to do the courses during my free trial, I was unfortunately unable to complete any of the classes due to my own time constraints. This led me to the conclusion that it would be best that I cancel my subscription and wait until I had more free time and would be able to make use of more paid content. This is where my experience went way, way downhill. After attempting to cancel my subscription a week before my free trial was up (and believing that I had succeeded), I heard nothing until 5 weeks later when I noticed a charge on my credit card from Shaw Academy. I'm willing to admit that I mist've made a mistake trying to cancel my subscription/account, tho I'm also certain that the confusing nature of the subscription and the cancellation process played a large factor. I tried contacting Shaw academy multiple times for about a week and a half and received nothing but auto-replies, until finally customer service contacted me. After quite a lengthy back and forth over the following 2 weeks, the end result can be summarised as follows: 1. I was informed that it was simply impossible to refund me the $39.99USD subscription charge, despite the fact that I had not used any of the services, and that it was abundantly clear that this was a mistake and not my intention. 2. The solution continually put forward by the customer service representative was for me to reactivate my account and take part in the courses, free of charge (final value offered was for $620 worth of free courses), despite the fact that I had informed him over and over again that I did not want to take any courses, and couldn't even if I wanted to, due to my time constraints. (I am aware that on surface level, this seems like an extremely generous and valuable offer. But the fact that the customer service representative continually ignored my explanation of why that would not be possible for me, and repeatably tried to force this solution on me, was insulting to say the least.) 3. It makes no logical sense why they can afford to offer me $620 worth of services and content, but cannot afford to offer me a $40 refund. No financial sense whatsoever. All in all, I would have liked to explore what Shaw Academy has to offer, as I'm sure that the contents of their courses is informative and valuable. However, due to the complete lack of customer awareness, refusal to provide a more reasonable (in my opinion) solution, and the extremely disappointing customer service responses (in my opinion), I would strongly recommend for anyone considering Shaw Academy to search for another online course to fulfil your wants and needs. I don't feel that Shaw Academy is genuinely interested in education, but more so in just making money. I would not trust Shaw Academy to have my best interests in mind and would find it hard to believe that they would have any other customers best interests in mind either. ",
            "date": "Answered February 5, 2020",
            "views": "1028",
            "upvotes": " View 195 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ng Jee Kinn",
                    "user_href": "/profile/Ng-Jee-Kinn"
                },
                {
                    "user_id": "Kashish Aggarwal",
                    "user_href": "/profile/Kashish-Aggarwal-2"
                },
                {
                    "user_id": "Olanna Iwu",
                    "user_href": "/profile/Olanna-Iwu-1"
                },
                {
                    "user_id": "Wasim Akram",
                    "user_href": "/profile/Wasim-Akram-2414"
                },
                {
                    "user_id": "Dara Sam",
                    "user_href": "/profile/Dara-Sam-10"
                },
                {
                    "user_id": "Phụng Phan",
                    "user_href": "/profile/Phụng-Phan-3"
                },
                {
                    "user_id": "Brit Mccall",
                    "user_href": "/profile/Brit-Mccall-2"
                },
                {
                    "user_id": "Adebimpe Adekola",
                    "user_href": "/profile/Adebimpe-Adekola"
                },
                {
                    "user_id": "Ben Shum",
                    "user_href": "/profile/Ben-Shum"
                },
                {
                    "user_id": "IndyPindee .",
                    "user_href": "/profile/IndyPindee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tia Hunter",
                "href": "/profile/Tia-Hunter-7"
            },
            "answer_text": "So I will add my two cents for what it’s worth but nearly every response I have read makes mine feel redundant. Basically, I signed up during this COVID quarantine and although I enjoyed the classes that I took, I wasn’t interested in going any further with it. I actually looked up the cancellation period 3 times. They seem to have a misleading way of communicating and I am guessing that’s done on purpose so they can justify charging your account. When I went to cancel earlier this month (May 1st) I saw that if I did so I would not be able to continue the lessons nor would I have access to the Bonus material I paid $40 for. I had 3 lessons left to watch and it said that I would be alerted about the cancellation period so I would have time to do so. I checked every email that they sent me as well as the plethora of SMS’s sent and not one of them says anything about a reminder for cancellation. So I checked a few days before it said I had to cancel and the countdown said only 3 days left which by the way did not include the day that the last class is given and when they allow me access to the last bit of the bonus material (very sneaky that). That day was the last day to cancel. Again, I would have no access to the material that I already paid for nor could I finish the lessons. The same day the lessons ended they took $70 from my account. I had sent them an email about a technical issue the week before and I did not get a response so I thought. So I was suspicious. I sent an email about the cancellation inquiring about a refund and I thought they sent me another computer-generated reply. I think they did but then after 2 or 3 paragraphs in that are sales pitches they address your issue and then go back into 3 or 4 more paragraphs of sales pitches. Even when I canceled the subscription, I still could not get off the phone without listening to the computer-generated sales pitch that lasted longer than necessary. I found a bit comical. They basically said they are not refunding the money and now I feel scammed. Again, although I really enjoyed their classes, I am definitely going to say DON’T TRUST THEM. I checked with the BBB and it seems there are similar issues there. I don’t think everyone reports it there like they do here on Quora though. Best of luck if you do and I hope you have a much better experience. ",
            "date": "Answered May 10, 2020",
            "views": "327",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Odeyinka Esther",
                    "user_href": "/profile/Odeyinka-Esther"
                },
                {
                    "user_id": "Kashish Aggarwal",
                    "user_href": "/profile/Kashish-Aggarwal-2"
                },
                {
                    "user_id": "Brit Mccall",
                    "user_href": "/profile/Brit-Mccall-2"
                },
                {
                    "user_id": "Doris Kendrick",
                    "user_href": "/profile/Doris-Kendrick"
                },
                {
                    "user_id": "Kai Jenkins",
                    "user_href": "/profile/Kai-Jenkins-2"
                },
                {
                    "user_id": "Eugenia Bu",
                    "user_href": "/profile/Eugenia-Bu"
                },
                {
                    "user_id": "Madara Kronberga",
                    "user_href": "/profile/Madara-Kronberga"
                },
                {
                    "user_id": "Adeelah Mir",
                    "user_href": "/profile/Adeelah-Mir"
                },
                {
                    "user_id": "Duy Tran",
                    "user_href": "/profile/Duy-Tran-313"
                },
                {
                    "user_id": "Casandra Klund",
                    "user_href": "/profile/Casandra-Klund"
                }
            ]
        }
    ]
}