{
    "title": "What can be done to improve girl child education? - Quora",
    "tags": [
        "Primary School Education",
        "Young Women",
        "Children"
    ],
    "response": [
        {
            "author_info": {
                "name": "Maurya Ji",
                "href": "/profile/Maurya-Ji-28"
            },
            "answer_text": "Education of a girl child in India is in shambles. Especially in the rural pockets of the country, which sees a huge drop out rate among girl children. The right education to the girl children, which is the first step towards encouraging girl empowerment. One of the best ways to ensure education for girl children is to reaching out to them directly. Find girl children living in your locality and surroundings, and recognise those who have dropped out of school. You can either try and get them to join the local government school or contact an NGO like Plan India who will offer the girls the right learning opportunity academically and otherwise.  Here are a few ways in which the entire society can participate in women empowerment: Equality Begins At Home: Children should be educated from a young age that boys and girls are equal. Especially in households with a boy and a girl child. Even subtle differences in raising the child, such as paying special attention to the boy child, or sending the boy to a better school can gradually build a sense of divide in the children’s minds. In order to avoid gender inequality , both children must be given equal importance and their dreams ought to be nurtured and encouraged, irrespective of if they adhere to gender norms put in place by society. A girl child can dream of becoming an astronaut just as much as a boy child can dream of getting into fashion designing. The Right Education: A good education is a tool that can help a girl child build a strong future for her and her family. Education of girl child in India is still disproportionate compared to the education of male children. Looking down upon girls who wish to embark on higher studies and lack of access to proper schools and colleges nearby are among the major factors contributing to this regressive trend. Access to even basic education can help empower the girl children and helps them stay abreast of the world they live in. This widens their understanding of the world and allows them to take the right decisions in life. Of course, the ultimate idea is to give them the right exposure and establish a system that encourages girl children to achieve their dreams. Create An All-Inclusive Space: Be it in schools, colleges, offices, or public places, women should have the right to equal participation. This is only possible through social reforms and political intervention. All government and civil bodies should actively involve themselves in creating a highly compassionate society by ending discriminatory practices against women. Promoting gender equality is the only way to empower women and ensure that they are treated as equals to men. Upholding the rights of the girl child and nurturing her ambitions instead of squashing them is the need of the hour. Girl empowerment begins at grass root levels. Only through education and creating a space for equal opportunities can women stand as equals among men in society. Plan India works towards creating an ecosystem that encourages female participation, especially those from the socially and politically backward communities, thus bringing a steady change in the society. ",
            "date": "Answered April 11, 2019",
            "views": "36",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Satyapriya Mishra",
                    "user_href": "/profile/Satyapriya-Mishra-5"
                },
                {
                    "user_id": "Abhishek Saraswat",
                    "user_href": "/profile/Abhishek-Saraswat-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yasmin Garana",
                "href": "/profile/Yasmin-Garana-1"
            },
            "answer_text": "Education is the most powerful weapon which can bring change to the world. Children are the next future of the nation; they should be well educated so they can make a brighter future for our nation. If you really want to create a great future for your nation then donate for child education in Ahmedabad through Manav Kartavya, which is NGO working for child education. Manav Kartavya is one of the best NGOs working for girl child education in Ahmedabad, India. 5 ways in which a child can benefit from your donation5 Ways in Which A Child Can Benefit 1. Education 2. Better standard of living 3. Games and hobbies for kids 4. Nourishing meals at school 5. Healthcare For More Details Visit: http://manavkartavya.org ",
            "date": "Answered June 27, 2019",
            "views": "1",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bùi Khắc Nam",
                    "user_href": "/profile/Bùi-Khắc-Nam"
                },
                {
                    "user_id": "Satyapriya Mishra",
                    "user_href": "/profile/Satyapriya-Mishra-5"
                },
                {
                    "user_id": "Mitesh Patel",
                    "user_href": "/profile/Mitesh-Patel-928"
                },
                {
                    "user_id": "Asmita Yadav",
                    "user_href": "/profile/Asmita-Yadav-49"
                }
            ]
        }
    ]
}