{
    "title": "What is your most secret experience at school? - Quora",
    "tags": [
        "Schools",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kamaria Roseboro",
                "href": "/profile/Kamaria-Roseboro"
            },
            "answer_text": "Ok this question sounds fun. I hate my school. But I do be having fun in there too, all kinds of fun to be exact. But I would really be acting all types of crazy if the assistant principal wasn´t always walking in the hallways. I would be having all types of fun, you guys just don´t know, I literally be having fun doing everything before class actually starts. My school is bad people are either getting expelled or suspended. Its horrible and sometimes funny at the same time because of people´s reactions you know? But I don´t know if you guys are ready for my story yet. Because this girl kept talking crap about me in weight training one day and the next morning she was still doing the same thing it was in the cafeteria. So I picked up a chair and threw it at her and I literally beat the crap outta her, I bet you she didn´t say nothing to me after she just looked at me like she was crazy. Like literally crazy. But imma save this story for another day. Because I don´t know if you guys are ready to see another side of sweet and adorable Kamaria, you only see this side if you piss me off or talk crap about me. So let´s just wait okay guys? I promise I will tell you guys some other time maybe tomorrow if I feel like it. But anyways let me be quiet before I get mad. Hoping for the best, ~Kamaria❤ ",
            "date": "Answered March 30, 2020",
            "views": "520",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Stefan-770"
                },
                {
                    "user_id": "Jordan Lee",
                    "user_href": "/profile/Jordan-Lee-537"
                },
                {
                    "user_id": "Aeriel Shaw",
                    "user_href": "/profile/Aeriel-Shaw"
                },
                {
                    "user_id": "Kim Boze",
                    "user_href": "/profile/Kim-Boze"
                },
                {
                    "user_id": "Peggy Mantei",
                    "user_href": "/profile/Peggy-Mantei"
                },
                {
                    "user_id": "David Dugan",
                    "user_href": "/profile/David-Dugan-37"
                },
                {
                    "user_id": "Ashla Delana",
                    "user_href": "/profile/Ashla-Delana"
                },
                {
                    "user_id": "Simone Melanie",
                    "user_href": "/profile/Simone-Melanie-1"
                },
                {
                    "user_id": "Hope Cover",
                    "user_href": "/profile/Hope-Cover-2"
                },
                {
                    "user_id": "Matias Sebert",
                    "user_href": "/profile/Matias-Sebert"
                }
            ]
        }
    ]
}