{
    "title": "What should I choose in GMC Nagpur and AIIMS Nagpur in the NEET 2020? - Quora",
    "tags": [
        "Government Medical College, Nagpur",
        "Nagpur, Maharashtra, India",
        "All India Institute of Medical Sciences (AIIMS)",
        "National Eligibility cum Entrance Test (NEET)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aniruddha Jadhav",
                "href": "/profile/Aniruddha-Jadhav-4"
            },
            "answer_text": "First of all I am an student of GMC Nagpur still I will try to be as unbiased as possible. And faced similar dilemma during my admission. Location: Aiims nagpur is located in th outskirts of city. So you would be mostly isolated from what's happening in the city.Also the being outside it may feel quite lonely sometime and might be difficult of u need anything to buy immediately. GMC nagpur on the other hand is located in the centre of the city and have well established market so buying any stationary,books and other essential is quite easy and its good for just relaxing as there are too many street food shops nearby. Academics: Mostly how u perform in medical colleges depends on you. But if u like to have regular colleges and strict planned environment around (Just like in school).Then Aiims nagpur is a perfect place for u. But if u like a bit relaxed life more than just study and learn at your own pace then I would suggest GMC nagpur. But as Aiims has recently been started all the labs and lecture hall would be new and equipped with new and perfectly functional equipments. Hostels: Aiims nagpur for sure has better hostel in terms of infrastructure and is equipped with everything that u need. But as aiims nagpur is relatively new college it lacks the culture and brotherhood and just makes the environment more lonely and compitative with each other.Also if aiims nagpur is free of ragging. GMC nagpur although the hostels had recently been renovated but nowhere matches the quality of aiims. But it has an established culture and events that take place in hostel from years which makes ur mbbs journey more memorable.And yes ragging is still prevalent here but the magnitude has reduced a lot and it is one of the reason that helps us make friends for lifetime. Reputation: Aiims nagpur although it is a new college u would get tag of being an AIIMSONIAN but this does not benefit in long run. And being relatively new it lacks any alumni of the college. But sure aiims being a central institution you get internal reservation and has high budget on infrastructure. Gmc nagpur being one of the oldest college and largest college and hospital in central india has good reputation.But being a state college u could see the budget cuts here and there. College life: GMC nagpur being an older college has established cultural events that happen every year like synerige, synapse, GFC and more. And has sports of all kind from cricket,basketball to swimming. And u would get seniors from final years to interns and to Jr Aiims being a new college it would take time for student adapt and form cultural communities and arrange events so for now no big events are organized here. ( personal opinion: And lack of seniors of might make it ur mbbs journey a little boring as we make one of them as our role model😅) Overall: if u are too focused on academics aiims should always be ur 1st choice. But if u are like me who like to enjoy life a bit more then gmc nagpur would be better. So its upto you: college life or Academics ",
            "date": "Answered October 8, 2020",
            "views": "19",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arul Agarwal",
                    "user_href": "/profile/Arul-Agarwal-1"
                },
                {
                    "user_id": "Bhavesh Kumar",
                    "user_href": "/profile/Bhavesh-Kumar-668"
                },
                {
                    "user_id": "Adnan Khan",
                    "user_href": "/profile/Adnan-Khan-935"
                },
                {
                    "user_id": "Pratik Girase",
                    "user_href": "/profile/Pratik-Girase-2"
                },
                {
                    "user_id": "Ishan Desale",
                    "user_href": "/profile/Ishan-Desale-1"
                },
                {
                    "user_id": "Saurajit Baishya",
                    "user_href": "/profile/Saurajit-Baishya"
                },
                {
                    "user_id": "Aman Belokar",
                    "user_href": "/profile/Aman-Belokar"
                },
                {
                    "user_id": "Sarthak Bansode",
                    "user_href": "/profile/Sarthak-Bansode"
                },
                {
                    "user_id": "Harshit Gupta",
                    "user_href": "/profile/Harshit-Gupta-1811"
                },
                {
                    "user_id": "Rushikesh Naik",
                    "user_href": "/profile/Rushikesh-Naik-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dr.Ankita Yawale",
                "href": "/profile/Dr-Ankita-Yawale"
            },
            "answer_text": "That solely depends on your interest in verious branches. Radiology, medicine and dermatology are preferred one among all. But you can go for other clinical branches too. Weigh all your options ,what is scope in future. Also while choosing a branch you should consider what life style you want . Because with branch comes a certain life style and you should be prepared for that too. Explore your intrest in internship. Ask resident of certain branct about their experiences. And you will know just what you want to opt for. So all the best ",
            "date": "Answered May 27, 2020",
            "views": "837",
            "upvotes": " Answer requested by Raunak Kapse"
        }
    ]
}