{
    "title": "What do teachers think about students with ADHD? - Quora",
    "tags": [
        "Attention Deficit Hyperactivity Disorder"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eugene Lim",
                "href": "/profile/Eugene-Lim-91"
            },
            "answer_text": "Thanks for the A2A. Frankly, I am a teacher, and not a psychologist, so it is difficult for me to detect if a child has ADHD. This is especially true as I teach teenagers and young adults, where it is harder to spot ADHD behaviour.  But I find that in today’s world, almost all my students show some symptoms of ADHD. Common symptoms of ADHD includes: Is easily distracted / does not pay attention or listenOften lose things, forget about daily activities and have problems organizing daily tasksDoes not follow directions and seldom finish tasks.Does not stay seated, talk excessively etc.Impulsive - does not wait for their turn and blurt out answers.I will examine each trait and how I cope with these traits in my classroom. 1, Is easily distracted / does not pay attention or listen. Frankly, in today’s world, it is becoming an “Me, Me, Me” generation that focus on themselves and instant gratification. For example, blogs, facebook and twitter, youtube allow them to post things about themselves and get information that is localized to themselves. Also games provide instant gratification. And in today’s world, almost all students have mobile phone, ipad / samsung note etc. So what happens is that attention span has been decreasing, and the class is easily distracted. So as a teacher, I cannot fight against this trend. What I can do is to lower the teaching time, and allow them to spend more time on tasks that will improve their learning. For example, instead of teaching for 40 mins, I teach for just 15 mins. After which is some activities to reinforce what they have learned in class. I used a wide variety of games to get students’ attention. On a given day, I may give in class homework that they must finish before the period ends, ora quiz where all students participate ina discussion in groups where students get to voice their opinion in small teams and compete to brainstormcollaborative learning using stacks of cards, where students question one another and praise / coach one another.playing related computer games in the computer lab that reinforce their learning.watching short videos in class (that are funny is best to get students’ attention).Game based learning where students form groups and play education games I designed etc.So I overcome this problem by having shorter instruction periods, and having a wide variety of teaching methods that allow students to stimulate their minds. 2. Often lose things, forget about daily activities and have problems organizing daily tasks As a teacher, I teach students to organize themselves. Also, I periodically check their file, and reward those who organize their notes in a neat matter, and reward those who organize well. I will also double check if students bring my notes to class, and reward those who bring my notes. (So students who did not organize themselves and did not bring my notes will miss out on candies). After about 2–3 weeks, I usually manage to get all students to bring their notes and organize themselves. As well I have a large homework tracker that I put in the class that allow students to see who own me homework, what homework they own me etc. Usually peer pressure will get the student to complete their homework. Or if they lost their homework (with the stupid excuse that their dog ate it), I will direct them to the online portal where they are supposed to download their homework, print it out and do it. (We have a computer lab in the school where students can print out their homework themselves). I also give reminders each lesson about upcoming tests and remind students to study for it. 3. Does not follow directions and seldom finish tasks. I use the carrot or stick approach to get students to follow directions. It works well for me. For example, I give students a piece of in class homework that must be handed in at the end of the lesson. So students who followed my directions and finish the task faster and done well get rewarded with a hall pass or free time or candies. I keep the work so that no one can copy from one another. As well, students favour the hall pass, and will leave the classroom allowing me to give more individualize attention to coach those who cannot do the problem. Student who failed to do their homework will have detention after school. The earlier they finished their homework completed to a satisfactory level, the earlier they get out of detention. You will be amazed how fast these students who have detention complete their homework. Usually after lunch or next period, their homework will be on my desk. They usually do it in secret during their next class to avoid detention. 4. Does not stay seated, talk excessively etc. Students actually come to school to socialize. Only the very top students come to school to learn. So what I do is to allow them to talk and move around to socialize. The catch is, we use collaborative learning and educational games to get them to move around and have fun while learning. 5. Impulsive - does not wait for their turn and blurt out answers. Again, I guide students by reminding them of the rules of the game, and have their classmates and peers teach them to wait for their turn. I find it is more effective to have classmates correcting one another, and I will walk around the room and solve any dispute when and as needed. As you can see from the above, I think ADHD is more prevalent in today’s society than we think. A large percentage of students exhibit some form of ADHD. I am not a psychologist and I do not care if the student has ADHD. I just care that the student learns what I am teaching and they pass the exam. After all, my job is to teach. Regardless if they have ADHD. The good news is that we can teach students to correct their own behavior or tailor our teaching styles to fit the students. Whatever works for ADHD students usually works for all students (because you get their attention). The bad news is that it is time consuming to tailor the teaching style the first time, but there after you can reuse the same tools, and make your classroom lively and fun to learn. ",
            "date": "Answered November 13, 2017",
            "views": "806",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "FX Susetya",
                    "user_href": "/profile/FX-Susetya"
                },
                {
                    "user_id": "Patrícia De Abreu Castello Branco",
                    "user_href": "/profile/Patrícia-De-Abreu-Castello-Branco"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ellis Reyes",
                "href": "/profile/Ellis-Reyes"
            },
            "answer_text": "That’s a very broad question. We know that they may be more work to support because of their lack of focus. We know that they may be more fidgety and unfocused in class, so we may have to repeat instructions to them. We know that they sometimes are disorganized, so getting work turned in on time can be an issue. We know that they may not always have their materials, so having spare stuff around helps. We know that some days are better than others depending on how their meds are working and if they remembered to take them that day. We do our best to support them and to help them to succeed in our classes. Sometimes we can, sometimes we can’t. ",
            "date": "Answered November 13, 2017",
            "views": "349",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abby Burdette",
                    "user_href": "/profile/Abby-Burdette"
                },
                {
                    "user_id": "Gabe MacFarlane",
                    "user_href": "/profile/Gabe-MacFarlane"
                },
                {
                    "user_id": "Harriet Elizabeth",
                    "user_href": "/profile/Harriet-Elizabeth-2"
                }
            ]
        }
    ]
}