{
    "title": "What happens to my degree if I get drafted while in my third year of veterinary school? Do I have to start over? - Quora",
    "tags": [
        "Veterinary Medicine",
        "Military",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Doug Freyburger",
                "href": "/profile/Doug-Freyburger"
            },
            "answer_text": "“What happens to my degree if I get drafted while in my third year of veterinary school? Do I have to start over?” No country with the draft times service versus college like that. The draft happens at a convenient time. Between high school and college or between degrees. The US hasn’t had a draft in my adult life and won’t as long as my grand children live. I was close enough after Vietnam that I didn’t even have to register for the draft. My brother is old enough he did face the draft to go to Vietnam. He used that as motivation in college. Your question is powerful in my family because that extra motivation was enough to get him accepted into veterinary school. He has had a wonderful career as a veterinarian. He likes it enough that he does not retire even though he could afford to retire over 10 years ago. There are college deferrals for the draft. As long as you stay off academic probation you are exempt from the draft. If there is a total war that includes nuclear weapons, being in college wont matter. either you die in attacks or you end up in the military. In today’s real world, you are exempt form the nonexistent draft. ",
            "date": "Answered February 5, 2020",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Elizabeth Denny",
                "href": "/profile/Elizabeth-Denny-9"
            },
            "answer_text": "Question answered: What happens to my degree if I get drafted while in my third year of veterinary school? Do I have to start over? Different schools have different policies about how interrupted studies are handled. The most common outcome would not be starting over completely but you likely would have to redo some/all of the clinical work. Usually graduate course credits don't “expire” quickly. Your profile seems to indicate you live in the US. So I'm not sure what you mean by “drafted.” I wouldn't think you meant military since we haven't had a military draft since 1973. And if one is reinstated on an emergency basis, professional studies likely won't be the first thing on your mind. Or did you mean you worry you might be drafted by a sports team? ",
            "date": "Answered February 5, 2020",
            "views": "68",
            "upvotes": "0"
        }
    ]
}