{
    "title": "What are good graduation gifts for a high school graduate not going on to college? - Quora",
    "tags": [
        "Gift Lists",
        "Graduations",
        "Gifts",
        "The High School Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arielle Masters",
                "href": "/profile/Arielle-Masters"
            },
            "answer_text": "I’ll reiterate what I said under another question, from someone asking for a book to motivate their life outlook (Arielle Masters's answer to What book is the best to get life motivation?): Sun Tzu's \"The Art of War\" (the James Clavell version, when it's available - here it is on Amazon: Amazon.com: The Art of War (9780440002437): Sun Tzu, James Clavell: Books ) is a book we like to give kids graduating from high school. Lots of good advice about picking your battles, avoiding battles, having a retreat strategy, reading your opponent, etc. that's really general life advice, not specifically for wartime. Since it’s not specifically a going-to-college item, it should be just fine in your case. If they have a car: a car emergency kit, first-aid kit, quick-starter (those can be a bit pricey, but they’re very handy and can also charge your phone); a prepaid gas card Whether or not they have a car: a basic tool kit, if they don’t already have one (hammer, Phillips and straight screwdrivers, adjustable wrench, pliers; maybe a few different sizes of nails or a picture-hanging kit). If they do have the basics, get them a set of folding or regular Allen wrenches. Sears Hardware has a 3-pack (regular, metric, spline); I’m sure other hardware stores also carry sets. If you know they’re getting their own place: a housewarming gift (decorative or useful - find out what they already have); a gift card to Bed Bath & Beyond, Linens & Things, or World Market; a book on basic home maintenance/repair; a nice plant in a nice pot/planter; a garden bench/chair; a wind chime or spinner for their yard; a stepping stone from a garden store or, if you know them well and have the time, make them a stepping stone for their new garden. If they’re crafty: a gift card for Michael’s, JoAnn’s, or another craft store; a basket of craft items for a hobby you know they have In general: something splurge-y AND practical - a gift card to their favorite chain restaurant, local restaurant, or bread store; to a local grocery or drug store; for Barnes & Noble or a local bookstore (or specific books you think they’d like); an Amazon (Online Shopping for Electronics, Apparel, Computers, Books, DVDs & more) gift card. ",
            "date": "Updated June 20, 2019",
            "views": "4",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amanda McClure",
                    "user_href": "/profile/Amanda-McClure-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Gurewitsch",
                "href": "/profile/Jay-Gurewitsch"
            },
            "answer_text": "Not everyone goes directly to college after high school, and many people do very well in the world without college at all, so it's still very much an accomplishment worth celebrating. All the standard graduation gifts are still appropriate; a funny card, Dr. Suess' \"Oh the Places You'll Go\", and something more serious that ties into her/his current interests or career plans. Given the price of gas these days, if the graduate has a car they might really appreciate a gift card from Exxon/Mobil or some other gas company with several hundred dollars on it. At 18 everyone wants to get out and see the world - help them do it! ",
            "date": "Answered May 4, 2011",
            "views": "41",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tsung-Han Yu",
                    "user_href": "/profile/Tsung-Han-Yu"
                }
            ]
        }
    ]
}