{
    "title": "What is the KVPY exam for? - Quora",
    "tags": [
        "Kishore Vaigyanik Protsahan Yojana (KVPY)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anjali Sachdev",
                "href": "/profile/Anjali-Sachdev-26"
            },
            "answer_text": "Kishor Sanskriti Promotion Scheme (English: Youth Scientific Incentive Scheme) (KVPY) is a scholarship program funded by the Department of Science and Technology, Government of India, whose goal is to encourage the students to take up research career in the areas of basic science. It offers scholarships and contingency grants until pre-PhD. Levels for selected students Beginning since 1999, it is administered by the Indian Institute of Science. Kishor Scientist Pratomone Scheme (KVPY) is a continuous national program of fellowships in Basic Sciences, which is started and funded by the Department of Science and Technology, Government of India, so that exceptionally talented and highly motivated students for basic science courses and research career To be attracted. Subjects: Physics, Chemistry, Biology Stream SA: The students studying in class 11 (Science Subjects) have to choose Stream SA while appearing for KVPY Exam. Stream SX: The students studying in class 12 (Science Subjects) have to choose Stream SX while appearing for KVPY Exam. Stream SB: The students studying in the first year of any undergraduate program in Basic Sciences, B.Sc./B.S./B.Stat./B.Math./Int. M.Sc./Int. M.S. in Mathematics, Physics, Chemistry, and Biology have to choose Stream SB while appearing for KVPY Exam. For more details, you can visit the AAYAAM academy website, they provide offline and online classes for KYPY. They also provide quality mocks at a reasonable price. All the best! ",
            "date": "Answered April 26, 2020",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Swetha Srinivasan",
                "href": "/profile/Swetha-Srinivasan-26"
            },
            "answer_text": "Well, it's designed to test your science concepts. There's no fixed syllabus but is based on 11th and 12th concepts. The first level exam is to filter out some of the smart minds. Those who clear a particular cut off are through to round two which is the interview. It is this aspect that interested me as here, the true capacity can be tested. The questions may be simple or tough, and along with the ability to answer correctly, one must possess confidence and a good body language. Overall, I personally feel that Kvpy is one of the few exams at high school level that tests multiple aspects of a person and not just bookish knowledge. ",
            "date": "Answered June 14, 2017",
            "views": "988",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anitha Srinivasan",
                    "user_href": "/profile/Anitha-Srinivasan-16"
                },
                {
                    "user_id": "Sanidhya Sharma",
                    "user_href": "/profile/Sanidhya-Sharma-27"
                },
                {
                    "user_id": "Ayush Barnwal",
                    "user_href": "/profile/Ayush-Barnwal-1"
                }
            ]
        }
    ]
}