{
    "title": "What is cardiovascular technology degree about (BSc)? - Quora",
    "tags": [
        "Bachelor of Science Degrees",
        "Technology",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "R.Logesh Waran",
                "href": "/profile/R-Logesh-Waran"
            },
            "answer_text": "B. Sc. Cardio Vascular Technology (CVT) is an Undergraduate programme in which they teach about management of various cardiac disorders includes complex diagnostic and therapeutic procedures, which involve use of various equipments, computer hardware, tools, machines, and pharmacological agents. Handling of these equipments and tools as well as their regular maintenance requires advanced and focused knowledge of the scientific principles on which the tests and equipments function, as well as to have hands-on skill in using these equipments correctly and safely. The personnel who carry out these responsibilities also must have adequate knowledge of structure and function of the human body, especially the cardiovascular system. Optimal delivery of cardiovascular health care is based on the safe use of the equipments and devices. This necessitates development of a cadre consisting of science graduates, who obtain focused, relevant knowledge in this specific area of cardiovascular technology through theory classes and supervised practical hands on training. The graduate program in Cardiovascular Technology consists of three years of clinical faculty supervised theoretic learning and practical hands-on training. This enables the student to apply specialized occupational theory, skills and concepts. At the end of three years the candidates will have to pass the University examination to be eligible for the bachelor degree. Upon completion of the 3-year course and one year internship the candidates will evolve into a full trained, qualified cardiovascular technologist capable of working independently. ",
            "date": "Answered February 20, 2017",
            "views": "54",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sahil Kumar",
                    "user_href": "/profile/Sahil-Kumar-3570"
                },
                {
                    "user_id": "Aparna Kamath",
                    "user_href": "/profile/Aparna-Kamath-21"
                },
                {
                    "user_id": "Vinod Nair",
                    "user_href": "/profile/Vinod-Nair-94"
                },
                {
                    "user_id": "Yashna Bajaj",
                    "user_href": "/profile/Yashna-Bajaj"
                },
                {
                    "user_id": "Selvaganesh S",
                    "user_href": "/profile/Selvaganesh-S-1"
                },
                {
                    "user_id": "Samina Zehra",
                    "user_href": "/profile/Samina-Zehra-1"
                },
                {
                    "user_id": "Gaba Sourabh",
                    "user_href": "/profile/Gaba-Sourabh"
                },
                {
                    "user_id": "Pinky Goswami",
                    "user_href": "/profile/Pinky-Goswami-2"
                }
            ]
        }
    ]
}