{
    "title": "What are some good, innovative classroom designs? - Quora",
    "tags": [
        "Instructional Design",
        "Design Thinking",
        "Teaching Methods",
        "Classrooms",
        "Product Design of Physical Goods",
        "Educational Technology",
        "Innovation",
        "Teaching",
        "Design"
    ],
    "response": [
        {
            "author_info": {
                "name": "Josephine Misson",
                "href": "/profile/Josephine-Misson"
            },
            "answer_text": "I think that it’s about shaking the rythme of classroom and making the learning and teaching experience more fun for both the teacher and the students. I think a really smart way to innovate in class is to make the learners become more active during the class by asking them questions regarding the content at strategical moments to which they answer on their phones. That’s a great way to incorporate technology, connect with them in a way that speaks to them and make them more active in the learning process, plus you’ll transform distracting tools and turn them to the benefit of education! Here are different ways to break the usual old school set of classroom and turn into something more dynamic and participative ! 1. Break the ice to attract attention  An icebreaker is a great way to start your presentation in a fun way, because it introduces interactivity in low-energy environments. Icebreakers are often used to help people get to know each other without direct interaction. In this case, they facilitate the introduction of a subject through personal reflection. Wooclap’s Word clouds are an effective way to start a discussion and push your audience to become engaged from the very start. Students just use the tools (smartphones, tablets, computers) at their disposal to answer inquiries, and those answers are displayed in real time to give everyone, including you, a good idea of the opinions shared throughout the audience. 2. Incorporate audience feedback via open questions into your presentation  Open questions open up a dialogue between the speaker and his/her audience. Because people answer through their phones — and not in person — they are free to leave honest feedback without public scrutiny. In addition, Wooclap gives you the option to identify participants or to allows anonymous participation. 3. Use quizzes to build anticipation  Quizzing the audience before or after a key point in your presentation is a great way to capture their attention and focus and gauge their understanding. It also helps transform spontaneous ideas into long term knowledge. Results can be displayed or hidden — the choice is up to you. Wait until the opportune moment to reveal everyone’s answers and draw their attention to your explanations. This delay keeps participants focused on your message, and the increased suspense counteracts any short attention spans. So, invite your audience to take a seat, but they will only need the edge. 4. Videos give you a chance to catch your breath Add Youtube, Vimeo, and other videos to your presentation, to give yourself, as well as the audience, a break. Including a video in your presentation changes its flow and allows people to relax before focusing again. In addition, visual stimuli are a great way to relay information and increase retention. 5. Make feedback a two-way street  Wooclap allows audience interaction even after your PowerPoint ends, by creating a report containing the results, exported either in PDF or Excel format. Share this report with your audience, online or as a printed version. For public speakers, these reports offer valuable insight into how t hey can improve the content of their presentation, while simultaneously giving the audience an idea of what they have learned. 6. Turn presentations into a competition  Create an unforgettable PowerPoint experience with live, interactive polls in a competition powered by Wooclap. Offer your audience a sensational experience and display a ranking of the top 5 participants. Wooclap’s competition mode stimulates participation and makes your presentations even livelier. ",
            "date": "Answered May 24, 2019",
            "views": "146",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gauthier Lebbe",
                    "user_href": "/profile/Gauthier-Lebbe"
                }
            ]
        }
    ]
}