{
    "title": "What are the best reference books for Biology class 11? - Quora",
    "tags": [
        "Reference Books",
        "Class 11th in India",
        "Biology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Raman Negi",
                "href": "/profile/Raman-Negi-1"
            },
            "answer_text": "As a novice learner you would always want to start from a basics. So it is mandatory to follow the books which has easy language and diagrams with complete illustration to make concepts easy to understand. So here are some books you should start studying to make your concepts strong. NCERT Biology: Best study material to understand the basics of Biology with effective illustration of topics.Trueman’s Biology: It is really helpful to prepare yourself for Medical entrance also helpful to understand the concepts of biologyPradeep’s Biology: This book is helpful for basics and will help you to prepare for Medical entrance exams as it has good study materials/contents for competitive exams.Rapid Biology: This book is really helpful for those who want to check their concepts understanding and how good they do understand the subjects.If you could afford this book it is the best book you can study Campbell Biology Buy Campbell Biology Book Online at Low Prices in India Although it is not recommended for beginners but if you really want to master the subject you should follow this book. Still I would suggest NCERT has best study materials for beginners. ",
            "date": "Answered August 15, 2016",
            "views": "34",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anuj Varanasi",
                    "user_href": "/profile/Anuj-Varanasi"
                },
                {
                    "user_id": "Ishita Mandal",
                    "user_href": "/profile/Ishita-Mandal-38"
                },
                {
                    "user_id": "Tae Vish",
                    "user_href": "/profile/Tae-Vish"
                },
                {
                    "user_id": "Mohini Jadhav",
                    "user_href": "/profile/Mohini-Jadhav-22"
                },
                {
                    "user_id": "Anitha Sathish",
                    "user_href": "/profile/Anitha-Sathish-10"
                },
                {
                    "user_id": "Domestic Wild",
                    "user_href": "/profile/Domestic-Wild"
                },
                {
                    "user_id": "Zoology Seramporecollege",
                    "user_href": "/profile/Zoology-Seramporecollege"
                },
                {
                    "user_id": "NIHARIKA SHARMA",
                    "user_href": "/profile/NIHARIKA-SHARMA-211"
                },
                {
                    "user_id": "Sushil Tiwari",
                    "user_href": "/profile/Sushil-Tiwari-111"
                },
                {
                    "user_id": "Shreya Purohit",
                    "user_href": "/profile/Shreya-Purohit-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanchita Rath",
                "href": "/profile/Sanchita-Rath-2"
            },
            "answer_text": "Biology mostly is a straight subject- you won’t get twisted questions here and answers to most of the questions depends upon how perfect your memory is. For class 11, I will suggest NCERT textbook as the best. If you are thoroughly prepared NCERT, most of your annual exam preparation is done. Go through all the exercise questions and NCERT exemplar questions and most of your problems are solved. You can also refer to sample papers, like All in One( from Arihant Publications), or Xam idea for extra questions for practice. For reference, there are books like Elementary Biology ( by KN Bhatia and MP Tyagi; Trueman Publications) is a good book. It will prepare you for annual exams and medical entrance tests. It has some additional concepts and you may require the help of your teacher for better understanding. Still, you need to be clear on NCERT concepts for performing best in biology. So go through your textbook first before moving on to the others. ",
            "date": "Answered May 10, 2018",
            "views": "75",
            "upvotes": "0"
        }
    ]
}