{
    "title": "What is something you learned from another person that you didn't think had anything to teach you? - Quora",
    "tags": [
        "Interpersonal Interaction Advice",
        "Personal Experiences",
        "Learning",
        "Important Life Lessons",
        "Experiences in Life",
        "Interpersonal Interaction",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Somit Anand Sinha",
                "href": "/profile/Somit-Anand-Sinha-1"
            },
            "answer_text": "Curious ...very Curious well the greatest and the only thing taught to me by the person whom I thought had nothing to teach me is that loneliness can be beaten up in the most hard times too if and only if we choose to be consistent in LIFE .....well I was taught that Loneliness is just an ILLUSION that can be removed by your waters of curiousity !!!!! ",
            "date": "Answered April 30, 2016",
            "views": "552",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Project Jenni",
                "href": "/profile/Project-Jenni"
            },
            "answer_text": "I learned humility, possibly the most valuable lesson of my life thus far (its only competition being forgiveness), from a stranger with the worst speech impediment I have ever encountered. This man was brave enough to approach me in an online dating forum. He was attractive, intelligent and charismatic. I liked him. I invited him for coffee. He was late. Very very late. Yet he kept texting insisting he would be there soon. I suffer from often crippling anxiety and panic attacks. I knew there was something similar happening to this guy and he was really fighting to show up. So I waited. Finally he arrived. He was shaking with trepidation. His cheeks were crimson and his ears were burning hot. I smiled, a genuine and concerned smile, and spoke first. “It’s alright, I have anxiety that is really debilitating at times. Is that what’s happened to you too?” Then immediately I understood. As his words failed him, time and time again, and I watched the anguish in his eyes while he fought a war within….just…to….speak….I was honoured. I was proud. I was amazed and overwhelmed and so very very humbled. He fought that battle for me. He didn’t even know me. I take my words for granted. When I cannot show up, I can communicate exactly why, every emotion with grace and nuance and poise. My words are my most effective and dangerous weapon. They are my salvation. And a man who could not speak his truth spoke it ever so clearly to me that day. How brave. How brilliant and honest and brutal and brave. I am humbled to know you. I strive to be more like you. You have inspired me to do and be and try. Thank you. We all have battles to fight and mountains to climb. We all have the opportunity to be humble and kind. ",
            "date": "Answered August 18, 2018",
            "views": "12",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jilly Murphy",
                    "user_href": "/profile/Jilly-Murphy"
                },
                {
                    "user_id": "Keith Katane",
                    "user_href": "/profile/Keith-Katane"
                },
                {
                    "user_id": "Dave Thompson",
                    "user_href": "/profile/Dave-Thompson-84"
                },
                {
                    "user_id": "Abdur Rehman Zahid",
                    "user_href": "/profile/Abdur-Rehman-Zahid"
                },
                {
                    "user_id": "Garrett Schmid",
                    "user_href": "/profile/Garrett-Schmid-2"
                },
                {
                    "user_id": "Jan Fargo",
                    "user_href": "/profile/Jan-Fargo-1"
                }
            ]
        }
    ]
}