{
    "title": "What do I need to study to become an astronaut? - Quora",
    "tags": [
        "Astronaut Selection",
        "Astronauts",
        "Space Travel",
        "Outer Space",
        "Astronomy",
        "Studying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Stagliano",
                "href": "/profile/Tom-Stagliano"
            },
            "answer_text": "Given that it is Thirty times easier to be admitted as a freshman at Harvard than it is to become an US astronaut, here is my stock answer:  Several of my professors were astronauts  and my roommate freshman year in college (MIT) became an astronaut.   He was a junior physics major.     There are two paths to becoming an astronaut: Become an US military pilot, and the best and safest pilot you can be.  Then become a test pilot and eventually a squadron commander.  Always have glowing recommendations from your superior officers.Get a PhD in a subject that will be necessary in which to perform research in space, or to assist in building a new space station, or a space colony.    My roommate got his PhD in EE and Lasers    e.g. there has to be a Reason for NASA to send you into space.     Of course you will be a perfect physical specimen (my roommate got his Black Belt in Karate.)     One of my professors increased his  chance to become an astronaut by volunteering to conduct research in Antarctica for One Year.  Nothing like a Winter isolated in Antarctica to prove you have the \"Right Stuff\".....     Also, an astronaut is an explorer, and as an explorer you should be prepared to die.   My college roommate perished on Challenger.......     All the best. ",
            "date": "Answered February 14, 2015",
            "views": "373",
            "upvotes": " View 221 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Batchu Thrishna",
                    "user_href": "/profile/Batchu-Thrishna"
                },
                {
                    "user_id": "Dmitry Kiourtzidis",
                    "user_href": "/profile/Dmitry-Kiourtzidis"
                },
                {
                    "user_id": "Jackson Oliver",
                    "user_href": "/profile/Jackson-Oliver-6"
                },
                {
                    "user_id": "Thendral Kamal",
                    "user_href": "/profile/Thendral-Kamal"
                },
                {
                    "user_id": "Carol Ronny",
                    "user_href": "/profile/Carol-Ronny"
                },
                {
                    "user_id": "Amal Raashid",
                    "user_href": "/profile/Amal-Raashid"
                },
                {
                    "user_id": "Michelle Ongkingco",
                    "user_href": "/profile/Michelle-Ongkingco"
                },
                {
                    "user_id": "Moses T Njovana",
                    "user_href": "/profile/Moses-T-Njovana"
                },
                {
                    "user_id": "Fernando Conceção",
                    "user_href": "/profile/Fernando-Conceção"
                },
                {
                    "user_id": "Mishma Raju",
                    "user_href": "/profile/Mishma-Raju"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Fraser",
                "href": "/profile/Jack-Fraser-11"
            },
            "answer_text": "To be an astronaut, you need to follow one of two fairly similar paths: Path 1Be a damned good member of the armed forces - fighter pilot, helicopter pilot and so on.Preferably have a background in science or engineeringSpend 10 years in the armed forcesApply to NASA/ESAPath 2Get a PhD, become one of the best scientists in your fieldMake your field relevant to going into spaceSpend 10 years in your fieldApply to make our field the one they want to spend all the money onGo into spaceAs you can see - you don't become an astronaut first. You do something useful, and then become an astronaut. If you're only doing what you have to do first to get into space, then you'll probably hate it. Don't aim to to go space. Aim to do something incredible in science - going into space is a bonus on top of that. ",
            "date": "Answered July 21, 2016",
            "views": "106",
            "upvotes": " View 63 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shams Rothee",
                    "user_href": "/profile/Shams-Rothee"
                },
                {
                    "user_id": "Fernando Conceção",
                    "user_href": "/profile/Fernando-Conceção"
                },
                {
                    "user_id": "Milena Jure",
                    "user_href": "/profile/Milena-Jure"
                },
                {
                    "user_id": "Srihan Misra",
                    "user_href": "/profile/Srihan-Misra"
                },
                {
                    "user_id": "Ha Trinh",
                    "user_href": "/profile/Ha-Trinh-23"
                },
                {
                    "user_id": "Ben Bizman",
                    "user_href": "/profile/Ben-Bizman-2"
                },
                {
                    "user_id": "Aastha Aakriti",
                    "user_href": "/profile/Aastha-Aakriti"
                },
                {
                    "user_id": "Karthik Mukund",
                    "user_href": "/profile/Karthik-Mukund-5"
                },
                {
                    "user_id": "Aaron Hyde",
                    "user_href": "/profile/Aaron-Hyde-12"
                },
                {
                    "user_id": "Melany Evangelista",
                    "user_href": "/profile/Melany-Evangelista-1"
                }
            ]
        }
    ]
}