{
    "title": "What do you think about BASLP? - Quora",
    "tags": [
        "Bachelors in Audiology and Speech Language Pathology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vilashini Manivannan",
                "href": "/profile/Vilashini-Manivannan"
            },
            "answer_text": "Well, I'm an Audiologist and Speech pathologist, so of course I think it's an amazing course. It lets me work as an separate health care professional individually from the Bachelors degree itself and I see that's a boon in many ways. India, being a developing country, needs more professionals in this field and thus private practice is much needed, extending way more into rural places than just urban. Hence it gives you an opportunity to also be a part of community rehabilitation where one gets to organize camps and increase people's awareness on the various services you could provide them with. Though it's better recognized now than earlier, people still go seek the help of an ENT for reduced hearing and a general physician for any speech related problems. Services of rehabilitation are still unknown to many except maybe Physiotherapy. So, there is plenty of amazing opportunities to BASLP degree holder. ",
            "date": "Answered July 1, 2018",
            "views": "54",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Prithvi singh",
                    "user_href": "/profile/Prithvi-singh-153"
                },
                {
                    "user_id": "Udit Kumar",
                    "user_href": "/profile/Udit-Kumar-142"
                },
                {
                    "user_id": "Abhinab Sharma",
                    "user_href": "/profile/Abhinab-Sharma-10"
                },
                {
                    "user_id": "Sonal Priya",
                    "user_href": "/profile/Sonal-Priya-11"
                },
                {
                    "user_id": "K and D Joshi",
                    "user_href": "/profile/K-and-D-Joshi"
                },
                {
                    "user_id": "Veena Santosh",
                    "user_href": "/profile/Veena-Santosh-11"
                },
                {
                    "user_id": "Mehshad Qamar",
                    "user_href": "/profile/Mehshad-Qamar"
                },
                {
                    "user_id": "Jemitta Jery",
                    "user_href": "/profile/Jemitta-Jery"
                },
                {
                    "user_id": "Hozaifa Arshad",
                    "user_href": "/profile/Hozaifa-Arshad-1"
                },
                {
                    "user_id": "Falak Ansari",
                    "user_href": "/profile/Falak-Ansari-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "A Human Being",
                "href": "/profile/A-Human-Being-50"
            },
            "answer_text": "Hey there, BASLP is a promising field, which deals with identification and rehabilitation of persons with communication disorders. Equipments do accompany, but human skills value the most. You can work wonders, bring about changes in many lives.This field try to focus on inclusion of people with disabilities (speech,language, hearing impairments) into the general population in almost all activities, revealing the amazing capabilities of human beings. You are called as an Audiologist or a Speech Language Pathologist or both. You have immense opportunities as a graduate or as a post graduate. This is one such area, which requires a vast research in it's various domains, so PhD is another option. You work in collaboration with Physiotherapists, Pediatricians, Psychologists, ENT Doctors, Special Educators etc. Your team members vary in accordance with the diagnosis made. Do opt BASLP, if you are interested in rehabilitating people with communication disorders as well as hearing impairments. ",
            "date": "Answered April 26, 2020",
            "views": "982",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "K and D Joshi",
                    "user_href": "/profile/K-and-D-Joshi"
                },
                {
                    "user_id": "Veena Santosh",
                    "user_href": "/profile/Veena-Santosh-11"
                },
                {
                    "user_id": "Nibedita Ghosh",
                    "user_href": "/profile/Nibedita-Ghosh-33"
                },
                {
                    "user_id": "Mehshad Qamar",
                    "user_href": "/profile/Mehshad-Qamar"
                }
            ]
        }
    ]
}