{
    "title": "What are the batches of vibrant academy? From best to worst for class 11 studying students. - Quora",
    "tags": [
        "Vibrant Academy",
        "Class 11th in India",
        "Studying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shivam Dubey",
                "href": "/profile/Shivam-Dubey-218"
            },
            "answer_text": "I am a current student of Class XI in vibrant academy. Class XI runs in two courses, i.e. Micro Course and Nano course out of which Nano course begins later than the micro. Micro consists of around 80% of the class XI students. So I am going to talk about that. The course is divided into 4 houses- E, N, R and G. There are 5 batches in every house like for E: E1, E2, E3, E4 and E5. Similarly for the others.  E1, N1, R1 and G1 are considered as same level of batch. Similarly for the 2,3,4 and 5. For every house the 1 batch is the topmost house batch and 5 is the worst. One of the subject teachers for the 1 batch is an HOD which is different for every house.  From each house the students performing the best and being in the top 30~40 in their respective houses are combined together to make different batches that are the P batches which are all under the HODs and it consists of P1 and P2 which have a batch strength lower than the house batches. But it does not matter to a great extent as if to which batch you belong. The house batches get equally good teachers and the batches are assigned solely on the Periodical tests that are held. What really matters is how good you are with the concepts and questions. All the Best! :) ",
            "date": "Answered January 11, 2016",
            "views": "89",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shivam Dubey",
                    "user_href": "/profile/Shivam-Dubey-218"
                },
                {
                    "user_id": "Hardik Agrawal",
                    "user_href": "/profile/Hardik-Agrawal-67"
                },
                {
                    "user_id": "Sanjay Bhartiya",
                    "user_href": "/profile/Sanjay-Bhartiya-9"
                },
                {
                    "user_id": "Ishan Deb",
                    "user_href": "/profile/Ishan-Deb-6"
                },
                {
                    "user_id": "Ruby Kumari",
                    "user_href": "/profile/Ruby-Kumari-211"
                },
                {
                    "user_id": "Arunabh Bh",
                    "user_href": "/profile/Arunabh-Bh"
                },
                {
                    "user_id": "Raja Kumar",
                    "user_href": "/profile/Raja-Kumar-928"
                },
                {
                    "user_id": "Ankit Kumar Singh",
                    "user_href": "/profile/Ankit-Kumar-Singh-25"
                },
                {
                    "user_id": "Shaban Mallick",
                    "user_href": "/profile/Shaban-Mallick"
                },
                {
                    "user_id": "Chandra Kishan Srivastava",
                    "user_href": "/profile/Chandra-Kishan-Srivastava"
                }
            ]
        },
        {
            "author_info": {
                "name": "Salil",
                "href": "/profile/Salil-3"
            },
            "answer_text": " There are two courses namely micro and nanoIn micro:p1* (if there is one) > p1 > p2/ Then there are four houses (ENGR.) which are further subdivided into 4 or 5 batches each.In them E1~N1~ G1~R1 >>>> E5~N5~ G5~R5Obviously, 1 batches are the best and 5 are the worst.You can move up and down in your house every two months when the batches are shuffled.Also for every test there are two ranks. The cumulative which is of the house and the vibrant rank which all children giving the exam are considered.To go to p batches you’re Vibrant cuml. rank (THAT YOU CAN GET ONLY AT THE RECEPTION) must be in 165. All the best :) ",
            "date": "Answered May 7, 2017",
            "views": "42",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arunabh Bh",
                    "user_href": "/profile/Arunabh-Bh"
                },
                {
                    "user_id": "Surekha Gupta",
                    "user_href": "/profile/Surekha-Gupta-9"
                },
                {
                    "user_id": "Someone",
                    "user_href": "/profile/Someone-1019"
                },
                {
                    "user_id": "Harsh Raj",
                    "user_href": "/profile/Harsh-Raj-271"
                }
            ]
        }
    ]
}