{
    "title": "What is 'American exceptionalism'? - Quora",
    "tags": [
        "American Exceptionalism",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Jones",
                "href": "/profile/Bob-Jones-1151"
            },
            "answer_text": "It might be easier to describe what is not “American exceptionalism” first. It is not that US citizens are morally or intellectually superior to others.It is not that America has always lived up to its ideals.It is not that America has treated all its citizens as equals.It is not because we are the most powerful country in the world.It is certainly not because America is without fault. Far from it.American exceptionalism (if there is such a thing since what is exceptional is shared by many people and countries today.) is about establishing the first government in the world based upon the right of all its citizens to live free. Life, liberty, and the pursuit of happiness are the fundamentals of our founding. That was exceptional in 1776 and it has continued to be an exceptional ideal to follow to this day. This has of course led to other exceptional things. Those ideals created the worlds largest and most prosperous economy. Those ideals created the intellectual climate that gave the US more Nobel Prize Winners than the next 3, the UK, Germany, and France combined. Those ideals gave us the wisdom to help rebuild our enemies from WWII and help them secure the blessings of living in a free country. We don’t always live up to our ideals. We failed miserably in our use of slaves. We treated women as second class citizens for well over a century. I could go on but others I am sure can enumerate our failing better than I can. That said American exceptionalism as embodied in the ideals of our founders was the culmination of thought from many peoples, many cultures, and many countries around the world. It did not originate as whole cloth. We have many to thank for these ideals. I would say that American exceptionalism is now embodied in the 45% of the world where freedom flourishes. It is still a minority of the worlds population and it is still as exceptional as it was on the day of our founding. Some of these countries have likely surpassed us in exhibiting some of the principles of our founders. That too has been part of American exceptionalism. I take both pride and shame in our history but I have nothing but respect and admiration for the exceptional ideals upon which this country was founded. ",
            "date": "Updated August 21, 2020",
            "views": "405",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aki Bjornsson",
                    "user_href": "/profile/Aki-Bjornsson"
                },
                {
                    "user_id": "David S. Livingstone",
                    "user_href": "/profile/David-S-Livingstone"
                },
                {
                    "user_id": "Helen Pawlirzyn",
                    "user_href": "/profile/Helen-Pawlirzyn"
                },
                {
                    "user_id": "Michael Walsh",
                    "user_href": "/profile/Michael-Walsh-549"
                },
                {
                    "user_id": "Philippe Eyraud",
                    "user_href": "/profile/Philippe-Eyraud"
                }
            ]
        },
        {
            "author_info": {
                "name": "Howard C. Berkowitz",
                "href": "/profile/Howard-C-Berkowitz"
            },
            "answer_text": "Originally, the term was brought into use by Alexis de Toqueville. Here’s an article of mine on it: American exceptionalism To that article (I don’t contribute to Citizendium any longer), I’d add, as background, the 1630 sermon by John Wintrop, as he came to be governor of the Massachusett’s Bay Colony: Descendants of the Great Migration. This was formally called “A Model of Christian Charity”, but more commonly known as the “City on a Hill” speech. That’s not to suggest that the United States is a Christian country. The model expressed, however, is not one of domination, but one suggesting that others watch what we do and choose to emulate it. Unfortunately, as Richard Haven suggests, it has become associated with aggressive nationalism. Another assessment: Winston Churchill once gave vivid evidence to the difference between a national identity rooted in history and one defined by ideology in objecting to a proposal in 1940 to outlaw the anti-war Communist Party. In a speech in the House of Commons, Churchill said that as far as he knew, the Communist Party was composed of Englishmen and he did not fear an Englishman. In Europe, nationality is related to community, and thus one cannot become un-English or un-Swedish. Being an American, however, is an ideological commitment. It is not a matter of birth. Those who reject American values are un-American. I might add my favorite definition of patriotism, from Carl Schurz, a refugee revolutionary from Germany, who subsequently served as a Civil War general, Ambassador to Sweden, Secretary of the Interior, Senator from New York, and one of the founders of the Republican Party: “I confidently trust that the American people will prove themselves … too wise not to detect the false pride or the dangerous ambitions or the selfish schemes which so often hide themselves under that deceptive cry of mock patriotism: \"Our country, right or wrong!\" They will not fail to recognize that our dignity, our free institutions and the peace and welfare of this and coming generations of Americans will be secure only as we cling to the watchword of true patriotism: \"Our country — when right to be kept right; when wrong to be put right.\" ",
            "date": "Answered November 14, 2016",
            "views": "12",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aki Bjornsson",
                    "user_href": "/profile/Aki-Bjornsson"
                },
                {
                    "user_id": "Brian Mbogo",
                    "user_href": "/profile/Brian-Mbogo-1"
                },
                {
                    "user_id": "David S. Livingstone",
                    "user_href": "/profile/David-S-Livingstone"
                },
                {
                    "user_id": "Philippe Eyraud",
                    "user_href": "/profile/Philippe-Eyraud"
                },
                {
                    "user_id": "Tony Sangster",
                    "user_href": "/profile/Tony-Sangster"
                },
                {
                    "user_id": "Charlie Taylor",
                    "user_href": "/profile/Charlie-Taylor-26"
                },
                {
                    "user_id": "Craig Simons",
                    "user_href": "/profile/Craig-Simons-7"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Iam-Noone-23"
                },
                {
                    "user_id": "Caroline Glass",
                    "user_href": "/profile/Caroline-Glass-2"
                },
                {
                    "user_id": "Tony Li",
                    "user_href": "/profile/Tony-Li-19"
                }
            ]
        }
    ]
}