{
    "title": "What is edX, and also what is mean by a verified certificate? - Quora",
    "tags": [
        "edX"
    ],
    "response": [
        {
            "author_info": {
                "name": "Prasanth Thangavel",
                "href": "/profile/Prasanth-Thangavel"
            },
            "answer_text": "edX Story (extract from edX website): Our Story Founded by Harvard University and MIT in 2012, edX is an online learning destination and MOOC provider, offering high-quality courses from the world’s best universities and institutions to learners everywhere. With more than 90 global partners, we are proud to count the world’s leading universities, nonprofits, and institutions as our members. EdX university members top the QS World University Rankings® with our founders receiving the top honors, and edX partner institutions ranking highly on the full list.  What is a verified certificate (extract from edX website) A verified certificate shows that you have successfully completed your edX course and verified your identity using your webcam and your government-issued photo ID. Verified certificates are available for a fee that varies by course. Many students use verified certificates to apply for jobs and university admissions. You can learn more on our verified certificate page.   Personally, this is one of the best educational affirm I have encountered in my life and I am greatly benefited and thankful to the edX community. Equivalent platform of edX is ‘'Coursera’ Reference: About Us What is a verified certificate? ",
            "date": "Answered August 15, 2017",
            "views": "2",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akshaya Venkat",
                    "user_href": "/profile/Akshaya-Venkat-13"
                },
                {
                    "user_id": "Elambharathi Thangavel",
                    "user_href": "/profile/Elambharathi-Thangavel-1"
                },
                {
                    "user_id": "Keerthi Ganesh",
                    "user_href": "/profile/Keerthi-Ganesh-13"
                }
            ]
        }
    ]
}