{
    "title": "What measures should be taken to improve India's education system? - Quora",
    "tags": [
        "Education Reform in India",
        "Education Reform",
        "Educational Systems",
        "Education in India",
        "Teachers",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Himanshu Pal",
                "href": "/profile/Himanshu-Pal-329"
            },
            "answer_text": "Here are some reforms that India should consider. Autonomous Institution ReformsMeasuresPrivatisation of old IITS and IIMS and old Universities like JNU, DU.Give full autonomy on raising funds, investing or starting up startups, education fees, course structure, hiring and enrolment foreign students and professors etc.Do not do abruptly give them a year or two to prepare and execute this plan.They should be charging government high fees on govt based research and should be allowed to take on research projects from private companies.Divert funds previously given to old ones to new ones.Direct benefit transfer of education subsidies to meritorious and poor students.ImpactGiving them full autonomy will fasten their decision making.They will be forced to do market based research.Since government will be controlling fee structure in new institutes they won’t be charging high fees because otherwise people will go to new institutes and they will not get talent.Since the subsidy is transferred directly to student this will stop leakage of education funds and student will be able to make choice on how to use this subsidy.Scholarships ReformsMeasuresCombine all the scholarship funds private or public to oneProvide a single online platform for applying for scholarshipsThis single fund should be open so that people can also contribute and corporates can also give donations if they want.Govt funding institutes should put condition on students ff they are placed they should sponsor tuition fees of at least 1 student. They can do it any time but within a span of 5 years.Govt should open a scholarship to provide funds to study abroad with the condition that they come back and work in India for 5 years. With a mandatory employment in government sector for 1 year.ImpactCurrently people do not know about the various scholarships. Giving them a single portal and single evaluation criteria will help them to apply.This will stop brain drain and force people to come back to India and improve our talent pool.Working for government will ensure they will bring new ideas and improve govt’s efficiency.R&D Reforms in educational institutesMeasuresCurrently research is conducted in isolation in India. Different colleges conducting same research and some doing research in areas which are already explored. There should be a single online platform for research where all research projects should be archived and published each year.In this online platform private corporates should also be involved by allowing to them to submit ideas and funding.This online platform should be like a social network where researchers can ask questions to any professors in India.Working professionals in corporates should be encouraged to join as mentor in corporate funded research projectsStudents should be given option to collaborate with other students and professors across universities.1 year Research should be made mandatory in undergraduate level.Each year there should be a competition and government should rank research projects across categories and award top 10 research projects.ImpactParticipation by corporates will improve market based research and institutes will not depend only on govt for R&D funding.Single platform will ensure that efforts are combined and not overlapped.This will also improve the research quality since they are being ranked based on some evaluation criteria.Abolish GATE or similar PG examsMeasuresEvery student is aware of his interest up till final year. GATE makes them to revise everything once again , this time could be utilised for enhancing our knowledge in our field of interest. Those interest in higher education should be given a chance in their finally year of under graduation to choose a research topic under any professors supervision and publish papers.Then after one year they will create a SOP(contains papers they have published, achievements, any scientific breakthroughs) and apply to different colleges. The colleges should then be able to select students.Students who require specific labs / tools should be provided access to the lab free of cost. Each student should be able to access other college resources by taking appointments. One can limit the number of times they are allowed to access them.ImpactThis will increase number of papers published and foster a research oriented environment.This will lead to proper utilisation of resources as many times lab equipments are left unused.This will make sure only interested students.School ReformsMeasuresWe should build school infra structure at scale. Give schools a infra status. Schools hostels with capacity for 25k students should be built. They should be built with minimum capacity and minimum expenditure like good toilets, drinking water and internet. This infra should be constructed in high density and outside main cities areas.For equipments Digital labs should be preferred. Experiments which used to require lab equipments can be simulated online.For teachers Remote teaching should be preferred on big and multiple lcd screens with class room of 300 students. Ask good students to help weaker students. Teachers are available but they do not want to go to remote places to teach.Instead of creating own platform for online teaching and assessment do a collaboration with non profit organisations like Edx.There should be separate schools for sports and for academics.Online and home schooling should be legalised. Govt should conduct exams yearly to evaluate what they learnt. For practical experiments they should be allowed to make use of tinkering labs under Atal innovation mission. They should start this in top 10 cities and then spread in other cities.ImpactA minimal infra gets built in small time but a full fledged school with facilities like good sports and labs takes time. We need to increase student enrolment and this will improve access to education for rural people.Giving encouragement to online and home schooling will put less load in current school infra.In general good teachers are not available in rural areas and they do not want to go and teach there. Live classrooms will help students in rural areas to get a level playing field compared to urban areas which have access to good teachers.",
            "date": "Answered May 17, 2020",
            "views": "11",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dhruv Kulkarni",
                    "user_href": "/profile/Dhruv-Kulkarni-9"
                },
                {
                    "user_id": "Nikhil Agrawal",
                    "user_href": "/profile/Nikhil-Agrawal-203"
                },
                {
                    "user_id": "Samuel Patole",
                    "user_href": "/profile/Samuel-Patole-3"
                },
                {
                    "user_id": "Shrestha Dey",
                    "user_href": "/profile/Shrestha-Dey-2"
                },
                {
                    "user_id": "Sahil",
                    "user_href": "/profile/Sahil-428"
                },
                {
                    "user_id": "Deepanshu Verma",
                    "user_href": "/profile/Deepanshu-Verma-217"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geeta Raman",
                "href": "/profile/Geeta-Raman-1"
            },
            "answer_text": "The question does not specify whether reforms are needed in the school system or at the college level. So I am going to focus mainly on the school system. Primary school system Do away completely with rote learning.There should be activity-based teaching.Value education must start here itself. Story telling can help here.There should be outdoor activities, exercise, games, etc. every day.Some of the teaching, especially Science and Social Science can also happen outdoor.Up to 5th grade, there should be no tests or exams.Children should not be burdened with heavy school bags.Each class should not last more than 30 mins.Basics of the regional language must be taught here.Art, craft, music and dance should also form part of the curriculum.Secondary school system Points 1–4 above apply here as well.Children should be involved in group projects.Physics, Chemistry and Biology must be taught with more practical emphasis.Math should be taught in a more interesting way with examples from day-to-day life.Public speaking in the form of debate, speeches, extempore must form part of the curriculum.Reading and writing must happen throughout the year to develop critical thinking skills.One outdoor sport and one indoor sport must be made compulsory.Music and dance could be made optional.The curriculum may include one foreign language besides the national language.Students must be encouraged to volunteer for a worthy cause - at least an hour a week.Field trips and excursions, inter and intra-school sports meet at least once a yearLife skills - time management, yoga, management of finances, exercising caution in the use of social networking sites etc.Only 2 exams - one mid-term and one final.Students must be encouraged to use the library rather than depend on the Internet.Students as well as teachers must never use the mobile phone in the classroom.The academic burden must be reduced.The quality of teaching should be such that children should not have to go for private tuition. Remedial classes must happen within the school itself.I shall add to this when i think of some more relevant points. ",
            "date": "Answered February 1, 2018",
            "views": "366",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jonathan-1170"
                },
                {
                    "user_id": "Ashok Raman",
                    "user_href": "/profile/Ashok-Raman-2"
                },
                {
                    "user_id": "Shobhit Singh",
                    "user_href": "/profile/Shobhit-Singh-192"
                }
            ]
        }
    ]
}