{
    "title": "What will happen if I got caught working using a fake college degree in India? - Quora",
    "tags": [
        "Fake IDs",
        "Hypothetical Scenarios About India",
        "Universities and Colleges in India",
        "Higher Education in India",
        "Colleges and Universities",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Soumyadipta Banerjee",
                "href": "/profile/Soumyadipta-Banerjee"
            },
            "answer_text": "If you have used a fake degree and you get caught, then the following will happen.  You will be placed under suspension and there will be a departmental enquiry put in place.The enquiry will centre around your degree and the officials will get in touch with the university concerned for authentication.Once the university confirms that the degree is false, you will lose your job. Since you lied on your resume and during your interview, you will not be entitled to any severane benefit or any money whatsoever after losing the job.The file will then go to the police and an FIR will be lodged against you. The criminal case will be registered against you at a court of law. The IPC sections that are likely to be invoked against you are 420 IPC and other sections under Fraud, Forgery, Cheating, Criminal Breach of trust etc. The matter will go to court and trial will begin.Meanwhile, you will not get a job anywhere else because there are allegations of fraud against you. When you are proven guilty, the court will sentence you to jail. However, you might not serve jail because you might secure bail. However, the case will drag on for 15-20 years.Twenty years later, you will be a bitter and broken man/woman.  So it is advisable not to lie and present a fake degree to get a job. Now suppose, you have already got a job using a fake degree, what will you do? Here's your best chance… Don't change your job. Once you are in, nobody goes back and checks your degrees (usually). There is no process of checking an employee’s degrees once you have already got a job and confirmed on payroll.Don't hanker for a promotion. In some cases, the HR or Personnel department goes through your qualifications again if you seek a promotion.Immediately enroll for the degree from an open university. So that you can submit the same when you are exposed. In some cases, you might be pardoned if the personnel department is kind and accepts your new degree. This is a 10% chance. In 90% of the cases, you will lose your job. However, if you have faked an engineering or a medical degree then nothing can be done.Please leave your job and start a business or another job. Just get out before you get caught. This is the best and easiest solution.Get a lawyer friend and get to know what to do in case you are caught. Remember, you have done an offence but you are lucky not to get caught.It's never an easy life of you have committed a crime. The feeling of being a sinner and the incessant lies to everybody and yourself eats you from the inside. So just leave the job, say sorry to yourself and get a job with honesty. Start life afresh. Trust me, it's a lot easier on your soul.  Do the right thing before it’s too late. Thanks! ",
            "date": "Answered June 4, 2018",
            "views": "401",
            "upvotes": " View 84 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mirza Faisal Begh",
                    "user_href": "/profile/Mirza-Faisal-Begh"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Parle-G-21"
                },
                {
                    "user_id": "Mayank Thapliyal",
                    "user_href": "/profile/Mayank-Thapliyal-13"
                },
                {
                    "user_id": "Srikar Vytla",
                    "user_href": "/profile/Srikar-Vytla-1"
                },
                {
                    "user_id": "Gayathri",
                    "user_href": "/profile/Gayathri-170"
                },
                {
                    "user_id": "Preeti Reddy",
                    "user_href": "/profile/Preeti-Reddy-18"
                },
                {
                    "user_id": "Roshan Desale",
                    "user_href": "/profile/Roshan-Desale"
                },
                {
                    "user_id": "Uppala Pridhvi",
                    "user_href": "/profile/Uppala-Pridhvi"
                },
                {
                    "user_id": "Henry Ignatius",
                    "user_href": "/profile/Henry-Ignatius-1"
                },
                {
                    "user_id": "Nikhil Jarial",
                    "user_href": "/profile/Nikhil-Jarial-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neena Kumtakar",
                "href": "/profile/Neena-Kumtakar"
            },
            "answer_text": "Many R&AW/CBI/indian intelligence employees have fake degrees including btech 1993 ee from a top college since 2010, and no action is taken , as it is officially allowed by the indian government. The engineer whose resume, including degree has been stolen by the fraud indian intelligence, NTRO employees finds it difficult to get any justice as the government is one of the most corrupt dishonest in the world , the indian mainstream media is full of liars, who do tell the truth, large companies like google, tata are involved ",
            "date": "Updated May 11, 2018",
            "views": "163",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hitesh Soni",
                    "user_href": "/profile/Hitesh-Soni-172"
                },
                {
                    "user_id": "Raj Tekade",
                    "user_href": "/profile/Raj-Tekade"
                },
                {
                    "user_id": "Shankar Madaralli",
                    "user_href": "/profile/Shankar-Madaralli"
                },
                {
                    "user_id": "Sameer Shah",
                    "user_href": "/profile/Sameer-Shah-175"
                },
                {
                    "user_id": "Sahithi Nanda",
                    "user_href": "/profile/Sahithi-Nanda"
                },
                {
                    "user_id": "Jesbin George",
                    "user_href": "/profile/Jesbin-George-1"
                },
                {
                    "user_id": "Subhrodip Sengupta",
                    "user_href": "/profile/Subhrodip-Sengupta"
                },
                {
                    "user_id": "Prashanth",
                    "user_href": "/profile/Prashanth-435"
                },
                {
                    "user_id": "Krunal Maheshwari",
                    "user_href": "/profile/Krunal-Maheshwari"
                },
                {
                    "user_id": "Sivagiri P Surya Prasath",
                    "user_href": "/profile/Sivagiri-P-Surya-Prasath"
                }
            ]
        }
    ]
}