{
    "title": "What should i wear to my high school graduation? - Quora",
    "tags": [
        "High School Graduation Ceremonies",
        "Graduations",
        "High School Education",
        "Women's Fashion and Style",
        "The High School Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nia Sallie",
                "href": "/profile/Nia-Sallie"
            },
            "answer_text": "I live in the U.S., so I hope you do too :) First, check to see if there are any regulations about color or things like that. Next, I would chose a nice summer dress (Something a bit more structured). I saw this year’s graduation, and the dresses tended to look like the ones to follow. White or another bright color would go beautifully with your skin tone. Stores: Tobi, (First order is 50% off!) Lulu’s, Modcloth, Shop Ruche, Nordstrom, local boutiques This white dress below would be pretty with some gold earrings and either wedges (Tan/Neutral colored), nude pumps, or brightly colored pumps. Something you can walk in, though.  Or this skater type of dress:  Or sheath dresses, like this:  Or this:  If you want to be more modest:  For our school, the high school graduation consists of everyone wearing the robe, (So what you wear doesn’t matter until afterwards) and going up to the stage to get their diploma. Afterwards, there was a function at a museum where they ate food, etc. Most people didn’t bring a bag, because they didn’t need to hold anything. I hope you have a great day! ",
            "date": "Answered July 5, 2016",
            "views": "747",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Haley Neal",
                    "user_href": "/profile/Haley-Neal-3"
                },
                {
                    "user_id": "Kenza Yousfi",
                    "user_href": "/profile/Kenza-Yousfi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nidhiramy",
                "href": "/profile/Nidhiramy"
            },
            "answer_text": "Wear a dress which you can be comfortable for the ceremony as well as for the party. So that you can solely enjoy the day. Choose a dress which is up to knee or bit above the knee. So that you don't have to constantly check on them. End of the day, its your choice Congrats on your graduation. ",
            "date": "Answered March 30, 2019",
            "views": "99",
            "upvotes": " Answer requested by Krista Roessle"
        }
    ]
}