{
    "title": "What subjects should be taught in public school that are not already? - Quora",
    "tags": [
        "School Curricula",
        "Core Curriculum",
        "Public Education",
        "Teachers",
        "Society",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hal Vaughan",
                "href": "/profile/Hal-Vaughan-1"
            },
            "answer_text": "What subjects should be taught in public school that are not already? Multiple subjects, including: Critical Thinking: How to understand basic logic and reason. For instance: All dogs have four legs. Fifi has four legs. That does not mean Fifi is a dog. This would also include things like why anecdotal evidence is not a valid proof that something is always true.Propaganda Awareness: A branch of critical thinking. Learn how to evaluate the source of information. Is it fact or opinion or a lie or fiction? Is what is being stated only material to make the source look good? What are the clues in a news report that tells you it’s biased or likely not to be trusted? Why is this politician attacking others the way they’re doing? Learn how to evaluate when something like flat Earth “explanations” are loaded with assumptions and twisted ideas.Religion 101: This includes a touch of critical thinking, again - how to evaluate groups that may be cults. What do they want? What are the signs they are focusing on controlling you or using you for income? But it would include how to figure out when someone pushing religion likely has ulterior motives.Religion 102: Up until now, my suggestions have been about bullshit detection. How to know when people are lying or using poor reasoning to support lies, or using religion as a method of income or control or to hurt others. This would look at religion in terms of understanding that there are many different religious views and we need to understand those with other views are not evil or out to get us.Life Skills: Learn how to shop for groceries and cook healthy meals. Learn what is and is not healthy food. Plan a healthy menu for a week without needing to take hours of research. How to balance your budget and write checks and handle a checking account. How to save up so you can handle it when car repairs are needed suddenly. Housekeeping basics, like keeping the house or apartment in good shape so you don’t get roaches or rats in your home. How to handle doing the laundry and even doing basic sewing to patch up clothes when needed. How to deal with car repairs, negotiate car sales prices, evaluate if a car buy is a good one or if you’re getting taken. Job interview basics and professional behavior in a job.Empathy: How to understand without judging and why judging is more destructive than helpful. Why we need to understand another point of view so we don’t immediately decide someone is disrespectful or stupid or obnoxious because they deal with things differently than we do. Learn how to respect and try to understand other points of view. (And how to deal with views that are just BS, and to address that appropriately.)Basic Self Therapy: General anger management and why it’s bad to just punch out someone because you didn’t like what they said. Learn how to accept when you’re wrong without kicking and screaming. How to realize when you’re wheedling and manipulating or bullying someone and to accept it’s wrong and seek help dealing with whatever is driving that. What do destructive relationships and toxic people look like? How do you avoid such people or get yourself out of a relationship with one?",
            "date": "Answered October 2, 2018",
            "views": "12",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shreyas G",
                    "user_href": "/profile/Shreyas-G-55"
                },
                {
                    "user_id": "Donald Marksberry",
                    "user_href": "/profile/Donald-Marksberry"
                },
                {
                    "user_id": "Melody McLaughlin",
                    "user_href": "/profile/Melody-McLaughlin-1"
                },
                {
                    "user_id": "Harri K. Hiltunen",
                    "user_href": "/profile/Harri-K-Hiltunen"
                },
                {
                    "user_id": "Roxanne Engel Wisniewski",
                    "user_href": "/profile/Roxanne-Engel-Wisniewski"
                },
                {
                    "user_id": "Ben Gabrieli",
                    "user_href": "/profile/Ben-Gabrieli"
                },
                {
                    "user_id": "John Romero",
                    "user_href": "/profile/John-Romero-21"
                },
                {
                    "user_id": "Tymoteusz Kazubski",
                    "user_href": "/profile/Tymoteusz-Kazubski"
                },
                {
                    "user_id": "Joseph Rischbieter",
                    "user_href": "/profile/Joseph-Rischbieter"
                },
                {
                    "user_id": "Sumona Routh",
                    "user_href": "/profile/Sumona-Routh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Paterson",
                "href": "/profile/Daniel-Paterson-16"
            },
            "answer_text": "Let's say there's this girl named Reis. Reis has a 4.0 unweighted GPA and a 5.3 weighted GPA in the top highschool in Texas (for those not affiliated with the U.S GPA system… that's good). The last time she has ever gotten anything late was when she was a 1st year… in preschool. She has also gotten herself involved in a country wide volunteer organisation known as “National Honour Society”, and has gained herself her fair share of 240 volunteer hours. After having score a 1520/1520 on the practice nation entrance exam, the PSAT, and a 1600/1600 on the actual national entrance exam, the SAT, she received a national merit scholarship, as well as a full ride to a school that she always wanted to go to: Harvard. She even became involved in Varsity Tennis, GT Art, full-time band, AP Physics 4 and whatever other advanced class you can state. So, when she graduates, she is given a diploma for all that she learned, she is given praise for being valedictorian, she is just utterly amazing. And yet, the second she gets out of school… …and she settles into an apartment after being in a college dormitory for one year… …she doesn't even know how to cook. Or clean. Or do laundry. She sits there, trying to look back at her textbooks, her notes, her anything! Alas, however, she lacks the skills to even live a basic life. So she sits there, calls her parents, and relies on her parents to do everything. While she's an adult. Maybe if school taught basic life skills, Reis wouldn't be stuck in this situation. But maybe it's the parent's job to do that. Not all parents will do that, though. Sad, but true. Maybe Reis should've taken Home Economics. Sorry, amongst the 150 courses in her High school, Home Economics is not one of them. Plus, even in high schools in which it is offered, not too many students would take it. Maybe Reis should just research on her own. Perhaps. School teaches you how to learn, not just what to learn. She could just research on her own. But would it be better for a teenager to learn life skills before becoming an adult, or becoming an adult with no knowledge of life skills whatsoever, exposing them to possible problems early on? High school decides. Reis' future and the futures of many other teens are in their hands. Edit: Fictional Reis' fictional side is really beginning to show with this answer. To be honest, especially after looking at a decent number of the comments below, Reis would likely be able to stand on her own two feet within the first two days of finally being an individual. Such can be seen with how: School teaches you how to learn, not what to learn. If anything, Reis should be able to research this stuff on her own, especially with the all powerful force that is the internet.Students' schedules are so jammed packed. Taking a class away for a mandatory home economics not only drains a school's budget, but also removes freedom from the schedules of kids in school.To be honest, it may be possible for Reis to have had a week designated at her school to learn basic life skills, but even then, she'd be bored. And those like Reis' older brother Rei with a 2.1 GPA who wouldn't feel motivated to try that hard to research also wouldn't feel compelled to learn from a class. If anything, Reis might be a tad bit confused at first, but she'll get used to it. She'll adapt. ",
            "date": "Updated October 3, 2018",
            "views": "654",
            "upvotes": " View 955 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Drew McCormick",
                    "user_href": "/profile/Drew-McCormick"
                },
                {
                    "user_id": "Kamila Irmukhamedov",
                    "user_href": "/profile/Kamila-Irmukhamedov"
                },
                {
                    "user_id": "Alexander Ross",
                    "user_href": "/profile/Alexander-Ross-85"
                },
                {
                    "user_id": "Belle Lu",
                    "user_href": "/profile/Belle-Lu-3"
                },
                {
                    "user_id": "Francesca Uy",
                    "user_href": "/profile/Francesca-Uy-1"
                },
                {
                    "user_id": "Addy Rogers",
                    "user_href": "/profile/Addy-Rogers-1"
                },
                {
                    "user_id": "Jesalynn Wilkerson",
                    "user_href": "/profile/Jesalynn-Wilkerson"
                },
                {
                    "user_id": "William Gutierrez",
                    "user_href": "/profile/William-Gutierrez-19"
                },
                {
                    "user_id": "Parimal Saraf",
                    "user_href": "/profile/Parimal-Saraf-1"
                },
                {
                    "user_id": "Marcy Buono",
                    "user_href": "/profile/Marcy-Buono"
                }
            ]
        }
    ]
}