{
    "title": "What do the admissions staff at universities never tell future students which they should? - Quora",
    "tags": [
        "Graduate School Admissions",
        "Students"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brett Elkins",
                "href": "/profile/Brett-Elkins-1"
            },
            "answer_text": "If you aren’t at the 75th percentile for grades and sat unless a special admit, first time college student or Family doesn’t speak English at home, you have little chance of getting in without something unique like an sat score much higher to make up for the lower grades or vice verse or a sensational Sat score and amazing extracurriculars They also don’t tell you they have to get people to apply and the admissions people encourage you to apply when you have no chance They also don’t tell you what they really want UCLA wants all As and couldn’t care a less about your activities while Cornell also wants all As but requires a 1570 sat and major leadership. They want to know you’ll take advantage of the clubs and activities Cornell has to offer and it’s a “major” factor to determine if you get in once you met their requisite scores. USC wants close to all As; 1530 SAT score or much higher and some high quality extracurriculars (solid but not ivy-esque). The rest of the incredible (and seriously underrated) UC schools like Berkeley Davis Irvine, San Diego and Santa Barbara etc (they are that good) won’t tell you this, but their stats tell you, as does a California mandate that the top 8% of all students in California for there class must get into one of the UC’s by law, as do the rejected kids I mentor that the Uc Schools care about your grades, first and foremost, and if high enough, they’ll let you in even with a significantly lower ACT score than their 75th percentile. They are grade-a-phobic or grade neurotic or grade myopic places far more than any Ivy but for Cornell. The ivys want high Act 1550 or higher but their paramount decision comes down to having national level activities or what college admissions counselors refer to as a spike that and or coming from pedigree like an elite private feeder school or being a legacy (and a legacy). If you have all As even with a 32 on the Act at any UC, you will have about a 99% chance of getting into every one of the UC school. My niece can attest to this and now attends UCLA with these stats. Unless on the fence, extracurriculars are not a major factor for some of the UC such as UCLA, UC Irvine, UC Santa Barbara. Just look at the 75th percentile to see if you get in and these schools are like a LeBron layup. I mean a slam dunk. My business partners god daughter had one activity soccor in high school and no clubs and got into Irvine, San Diego and Santa Barbara even though her dad said she would never get in with that and a 1450 SAT and 4.3 weighted gpa. He was pretty happy he was wrong. U Texas is one of the best and most fun places to attend in the country and is so hard to get into out of state it’s like applying to an Ivy (and should be higher ranked in all actuality getting no love from the “reports.” But college kids know how great this school is. What they won’t tell here is if your a top student in state it’s pretty easy to get in but out state get on your famed walking boots and get out of town since only 10% or so of out of state kids make the cut. So if you live out of state, it probably makes little sense to apply because if you get in here you’ll likely get into Cornell and other top 20 spots (and still may get rejected here). Usually if you get into Cornell or Texas from outside of Texas most end up choosing Ithaca although Austin is the place kids most would love to live in. Harvey Mudd, CalTech, and MIT love “test score junkies” and want an 800 in math on the SAT (or higher-just kidding) and a 1580 minimum score overall plus some really rocket science type extracurriculars since most kids even Ivy leaguers can’t handle the heat at these hotbeds of world leading scientific research. Most of us including myself would likely fail out here due to the difficulty of their course so they are calculating your mental firepower and you had better have a bazooka to get a shot if you will. These are some of the secrets that college can’t (and won’t) tell you. I hope that helps in some way. College crib notes, you now have, but just like a difficult physics exam, the hard part now is getting these insane stats. Wish you luck. And don’t let anyone in our little secret not that it will really matter at the end of the day as so few can meet these standards but if you do I hope you are seriously proud. You earned it ",
            "date": "Updated December 10, 2019",
            "views": "194",
            "upvotes": " View 36 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Saryu",
                    "user_href": "/profile/Saryu-2"
                },
                {
                    "user_id": "Digital Karma",
                    "user_href": "/profile/Digital-Karma"
                },
                {
                    "user_id": "Anshul Puri",
                    "user_href": "/profile/Anshul-Puri-13"
                },
                {
                    "user_id": "Siddhant Nagpal",
                    "user_href": "/profile/Siddhant-Nagpal"
                },
                {
                    "user_id": "Eva Wilson",
                    "user_href": "/profile/Eva-Wilson-77"
                },
                {
                    "user_id": "Brian Ou",
                    "user_href": "/profile/Brian-Ou-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/T-P-M"
                },
                {
                    "user_id": "Vivek Dixit",
                    "user_href": "/profile/Vivek-Dixit-226"
                },
                {
                    "user_id": "Jieqiu Fan",
                    "user_href": "/profile/Jieqiu-Fan"
                },
                {
                    "user_id": "Danielle Mather",
                    "user_href": "/profile/Danielle-Mather-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted Lehmann",
                "href": "/profile/Ted-Lehmann-2"
            },
            "answer_text": "There really aren’t any real secrets in the admissions business. The process is pretty transparent, and all the “help” you can find on the internet in a varity of spaces. When you bet the store on your SAT’s, GPA, and having participated widely in extra-curricular activities to gain you admission to any particular elite university or college, let alone one of the hallowed Ivy League schools, your betting a long shot. As with most long shots, your betting your future on a likely looser. Sure, you should go ahead and apply to a couple of top notch schools, both to soothe your ego and to take a chance. But you should make sure you study colleges widely, visit as many as you can, and assure yourself that you have sufficient back-ups of different degrees of quality to assure your chances of getting a good education. ",
            "date": "Answered March 10, 2020",
            "views": "106",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ron Leighman",
                    "user_href": "/profile/Ron-Leighman"
                },
                {
                    "user_id": "Anindya Sen",
                    "user_href": "/profile/Anindya-Sen-14"
                }
            ]
        }
    ]
}