{
    "title": "What was the biggest scandal at your high school? - Quora",
    "tags": [
        "Scandals",
        "The High School Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Claire Cutter",
                "href": "/profile/Claire-Cutter"
            },
            "answer_text": "At 17-years old, I had a relationship with a 23-year-old teacher in my high school. And school officials can’t do anything about it… First, a little about me. During high school, I looked like an athletic university student which is rare from where I’m from (A country in South-East Asia). I’ve had flings since I was 12 (nothing sexual, just you and someone being a “thing”) and I was always included in the “cool guys” group. I was very good-looking according to other people because my features was that of a mixed Asian and Caucasian which stands out from the usual. I’m not boasting anything but I just wanted to give context as to how what I’m about to tell you is possible and I know that my looks isn’t as impressive in other countries where my features are pretty common. And I had a weakness with girls who can sing because I was never any good at it. I was enrolled in a Catholic all-boys school which is also one of the best schools in the capital as it produced a lot of technically-inclined graduates who go on to study engineering and become licensed engineers. And much as you’d expect, young female teachers were always ogled by majority of the students. When I was in my second-year of high school, the elementary school section of my school (we basically had pre-school, elementary school, high school, and vocational school all in one huge campus) just hired a new music teacher. She was then probably 22-years old (fresh out of college/university from where I’m from), she was very cute and looked like a student herself as she was petite and shorter than me. Every morning, the whole school had an assembly to sing the national anthem, have our morning prayers, and if any of the school officials had any announcements. All of the students were lined up in their respective classes and the whole area was divided by school level. So we can basically see the other students from elementary, vocational school, and so on. That’s when I first saw her and I was definitely in-love especially when I first heard her sing in one of our school Masses. Fast forward to the end of the school year, we had this huge sports fest where only teachers from all levels are competing and us students are to cheer on our class advisers. While hanging out with my friends in our usual spot, I saw her on her way to the gymnasium and will be passing our area along with the male music teacher for high school (who I’m close with). She was wearing this very cute athletic attire (singlet with sports shorts) which made her look younger because we’re all used to seeing them all in the formal teacher’s uniform (blazer and knee-length skirt or slacks). My friends who knew I had a thing for her dared me to ask for her number, and since I was young and dumb, it wasn’t that hard to gather all the courage to do so. Plus I leveraged my friendship with the male music teacher to introduce me and he did. To be honest, I expected complete rejection… But lo and behold, she gave it to me with a smile. All my friends couldn’t believe it, but I’m sure they were as baffled as I was. At first I didn’t think much of it, thinking she was just probably being nice and all as teachers in our school are cool people to hangout with and are generally very approachable like the male music teacher in my level. So that very evening, I sent her a text message… And she responded! I was able to introduce myself and she was nice enough to entertain me all throughout. As that day was the last day of school, the next day was a Saturday and pretty much just the day to collect our class cards with our grades on it. I asked if she’ll be in campus because I’m coming to pick up my grades. She said she would be and I asked if we could hang out. At that point all I really wanted was to hang out with this very attractive teacher and be friends with her because I was pretty sure I had no chance in hell. After collecting my class cards, I texted her to ask where I can meet her and she was just in the lobby waiting for me. When I arrived, I saw her sitting in one of the benches so I sat next to her. We chatted about some random stuff and since this was back in 2003, smartphones with cameras were not a thing so I brought my own small digital camera to document what I can (more like to have something to brag about to my friends). I asked for a “selfie” and she obliged, leaning to my shoulder as I was tall for my age and as I mentioned, she looked pretty much like a student as well because she was short. In my own thoughts I was celebrating, feeling like I’ve hit the jackpot, so I decided to push my luck and ask her out to a movie. To my surprise, she accepted the offer and we pretty much went on our first date. I of course told her that I’d take care of the costs but since she was the one who had a job she didn’t accept my offer and paid for the both of us. I was in cloud nine then and when we said our goodbyes after dinner, I honestly thought that was it. When I got home, I sent her a text message and she was still very responsive to my surprise. So again, I didn’t quit even though I was ahead so I asked her out again which she never refused unless she was busy or something. This went on throughout the summer vacation, we didn’t really give a crap if people in our school saw us going out as teacher-student relationships were very rare from where I’m from so we were sure they would not think much of it (which in hindsight WAS SO WRONG). How I reasoned it out was the fact that she was not technically MY teacher as she was teaching a different school level so surely people will not think we were dating to get my grades up (which was very naive of me). It was in one of these dates that I decided to be sweet and give her a bouquet of roses which earned me my first kiss from her. When the new school year started, I entered my fourth year (graduating year) in my high school. I hit 17 and she hit 23. There were already some rumblings of my relationship with this teacher but not so much. Other students who hated my guts didn’t spread the rumors as it would boost my ego more and as I mentioned, smartphones with cameras were not yet a fad so there was no proof other than what I had in my small digital camera. It was then that we actually put a label in our relationship and actually started to be cautious about it. If people ask, we would always say that we’re distant relatives hence the closeness. She would allow me to enter the elementary music room during break times when all the students were to stay outside the buildings but still within the campus walls. I was also a Citizen’s Army Training / Reserved Officers Training Corps school officer at the time so I had unrestricted access to the buildings as it was one of our duties to keep watch of the rooms for any student thieves. The music room was beside the elementary library so the librarian would always see me and she’d only smile. I assume she bought the whole “distant relatives” thing. We’d always make out in the far corner of the music room and it was advantageous for us that the windows were tinted heavily from the outside so you can barely see anyone inside if the lights are off. Right before the bell rang, she’d always allow me enough time to go back to my class line or the Citizen’s Army Training / Reserved Officers Training Corps office downstairs before heading back to my classroom. People never asked and it was very easy for me and her to keep it going… Or so we thought. Nearing the end of final school year, the rumors have reached the principal. There were also eyewitness accounts by fellow faculty which weighed a lot more than gossip from students. As we planned, we stuck with our “distant relatives” excuse but the principal was not buying it. I was often sent to the guidance councilor’s office and he’d always say that I can freely tell him what’s going on and he’d never use it against me. I was paranoid as hell of getting kicked-out so as planned, I still said we were related and never once faltered with this excuse. I was so invested in our relationship that I was convinced that she’s the one. I was lucky that the school didn’t reach out to my parents as I’m sure they were afraid for the scandal to break out and tarnish the school reputation. All they can pretty much do was damage control. She told me as well that her superiors were questioning her about it as well as her colleagues, so we agreed to stop meeting in the music room (which for me was hard to accept) and just date outside of the school, but that was pretty much becoming harder as well as the walls were closing in. Even my guy music teacher friend in my level was very disappointed in us but didn’t really know what to do as well as he cannot get around our excuse that we discovered that we were relatives. We had to do everything now in secret, making sure we go to places we were sure nobody would recognize us. Then came our last day of school before my graduation… ALMOST THERE! It was both very fulfilling but still we had to keep a lid on our relationship. The thing was, it was tradition to always have one final school Mass before graduation, and of course they had HER as the music teacher sing some of the songs. There was one song she sang entitled: “I love you” or something which is actually addressed to Jesus but every time she said that, students and teachers would look at me, the former snickering and the latter in disappointment. I didn’t care, I was in-love and I felt like love won. When school was done for the day, she invited me over to her place for the first time. She was staying in her own studio apartment and we both just lay down in her bed, embracing and making out. Mind you, I was actually a virgin at this point. All I’ve done before was up to second base so the whole setup of us being in bed and doing all that turned me on, and I wasn’t alone. She then pulled down her panties and it was my first time actually seeing that female private part in person. She then started to pull down my pants and underwear and told me to relax as she’ll be doing all the work. She didn’t even need to use her mouth as I was stiff from this very first sexual experience I’m having and she was obviously wet. She then proceeded to guide my member into her’s and placed it in. It was my first time being inside a girl so after a few thrusts, I came inside her. Instant regret swept-in and I was suddenly struck with the idea that I may have just impregnated her. I was mortified, being a father at that age was something I never wanted to be as it will make my future very complicated and my parents will definitely kick my ass. I sat back up and told her my fears but she appeased me and told me not to worry about it. She washed herself and I went home right after, still carrying that fear throughout the night. Graduation day in campus… My name got called on the stage, got my diploma, shook the principal’s hand, posed for a picture, then walked down. WE MADE IT! I’m pretty sure the school officials were happy to get rid of me before the scandal erupted and I was so happy that I decided to do something stupid. Instead of going to my parents after the whole graduation ceremony, I went to her who was somewhere in the campus. I decided then and there to introduce her to my parents which she was very reluctant to but I thought it didn’t matter as my parents wouldn’t really care. I tried looking for my parents in the campus to no avail. I sent them a text message to ask where they were and they answered in a very nonchalant way that they were waiting for me in the car outside. I wasn’t able to pick up the hints that they were quite angry at me for not going to them first as it was a big achievement for parents to have their child graduate and should’ve been celebrated right then and there but I was stupid and went straight to my girl without realizing it. So as we both approached the car, my mom rolled down the window but didn’t turn her head to us. It was at that point I realized they were mad as hell. I went on to introduce her to my parents but I never said she was a teacher. My mom was not moving at all but my dad at least talked to us but coldly, telling her it was nice to meet her and me to get in the car. I had to say goodbye to her then and there and I can see how hurt she was but there was nothing I can do about it as I had to follow my parents. That was pretty much the last time we met then, I was not allowed to meet her anymore as my parents had put two and two together that she was a teacher in my school. We texted and called each other quite a bit but she said she resigned from her work in my school and decided to move to a different province far from the capital where she was to continue teaching children. After that, I never heard from her again as she stayed away from social media and I moved on to college and work. I don’t even have any idea if she indeed got pregnant because of me so it’s definitely one of the things that keeps bothering me until today whether I’m actually a father now or not. The only thing I now have of her after losing much of the things she gave me throughout the years was her note for me in my school uniform. To explain, it was a trend that in the last school day before graduation, we have our friends, classmates, teachers, or whoever you wanted immortalize themselves to you by signing over your white school uniform with a permanent marker. Leaving a final note of farewell or something. I had everyone use black and blue permanent markers except her. She used a red permanent marker which stood out from the rest and I left a spot for her in my uniform positioned on top of where my heart should be (or at least in close proximity). I immigrated to another country but once I am able to visit home again, I’ll take a photo and post it here. Looking back, I realized that it was all my fault. While I was genuinely in-love, it was very selfish of me to put her in that situation. I don’t blame her for taking away my virginity as I had consented to it so even if people say she took advantage of me, in my point-of-view I was to blame for it all. I ruined someone’s teaching career just to chase this stupid boy’s fantasy and I regret all of it. If I truly loved her, I would’ve allowed her to succeed in her career as a teacher in one of the best schools in the capital and probably go on to be someone important in the field of education and music. All I can really do now is to learn from what I can with what I’ve experienced and not be blind to the signs if my future son or daughter were put into that situation as well. I apologize if my answer has offended anyone and I’m welcome to any critique or lecture as I am honestly still lost when it comes to this because there was never any proper closure. ",
            "date": "Updated January 4, 2019",
            "views": "489",
            "upvotes": " View 47 Upvoters",
            "upvoters": [
                {
                    "user_id": "Claire Cutter",
                    "user_href": "/profile/Claire-Cutter"
                },
                {
                    "user_id": "Nikos Katehis",
                    "user_href": "/profile/Nikos-Katehis"
                },
                {
                    "user_id": "Vaishnavi Arya",
                    "user_href": "/profile/Vaishnavi-Arya-2"
                },
                {
                    "user_id": "Kym Ladell",
                    "user_href": "/profile/Kym-Ladell"
                },
                {
                    "user_id": "Ayomide Ayeni",
                    "user_href": "/profile/Ayomide-Ayeni-8"
                },
                {
                    "user_id": "Larry Feldman",
                    "user_href": "/profile/Larry-Feldman-26"
                },
                {
                    "user_id": "Megan Fleming",
                    "user_href": "/profile/Megan-Fleming-63"
                },
                {
                    "user_id": "Kufre Wilson",
                    "user_href": "/profile/Kufre-Wilson"
                },
                {
                    "user_id": "Raghav SM",
                    "user_href": "/profile/Raghav-SM-1"
                },
                {
                    "user_id": "Cole Kellison",
                    "user_href": "/profile/Cole-Kellison-1"
                }
            ]
        }
    ]
}