{
    "title": "What countries in the EU offer free university education to EU citizens? - Quora",
    "tags": [
        "Specific Countries in Europe",
        "Education in Europe",
        "Higher Education in Europe",
        "Colleges and Universities in Europe",
        "College and University Tuition Fees",
        "Tuition Fees",
        "European Union",
        "Europe",
        "Higher Education",
        "Colleges and Universities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Simon Poulsen",
                "href": "/profile/Simon-Poulsen-2"
            },
            "answer_text": "Austria, Denmark, Finland and Sweden offer free education to EU citizens. Some others such as France and Germany charge a registration fee which could be a few hundred Euro per year although the education is basically free. Most countries have some kind of payment which can vary from e.g. € 200 per term right up to the United Kingdom’s GBP 9.000 per year. I can’t speak for the other regions but certainly in Denmark, students can not only benefit from free university education, but can also get grants to cover living expenses while they’re in education, as well as student loans at attractive rates. I’d guess that the grants for living expenses aren’t an automatic right to EU students who move to the country to study though. Tuition Fees at Universities in Europe Tuition Fees & Scholarships Compare tuition fees schemes in Europe ",
            "date": "Answered July 25, 2016",
            "views": "29",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Gustavo-Na-Gopaleen"
                },
                {
                    "user_id": "Shane DiAngelo",
                    "user_href": "/profile/Shane-DiAngelo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paolo Lim",
                "href": "/profile/Paolo-Lim-1"
            },
            "answer_text": "First of all, a college in the EU is a slightly different level of education from what it means in the US.  What we know as a college level of education in the US means a university level in the EU.  In both the EU and US, this level comes after secondary/high school but in the former, it is not completely tantamount to higher education.  A college course lasts about 2 years and students sit an exam to determine their score.  These scores determine which unis can consider their application.   Now as for your question, if you mean university education, Germany and Finland provide higher education for free.  France and the Netherlands offer it for a minimal fee at least for EU/EEA citizens. ",
            "date": "Answered March 11, 2015",
            "views": "31",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Court Jeremiah",
                    "user_href": "/profile/Court-Jeremiah"
                },
                {
                    "user_id": "Evanny Henningsen",
                    "user_href": "/profile/Evanny-Henningsen"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Purple-Miyav"
                },
                {
                    "user_id": "Jo Ji",
                    "user_href": "/profile/Jo-Ji-2"
                }
            ]
        }
    ]
}