{
    "title": "What is a good book for learning mathematical notation? - Quora",
    "tags": [
        "Buddha and His Dhamma",
        "Mathematical Notation",
        "Computer Programming Books",
        "Education Book Recommendations",
        "Computer Programming Book Recommendations",
        "Theoretical Computer Science",
        "Learning",
        "Learning to Program",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shanelle Wall",
                "href": "/profile/Shanelle-Wall"
            },
            "answer_text": "maybe this is the book you're looking for > > > Mathematical Notation: A Guide for Engineers and Scientists Mathematics is a language with a unique vocabulary, written with a dizzying array of often incomprehesnible symbols. If we are unsure of the meaning or usage of a mathematical word, a quick internet search is invaluable. But what are we to do when confronted with some strange mathematical hieroglyph? What does one type into the search bar? This book is the answer! Our goal is to cover mathematical notation commonly used by engineers and scientists---notation a university student is likely to encounter. We make no attempt to teach the mathematics behind these symbols. Rather, our goal is to give reminders of what these symbols mean; from there, we can consult textbooks or resources on the web. The book is organized by mathematical topic, but multiple indices steer the reader to each symbol's explanation. We also show how to produce the symbols in LaTeX and give guidance on their mathematical usage. ",
            "date": "Answered February 16, 2019",
            "views": "612",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fatimah Huerta",
                "href": "/profile/Fatimah-Huerta"
            },
            "answer_text": " Mathematics is a language with a unique vocabulary, written with a dizzying array of often incomprehesnible symbols. If we are unsure of the meaning or usage of a mathematical word, a quick internet search is invaluable. But what are we to do when confronted with some strange mathematical hieroglyph? What does one type into the search bar? This book is the answer! Our goal is to cover mathematical notation commonly used by engineers and scientists---notation a university student is likely to encounter. We make no attempt to teach the mathematics behind these symbols. Rather, our goal is to give reminders of what these symbols mean; from there, we can consult textbooks or resources on the web. The book is organized by mathematical topic, but multiple indices steer the reader to each symbol's explanation. We also show how to produce the symbols in LaTeX and give guidance on their mathematical usage. Mathematical Notation: A Guide for Engineers and Scientists ",
            "date": "Answered December 28, 2018",
            "views": "671",
            "upvotes": "0"
        }
    ]
}