{
    "title": "What is the difference between development studies and community development? - Quora",
    "tags": [
        "Development Studies",
        "Community Development"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hossain Rakib",
                "href": "/profile/Hossain-Rakib-2"
            },
            "answer_text": "Development Study is a subject or discipline which focuses on the development of a country from many perspectives (e.g. like how to improve the economic condition of some Asian countries who are poor). “Community development is a process where community members come together to take collective action and generate solutions to common problems. Community wellbeing (economic, social, environmental and cultural) often evolves from this type of collective action being taken at a grassroots level. Community development ranges from small initiatives within a small group to large initiatives that involve the broader community.” Community development focuses on developing particular problem of a community such as how to improve the homeless people who are living in your community right now (e.g. like finding a job for them or giving them food as help or finding another way to help them). ",
            "date": "Updated January 13, 2020",
            "views": "12",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Doofan Adasu",
                    "user_href": "/profile/Doofan-Adasu-1"
                },
                {
                    "user_id": "Chipo Leohatch",
                    "user_href": "/profile/Chipo-Leohatch"
                },
                {
                    "user_id": "John Kelvin Hove",
                    "user_href": "/profile/John-Kelvin-Hove"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ali Ashar",
                "href": "/profile/Ali-Ashar-4"
            },
            "answer_text": "Development studies is a multidisciplinary studies for the holistic development in each and every aspect, however community development is a specialization in development studies, more concern about the development of a certain group, region or community. take care and keep smiling. Thank you ",
            "date": "Answered March 16, 2019",
            "views": "362",
            "upvotes": " View Sharers"
        }
    ]
}