{
    "title": "What is your reaction if your students cheat during the exam? - Quora",
    "tags": [
        "Cheating (exams)",
        "Academic Plagiarism and Cheating",
        "Academia",
        "Teachers",
        "Students",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Smith",
                "href": "/profile/Bob-Smith-1408"
            },
            "answer_text": "No reaction. Cheating is impossible in one-to-one viva voce examination. Essays are hard to fake once you ask the student to go over it with you. And even if they do cheat, why should I care? School is a training ground for the person's future. I - and any other real person doing the real studies - can tell immediately when a supposed PhD or any one claiming degrees or courses has just bought their diploma/accreditation. If they want to give tens of thousands of dollars to some corrupt teacher or some student shrill, good luck to them. Cheating channels money to the smart, and away from the stupid. Administratively they will get an incomplete (giving an F isnt really allowed in the elite universities without alot of difficulty). I guess alot of these grade-purchasers get through the system, everywhere. But in the real world, its much harder to fake your way through. And anyone hiring based only on a diploma deserves to be cheated. Most students, when confronted with cheating, realize that the course is not for them…if they need to cheat to get through. Its a process of self-discovery. The teacher can be supportive, and help the student see the bigger picture. Punishing students for cheating went out in our parents' generation. Our grandparents' use of school as a sorting mechanism is dead. Pitting students against each other for the highest GPA is meaningless in the modern world. Employers never care about GPA anyway (Ive never once in my 30 years working life been asked for my GPA). But I guess the environment I work in is unique. I dont know how/why schools and administrators act the way they do outside of the milieu I have known my entire life…a milieu inhabited by most. ",
            "date": "Answered July 27, 2019",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaimin Galaiya",
                    "user_href": "/profile/Jaimin-Galaiya-1"
                },
                {
                    "user_id": "Joana Wts",
                    "user_href": "/profile/Joana-Wts"
                },
                {
                    "user_id": "Fiona Mandana Kelm",
                    "user_href": "/profile/Fiona-Mandana-Kelm"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ray Teurfs",
                "href": "/profile/Ray-Teurfs"
            },
            "answer_text": "My reaction when a student cheated during an exam or quiz or other test was that this is another teaching moment. Learning to be a person of integrity is certainly as important (really, more) as the subject matter. But, there is a process… First, you have to be able to establish that the student has cheated. I have done this in various ways. One tricky way on my part - when I was sure they cheated but could not prove it - was to ask “how many problems did you get help with?” When they answered (usually another lie), “only one or two,” I had them. Once established that they cheated - both they and I agreed, I talked about it with them. I would talk to them in a nonjudgmental tone and would ask them things like, “are you interested in being a person of character?” I might also point out the cowardliness inherent in cheating …not being brave enough to be seen for what you do or don’t know. I would end the talk not with an admonishment of, “I better not catch you cheating again,” but more with what we exchanged as food for thought. True, deep learning is always something voluntarily internalized, not something forced down your throat with threats and fear. It worked. I watched many young people ‘get it’. My favorite was when practically all the top players of our basketball team was in my geometry class and were simply copying homework from each other. I talked to all of them at once, appealing to their sense of integrity. I made the clear distinction between the copying they were doing and true give-and-take collaboration where they help each other learn. The quality of their work improved immediately. They must have talked it over on their own and decided that they were not doing themselves any favors by doing things the easy, less honest way. ",
            "date": "Answered July 29, 2019",
            "views": "88",
            "upvotes": " Answer requested by Haris Rudianto"
        }
    ]
}