{
    "title": "What are we doing on individual basis to protect our environment? - Quora",
    "tags": [
        "Protection",
        "Environmentalism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Schwartz",
                "href": "/profile/Steven-Schwartz-89"
            },
            "answer_text": "The environment can be saved but I think that you have to be a bit more specific. The oceans are filling up with plastics and the effects are everywhere. Individuals, corporations and government entities can act to reduce the use of plastic bags and single use containers. Recycling should be encouraged by raising the deposit from 5 cents to 25 cents and people would pay more attention and recycle more containers. The use of glass bottles and reusable containers should be encouraged, in my opinion. There are groups that clean up beaches, highways and other areas in various communities and this should be encouraged. In my opinion, corporate polluters should not be allowed to simply go bankrupt to avoid the consequences of their actions, like the coal companies and some of the power companies like PGE in California. Government entities should work for the interests of the public for the common good, and not for the interests of large corporations and special interest groups. We have seen the effects of dumping on Long Island recently when a county park was irreparably damaged due to toxic waste materials put there by individuals. Suffolk County has been unable to remediate the problem because they don’t have the will to do it and they carried no insurance on the property, which is incredibly shortsighted. Instead of dealing with the problem, they have changed the laws as if to pretend that they can make this go away by compelling contractors and landscapers to bring their wastes to private dumps and the prices have gone up manyfold because the waste has to be trucked out of state. It would be great if governments could encourage residents to use natural means to fertilize their lawns and gardens; this might help lessen the concentration of nitrogen in the runoff. The problem is that there is little planning when it comes to building new houses here on Long Island, especially in certain towns. More houses mean more waste going into the ground which potentially can harm the water supply. Tax revenues seem to be most important to our officials and there are new houses popping up all over the place in the neighborhood where I live. Some are on larger lots and others are on extremely small lots packed in right next to each other. This population density is contributing to more traffic on local roads and it is difficult and sometimes impossible to get around on local roads like Route 110 during rush hour and on weekends but I guess that is the price of progress, if that is what one can call it. We need to increase the use of public transportation and encourage people to use trains and buses. We need to fund public transportation through means other than raising fares. This is counterproductive and won’t increase ridership, in my opinion. There are many ways we can help save the environment: Plant trees and in particular, species that remove toxins from the soil (where it is necessary) Encourage pollinators by planting species that attract bees, butterflies and other insects. Lobby the government to prohibit the use of nicotinoids, which kill off bees. Stop using pesticides and opt for natural solutions. Find alternatives to lawns which don’t require us to kill weeds and use chemical fertilizers or use natural alternatives. Drive less, carpool and take public transportation when possible. Save electricity by installing energy efficient LED lighting in homes, offices and warehouse. Some utlities like PSEG offer special deals on LED light bulbs several times per year at discounted prices with free shipping to local residents. Use less energy when heating homes, offices and warehouses by installing insulation, energy efficient infrared quartz heaters over the old toaster-with-a fan type heaters. Many devices and apps are available to save electricity and help heat and cool buildings by using cool roof technology, building automation and more efficient boilers, furnaces and air conditioning units. Renewable energy can also provide additional power that doesn’t add emissions to the atmosphere. Solar, wind, geothermal (heat pumps) and hydroelectric power can be used to augment power from the grid, depending upon where you are in the country and world and the use of renewable energy is growing by leaps and bounds in the USA and elsewhere. We can have respect for the earth and each other, that would be good start as well as the things I have mentioned above. I don’t claim to be an expert but denying that there is a problem is foolish and self destructive. The earth is resilient and can be healed if only we would work with it and stop acting as if we have total control over it without consequences. A quote from an American Indian in recent times: \"Someone needs to explain to me why wanting clean drinking water makes you an activist, and why proposing to destroy water with chemical warfare doesn't make a corporation a terrorist.\" \"Whether we have wings or fins, or roots or paws... we are all relatives.\" -- Winona LaDuke - Ojibwe ",
            "date": "Answered March 6, 2019",
            "views": "249",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Matthew Smith",
                    "user_href": "/profile/Matthew-Smith-1918"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Bailey",
                "href": "/profile/Rob-Bailey-22"
            },
            "answer_text": "Use drip irrigation for your garden and flower bedsTake shorter showersDon't leave the water running while shaving or brushing your teethAlways read the ingredients, and do not buy things with palm oil in themEat lower on the food chainSubstitute red meat for poultry and sustainably raised/caught fishLook for Fair Trade and sustainability certifications on food itemsAsk your Starbucks barista for them to use Fair Trade Certified coffee for your drinkBuy clothing from companies who sustainably source their textilesDon't dump chemicals on the street or in your yardBike places, walk more, and carpool when you canBuy local food- become a locavoreUse less one-time use plastic items- carry a reusable water bottle with youUse organic sunscreenTurn off the lights when you leave your room or houseUse less animal productEat all the food you buyUtilize public transportationDonate to grassroots conservation programs across the US (or whatever country you belong to)Vote for politicians who take environmental issues to be an important and pressing topicBecome educated about the problems we face due to climate changeIn general, waste as little as you can. Use only what you must, and think to yourself through every situation, “Am I living sustainably?” ",
            "date": "Answered July 21, 2017",
            "views": "1",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nafees Alam",
                    "user_href": "/profile/Nafees-Alam-38"
                },
                {
                    "user_id": "Fiona Zhong",
                    "user_href": "/profile/Fiona-Zhong-7"
                },
                {
                    "user_id": "Mallekedi Likitha",
                    "user_href": "/profile/Mallekedi-Likitha"
                },
                {
                    "user_id": "Mellissa Grana",
                    "user_href": "/profile/Mellissa-Grana"
                },
                {
                    "user_id": "Farida Warsame",
                    "user_href": "/profile/Farida-Warsame"
                },
                {
                    "user_id": "Audrey Yoriko",
                    "user_href": "/profile/Audrey-Yoriko"
                },
                {
                    "user_id": "Disha Rao",
                    "user_href": "/profile/Disha-Rao"
                },
                {
                    "user_id": "Gavin Bailey",
                    "user_href": "/profile/Gavin-Bailey-10"
                },
                {
                    "user_id": "Rebecca Williams",
                    "user_href": "/profile/Rebecca-Williams-209"
                },
                {
                    "user_id": "Saurabh Tamhankar",
                    "user_href": "/profile/Saurabh-Tamhankar"
                }
            ]
        }
    ]
}