{
    "title": "What do I bring to a high school graduation? - Quora",
    "tags": [
        "Graduations",
        "High Schools",
        "High School Education",
        "The High School Experience",
        "Schools",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Janine Rinker",
                "href": "/profile/Janine-Rinker"
            },
            "answer_text": "I would suggest a card. If you want to enclose a gift card or cash, you may, but it is not expected. It can be embarrassing to have people really gush over you at graduation, depending on how well you know them. Depending on how high of premium there is on seats at graduation, it may be quite an honor to be invited, or they may have invited a lot of people who are casual friends. Where I live, people generally do graduation parties, and this would be an appropriate venue to take a gift if you wanted to (and were invited). I do think some people brought flowers to their graduates (at graduation), but I saw a lot more of that at college graduation for associate’s degrees and nurse pinning. Just another suggestion: follow up with graduates in the next year. It is a big deal when you graduate, but once you start working or going to college you often don’t hear much from anyone back home. A care package or even a card lets them know people haven’t forgotten them. Sometimes people are ambivalent about graduating, but they can definitely use your support in their lives after high school as well. ",
            "date": "Answered June 9, 2018",
            "views": "886",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Susan Long",
                "href": "/profile/Susan-Long-34"
            },
            "answer_text": "If you’re graduating wear your gown and hat, bring your phone and keys to you car/house. If you smoke bring your smokes & a lighter to use after the ceremony is over. If you’re celebrating someone else’s graduation bring your smokes, lighter and keys to your car/home. Also bring a card and flowers and a big smile and a hug. Nothing else is required. ",
            "date": "Answered May 27, 2018",
            "views": "321",
            "upvotes": "0"
        }
    ]
}