{
    "title": "What are the advantages and disadvantages of letting kids to write on walls? - Quora",
    "tags": [
        "Children"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sharad Deshmukh",
                "href": "/profile/Sharad-Deshmukh-3"
            },
            "answer_text": "Very beautiful happening in the life of parents. I have experienced it as a child and also as a parent. As a child my parents encouraged me to write on a floor as the wall were not available to write. My father particularly made our floor with some cement and maroon colour, where it was super easy to write and wipe. In my home I reserved a big portion of wall for my children. I painted it in black(?) board green easily available now a days. In one school I saw wall covered by news paper and children were encouraged to write on them with crayons. I will list some disadvantages first. It looks ugly for some people.It looks odd.It looks embarrassing when guests visit.It requires some money to make walls good again.Now advantages. It satisfies natural urge of child.It helps to express freely. The process itself is very creative. With the help of coloured chalks it becomes very vibrant.It improves motor co ordination of children.It helps to imbibe many good thing which will last for very long time in the brain of children.It makes parents a little free. Just nearby but in separate domain both can work at their own.It is very low cost solution as compared to other alternatives.You can induce many good habits through it.The total cost to be paid to consultants and practitioners for doing these things is very large as compared to repairing walls. It can help to create a bond between children and parents. The wall becomes an individual asset of a child with which they can do whatever they want, still under a supervision of parent. So in my opinion advantages are more as compared to disadvantages. ",
            "date": "Answered November 9, 2018",
            "views": "144",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Opinder Kaur",
                "href": "/profile/Opinder-Kaur-9"
            },
            "answer_text": "Giving children freedom and creative hand is a good idea but writing or scribbling on wall is a bad habit. If once they develop this type of habit, they will not be able to differentiate where they are allowed to write and where they are not. For them every wall is same. To lend them a free hand and to bring out their imagination and creativity, provide them a special place on the wall or in the house to scribble. Appreciate their work and also explain, only that place is meant for their masterpieces. This way it will not hamper their creativity and imagination. It will also make them clear that can’t leave their special marks everywhere. They are precious for you. They will develop respect for others property and take care of their own belongings. Remember- We have to inculcate good habits from the beginning itself. We need to pamper the kids in a right way. ",
            "date": "Answered November 9, 2018",
            "views": "146",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sharad Deshmukh",
                    "user_href": "/profile/Sharad-Deshmukh-3"
                }
            ]
        }
    ]
}