{
    "title": "What are the reasons why it is important for a teacher to know how learners learn? - Quora",
    "tags": [
        "Teachers",
        "Teaching",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vanessa Dye",
                "href": "/profile/Vanessa-Dye-3"
            },
            "answer_text": "It is important for the teacher to know how students learn, so they can help them in the process of learning. Most beginning teachers teach in an intuitive way - i.e. their teaching style reflects the way they learn. However, HOW YOU LEARN will be very different to someone else. For this reason, it is important to know about: How people learn? Finding out what learning style the students are may help their learning abilities. For example – being aware of different learning styles can help the teacher prepare, notes, tactics and resources to appeal to a range of styles, e.g. visual, auditory, written etc. And to try and include an activity which appeals to kinaesthetic learners What factors affect learning positively and negatively? Learning is difficult for some and easy for others, so it is useful to have additional tasks that can be given to faster learners, or teachers can organise some groups to have a mix of stronger learners with those who are less strong.Learning is about increasing levels of knowledge, skills or values, so the teacher needs to prepare appropriately for these domains of learning. When lesson planning the teacher needs to consider the:Amount of knowledge – i.e. don’t try to cover too much. The maxim less is more works here. (Although have additional material for the faster learners).Sequence of teaching – here it is useful for teachers to try and link new learning to ‘old’ i.e. build on what they already know.Level of knowledge – again, from knowing the students, the teacher will be able to gear the learning to the right level, so it the material is challenging, but not overly difficult.The learning process is different for all, so being aware of any pitfalls of a particular learning event is vital. The teacher’s empathy will help here, by re- thinking what the potentially difficulties are for learning this specific piece of learning, and building in additional support when it is needed.How can learning theories help me to better meet the learning needs of my students? Example ideas from learning theories are: From the Behaviourist theories - the use of positive feedback in the form of rewards e.g. grades, class recognition etc helps to motivate students to build on their current learning into the future.From Cognitivist theories - teachers can draw on ‘learning by doing’ approaches, guided studies which help prompt the students to thinkSocial learning theories – e.g. the teacher can act as a role model that the students ‘copy’Humanistic theories – e.g. it is useful to find out what motivates the students and try and build goals and aims into lessons. Also the teacher needs to work on ideas of ‘democracy’ in the classroom and creating a ‘safe space’ for the student to grow and develop.Andragogy – e.g. this relates more specifically to adult learners and one of the key expectations is that the teacher should try to use the adults experience(s) as the cornerstone of learning.I hope this explains why it is important for the teacher to know how learners learn. A knowledge of learning styles and theories can add to the armoury of approaches/teaching methods and ideas that teachers can/may use. ",
            "date": "Answered August 25, 2020",
            "views": "142",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ken Eckert",
                "href": "/profile/Ken-Eckert"
            },
            "answer_text": "There is some discussion in teacher training on whether the content being taught or the pedagogy and practice involved in teaching are more important. But generally, I agree with Andy that this question rather answers itself. “You had one job,” as the expression goes: the job of a teacher is to teach learners. I’m not sure it’s necessary to give reasons why a teacher should know something about how learners learn; that’s how they do their job, just as it’s pretty self-evident that if you want to be a painter it’s good to know something about canvases. ",
            "date": "Answered August 25, 2020",
            "views": "74",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ben Knight",
                    "user_href": "/profile/Ben-Knight-21"
                }
            ]
        }
    ]
}