{
    "title": "What is your experience on attending online classes instead of conventional classes in your school or college? - Quora",
    "tags": [
        "Online Classes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Himanshu Mnmrt",
                "href": "/profile/Himanshu-Mnmrt"
            },
            "answer_text": "Quite a different experience actually (speaking from college’s point of view ) Can take class anywhere, bed, sofa, floor, kitchen, heck in bathroom.You want get teacher’s attention if you don’t try to get that specifically, more on this in coming points.You choose to listen or not to ( it’s not compulsory for us to turn on the camera )If you really want to learn, teachers are really putting in the efforts for that.There’s no barriers as such of communication, understanding , learning until unless some major issue is there, like unavailability of internet or digital device ( and this is the case in rural India mostly )We miss all the fun we used to have in class and college campus, the real presence of humans are unmatched even after all these technological advancements.Lastly but not the least, we are seeing a great increase in misbehavior teachers and troubling them a lot, a humble request is to please respect them, for most of them it’s a new environment and teaching to a camera is much more difficult than teaching the students, so cooperate with them and live this moment of transition, hope everything will be fine soon.Adios Amigos  Image courtesy : Google Images ",
            "date": "Answered August 7, 2020",
            "views": "166",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ankit Choudhary",
                    "user_href": "/profile/Ankit-Choudhary-751"
                },
                {
                    "user_id": "Nishant Kumar",
                    "user_href": "/profile/Nishant-Kumar-385"
                },
                {
                    "user_id": "Alok Kumar",
                    "user_href": "/profile/Alok-Kumar-660"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gayatri Basu",
                "href": "/profile/Gayatri-Basu-3"
            },
            "answer_text": "According to my opinion…I could concentrate better cause there are no peer pressure or distractions which ccurs almost daily in every period in school. Hence it might be advantageous for a person to concentrate better cause many details are represented through PowerPoint slides which was not possible in conventional class. Moreover it depends on the person how he or she interprets it ",
            "date": "Answered August 16, 2020",
            "views": "57",
            "upvotes": " Answer requested by Alok Kumar"
        }
    ]
}