{
    "title": "What is e learning and its importance? - Quora",
    "tags": [
        "Interactive eLearning",
        "E-learning",
        "Learning",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Beverly Boerner-Reynolds",
                "href": "/profile/Beverly-Boerner-Reynolds"
            },
            "answer_text": " What is e-learning? E-learning stands for electronic learning. E-learning allows instructional designers, e-learning specialists, courseware developers, training managers and more to train based on the following: Who to train? · Large amounts of persons or users regardless of location What to train? · The same, repeatable message for a single purpose (e.g., processes, procedures, software, task progression) Why to train in this manner? · To achieve a singular purpose or solve a problem When should it be available? · Anytime with flexibility Where should the training be accessible from? · Anywhere in the world and from any device How should the training be created? · The tool is less important than the content being discussed or covered Top 4 Benefits of E-Learning? There are several benefits of e-learning, but here is my personal top 4 benefits that give e-learning its importance in today’s society: 1. Online learning promotes an atmosphere of collaboration. That is, when learners are taking the same course, they are likely to talk if located together or in a chat option. 2. Allows metrics to be run When you have e-learning, you can run your courses through a LMS. LMS stands for Learning Management System. A LMS enables tracking of completion rates or starting numbers per course. 3. Contributes to employee content recollection Users are able to recall the information learned – especially when the details are displayed in a visual format. 4. Train the masses Online training allows the same message to be sent to all users. ",
            "date": "Updated July 2, 2019",
            "views": "13",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Emes Ofonasaha",
                    "user_href": "/profile/Emes-Ofonasaha"
                },
                {
                    "user_id": "Jimmy Harzog",
                    "user_href": "/profile/Jimmy-Harzog"
                },
                {
                    "user_id": "Janice Smither",
                    "user_href": "/profile/Janice-Smither"
                },
                {
                    "user_id": "Brian Westergard",
                    "user_href": "/profile/Brian-Westergard"
                },
                {
                    "user_id": "Geraldine Smither",
                    "user_href": "/profile/Geraldine-Smither"
                },
                {
                    "user_id": "June Walker",
                    "user_href": "/profile/June-Walker-39"
                },
                {
                    "user_id": "Amy Mannings",
                    "user_href": "/profile/Amy-Mannings"
                },
                {
                    "user_id": "Mandy Blinz",
                    "user_href": "/profile/Mandy-Blinz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Mathew",
                "href": "/profile/Joseph-Mathew-377"
            },
            "answer_text": "e-Learning is defined as studying courses online with the help of internet, computer & CD/DVD, Streaming through audio or video. Most commonly, it is attainable thorugh e-learning platform like Litmos, GetTeachr..etc. E-learning has been trying for many years now to complement the way we learn to make it more effective and measurable. The result now is that many tools help create interactive training courses, standardize the learning process and/or inject informal elements to otherwise formal learning processes. There are many benefits for both the learners and the organizations through e-learning, Some are:- Cost-Effective and Environmentally FriendlyImproved RetentionFlexibility for both the staffs/learnersGamification makes the course more entertainingStudents are able to link the various resources in several varying formats.As you have access to the net 24x7, you can train yourself anytime and from anywhere also.Through discussion boards and chats, students able to interact with everyone online and also clear your doubts if any.For more e-learning updates, news & events, Get connected with eLearnCommunity. eLearning Community for eLearning resources, learning managementsystems LMS reviews, events and news | eLearnCommunity ",
            "date": "Answered July 29, 2019",
            "views": "243",
            "upvotes": "0"
        }
    ]
}