{
    "title": "What was your college application essay about? - Quora",
    "tags": [
        "College Application Essays",
        "Colleges and Universities",
        "College and University Admissions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hannah Powell",
                "href": "/profile/Hannah-Powell-66"
            },
            "answer_text": "NYU Essay As an aspiring tech entrepreneur dedicated to social justice, I believe a well-rounded education is essential. The field of business is informed by many disciplines, from the liberal arts to the sciences, and I desire to attend a university that graduates students who have a holistic approach to solving global issues. NYU’s Stern School of Business provides my ideal learning environment with its business courses in entrepreneurship and technology and its commitment to social responsibility. NYU’s philosophy of providing “excellence and innovation in teaching that facilitates student learning” excites me. The culture of the school is forward-thinking and innovative, and NYU students are equipped to be just that. The Stern curriculum, while organized and structured, still offers flexibility for students like me to tailor my education based on my interests. Amongst the 13 concentrations offered under the business program by the NYU Stern Undergraduate College, I plan to pursue Computer and Data Science as the main concentration with Entrepreneurship being a co-concentration. Technology primarily drives modern businesses and the course INFO-UB 1 (Information Technology in Business and Society) under the primary concentration would provide me not only with the basics of working in these businesses using computing and data science but also an understanding of the implications of these technologies for business managers. The course INFO-UB 60 (Networks, Crowds and Markets) under the co-concentration on the other hand will help me come up with the networks and perspectives imperative for success as a startup founder. In NYU Stern, there are tracks as well to guide students in choosing electives. These would provide me with a clear-cut direction of coursework that will help me develop both intellectually and professionally in my various areas of interest. The entrepreneurship track in particular will help me gain the ins and outs of starting new ventures and hence increase my chances of success in the business world. Finally, NYU Stern has a social impact curriculum and initiatives that are perfect for me. For instance, the course “Business and Its Publics” in the Social Impact Core would help me become aware of the many interconnections between business, society, markets, politics, art, culture, and life. The “Social Solutions Project” initiative would help me develop my own social venture business ideas and the fact that I would have the support of the faculty mentors, guest practitioners and various student leaders makes NYU Stern a perfect choice for me. U. Michigan Essay The University of Michigan’s Ross School of Business is well-known for its entrepreneurial spirit and focus on technology, which is perfect for me, an aspiring tech entrepreneur. With a theory-to-practice learning approach, coupled with an emphasis on professional development through internships and personal development through extracurricular activities, the Ross School of Business provides my ideal learning environment. The Ross School of Business philosophy “Building a better world through business” truly excites me since it lines perfectly with my own. The structured, yet flexible MERGE (Multidisciplinary Exploration and Rigorous Guided Education) curriculum is well-rounded, covering a span of disciplines such as applied economics and business communications. This curriculum would help me develop the knowledge, leadership skills, and analytical ability that I need to turn the modern world challenges into opportunities. I aspire to pursue Bachelor of Business Administration in Ross with a minor in Entrepreneurship. The BBA program would help me learn to help create a better world through the power of business by developing critical thinking and core business skills from top business minds. The minor in entrepreneurship would help me develop the skills and experience to translate ideas into real impact in business. Additionally, Ross emphasizes on practical learning, applying my business skills in the real world even during my courses. This is through REAL (Ross Experiences in Action-based Learning). Opportunities under REAL such as REAL: START, REAL: ADVICE, REAL: INVEST and REAL: LEAD would help me: Develop my original new business idea; consult with real-world businesses on strategic issues; manage a student-run investment fund and also operate an ongoing business unit with a corporate partner respectively. Ross also has centers that are hubs of innovation on campus for students to participate. These include the StartUM which focuses on turning innovative ideas into viable start-ups. Students take a hands-on approach by working in teams to brainstorm and develop a product or service. The student organizations such as Entrepreneur and Venture Club (EVC) and Enactus that focus on entrepreneurship are of great interest to me since they will hone my entrepreneurship skills. Moreover, there are a lot of opportunities to interact with the students for instance through the Technology & Business Innovation Forum which helps promote business leadership in technology adoption by connecting the worlds of technology and business practice. Being encompassed by a mentally inquisitive and a competitive student body will guarantee that I put my best foot forward and provoke myself to outperform what I consider to be my potential. With the benefit of gaining from educators that are pioneers in their branches of study, I am sure that the college will give me enough chances to find and express myself. Being a good leader, exceptional in speech and debate, I am interested in the university’s ability to enhance my leadership and communication skills. This can be achieved by joining clubs such as the General Management Club (GMC), The Tech Club and Michigan Business Women – BBA. This will enable help me in developing people skills, which is basic for accomplishment in business. In conclusion, I am confident that delving into an undergraduate program at the Ross School of Business will allow me to apply viable business tactics to my own ideas in order to build successful business of my own. Indiana University Essay “HOO HOO HOO HOOSIERS!” I was welcomed with this passionate chant when I stepped onto the Indiana University campus this past summer for the Young Women’s Institute. During the program, I stayed in the Teter Residence Halls with amazing resident advisors Jenna Miller and Victoria Anderson. I especially appreciated their care and mentorship throughout the camp. Along with supportive undergraduate students, I also met enthusiastic professors such as Dr. Kitsmiller in marketing and compassionate staff like the program coordinator Sarah Hatch who helped me through a severe cold the whole week. Ultimately, it was through this supportive community that my group and I placed first with our project. This past summer confirmed that IU is the perfect place for me to pursue business and entrepreneurship. The Young Women’s Institute was just a small part of a larger community that is committed to providing young women with the opportunity to build important business skills. First and foremost, the Kelley School of Business curriculum encompasses the Kelley Compass classes, Global Foundations core and Integrative Core classes which suit me perfectly. These would enable me: to work with business professionals to define my values and goals, refine my interpersonal and teamwork abilities, and develop the practical skills required to succeed in business as well as develop strategies to analyze and interpret the economic and technological influences that drive the global economy. Additionally, Kelley has other resources and opportunities which clearly reveal that students are thoroughly supported to be engaged with current research and experiential learning. There are workshops which provide an augmented academic experience and will enable me to go beyond the curriculum and gain specialized skills. These workshops include the Consulting Workshop and the Global Sales Workshop. Kelley has a Living Learning Center for freshmen which is great for me since I would interact with motivated first-year business students and participate in a residential program that focuses on personal, academic, and professional development. As an aspiring undergraduate at Indiana University, I want to further enhance my leadership skills so that I could go back to my community and continue building an atmosphere for other women to thrive. I look forward to working on real-world business case projects alongside other passionate female leaders, all under the mentorship of faculty and business professionals. Outside classroom, there are numerous seminars on topics such as international business that show the university and the institute’s global perspective. 1. What factors influenced your decision to apply to Barnard College and why do you think the College would be a good match for you? (100-250 words) When I initially found out about Barnard, it was obviously apparent to me that the school is a network of solid women who are delightfully positive in a manner that I had never seen in a scholarly domain. I turned out to be instantly excited in pursuing my economics major in Barnard and felt as if I had found a shrouded pearl. Firstly, Barnard College’s department of economics offers a broad course of study in economic theory and applied economics. This interests me since it would prepare me for graduate work in economics and business and would also help me to foster a critical understanding of economics and its relation to other disciplines. The program would also help me develop a mastery of modern economic theory and its tools of analysis. Additionally, Barnard has Economics Track which would be beneficial to me as it would teach me the theory and the analytical and mathematical tools now expected of entering graduate students in economics and useful for graduate study in related fields such as business. Finally, Barnard has the Athena Center for Leadership Studies which supports female entrepreneurs by providing resources and mentorship for those young women who have or are launching their own ventures. This interests me since I would be able to experiment with entrepreneurship through internships and hands-on work experience. 2. Pick one woman in history or fiction to converse with for an hour and explain your choice. What would you talk about? (100-250 words) Many years ago, ladies were relied upon to adjust to their gender roles and on the off chance that they strayed from their expected paths, they could without much of a stretch be viewed as \"undesirable\". Regardless of the way that she would have been looked down upon, Mary Wollstonecraft chose to turn into the lady in charge of advancing feminism through her famous book, “A Vindication for the rights of Women”. If by any chance I could chat with Mary, I would ask what she found most energizing as a pioneer of feminism. I would ask what her battle for ladies' rights meant to her and tell her of all the enormous ways ladies have advanced in their capacity and influence. I would express gratitude toward her for the impact she's had in my life. For the duration of my life I came to progressively respect Mary Wollstonecraft, with the calm poise and straightforward polish depicted in her photos being something I aim toward. She was a true pioneer in a period when ladies were thought to play such little and insignificant roles in the society, yet had the ability to change lives in a way just recognizable by those such as herself. 3. Barnard women seek to make a difference in their community, whether through the residence hall, classes, clubs, volunteer work or a part-time job they hold. Describe how you make a difference in your community and what you have learned from that experience. In what ways do you see yourself contributing to the community at Barnard, inside or outside of the classroom? (250 words max) In my community, I made a difference by not only starting a chapter of Girls Who Code at my school, where I realized the potential of my peers and myself in STEM but also taking the initiative of starting a chapter of a speech and debate club at my high school. From these experiences I learned that helping others practice new skills and nurturing other people’s passions brings me a lot of enjoyment and also that in order to be a true leader, I have to let others shine, picking the right moments to allow others to reach their fullest potential. I see myself contributing to the community at Barnard, inside or outside of the classroom by engaging in speech and debate events or rather public speaking in general as well as teaching interested ladies how to code. ",
            "date": "Answered September 11, 2018",
            "views": "401",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kim Doan",
                    "user_href": "/profile/Kim-Doan-42"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Huzi-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marc Mularz",
                "href": "/profile/Marc-Mularz-1"
            },
            "answer_text": "I wrote about my best friend’s little brother who died from an asthma attack when he was 14. He never let his asthma stop him from doing what he loved, except on those days where it was so bad that he was not allowed out of the house. He loved playing baseball more than anything and was a died in the wool Yankees fan. I talked about how he always inspired me when I thought that my life was tough… Love you Johnny and still miss you 40 years later ",
            "date": "Answered July 1, 2019",
            "views": "98",
            "upvotes": "0"
        }
    ]
}