{
    "title": "What happens during the festival of Diwali? - Quora",
    "tags": [
        "Hindu Festivals",
        "Festivals of India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Soulveda",
                "href": "/profile/Soulveda-1"
            },
            "answer_text": "Celebrating is integral to our genetic makeup. We don’t necessarily need a reason to celebrate. And when we do have one, we go all out. More so, in a colourful and diverse society like India, celebrations take on a whole other meaning. Welcoming a new member into the family, winning a cricket match or even movies becoming blockbusters–we love to celebrate our collective joys and glories. It resonates with our culture and forms the ethos of our vibrant society.  A land of festivals, India celebrates harvest festivals, music festivals and national festivals. In a society that’s rooted in tradition and cultural diversity, religious festivals form a large part of celebrations in India. Irrespective of the religion they belong to, festivals bring people together and further strengthen the inherently vibrant social fabric. One such festival is Diwali. A harvest festival, Diwali is celebrated in the Hindu months of Ashvin and Karthika (October and November). Its celebration and rituals may vary across regions, however, the core message of Diwali remains the same–darkness to light, ignorance to knowledge, triumph over evil and hope over despair. Festivals everywhere have their roots in legends and Diwali is no exception. We bring to you some of the legends associated with Diwali and hope that the message stays with you long after you have read them. The prince returns One of the most well-known legends is that of Rama, the eldest son of Dasaratha, the king of Ayodhya. The story goes that Rama, his wife Sita and brother Lakshmana were exiled from the kingdom for 14 years. Ravana, the king of Lanka saw Sita in a forest and mesmerised by her beauty asked her to marry him. When she refused, Ravana abducted her and held her captive. Rama with the help of Hanuman, Bali, Sugreev and an army of monkeys attacked Lanka and killed Ravana in an epic battle. Rama, Sita and Lakshmana returned to their kingdom on a new moon night in the Hindu month of Ashvin. The people of Ayodhya celebrated the homecoming of their benevolent prince by lighting earthen lamps, bursting firecrackers and distributing sweets. Houses were cleaned and all the roads leading to Ayodhya were illuminated. Rama’s return marked good times ahead for the kingdom which had lost its prosperity without their beloved prince. Read more: Diwali: A Befitting Ode To Gods | Soulveda ",
            "date": "Answered August 20, 2019",
            "views": "178",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Arun Kant",
                    "user_href": "/profile/Arun-Kant-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chetan Mishra",
                "href": "/profile/Chetan-Mishra-32"
            },
            "answer_text": "Diwali is a five-day celebration which occurs on the fifteenth day of the Hindu month of Kartika. The fourth day of Diwali is the Hindu New Year. ... Diwali is known as the Festival of Lights and it is held in honour of Lakshmi, the Hindu goddess of wealth and prosperity.  ",
            "date": "Answered October 10, 2017",
            "views": "151",
            "upvotes": "0"
        }
    ]
}