{
    "title": "What do you think of the American education system? Why do you think that way? - Quora",
    "tags": [
        "Education Disruption",
        "Education in the United States of America",
        "Educational Systems",
        "Higher Education",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashley Lande",
                "href": "/profile/Ashley-Lande-2"
            },
            "answer_text": "Disheartened and pessimistic. The one saving grace to the American education system is the popularity of private tuition and the fact that voucher programmes are gaining steam. A lot of people - especially non-Americans - still don’t know much about why so many people in the US have a problem with the current system. The system as it is compels people to send their children to the school in their district even if its a failing school. I used to live in the UK and went to school there. You could go to any school that would take you. The idea that American parents, especially low income ones who are more in need of choice, cannot send their kids to a better school if they can is nightmarish. It’s an awful system. I could write an entire answer on why this problem alone is just awful.The way that teachers unions, parents, politicians and even teachers themselves have allowed grades to increasingly lose their value for better appearances. All the adults in these situations have decided it’s better for a kid to get a B (even if they wrote a really bad assignment) than a C (but they produced a really good assignment). It’s just tragic. That’s the only word for it. Because kids no longer have to aim so high and teachers seem fine with that. I won’t say all teachers though. I’ve seen teachers venting about this right here on Quora.Teachers unions themselves have been complicit in covering for school scandals, much as press secretaries cover for White House scandals. There have been teachers union bosses caught on tape (look this up from New Jersey) discussing helping teachers avoid statutory rape and even sexual assault charges. Meanwhile the unions only really care about the teachers and will 100% push for changes that hurt students if it helps teachers.The fact that standards have also declined for teachers. Did you know that New York a couple of years ago ended the practise of literacy tests for teachers? The reason being that not enough teachers were passing. It’s an endless cycle. Students aren’t well educated so when it comes to picking teachers, they aren’t going to be the nation’s brightest. And then they go on to teach kids themselves kept at low standards. It’s just a really sad state of affairs.Still on teachers, we see the good teachers being sent to wealthier schools while the, well, crap teachers are sent to poorly performing schools.While I have my problems with teachers, they aren’t the bad guys here. Over the last 30 years, teachers have seen their powers shrink while their responsibilities have skyrocketed. Teachers are expected to act as co-parents but with virtually no ability to punish misbehaving students.On the other side we have the issue of parents themselves. When parents these days aren’t completely neglecting their kids education because “that’s the teachers job” they’re in the reverse, being far too extreme. They’ll either put too much pressure on their kids, too much pressure on teachers or both. You see stories about parents assaulting teachers for failing their son/daughter. You see stories about parents harassing teachers.And of course the kids. We live in an age of growing ignorance where kids will absolutely pick on other kids for being smart or getting good grades. From what I’ve heard, it’s even worse in majority black public schools where it can even be frowned upon (at times, I’m not saying this is the norm) just to be literate and you’ll be accused of “talking white”. And while we’re talking modern kids, don’t even get me started on crime and teen pregnancy.And worst of all, most people aren’t even willing to admit the above problems. They’ll go along with maybe a couple but label the rest an exaggeration, a lie, a misrepresentation, etc. Because it’s easier to just say “teachers are heroes and they deserve a raise” than it is to say “if teachers unions are covering for that sort of thing maybe we should look into it”.The American education system, specifically the public system is a sh*t show. Being raised in the American public school system, especially in some cities, must feel downright claustrophobic. You can’t get out. The system is designed to keep you there. Performing better can lead to insults. I think all the good kids in these schools are just keeping their heads down, trying to not be noticed. I do think that this particular attitude (that smart is bad) has actually declined in recent years slightly as things like “nerd culture” have become more mainstream and I think people are actually becoming a little more mature in that respect. So yeah. That’s my take. I intentionally kept this apolitical to try and stick to things more people can agree on but honestly I could do another 5 paragraphs on things like the state of free speech on campuses, ideological faculties and student activism. ",
            "date": "Answered October 21, 2019",
            "views": "17",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Glodowski",
                    "user_href": "/profile/Robert-Glodowski-1"
                },
                {
                    "user_id": "Ayala Ramjee",
                    "user_href": "/profile/Ayala-Ramjee-1"
                },
                {
                    "user_id": "Amol Walunjkar",
                    "user_href": "/profile/Amol-Walunjkar"
                },
                {
                    "user_id": "Ian Lewis",
                    "user_href": "/profile/Ian-Lewis-36"
                },
                {
                    "user_id": "Bryce Howell",
                    "user_href": "/profile/Bryce-Howell-13"
                },
                {
                    "user_id": "Herbert Garrison",
                    "user_href": "/profile/Herbert-Garrison-2"
                },
                {
                    "user_id": "S Harish",
                    "user_href": "/profile/S-Harish-24"
                },
                {
                    "user_id": "Felix Soegimin",
                    "user_href": "/profile/Felix-Soegimin"
                },
                {
                    "user_id": "Brian Kayman",
                    "user_href": "/profile/Brian-Kayman"
                },
                {
                    "user_id": "Clayton Jay Hardy",
                    "user_href": "/profile/Clayton-Jay-Hardy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shawn Endresen",
                "href": "/profile/Shawn-Endresen"
            },
            "answer_text": "To quote R. F. Laird, even its core is a slimy decaying blob of putrefaction. Arts and practical crafts (shop and home ec and driver's ed) have been cut out of the system, so that graduates neither learn the skills to be independent nor connect with culture. Testing mania determines curricula down to the smallest detail. Health and science curricula have been politicized by people who lack any qualifications to comment on them. But mostly, it's about money. I understand I live in one of the worst places around for this particular sort of shenanigans, but - schools are traditionally payed for by local property taxes, with the contributions of state and federal governments being very small in comparison. And that has lead to gaming the system. My school district has five high schools in it. The one in the neighborhood full of two-million dollar homes has parents pay hundreds of dollars per year per household (remember, nominally a public school) to buy the school new equipment and fund trips; the four schools that aren't in such rich neighborhoods get to cope with the consequences of reduced property taxes. But hey, if you have to pay \"your\" hard earned dollars to get your kid an education, it's your right to make damned sure not a dime of your money goes to some other kid's education, right? The school bus system was discontinued decades ago - why would property-holders pay for such a thing, when they can make kids ride public transportation (which costs those who use it a flat fee, and is funded primarily by local sales taxes, so that the burden of paying for transportation has been shifted from those most able to afford it to those least)? But this is, at bottom, a wealthy area even if its political culture is dysfunctional. How is a bad school in a slum supposed to improve if its only meaningful source of funds is property taxes on the surrounding slum? Cuts have made class sizes insane. Middle school, at this point, has to be seen as a failed experiment. 11-year-olds don't function independently without meaningful adult supervision; they need a single teacher watching them most of the day, not high school in miniature, where they can evade adult eyes and bully each other mercilessly before their brains are developed enough to have much self-discipline or conscience. And now, let's talk about how and why, despite the gender and racial makeup of our community and the nation in general, 85% of schoolteachers are white women. Care to guess? Because it pays literally half what other jobs that require comparable educations pay. We have staffed our school systems with those people from backgrounds where a college education is certain but being your families' breadwinner is unnecessary. The wives of professionals are the only people who can afford to become teachers. We don't treat teaching as a profession, we treat it as a hobby of the upper middle class. Which is why, at least in this state, teachers get to sign away their social security and are still bound by archaic morals clauses in their contracts that would be flatly illegal in the private sector. I suspect it's also why so much rage gets directed at teacher's unions - cops and firefighters, sure, they're good guys doing a job that benefits the community (maybe), but when teachers demand any sort of respect, I think people still see them as a bunch of spoiled housewives getting uppity. There are more qualified people than me to talk about what's wrong with higher education. Anyway - it's rotten. Mostly because we're trying to run a universally necessary public service on a model left over from a time when education was a luxury. ",
            "date": "Answered June 10, 2015",
            "views": "15",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vrinda Rao",
                    "user_href": "/profile/Vrinda-Rao-14"
                },
                {
                    "user_id": "Jim Smithy",
                    "user_href": "/profile/Jim-Smithy-4"
                },
                {
                    "user_id": "Jenevieve Power-DeFer",
                    "user_href": "/profile/Jenevieve-Power-DeFer"
                }
            ]
        }
    ]
}