{
    "title": "What are the characteristics of social studies? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Suraj Kumar",
                "href": "/profile/Suraj-Kumar-3190"
            },
            "answer_text": "There are two main characteristics of social studies as a field of study. First is social studies promoting civic competence, the knowledge, skill, and attitudes of a student needed to assume \"the office of citizen\" in our democratic republic. The National Council for the Social Studies considers civic competence as a main goal for social studies. The NCSS says, students who learn these skills in social studies will help shape the future of a democratic society. The second characteristic of social studies is the social studies program, K-12, integrates knowledge, skills, and attitudes within and across disciplines. A third characteristic is one in which social studies programs help students construct a knowledge base and attitudes drawn from academic disciplines as specialized ways of viewing reality. This can be achieved with courses such as, history, geography, political science, sociology, and language arts, English and fine arts. Examples from each help students experience concepts reflectively and actively, through reading, thinking, discussing and writing. The fourth characteristic of the social studies program is the demonstration of the changing ",
            "date": "Answered February 17, 2018",
            "views": "116",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Natasha Reid-McHayle",
                    "user_href": "/profile/Natasha-Reid-McHayle"
                },
                {
                    "user_id": "Roxanne Cruzado",
                    "user_href": "/profile/Roxanne-Cruzado-1"
                },
                {
                    "user_id": "Deepa Tech",
                    "user_href": "/profile/Deepa-Tech"
                },
                {
                    "user_id": "Agboola Kayode",
                    "user_href": "/profile/Agboola-Kayode-2"
                },
                {
                    "user_id": "Rahila Ibrahim",
                    "user_href": "/profile/Rahila-Ibrahim-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashley Burcham",
                "href": "/profile/Ashley-Burcham-1"
            },
            "answer_text": "Attributes of Social Study? Put simply, those who do not study the world, its cultures and politics, its geography, and its past, become limited in scope, and in the case specifically of history, become destined to repeat (or suffer) the mistakes made by man thus far. Man can not know how and where to go until he understands where he has been. Social study, in all of its forms, is the greatest enemy of ignorance. Ignorance allows one to fall prey to manipulation and influence which only serves the manipulator's desires. rather than preserving one’s independent thoughts and actions. Social Sudy is, simply, essential to living in today's world. ",
            "date": "Answered December 31, 2018",
            "views": "43",
            "upvotes": "0"
        }
    ]
}