{
    "title": "What is the difference between disciplinary and interdisciplinary projects? - Quora",
    "tags": [
        "Projects"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kharan Shiluveru",
                "href": "/profile/Kharan-Shiluveru"
            },
            "answer_text": "Disciplinary projects are those which include only one branch of engineering where as Interdisciplinary projects are those which involve more than one branch. Let me illustrate with an example of solar car. The main stages included are Building the car of the body and braking systems and stuff.Extracting as much energy as possible from solar panel and storing the energy.Using the energy to run the car.Point 1 can be done only by a mechanical engineer using the knowledge of mechanical engineering once he knows what all are the extra parts to be placed like solar panel and battery and their size. Point 2 can be done only with the knowledge of electrical engineering. However point 3 requires both. Electrical knowledge is required to to decide what type of motors are used and the load they can drive and torque they can provide and all such knowledge regarding minimum load and torque can only given by a mechanical engineer. I guess that you have got enough idea about the differentiation between them. However in the recent times reasearch has become more precise that projects between two differnt areas of same branch of engineering are also considered as interdisciplinary projects in few places. ",
            "date": "Updated March 14, 2018",
            "views": "51",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nilkanth Patadiya",
                    "user_href": "/profile/Nilkanth-Patadiya"
                },
                {
                    "user_id": "Vishnu Vardhan Reddy",
                    "user_href": "/profile/Vishnu-Vardhan-Reddy-74"
                },
                {
                    "user_id": "Arunoday Manda",
                    "user_href": "/profile/Arunoday-Manda"
                }
            ]
        }
    ]
}