{
    "title": "What is the difference between IB math SL and HL? - Quora",
    "tags": [
        "IB Math Studies",
        "IB Maths SL",
        "IB Mathematics HL",
        "International Baccalaureate (IB)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Freddy Abboud",
                "href": "/profile/Freddy-Abboud"
            },
            "answer_text": "Oh, there is a huge difference. In Math HL, there is a lot more additional content that SL students won’t take: A lot more sub-topics (for example, vector cross product; integration by parts; permutations and combinations… to mention a few).More chapters (Complex numbers - 2 chapters; Mathematical induction; I believe there’s also a probability chapter that is HL only but I may be recalling wrong).The exams for Math HL are also longer. SL papers 1 and 2 go for 1 and a half hours each, while the HL papers go for 2 hours each - due to the fact that HL has more content and is more difficult. The SL papers are worth 90 marks each while the HL papers are worth 100 marks each (as of 2017). In addition to that, HL students have to choose a whole option topic to study from a total of 4 - Calculus; Discrete Mathematics; Sets, Relations, and Groups; and Statistics and Probability. The options cover a lot of material and are tested in separate papers (Paper 3) that go for an hour and are worth 50 marks. However, the options can be quite difficult and are not to be underestimated at all. In a nutshell, HL Maths is a lot more difficult than SL Maths - it is infamous for the huge gap in difficulty between itself and SL, not just because of the extra material (including the option) but also because you just have to think very differently. Nothing is a direct application of formulas and concepts in IB maths, but this is more so in HL. However, SL is not to be underestimated either as it can be pretty difficult as well. As a matter of fact, the SL exam was actually relatively pretty difficult in the May 2017 session. I remember our HL probability questions being very easy, but there was one probability question my peers in SL had that was pretty hard and I spent a lot of time racking my brain over it (I was allowed to check a paper once the exam was done). All in all, as I said, HL Maths is just a lot more difficult, but it is doable. ",
            "date": "Answered December 15, 2017",
            "views": "56",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Muhammad Alfie Ramdhan",
                    "user_href": "/profile/Muhammad-Alfie-Ramdhan"
                },
                {
                    "user_id": "Ada Turanli",
                    "user_href": "/profile/Ada-Turanli"
                },
                {
                    "user_id": "Natalie Beridze",
                    "user_href": "/profile/Natalie-Beridze-1"
                },
                {
                    "user_id": "Kinchit Yadav",
                    "user_href": "/profile/Kinchit-Yadav"
                },
                {
                    "user_id": "Hugo Dahlqvist",
                    "user_href": "/profile/Hugo-Dahlqvist"
                },
                {
                    "user_id": "Kathy Kang",
                    "user_href": "/profile/Kathy-Kang-9"
                },
                {
                    "user_id": "Savi Debre",
                    "user_href": "/profile/Savi-Debre"
                },
                {
                    "user_id": "Meg Kesana",
                    "user_href": "/profile/Meg-Kesana"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Koen-Vochten"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/As-Sa-49"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kathy Kang",
                "href": "/profile/Kathy-Kang-9"
            },
            "answer_text": "IB Math HL is significantly harder than IB Math SL. The majority of the IB Math HL curriculum is focused on in-depth calculus. There are a few sections where areas like statistics are explored, but roughly a year and a half are spent on understanding the intricacies of calculus. In contrast, IB Math SL only spends roughly half a year on calculus, with the rest of the class time being dedicated towards the subjects IB Math HL skimmed over (statistics, probability etc.) IB Math HL students who dropped to SL in the second half of the class told me that all the calculus we learned in SL was covered in the first few months of HL, so the class was a breeze for them. Some classes (IB Biology, IB Spanish, IB French etc) don’t have a significant learning gap between their SL and HL classes. This is not the case for IB Math. IB Math HL is very difficult, whereas IB Math SL is manageable if you’re not naturally good at math. Hope this helps! ",
            "date": "Answered April 13, 2019",
            "views": "19",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hugo Dahlqvist",
                    "user_href": "/profile/Hugo-Dahlqvist"
                },
                {
                    "user_id": "Gloria Johnson",
                    "user_href": "/profile/Gloria-Johnson-2"
                }
            ]
        }
    ]
}