{
    "title": "What do most Christians think of Ned Flanders? - Quora",
    "tags": [
        "Christians",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dahlas Forgie",
                "href": "/profile/Dahlas-Forgie"
            },
            "answer_text": "Oh Lord. Ha ha ha. I don't know what most Christians think of him personally, but I've been told I'll turn into a Ned Flanders some day, while some of the stuff I do seems Ned-like and I wouldn't be too upset being like Ned Flanders. Overall, his contribution as a character is fantastic, and definitely done at a better taste than \"Christian\" characters on south park, one of which is Cartman, who half the time makes hateful jewish remarks, swears up a storm, commands his own parents, and has done things that no Christian ought to be doing....EVER. at least Ned Flanders is somewhat accurate, I doubt he offends too many Christians, if anything, I like the running gag with Ned Flanders, he has his moments, and is a little stable compared to the rest of the cast, like his neighbor Homer Simpson, who also attends church, but does not take it so seriously as Ned Flanders does. I like the guy, there's nothing wrong with a little Christian comedy, as long as it's not many light of God or Christ in any manners. ",
            "date": "Answered February 6, 2016",
            "views": "513",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Barron",
                    "user_href": "/profile/David-Barron-121"
                },
                {
                    "user_id": "Lukas Sprehn",
                    "user_href": "/profile/Lukas-Sprehn"
                },
                {
                    "user_id": "Joshua Alzol",
                    "user_href": "/profile/Joshua-Alzol"
                },
                {
                    "user_id": "Joseph Anthony",
                    "user_href": "/profile/Joseph-Anthony-30"
                },
                {
                    "user_id": "Stephen Sibbald",
                    "user_href": "/profile/Stephen-Sibbald-1"
                },
                {
                    "user_id": "William Robb",
                    "user_href": "/profile/William-Robb-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Eckert",
                "href": "/profile/Ken-Eckert"
            },
            "answer_text": "One of my friends who is a pastor loves the Simpsons, and sometimes remarks that either the show is written by highly educated Lutherans or by staunch atheists. Some of the jokes made about Ned are actually quite learned and require some knowledge of the cultural capitol of fundamentalist Christians. For this reason, although I can't of course speak for nearly 2 billion Christians, I don't mind the portrayal of Ned because it is done intelligently and with some affection-- the writers know enough about Veggietales or evangelical practices to parody them properly, and while Ned is sometimes stupid or gullible, he's a basically honest and decent guy who means well (and he does drink beer). The show itself is pretty ambivalent about religion, sometimes showing God Himself or divine acts, and at other times mocking Ned's piety-- showing the \"prayer-powered car\" his sons sit in at a race doing nothing. I once had a Pakistani roommate, and he thought Apu was hilarious-- he said Pakistanis aren't offended by him, they just think he's a stupid guy, and that the show's joking about him isn't mean-spirited. Again, I can't speak for all, but I think the same about Ned.  ",
            "date": "Answered February 4, 2016",
            "views": "879",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Isaiah Omobogie",
                    "user_href": "/profile/Isaiah-Omobogie-1"
                },
                {
                    "user_id": "David Barron",
                    "user_href": "/profile/David-Barron-121"
                },
                {
                    "user_id": "Lukas Sprehn",
                    "user_href": "/profile/Lukas-Sprehn"
                },
                {
                    "user_id": "Matthew D. Gamble",
                    "user_href": "/profile/Matthew-D-Gamble"
                },
                {
                    "user_id": "Rey J. Weiler",
                    "user_href": "/profile/Rey-J-Weiler"
                },
                {
                    "user_id": "Colin Dear",
                    "user_href": "/profile/Colin-Dear-2"
                },
                {
                    "user_id": "Nathaniel G A Parker",
                    "user_href": "/profile/Nathaniel-G-A-Parker"
                },
                {
                    "user_id": "Jeremy Lowe",
                    "user_href": "/profile/Jeremy-Lowe-3"
                },
                {
                    "user_id": "Brendan Waugh",
                    "user_href": "/profile/Brendan-Waugh"
                },
                {
                    "user_id": "Joshua Alzol",
                    "user_href": "/profile/Joshua-Alzol"
                }
            ]
        }
    ]
}