{
    "title": "What does your name mean and does it define you? - Quora",
    "tags": [
        "Name Meanings",
        "Given Names",
        "Etymology",
        "Meaning (philosophy)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jules Bearsong",
                "href": "/profile/Jules-Bearsong"
            },
            "answer_text": "The name Jules, one of the many forms of Julius, means “Youthful.” If it refers to being youthful in looks, it doesn’t appply to me. When I was 12–14 I would frequently get asked in the gas station if I bought gas. And lord knows, any time I held a baby, I would inevitably get asked by strangers how many other children I had. I’ve been carded so few times in my life, I’m actually shocked when it happens. In contrast, my husband has a baby face and only stopped getting carded so much when I first started hanging out with him, haha! In personality, I like to think I’m more youthful. Seriously, I will never get too old for a dare or staring contest. Still undefeated in the staring contest department! But I don’t think it’s the descriptor most anyone would use for me. More often than not, people go with the punny descriptor. “Jules, you’re a gem.” ",
            "date": "Answered November 18, 2018",
            "views": "122",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Samantha Earnshaw",
                    "user_href": "/profile/Samantha-Earnshaw-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raven Walker Robison",
                "href": "/profile/RavenWalker-Robison"
            },
            "answer_text": "Yes, it does. Raven brought the People to land and Walker means he lived in two worlds I have had a “gift\" from a very early age. My “gift\" use to scare me, horribly when I was younger. Turns out my fire and brimstone grandmother recognized my “terrors\" as she called them. She taught me how to shield. Like in a prior post I never drank beyond my limit, I didn't do drugs. Any loss of inhabition would bring them on. Native children in certain tribes get their Tribal name upon maturation. My Native Grandmother chose my name based on my “gift\" because both my grams agreed it gave me protection. Sometimes when I sleep without medication given to me for that sole purpose( I predicted my physician stepping in a hole in his back yard breaking his ankle! He became a true beliver)I still receive terrifying “revelations\" as my fire and brimstone grandmother called them. She told me if I didn't suppress them I would become an unwilling experiment for some damned government. I have gotten so good at suppression after fighting them for over 40 years plus that I only get them when ill. My very last vision of premonition was the day my husband was headed to a state bankruptcy building in OKC, April 19, 1995 three days before our daughters wedding. I MADE him take my bag phone. He had stopped at the 45 mile marker. He called said something was wrong no traffic was going into OKC. He didn't know that over half the offices were empty and the bankruptcy court was closed.(How did that happen if No One knew what was going on?) I told him to turn his radio to our AM news channel. He had been listening to his cassettes and come home it was on all the television channels! ",
            "date": "Answered March 19, 2019",
            "views": "546",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Susan McFadyen",
                    "user_href": "/profile/Susan-McFadyen-3"
                },
                {
                    "user_id": "Maria Childs",
                    "user_href": "/profile/Maria-Childs"
                }
            ]
        }
    ]
}