{
    "title": "What should we do to be good parents? - Quora",
    "tags": [
        "Parenting Hacks",
        "Psychology and Parenting",
        "Parenting Advice",
        "Family Relationships and Dynamics",
        "Parents"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jenny Bobe",
                "href": "/profile/Jenny-Bobe"
            },
            "answer_text": "Treat your children as humans. Once you have a child you are no longer the center of your universe they are. They are your everything, or at least they should be. Repect your child, they are human they have needs, dreams, feelings, wants, and thoughts they can think just like you. They are excellent, they are unique, they are special in their very own way. They are the best thing in your entire life and they are perfect to you. Let them be them and love them for that and let them know that you do love them for that. You are their everything, to them you are their God as such you must show them they way. The way you talk to them beecomes the way the view themselves. So tell them; “You are so smart, great job!” Even if it's a small accomplishment because they are looking up to you and needing that approval from you. They need you to get overexcited over the sillest of things because to them it isn't something small it's part of their growth as a human being. The words you say about your child becomes the words they say about themselve. So handle with care. If you respect your child, they respect themselves and grow up to be happy, friendly functioning adults. When they go astray you take their hand and lead them on the right path. You give your child space to be their own person but at the same thing let them know boundaries. They need to know they are equally as important as everyone else meaning they are not any less important than the other person but they are also not more important therefore they must respect other people's feelings just as you respected your child's feelings. Your kids have they right to have a voice. Be willing to listen to their objections and put their word into consideration, but also don't just give in. Teach your child to debate but they also need to know that they cannot alwaysget their way, explain to them why you are making the decision you are. Remind them that YOU are in charge not them, but they have a right to tell you no of they feel like they aren't being treated fairly. If you tell your child “Turn off the game console.” And they ask. “Why?” Don't say “Because I said so.” Instead say. “Because you have been playing for awhile now and I think you and the game both need a break.” Saying “Because I said so.” Gives your child they impression that they cannot and should not question you, and when they grow up they don't know how to question other adults even if they aren't being treated fairly. Listen to their stories and make believe games as well. Listen to your child. Otherwise when they grow up they just are going to figure you don't want to hear it. If they have a bad dream let them run into your room and tell you about it and comfort them and let them know you care even though it's 2 in the morning. Let them interrupt your show when they scrap their little knee or they need you to spell something out for them. That way when they are big they know that no matter what you are doing they know they can come to you with a problem. But also them teach to solve their own problems as well. If they ask you “How do you spell Sand?” Ask them “How do you think you spell Castle?” If they say “I don't know.” Tell them. “Sound it out.” And then they sound it out. Also don't just let them walk all over you and others though. When they make fun of their young Tell them that they must be respectful to others in order to be treated respectfully. So if your child says that they don't have to listen to you tell them. “I am your parent, I am in charge. If you ever want to be in charge than you are going to have to listen me first.” Teach your child that's it's okay to lose as well. I have seen so many people scared of losing so they never give it a shot or expecting to win so giving it their all and are absolutely devasted when they lose. As my mom always said you are going to lose a lot in life but go out and try anyway just be prepared not to win. Let your child know that you also will not be disappointed in them if they lose. Discipline your child, don't punish them. Be a respectful person and make them into a respectful person. Every child is different so they need unique parenting. Be the person you hope your child to become. And also let your kids be kids. Remember they are only a child once so let them enjoy their childhood. They have many years as a grown up and so little time as a child. After reading all this I would like to also remind you to listen to your gut and not just what others are saying. ",
            "date": "Answered May 31, 2016",
            "views": "640",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Babita Agrawal",
                    "user_href": "/profile/Babita-Agrawal-98"
                },
                {
                    "user_id": "Jane Doe",
                    "user_href": "/profile/Jane-Doe-2393"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Kc-Myndbuf"
                },
                {
                    "user_id": "Priyanka Mangalwedhekar",
                    "user_href": "/profile/Priyanka-Mangalwedhekar"
                },
                {
                    "user_id": "Maud Kennedy",
                    "user_href": "/profile/Maud-Kennedy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amana",
                "href": "/profile/Amana-5"
            },
            "answer_text": "Be their role modelLove them unconditionallyBe a friend as much as a parent - strike this delicate balance so that you remain an authority figure as much as a BFFBe patientTake care of yourself so that you're there for them for as long as possibleLearn to accept their weaknesses and nurture their qualities.Don't thrust your ambitions on them please.Encourage them for their effort even if these efforts don't lead to tangible rewardsTake them for annual vacationsEat together as a family at least one meal a dayThey'll leave us to make their own nests someday, let them fly freely when that happens, all the while giving them advice if they need itRespect each other in front of your children even when you're arguing. It's an important lesson for them.Don't let the drive in you to be the best parent in the world adversely affect your health.Parenthood is the biggest challenge in life, your efforts can be measured through how balanced individuals your children become.Edit - I forgot the most important lesson. Khalil Gibran said - Your children are not your children. They are the sons and daughters of Life's longing for itself. They come through you but not from you, And though they are with you, yet they belong not to you… Read the whole poem online.. ",
            "date": "Answered August 6, 2019",
            "views": "54",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Glen Omvig",
                    "user_href": "/profile/Glen-Omvig-1"
                }
            ]
        }
    ]
}