{
    "title": "What do most liberal arts majors do after graduation, honestly? - Quora",
    "tags": [
        "Learning About Liberal Arts",
        "Liberal Arts Colleges",
        "Liberal Arts",
        "College and University Majors",
        "Liberalism (politics)",
        "Higher Education",
        "Colleges and Universities",
        "College Advice",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lukasz Laniecki",
                "href": "/profile/Lukasz-Laniecki"
            },
            "answer_text": "Liberal arts majors can do whatever the fuck they want with their lives. They can write books or articles, paint paintings, draw, cook meals or run a restaurant, shoot photos, become lawyers, or doctors, or vets, or actors, or policemen, or politicians, or body builders, or fitness coaches (or whatever), shoot films, blog, vlog, comment, run, fight in a cage, do stand up. Whatever the fuck they please. Believing that something you did in your late teenage years/ early 20s (like the thing you studied) defines you is the surest way to have an unsatisfactory life. This conventional thinking that in your late teenage years you must acquire some “practical” education, thus pick a major that offers good, concrete career opportunities (which is the kind of mindset most people, especially parents, have, and which they then pass on to young adults) is the biggest mistake people can make. ",
            "date": "Answered January 7, 2019",
            "views": "187",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Apoorv Sathish",
                    "user_href": "/profile/Apoorv-Sathish"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Howard",
                "href": "/profile/Jonathan-Howard-71"
            },
            "answer_text": "Pretty much anything. I went into finance and became an executive, my boss was also a liberal arts major, as was our CEO (big finance company, Fortune 100). My wife is a university administrator. I know recent liberal arts majors who are insurance underwriters, hospital administrators, cybersecurity experts for the military, lots of financial types, human resources executives, computer jockeys, lawyers, physicians, web designers. I’m not sure there’s anything a liberal arts major can’t do. It depends entirely on the liberal arts major. ",
            "date": "Answered November 11, 2019",
            "views": "35",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-7"
                }
            ]
        }
    ]
}