{
    "title": "What effects will a homework ban have on student learning? - Quora",
    "tags": [
        "Homework",
        "Bans and Banning",
        "Students",
        "Studying"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Gerndt",
                "href": "/profile/John-Gerndt"
            },
            "answer_text": "That would depend on what the students do with that time they have due to having been released from structured practice. If they spend it in contemplation of other connected pursuits then something good might happen, if they spend in a locked loop of a game then they will not progress as they might have. I believe in play. It is a great way to learn if the play is done with an open and curious mind. Play is as varied as humans. Programs don’t rank high in my estimation of creative play. Programs by their nature are pretty darn limited. Programs are good for (mostly) learning a single thing, once learned it’s time for a new program. Programs are not really play. Back to the topic of a homework ban, it’s results has everything to do with the students. It’s going to reduce the structure of the classroom. There will be less to discuss if there is less shared practice and less progress of skills without practice. In total it holds the prospect of less education per day. It depends on kids self-education impulses. For most kids, that’s a big zero. ",
            "date": "Answered September 7, 2020",
            "views": "731",
            "upvotes": " Answer requested by Shane Rathbone",
            "upvoters": [
                {
                    "user_id": "Robert Pattison",
                    "user_href": "/profile/Robert-Pattison-4"
                },
                {
                    "user_id": "Casey Chen",
                    "user_href": "/profile/Casey-Chen-25"
                },
                {
                    "user_id": "Angela Qi",
                    "user_href": "/profile/Angela-Qi-10"
                },
                {
                    "user_id": "Jessy Fontenot",
                    "user_href": "/profile/Jessy-Fontenot"
                },
                {
                    "user_id": "Anita Russell",
                    "user_href": "/profile/Anita-Russell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Verkouille",
                "href": "/profile/Jeff-Verkouille"
            },
            "answer_text": "Honestly rather minimal in many subjects, provided the student in question does not require remedial practice. Some subjects, from certain math lessons to martial arts, musical instruments, dance, weight-lifting, foreign languages and other disciplines, require repetitive practice to enhance one’s forward progress. If one practices needed skills enough to gain fluency than one will be successful, homework assignments or not. If one is merely seeking the temporary external validation of grades and does not strive to actually learn new concepts and practice the necessary steps to gain a better comprehension of a given subject, well, the eventual outcome is stasis or a decline in ability. It’s always been up to the student to learn. Homework was but one tool to do so. ",
            "date": "Answered September 6, 2020",
            "views": "425",
            "upvotes": " View 5 Upvoters"
        }
    ]
}