{
    "title": "What are some good books on improving social and communication skills? - Quora",
    "tags": [
        "Social Skills",
        "Improving People Skills",
        "People Skills",
        "Communication",
        "Skills",
        "List Question",
        "Book Recommendations",
        "Self-Improvement",
        "Social Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Will Offen",
                "href": "/profile/Will-Offen"
            },
            "answer_text": "Many years ago when I was around 40 years old, I took my first overseas project to open outlets for a UK company in America. Although I had reached a relatively high level of seniority and respect in my industry, my personal levels of self esteem provided a constant challenge and I therefore never felt comfortable or secure. I made everything much harder than it needed to be if only I had more trust in myself. The project in America was a major turning point in my life, for there I discovered that people actually practised learning to self improve - something that we Brits didn't really know about at that time. The most valuable lesson I learned was that the fundamental skill of success was the skill to interact effectively with other people in whatever situation I encountered them. The most valuable lesson I learned about the skill to interact was that we must start with ourselves, because the way in which we interact with ourselves forms the bedrock for all of our actions. With this knowledge I started the habit of intelligent self interaction. There is a never ending number of lessons we could learn, from never ending sources, so where to start? My start point was with a book that today I still consider the best. “How to win friends and influence people”, by Dale Carnegie. Here we can find a massive helping of a vital ingredient, always needed when learning or improving a skill - simple awareness. “How to win Friends” opens the door on the subject and provides a great base from which to build and perfect this vital life skill. From reading this book, I became so involved, that I went on to read and absorb as much knowledge as I could find, the belief in the value of great interaction skills becoming so strong, I now concentrate on showing others the wonderful power and benefits that are available by putting our abilities to influence others at the forefront of everything we do! My core beliefs are demonstrated by these three words: Interact. Engage. Influence. They are the base for everything I believe and everything I teach! Good luck with your learning. ",
            "date": "Answered May 15, 2018",
            "views": "166",
            "upvotes": " View 37 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bryan Carl",
                    "user_href": "/profile/Bryan-Carl-2"
                },
                {
                    "user_id": "Karan Sharma",
                    "user_href": "/profile/Karan-Sharma-1759"
                },
                {
                    "user_id": "Farhana Umar",
                    "user_href": "/profile/Farhana-Umar"
                },
                {
                    "user_id": "Amy Smith",
                    "user_href": "/profile/Amy-Smith-2653"
                },
                {
                    "user_id": "Nikita Gupta",
                    "user_href": "/profile/Nikita-Gupta-557"
                },
                {
                    "user_id": "Ross Madler",
                    "user_href": "/profile/Ross-Madler"
                },
                {
                    "user_id": "Mariyayee Mariyayee",
                    "user_href": "/profile/Mariyayee-Mariyayee"
                },
                {
                    "user_id": "Prachi Ahlawat",
                    "user_href": "/profile/Prachi-Ahlawat-9"
                },
                {
                    "user_id": "Pradeepram J",
                    "user_href": "/profile/Pradeepram-J"
                },
                {
                    "user_id": "Mrunal Salunkhe",
                    "user_href": "/profile/Mrunal-Salunkhe-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Banchiwosen Woldeyesus",
                "href": "/profile/Banchiwosen-Woldeyesus"
            },
            "answer_text": "Of all the many communication books I have read, one tops it all. Dale Carnegie’s ‘How To Win Friends and Influence People’ is in my opinion the best book which has everything we need for improving our communication skills.  If we use a small percentage of the many principles found in the book, we would be the best communicators. Here are few examples of how the book can help us: One of the lessons I have had to learn over and over again is that it is not cool to criticize and condemn others. I lose a whole lot including myself whenever I give in to the temptation of condemning others. Dale Carnegie says in his book: “Don’t criticize, condemn or complain.”  Whenever someone does something for me that makes me happy, my default is to just accept it without giving any kind of appreciation. That is an absolute failure in communication. “Give sincere appreciation.” Says Carnegie. I have to remember that, people need to feel valued just as I do.  I am communicating with a colleague of mine. I talk about myself and what I want ceaselessly. I chase my needs relentlessly through my conversation. In the process, I have completely forgotten the other person. Here is what Carnegie says on the matter: “Arouse in the other person an eager want.” When I communicate with that colleague of mine, I do not ask questions, I do not show an interest in what he has to say. “Become genuinely interested in other people.” Says Carnegie if we want to become a better and likeable human being.  I spend the whole day with a face that is stern. A face that tells you I am unhappy with you. I find out through Carnegie’s book that smiling is an essential ingredient in communications. I smile and suddenly my relations have improved tremendously.  We all exhibit a certain pattern when we communicate. We tend to talk a lot. We will deny that talking too much could be a problem for any of our communications. Carnegie says that it is. “BE a good listener.”  You are not a good communicator unless you know one important thing about the other person. Not his height, his weight, or what he likes or what he doesn’t like. You have got to know his name. “Remember that a person’s name is to that person the sweetest and most important sound in any language.”  Have good points. Do not have good points. Either way, there is a 100% guarantee for you to have the best communication skills. And that is: “Talk in terms of the other person’s interests.”  Imagine for a minute that I am in work meeting. Someone has completely disregarded the points I have made. I want to argue. I want to create a war with this person who in my opinion has shamed me. Carnegie says in situations like these, I ought to avoid such arguments. He says even if I win the war, I lose the battle. Carnegie blatantly describes this idea as a principle in his book: “The only way to get the best of an argument is to avoid it.” This is a bitter, bitter pill to swallow. But I have found out it has remarkable dividends.  Imagine again I am in that meeting where my colleague is talking about his points. I find a mistake in his talk or his presentation. I then plan to destroy him with his mistake. That is a wrong approach to any kind of communication. Carnegie says. “Show respect for the other person’s opinions. Never say, “You are wrong.”” “If you are wrong, admit it quickly and emphatically.” “Call attention to people’s mistakes indirectly.” “Talk about your own mistakes before criticizing the other person.” “Use encouragement. Make the fault seem easy to correct.”  Have you ever noticed how involved we are with ourselves when we are having conversations? Why is he/she still talking? You do not say that out loud. But, you are thinking it. Or, you are having internal conversations with yourself. Carnegie says we should do the exact opposite if we want to improve on our communication skills. “Try honestly to see things from the other person’s point of view.” “Be sympathetic with the other person’s ideas and desires.” “Make the other person feel important - and do it sincerely.”  I have this wonderful book at home and at my work place. I have it on my smart phone. Look at the chapters found in this book:  I use it as a guideline to improve my communications with my friends and family. I use it as a guideline for many of my presentations on ‘Effective Communication’. I use it as a guideline whenever I speak about Effective Communication in front of audiences. Here on Quora, I try to answer questions related to communication skills. Here are few ones I have answered. What is the best way to improve communication skills? How can you improve your communication skills? How do I become a better communicator?  Chaw. Enjoyed this? Follow my inspirational blog to receive my latest articles as I write them in your inbox. ",
            "date": "Updated January 12, 2019",
            "views": "43",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Farhana Umar",
                    "user_href": "/profile/Farhana-Umar"
                },
                {
                    "user_id": "Pratyush Dutta",
                    "user_href": "/profile/Pratyush-Dutta-1"
                },
                {
                    "user_id": "Abhi C",
                    "user_href": "/profile/Abhi-C-49"
                },
                {
                    "user_id": "Shruti Komal",
                    "user_href": "/profile/Shruti-Komal-2"
                },
                {
                    "user_id": "Sahil Bisht",
                    "user_href": "/profile/Sahil-Bisht-65"
                },
                {
                    "user_id": "Zahrah Musa",
                    "user_href": "/profile/Zahrah-Musa"
                },
                {
                    "user_id": "Chhatra Ram",
                    "user_href": "/profile/Chhatra-Ram"
                }
            ]
        }
    ]
}