{
    "title": "What was the worst school you ever went to? - Quora",
    "tags": [
        "The Worst Thing",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jasmine Johnston",
                "href": "/profile/Jasmine-Johnston-9"
            },
            "answer_text": "My middle school It wasn't the worst school ever and there were definitely worst schools in the district. I didn't really notice how bad it was till 8th grade and there would be fights at least once or twice a week. One day after running an errand for someone in the office, I came across someone's weave. This was an occurrence that happened occasionally when there was a fight. I'm pretty sure a few kids from my school got arrested and went to the school for kids who get in trouble a lot. There's a few fights from my school that are on YouTube (probably normal for other schools too). For the 8th grade field trip, we went to Busch Gardens. I had my mom chaperone (bad idea- I know). I got on the bus and see the teacher who didn't care what kids were doing and the kids who talked about smoking blunts, drugs, and sex. My mom was listening to them wondering why the teacher wasn't doing anything. She was amazed that this was how the public school system was. I'm glad she got to see the stuff from my point of view when I told her about how bad school was. And then the worst thing happened, the bus’s A/C stopped working. Everyone on the bus was complaining and yelling. “F*ck this sh*t,” one student had said. “I could be home smoking weed,” someone else stated. My mom looked at me and was pretty angry about their use of language and the teacher who wasn't doing anything. After we were on the road for 20 minutes the students finally made the really rude bus driver pull over and move us on different buses. All the buses moved to the side and we got out. The buses were so close to being full, so a lot of kids had to sit on others and the floor. Then things got a little better since there were more teachers that students are scared of on the bus we were now on. My mom got to see the true colors of the school I went to and started to consider sending my little brother to private school. And that experience is why middle school was probably the worst school I went to. The teacher from paragraph 3 was fired a year later. ",
            "date": "Answered July 4, 2017",
            "views": "938",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jonathan Fernandes",
                    "user_href": "/profile/Jonathan-Fernandes-12"
                },
                {
                    "user_id": "Kumud Rathore",
                    "user_href": "/profile/Kumud-Rathore-6"
                },
                {
                    "user_id": "Benson Abraham",
                    "user_href": "/profile/Benson-Abraham-8"
                },
                {
                    "user_id": "Fensaree Mis",
                    "user_href": "/profile/Fensaree-Mis"
                },
                {
                    "user_id": "Andrew Walden",
                    "user_href": "/profile/Andrew-Walden-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kishor Mali",
                "href": "/profile/किशोर-माली-Kishor-Mali"
            },
            "answer_text": "It was my post-graduation school (college) and I am telling you why. We have to attend college from morning 8.30 AM to 5.00 PM.If you can’t reach to 80% attendance, you need to pay Rs. 30/- each lecture you missed. (If you have sever problems things still no compromise in fine) .You can’t get exam hall-ticket if you don’t pay fine.There is no placement cell over there. Vice-president used to ask to students that, please search person in your contacts for the post of TPO. (Its real, not a joke)HOD, enters to the class only to give instructions regarding FINE.Lecturers coming with pendrive during practical sessions, without pendrive the so called java specialist can’t complete the any program (C, C++, Java).We paid 70k for nothing. We had good infrastructure, but not good people. Good people left that place within an year. Only political shits are working there now.No cultural events. If girls and boys caught talking with each other, lecturers used to harass that girl and boy during lectures and exams.We hostellers loves hostel a lot. Campus area was good. We have good relations with hostel rectors than our lecturers. Not a single placement happen during my batch by college. Everyone struggle at their own. Some friends took references from seniors. Now, college started new drama. They call everyone and asking their current job details. And they are going to show on the board during admissions that these many students got placement from the college. SHIT! ",
            "date": "Answered July 4, 2017",
            "views": "887",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Fernandes",
                    "user_href": "/profile/Jonathan-Fernandes-12"
                },
                {
                    "user_id": "Nippy Candy",
                    "user_href": "/profile/Nippy-Candy"
                },
                {
                    "user_id": "Ayushman Shukla",
                    "user_href": "/profile/Ayushman-Shukla-8"
                },
                {
                    "user_id": "Gaurav Dua",
                    "user_href": "/profile/Gaurav-Dua-21"
                }
            ]
        }
    ]
}