{
    "title": "What skills do I need to survive the imminent collapse of human civilization due to climate change? - Quora",
    "tags": [
        "Survivalism",
        "Apocalyptic and Post-Apocalyptic Hypothetical Scenarios",
        "Civilization",
        "Survival",
        "Climatology",
        "Climate Change",
        "Skills"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Elvidge",
                "href": "/profile/Peter-Elvidge-2"
            },
            "answer_text": "Simple, basic skills. Procure a water supply, grow food, build shelter, defend yourself from raiders. Can you do these things ? Thing is, most of us have forgotten basic life skills, so dependent have we become on our complex globalised economy to provide for us. I might have spent years building skills in data analysis and programming and so forth. What use will these skills be following a collapse of the world order where there is no water coming out of the taps and no food on supermarket shelves. They will be no use at all. We would all be like helpless infants, so dependant have we become on the cultures within which we live. This is why the Dark Ages of medieval Europe lasted for so long. It was because the Roman Empire was so successful that its collapse was so catastrophic. All civilisations end in (usually) catastrophic sudden downfall. The higher the levels of complexity achieved, the deeper the shock of the eventual downfall. ",
            "date": "Answered July 1, 2019",
            "views": "140",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tamas Muszbek",
                    "user_href": "/profile/Tamas-Muszbek"
                },
                {
                    "user_id": "Barry Lewis",
                    "user_href": "/profile/Barry-Lewis-6"
                },
                {
                    "user_id": "Joe Paladin",
                    "user_href": "/profile/Joe-Paladin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barry Lewis",
                "href": "/profile/Barry-Lewis-6"
            },
            "answer_text": "“The imminent collapse of human civilization” Say what? You do know that if this prophesy comes true then homo sapiens will cease to extinct. Not only will homo sapiens become extinct but all oxygen breathing animals also. You do know that O2 is 19.9% of the atmosphere. N is near 80%. The other 1.1% contains trace elements. I'll emphasise that again: TRACE ELEMENTS. CO2 is 0.004% of that 1.1% of the trace elements. I'll let you do the maths. ",
            "date": "Answered July 1, 2019",
            "views": "77",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Pattison",
                    "user_href": "/profile/Robert-Pattison-4"
                },
                {
                    "user_id": "Gerard Smorowski",
                    "user_href": "/profile/Gerard-Smorowski"
                }
            ]
        }
    ]
}