{
    "title": "What role do statistics play in education? - Quora",
    "tags": [
        "Learning About Statistics",
        "Roles and Responsibilities",
        "Statistics (academic discipline)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Faust Kristin",
                "href": "/profile/Faust-Kristin"
            },
            "answer_text": "1) Business: Statistics play an important role in business. A successful businessman must be very quick and accurate in decision making. He knows that what his customers wants, he should therefore, know what to produce and sell and in what quantities. Statistics helps businessman to plan production according to the taste of the costumers, the quality of the products can also be checked more efficiently by using statistical methods. So all the activities of the businessman based on statistical information. He can make correct decision about the location of business, marketing of the products, financial resources etc… (2) In Economics: Statistics play an important role in economics. Economics largely depends upon statistics. National income accounts are multipurpose indicators for the economists and administrators. Statistical methods are used for preparation of these accounts. In economics research statistical methods are used for collecting and analysis the data and testing hypothesis. The relationship between supply and demands is studies by statistical methods, the imports and exports, the inflation rate, the per capita income are the problems which require good knowledge of statistics. (3) In Mathematics: Statistical plays a central role in almost all natural and social sciences. The methods of natural sciences are most reliable but conclusions draw from them are only probable, because they are based on incomplete evidence. Statistical helps in describing these measurements more precisely. Statistics is branch of applied mathematics. The large number of statistical methods like probability averages, dispersions, estimation etc… is used in mathematics and different techniques of pure mathematics like integration, differentiation and algebra are used in statistics. (4) In Banking: Statistics play an important role in banking. The banks make use of statistics for a number of purposes. The banks work on the principle that all the people who deposit their money with the banks do not withdraw it at the same time. The bank earns profits out of these deposits by lending to others on interest. The bankers use statistical approaches based on probability to estimate the numbers of depositors and their claims for a certain day. (5) In State Management (Administration): Statistics is essential for a country. Different policies of the government are based on statistics. Statistical data are now widely used in taking all administrative decisions. Suppose if the government wants to revise the pay scales of employees in view of an increase in the living cost, statistical methods will be used to determine the rise in the cost of living. Preparation of federal and provincial government budgets mainly depends upon statistics because it helps in estimating the expected expenditures and revenue from different sources. So statistics are the eyes of administration of the state. (6) In Accounting and Auditing: Accounting is impossible without exactness. But for decision making purpose, so much precision is not essential the decision may be taken on the basis of approximation, know as statistics. The correction of the values of current asserts is made on the basis of the purchasing power of money or the current value of it. In auditing sampling techniques are commonly used. An auditor determines the sample size of the book to be audited on the basis of error. (7) In Natural and Social Sciences: Statistics plays a vital role in almost all the natural and social sciences. Statistical methods are commonly used for analyzing the experiments results, testing their significance in Biology, Physics, Chemistry, Mathematics, Meteorology, Research chambers of commerce, Sociology, Business, Public Administration, Communication and Information Technology etc… (8) In Astronomy: Astronomy is one of the oldest branches of statistical study; it deals with the measurement of distance, sizes, masses and densities of heavenly bodies by means of observations. During these measurements errors are unavoidable so most probable measurements are founded by using statistical methods. ",
            "date": "Answered June 22, 2016",
            "views": "3",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Sumit Rana",
                "href": "/profile/Sumit-Rana-495"
            },
            "answer_text": "Statistics is an essential part of education. In other words, it is related as well as entirely depends upon mathematics. Probability is the foundation of the theory of probability. But now a day it is turned into the most advanced mathematical theory of Integration and Measures. With the increasing use of mathematics and statistics is building new ways for the development of statistics i.e., known as Mathematical statistics. Statistics is an essential branch of mathematics. Applied mathematics is a part of statistics that is specialized in data. Read more ",
            "date": "Answered August 3, 2019",
            "views": "23",
            "upvotes": "0"
        }
    ]
}