{
    "title": "What can technology do to help and protect the environment? - Quora",
    "tags": [
        "Environmentalism",
        "The Environment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sowmya Emmanual",
                "href": "/profile/Sowmya-Emmanual"
            },
            "answer_text": "I never felt it could, as technology has the stigma of having ruined the planet. I did chang my mind however when I was researching for a piece for my client. You can read the whole blog here: Technology That Can Save The Planet Here is an excerpt: Technology that can save the planet? Haven’t we all actually blamed technology for ruining the environment in the first place? True, the planet has been ruined by the abuse of its resources in the name of tech, but it is equally true that the right technology can and will heal the planet. Tapping into renewable sources of energy like wind, solar and hydroelectric power can make a whole lot of difference to the environment and technology helps make it more efficient. By effectively tapping and dispensing these renewables, technology has played a huge role in stalling the climate crisis. Then there is the tech that makes the paperless revolution possible. Going Digital can and is saving millions of trees as we saw in a previous blog. This series of blogs is dedicated to exploring new and innovative ways of saving the planet and we are open to featuring some of your ideas. For now, let’s explore three rad ways where tech is helping save the planet. Carbon Capture The havoc wreaked by carbon emissions on our environment is a horror story being played out every day. Capturing this poison and alchemizing it into something productive is a solution that is being made possible by companies like Carbonfree Chemicals. Direct capture of carbon emissions from a cement plant and converting it into commercial carbon-negative products is the plan. Their site says: “Carbonfree Chemicals’ vision is to have new or existing industrial manufacturing facilities, refineries, or even power plants equipped (or retrofitted) with SkyMine® technology. This technology will remove carbon from flue gases and transform it into solids like sodium bicarbonate (baking soda), and also produce hydrochloric acid, caustic soda, and bleach.” The idea is brilliant to say the least. They foresee a reduction of 300,000 tons of CO2 emissions per year through this initiative. This is just one of the many companies and organisations that are working to make this a reality. Organic Flow Battery A major breakthrough in the use of renewables is the Organic Flow Battery by Harvard. This is a metal-free flow battery and makes use of carbon-based molecules called quinones and which provides an inexpensive and effective storage of energy. This could replace conventional battery tech that is quite expensive. These organic flow batteries can store larger amounts of energy than conventional batteries. Here’s a quick look at the technology: Drones in Wildlife conservation The use of drones has made quite the difference in wildlife conservation. Drones can reach places that humans can’t and give us more effective access to wildlife. Spanning large spaces over wildlife reserves, these drones can keep track of endangered species and protect them from poachers. By providing a keener set of eyes, these drones can help conservationists a great deal. Here is an overview of the amazing work these drones are enabling in Africa: http://www.bbc.com/news/business-28132521 ",
            "date": "Answered September 11, 2017",
            "views": "794",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Reynolds",
                "href": "/profile/John-Reynolds-70"
            },
            "answer_text": "Build nuclear power plants. A lot of them.Modify coal and natural gas power plants to capture and sequester carbon.Stop approving construction of new coal-fired power plants.Stop approving construction of new natural gas power plants. Although they release less carbon than coal, they still release carbon. A lot of it. And the supply chain releases massive amounts of methane, which is much worse than carbon dioxide. There are better solutions (see #1), especially given that natural gas just doesn't make environmental sense.Stop adding alcohol to gasoline. Alcohol comes with a higher carbon footprint than gasoline but contains less energy per gallon.Spend more R&D money on CCS (carbon capture and sequestration).Spend more money on researching ways to convert carbon dioxide to energy.Spend more money on R&D into bacteria and other technology to create fuel from stuff that died recently, so that there's less need to pump petroleum to fuel cars and aircraft.Build hydrogen refueling stations nationwide, but require that hydrogen be manufactured using a zero-emissions solution like nuclear power (currently, natural gas is the primary feedstock).Continue to explore ways to put the cat back into the bag. There are ways to suck carbon out of the air, but this technology is in its infancy and should be well-funded because we are going to need it.Charge a carbon tax: This is essential to enabling the market to clean up emissions without excessive regulation. Charge by the ton of carbon emitted. Use this money to pay companies to remove atmospheric carbon. Pay by the ton of carbon sequestered. Do not use it to pay for anything else, like planting trees, etc. At the end of the year, whatever is left can be redistributed to all citizens equally without regard to need or income. This might seem to be a massive wealth redistribution project, and would be, at first. But as companies become successful in sequestration, it would become a new industry.After the previous suggestions are put in place, it's ok to explore these “feel-good” solutions that can't solve the problem by themselves but may help as part of the country's long-term zero-emissions energy strategy: Continue to explore ways to make solar energy collection more efficient and less harmful to the environment (I'm talking about the supply and disposal chains).Continue to explore ways to make windpower and wave power more efficient and safer for wildlife and the environment.Edit: Added item 11. ",
            "date": "Answered December 14, 2019",
            "views": "359",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nancy Hubbard",
                    "user_href": "/profile/Nancy-Hubbard-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Wihem"
                }
            ]
        }
    ]
}