{
    "title": "What was your IIT-JEE preparation story? - Quora",
    "tags": [
        "JEE Preparation",
        "Joint Entrance Examination",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chandrachud Pati",
                "href": "/profile/Chandrachud-Pati"
            },
            "answer_text": "Lol! My answer really would be very different from the ones you have heard or will be hearing. Pre-JEE phase- I had no idea of JEE till class 10th. It was after class 10 that I gave entrance exams for various top schools in Bhubaneswar and came to know from the pamphlets distributed by them of their achievements which read aloud on how many students qualified JEE. Though I was short-listed in all the schools, I was fool enough to enroll my self in an integrated curriculum and a coaching centre simultaneously. I thought I would read about Jee both in school and coaching what a bliss it would be! To which I failed utterly. I went to only 6 classes in the entire 2 years to the coaching class which was 30mins ride from the school hostel. A carefree kid- I had no plans for pursuing engineering. I just enjoyed bunking classes sleeping late nights and reading very few times. I had only one thing in mind. No one has become famous academically for the long term. My parents use to tell me stories of Mishraji ki ladki, Mohantyji ka launda. Yes, we are odias and you won't expect many Sharma's and Verma's here. And these stories faded away in 2 weeks. And as an avid social media user, I was aware of standup comedians, entrepreneurs, celebrities, content creators, politicians, and nowhere I was aware of any academically excellent people. To any Jee/Upsc toppers I don't remember any of them except Kalpit Veerwal because he is a student entrepreneur and a Youtuber now. So, I was okay with any colleges I would get because the college will not lead me to my dream place. I am not okay with placements and all but interested in creating my own space so that people will know me! Abroad Colleges exploration- Being from KiiT International School, I was also fascinated by the fact that many students go abroad for undergrad. I kept a secret phone(cons of studying in an orthodox environment) with me. Though it was for late-night chats, I used it constructively and searched for various options abroad. Our school also had a tie-up with Univariety - A counseling platform for the ones who want to study abroad. Mark here, I came to know of the opportunities nearly in February of 12th class(our was an integrated batch- so we were promoted before usual time) and the application portal of UK which is known as UCAS had its deadline as Oct-15(I guess). So I read and researched heavily about how the admissions happen. And to my astonishment colleges in the UK didn't accept SAT and Toefl scores mandatorily. I write fairly well and was accepted for CS majors at University College London which ranks freaking 8th in the world and to other colleges like the University of Manchester(Rank 27) and Bristol(Rank 49) as well. I was happy and the total budget of 3years(UK undergrad courses are of 3 years) would be around 75 lacs. But then I introspected. I thought if, after moving there I wouldn’t love CS and be pressurized to work just to pay back the loans-this wouldn’t make me happy. So, I dropped the plan of studying abroad. January JEE- I was great at last minute studies. I don't know how I was motivated. But, I studied for nearly 12 hours daily in the month of December. This is the highest I had studied. And believe me, I started and finished(somewhat) in that month only. Took out prev year questions, vedantu, unacademy helped in strategies and clearing last-minute concepts and strategies. And voila! I scored a decent percentile! BOARDS- I scored fairly well in boards. And this was even last minute preparation coz being in an integrated school, we were never taught how to write long descriptive answers. Being from ICSE background helped here. COLLEGE SELECTION AND DU- I was very much confused after the results. I liked only one subject till now. And this was Mathematics. My JEE-Adv scores were not that good. And I was getting Maths in one of the top colleges in DU- Ramjas College and NIT Rourkela. But the major difference was that- BSc at Ramjas was of 3years and it was Int. MSc at NITR for 5 years. I decided the former and went to the city of UPSC dreams- Delhi. After St. Stephens, Hindu and Hansraj, Ramjas was the fourth-best college of DU and the college area was nearly the size of my previous school! *chuckles* Returning to NITR after disowning Ramjas- I hadn’t filled the JOSAA. And I didn’t like the atmosphere in Delhi. I lived in a place that was walking distance from Hudson lane and North Campus. It was very densely populated. You will see people everywhere living from dim light garbage areas of East Delhi to posh areas of South Delhi. And if you are here till now- you must have known that I am the most confused soul you have come across to date. So I decided to have time before I could decide anything about my future. And I went for filling the CSAB round. I was accepted in the 3rd list of DU. So just after 4–6 days stay in Delhi I returned to my place. And it was the time of CSAB round and luckily there were vacant seats in my favoured branch and I was accepted to Mathematics at NITR. Future Prospects- In the world of tomorrow, the companies will rule the world not the government.(Not mentioning the communist govt in China)If a settlement on Mars happens either Amazon or SpaceX will be God there. Look at a point here, Narendra Modi is in very good terms with Ambani. US is majorly dominated by Apple, Microsoft, Facebook. Where there is money, there is power. Mark my words, I didn't say peace. Create something of your own, Solve common man’s need, Be someone that many look up to and many remember for your good deeds to mankind. Let’s go with the move for now. I am interested in Mathematics and that's it. Let's see what happens. And now I am really very happy at my decision. A lush green campus of 1200 acres. Great friends, great club culture. NITR is one of the best places to study and LIVE! But the main thing is that I tried all possible options and now I am not in a state that ‘yaar yeh le liya hota toh achha hota’. I am happy. Peace is not the ultimate goal of life. It is the most fundamental requirement. Signing off! Cheers! P.s: It was my story. But if someone wants to pursue further studies and make breakthrough research, IIT's, NIT's are the best place to do so. Go through my other answers on how to prepare. And if you are someone who looks for opportunities, trust me these are the best places in India. Study hard and be a part of the wonderful alumni network. I wish you a best of luck in your journey! ",
            "date": "Updated June 19, 2020",
            "views": "153",
            "upvotes": " View 133 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rachit Goyal",
                    "user_href": "/profile/Rachit-Goyal-90"
                },
                {
                    "user_id": "Priyal Powle",
                    "user_href": "/profile/Priyal-Powle"
                },
                {
                    "user_id": "Golden-Snowflakes",
                    "user_href": "/profile/Golden-Snowflakes"
                },
                {
                    "user_id": "Harsh Kumar Singh",
                    "user_href": "/profile/Harsh-Kumar-Singh-165"
                },
                {
                    "user_id": "Pranathi Devulapally",
                    "user_href": "/profile/Pranathi-Devulapally"
                },
                {
                    "user_id": "Keshav Nair",
                    "user_href": "/profile/Keshav-Nair-34"
                },
                {
                    "user_id": "Naman Alagh",
                    "user_href": "/profile/Naman-Alagh-3"
                },
                {
                    "user_id": "Mukesh Sharma",
                    "user_href": "/profile/Mukesh-Sharma-4427"
                },
                {
                    "user_id": "Afreen Sultana Laskar",
                    "user_href": "/profile/Afreen-Sultana-Laskar-2"
                },
                {
                    "user_id": "Kriti Kamal",
                    "user_href": "/profile/Kriti-Kamal-8"
                }
            ]
        }
    ]
}