{
    "title": "What should I do to clear viteee? - Quora",
    "tags": [
        "Vellore Institute of Technology, Vellore Exams and Tests",
        "Vellore Institute of Technology Engineering Entrance Examination (VITEEE)",
        "Vellore Institute of Technology, Vellore"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vijay Saran",
                "href": "/profile/Vijay-Saran-4"
            },
            "answer_text": "Vit is something which you can crack any day. I secured AIR 2134. Go through these points, they will help you for sure  1. Time Management: VITEEE is not about solving all questions, but it is about solving decent number of questions in a given time frame. If you are unable to solve any question do not waste time on a particular question. Move to the next question and try to solve easy questions rather than focusing and spending more time on solving more difficult question because you have to attempt the whole test (coz there is no negative marking) 2. Understand basic concepts: It is really important to complete your NCERT books as these textbooks will help you to build your base and you can learn the basics. Always ensure that you are covering all topics of NCERT books well on time. The NCERT of Class 11 and Class 12 covers about 45 percent and 55 percent of the VITEEE question papers, respectively. 3. Develop speed and accuracy skills: While preparing for the VITEEE give importance to speed in working out the problems. Try to make your own strategy to crack the exam. Enhance your skills and try to master analytical skills with conceptual understanding. Aim for 100 percent strike rate. This will give you an edge over the other students. Speed and accuracy is really important to crack this VITEEE exam. 4. Practice a lot: VITEEE exam require lots of hard work and practice. The more you practice, the better it is for you. The more you spend time on solving the question the more you get familiar with problems and fine tune your basic concepts. 5. Clear your concepts: Take a proper guidance from your teacher. Try to clear the confusion and clear your concepts. It is really important to have a good base and strong foundation to solve all level of questions. 6. Group study: If possible try to study in group. It might be that while studying alone you might find some topic unimportant but in group you came to know about its worth. Studying in a group you get chances to clear your concepts and queries. 7. Last year papers: Last year papers are good way to know the pattern the questions. Also many time questions are repeated from last year papers. Solve all the last year papers. You can get tons of last year papers online. 8. Make notes: Take notes of the tips preparing for VITEEE exam. It helps a lot in last minute revision. Make your notes your best friend during exam. You can make your short notes and make the information handy for you, so that all the time you will not go back to your books again and again. 9. Mock Tests/ Sample Papers: Previous year papers of VITEEE are imperative in the sense that they help in knowing the trend of questions asked in the exam. After covering certain portion of syllabus, refer the past year papers and try attempting the questions. This will also help you in identifying your weak points so that you can work on them. Solve tons of last year papers as they will also help in improving your accuracy. 10. Revision: Keep on revising the areas already covered after some days. Matter does not get stored in memory permanently. We tend to forget after some time as the memory fades away gradually. So cover some section of one subject, switch to the other subject and then again revise the first subject.Have faith in yourself, try your level best and you’ll surely win the race! Good Luck! ",
            "date": "Updated April 18, 2016",
            "views": "25",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sankalp Dev",
                    "user_href": "/profile/Sankalp-Dev-1"
                },
                {
                    "user_id": "Ganesh Kommana",
                    "user_href": "/profile/Ganesh-Kommana-2"
                },
                {
                    "user_id": "TIFFIN BOX",
                    "user_href": "/profile/TIFFIN-BOX-1"
                },
                {
                    "user_id": "Srivathsav",
                    "user_href": "/profile/Srivathsav-3"
                },
                {
                    "user_id": "Hari Das",
                    "user_href": "/profile/Hari-Das-246"
                },
                {
                    "user_id": "Siddharth Sengupta",
                    "user_href": "/profile/Siddharth-Sengupta-10"
                },
                {
                    "user_id": "Thaara Gop",
                    "user_href": "/profile/Thaara-Gop"
                },
                {
                    "user_id": "Yamini Seepana",
                    "user_href": "/profile/Yamini-Seepana"
                },
                {
                    "user_id": "Priyanka Salunke",
                    "user_href": "/profile/Priyanka-Salunke-2"
                },
                {
                    "user_id": "Animesh Singh",
                    "user_href": "/profile/Animesh-Singh-354"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kunjan Modi",
                "href": "/profile/Kunjan-Modi-1"
            },
            "answer_text": "To clear the VIT examination u should go through the previous year questions of different-different private examinations like Bits,vit itself.For vit you have to clear about theory and some different topics are also there in vit examination  then the other exams.At the  same time there also some topics are not in vit examination syllabus as compare to mains or other exams syllabus.So my advise is that u first go through the syllabus then do your theory part best and then focus on conceptual questions. ",
            "date": "Answered April 6, 2016",
            "views": "696",
            "upvotes": "0"
        }
    ]
}