{
    "title": "What's the purpose of child punishment? - Quora",
    "tags": [
        "Punishment",
        "Purpose",
        "Children"
    ],
    "response": [
        {
            "author_info": {
                "name": "James C. Talbot",
                "href": "/profile/James-C-Talbot"
            },
            "answer_text": "The concept of punishment goes back to our cave-dwelling days. ‘Get frustrated, then angry, and then lash-out’ has always been the order of the day. Eventually, we came to consider that punishment as a means of retribution was a bit crass so we decided to define it as a ‘teaching tool’ and as a way to exact ‘justice’ on those who break the rules or offend our sensibilities. Do traditional forms of punishment hurt people more than help them? Yes, it would seem so. The only party helped is the punisher through being afforded the opportunity to gain a measure of satisfaction for having been offended. This measure of satisfaction comes in the form of retribution and serves as the primary basis for our system of punitive measures. It’s a circumstance evidenced by the fact that we, as a society, would prefer to lock offenders in a cage for a time rather than sentence those offenders to gainful employment as a means of making retribution to those who have been harmed as the result of their crimes. Additional evidence of our penchant for punishment can be seen through the traditional notion that our punishments serve as a ‘teaching methodology’. We pay lip service to ‘teaching them a lesson’ while knowing full-well that rule-breakers are going to go right on breaking the rules. We still want our ‘pound of flesh’ even though it often proves to be counter-productive and works against our best interests. For example, many parents will claim that hitting their children works as a punishment. It works so well that they keep hitting their children time and time again. It’s not hard to see the flaw in such logic. We’ve reached a point in our social evolution that finds the veracity and effectiveness of our methods of punishment being placed in question. We lock offenders up in prisons only to eventually release them back into society more anti-social than when they were first incarcerated. More flawed logic. Perhaps it’s time we take a hard look at our penchant for vengeance and retribution while at the same time reconsidering our views on what actually constitutes the concept of ‘justice’ as a rationale for punitive measures. I say this because, as of now, there has been a mountain of accumulated evidence indicating that there are far greater risks and poor outcomes related to punishment (as we know it) than there are positive outcomes. As it turns out, it appears that while some degree of immediate, short-term behavioral change might result as a consequence of our methods of punishment, there is a much greater probability of long-term emotional or physical harm caused as a result. Over half a century ago, a psychologist named, B.F. Skinner, *proved* (not theorized) that positive reinforcement was superior to negative reinforcement within a learning environment. Subsequent research over the years has substantiated Skinner's findings on a number of fronts. There are two major conclusions to be drawn by this point in time: Positive reinforcement serves as a necessary component within a healthy process of emotional growth and development in children.Punishment serves no benefit to a healthy process of emotional growth and development in children and is highly prone to instead serve as an obstacle to that process.The concept of punishment is designed to alter behavior through treatments meant to demean and diminish the wrongdoer. It’s a treatment that runs counter to the crucial development and maintenance of self-esteem/self-worth, which are necessary factors related to a healthy process of growth and development in association with a continuing sense of well-being. In recent years, there have come about methods of positive discipline that are safer, more effective methods than traditional punitive practices and, by all accounts, they appear to be the way of the future. ",
            "date": "Answered January 25, 2020",
            "views": "54",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Eric Davis",
                    "user_href": "/profile/Eric-Davis-244"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kim Baumgart",
                "href": "/profile/Kim-Baumgart"
            },
            "answer_text": "Science has shown us, most recently through brain scans that there is no good purpose in punishment. Science has also shown us, with most recent brain research, that the theories of child development that have been around for a fairly long time are pretty accurate. A child’s brain is made to be wired during the first 8 years of life, most quickly during the first 3. The purpose of that wiring is to lay the foundation for a lifetime. Punishment shuts the brain down which causes negative feelings and makes critical thinking difficult. Whereas, teaching children in a positive and supportive way builds trust and helps children learn important things they need to know in life. ",
            "date": "Answered January 26, 2020",
            "views": "28",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eric Davis",
                    "user_href": "/profile/Eric-Davis-244"
                },
                {
                    "user_id": "James C. Talbot",
                    "user_href": "/profile/James-C-Talbot"
                }
            ]
        }
    ]
}