{
    "title": "What are the Top SAT books? - Quora",
    "tags": [
        "Johns Hopkins University",
        "SAT (Scholastic Assessment Test)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yashodhan.B",
                "href": "/profile/Yashodhan-B"
            },
            "answer_text": "Hello! I will suggest you some great books that have been proven effective and will surely help you to get at minimum 1500+ on the SAT exam! Maths:- for math, I would recommend you to go on khan academy and watch all videos and attempt all the questions theory-wise there I can’t stress this enough! After you have a good handle over theory..purchase the John chungs Math level 1 book…it has around 55 or so tips and tricks which will surely help u, and also has around 10–12 practice tests which are harder than the real test so don’t be discouraged if you get very low score in those…usually I add 100 or so points in my score from these tests to compare it to the real thing. This should be enough for an 800 or at least 750+ reading and writing:- this skill can’t be improved just in a week or even months…reading skills take years to improve. In terms of practice, again finish your khan academy reading and writing and make sure to get to level 4 in all reading and writing in khan academy. After that purchase the Erica Meltzer “The critical Reader” book it will boost your score a lot and it’s singlehandedly the most recommended book for reading. For writing you may also purchase Erica Meltzer:- “The ultimate guide for sat grammar” both books are amazing! after you are finished with the practicing…give yourself at least 3–4 weeks of practice tests if you have a lot of time on hand (preferably months) and if not u might do it in 1–2 weeks also. There are full 10 practice tests available for free on khan academy website which you can take directly online. With dedication and consistency you will easily achieve 1600! Any of the books I mentioned belong to their respective authors and I am not advertising or doing any sort of promotion of these books at all. These books are recommended by personal experience only. All the best for your preparation! ",
            "date": "Answered October 8, 2020",
            "views": "86",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edmund Bantes",
                    "user_href": "/profile/Edmund-Bantes"
                },
                {
                    "user_id": "Evan Jonlich",
                    "user_href": "/profile/Evan-Jonlich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shenandoah Duraideivamani",
                "href": "/profile/Shenandoah-Duraideivamani"
            },
            "answer_text": "Refer Which books are the best to prepare for the SAT preparation? and select one for your preparation. I would personally recommend Barron’s. It is a bit harder than the actual SAT, but it is better to write a harder mock test than the easier one. So if you are in a time constraint, don’t get demotivated by the mock test results. You can conclude SAT preparation, by taking Official SAT Practice Tests, published by College Board, one by one and try completing all of them. This gives you practice to remain concentrated for full exam duration and also help you in bridging the knowledge gap. Practice makes you perfect and also gets you used to the rigor of actual test. Take the most recent one, answer as if you are doing in a test center and within the prescribed time. Evaluate your answers, you have scoring sheet and also explanations to answers available.Review all wrong / guessed questions and understand how you can get them right next time. Take the next practice test, adopt this iterative approach, until you complete all official tests and will definitely improve your overall score. ",
            "date": "Answered December 30, 2017",
            "views": "22",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shaik Owaise",
                    "user_href": "/profile/Shaik-Owaise-1"
                },
                {
                    "user_id": "Varun Raj",
                    "user_href": "/profile/Varun-Raj-222"
                },
                {
                    "user_id": "Gauri Nautiyal",
                    "user_href": "/profile/Gauri-Nautiyal"
                },
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                }
            ]
        }
    ]
}