{
    "title": "What is the procedure of getting into IB? - Quora",
    "tags": [
        "International Baccalaureate (IB)",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Tippett",
                "href": "/profile/Alex-Tippett-1"
            },
            "answer_text": "You must take your textbooks and create a shrineThen you pray to this shrine 3 times a dayTake your calendar and clear it of all activitiesFill your head with crazy acronyms (IA,EE, CAS, TOK, EA, DP, AOK,WOK)After a week of praying to the textbook shrine you must travel up a mountain to a store to buy Blue and Black Ink pensThese blue and black ink pens cannot be erasable and/or gel.Place these pens on your shrinePray to this shrine for 7 more daysThen you can join the IBIn all seriousness, you can probably take an examination offered by your school or talk to the IB coordinator at your school in order to find out what requirements you need to be a part of IB. Some schools don’t make you do anything in order to take IB classes, you just have to talk to your school’s IB coordinator. ",
            "date": "Updated December 31, 2017",
            "views": "962",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rishi Kothari",
                    "user_href": "/profile/Rishi-Kothari-22"
                },
                {
                    "user_id": "Lily Leo",
                    "user_href": "/profile/Lily-Leo-2"
                },
                {
                    "user_id": "Deborah",
                    "user_href": "/profile/Deborah-172"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Ranjan",
                "href": "/profile/Abhishek-Ranjan-790"
            },
            "answer_text": "The intelligence bureau (ministry of home affairs) conducts the ACIO exam for recruitment of assistant central intelligence officers. It is a Grade – II, Group – C (non-gazetted, non-ministerial), executive post with the intelligence bureau. It is a very prestigious exam similar to other government exams such as the SSC combined graduate level examination ( SSC CGL). The IB ACIO Tier-1 exam is on October 15 and Tier-2 is in January 2018. In this post, Abhishek Patil, CEO and co-founder at Oliveboard, an online preparation portal for MBA, banking and government exams, discusses each of the sections of the IB ACIO exam ",
            "date": "Answered January 24, 2019",
            "views": "454",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Praveen Kumar",
                    "user_href": "/profile/Praveen-Kumar-20627"
                },
                {
                    "user_id": "UJJAIN MOTHAY",
                    "user_href": "/profile/UJJAIN-MOTHAY"
                }
            ]
        }
    ]
}