{
    "title": "What is the perfect timely table for class 8 with Byju’s and coaching classes? - Quora",
    "tags": [
        "BYJU'S (company)",
        "Coaching"
    ],
    "response": [
        {
            "author_info": {
                "name": "Samaira Kapoor",
                "href": "/profile/Samaira-Kapoor-19"
            },
            "answer_text": "Well I cannot mention a perfect time table but I do have few suggestions which you can utilize while making your time table. As you are packed with two different coaching, make sure to bring out some time for your self study because no amount of coaching can make you understand the subjects unless you don’t read and practice yourself.Take out time for good sleep and proper food. Also give yourself short relaxation breaks. Don’t over burden yourself.",
            "date": "Answered October 21, 2020",
            "views": "20",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Samar Nayar",
                    "user_href": "/profile/Samar-Nayar"
                },
                {
                    "user_id": "Subham Pradhan",
                    "user_href": "/profile/Subham-Pradhan-74"
                },
                {
                    "user_id": "Harsita Saikia",
                    "user_href": "/profile/Harsita-Saikia-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anmol Pangtey",
                "href": "/profile/Anmol-Pangtey"
            },
            "answer_text": "When I saw the question, my reaction was “Bacche ki jaan loge kya?” First of all, before I answer to your question I have to ask something. Why do you have both coaching classes and byjus subscription? Waste of money and time and effort If you ask me If this is a parent asking, then I would recommend you not to put too much pressure on your child. My guess is you are preparing your child for jee/neet. If this a student, then instead of asking this, make your own timetable and make sure not to study a lot because this time will not come again and you might regret it later that you didn't enjoy your life during this time. ",
            "date": "Answered October 21, 2020",
            "views": "25",
            "upvotes": " Answer requested by Harsita Saikia"
        }
    ]
}