{
    "title": "What are the main characteristics of a good thesis? - Quora",
    "tags": [
        "Academic Research in Graduate School",
        "Graduate Education in Computer Science",
        "Theses and Dissertations",
        "Graduate School Education",
        "Academic Research",
        "Writing Advice",
        "Computer Science Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hải Yến",
                "href": "/profile/Hải-Yến"
            },
            "answer_text": "I'm not gonna tell you the main features of a good thesis because I have no clue of it, or at least, I can not define what a good thesis is. What I'm gonna say here is, hopefully, to help you set standards of writing thesis, not walk in the dark.1. Coherence: Obviously we do not write more than 10,000 words within one night. Instead, we separate it into parts and complete them day by day. This will evoke one issue: You care for the parts and not the whole context. For instance, you mention one supposition in theoretical chapter and promise to test it later on. But you just forget it because once you finish writing each chapter, the feeling of happiness, glory and whatever invades you. Looking back to figure out mistakes and correct them? Such a nightmare! So, be brave!2.  Integrity: You do not own what you do not work for. So, whatever ideas, comments or results you've got from sources, name the authors and specify the page numbers if any. Think about thesis as a channel to discuss with academic world. You read the ideas of others and you follow them, criticize them but never steal things from them. Stealing ideas of others either on purpose or by chance do not add value to your thesis. So, be highly strict on this point. 3. Precision: Don't get me wrong here. Perhaps, in the most credible case, you end up with wrong results, not on purpose. It's still acceptable. This is what I mean: Do not expect to get the results that model is not designated for. At the very first time, read the assumptions and relevant scenarios of the model carefully. I spent 1,5 months to conduct tests on a harsh model and did not get what I was supposed to test. Trust me, the more important it is, the slower you should work on it. There it is. Finally, writing thesis should be an enjoyable path that makes you figure out your real ability and interest. ",
            "date": "Answered February 13, 2015",
            "views": "44",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Donna Williams",
                    "user_href": "/profile/Donna-Williams-238"
                },
                {
                    "user_id": "Mahmut Cavdar",
                    "user_href": "/profile/Mahmut-Cavdar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Angie Stones PhD",
                "href": "/profile/Angie-Stones-PhD"
            },
            "answer_text": "The best and ONLY basis for good theses is to read, read and read past research papers and find a gap in that literature. Something that needs to be further investigated or something the authors neglected. For example, you may read a paper on Panic Attacks among first year University students but you notice that the age demographics is from 18–45 years of age. You look closer and you notice that quite a lot of students are in the 25–30 bracket and you wonder if the results those authors got would stand true if the other age groups are excluded. Next step is to look at the literature to see if anyone had already done that. If not, you have a gap. I hope this (very simplistic example) helps, ",
            "date": "Answered July 2, 2018",
            "views": "18",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mariam Fouad",
                    "user_href": "/profile/Mariam-Fouad-19"
                },
                {
                    "user_id": "Noor Aljanaby",
                    "user_href": "/profile/Noor-Aljanaby"
                },
                {
                    "user_id": "Mira Ali",
                    "user_href": "/profile/Mira-Ali-2"
                },
                {
                    "user_id": "Júlio César Ribeiro",
                    "user_href": "/profile/Júlio-César-Ribeiro-1"
                },
                {
                    "user_id": "Lois Bornilla",
                    "user_href": "/profile/Lois-Bornilla"
                }
            ]
        }
    ]
}