{
    "title": "What universities accept an IB certificate? - Quora",
    "tags": [
        "International Baccalaureate (IB)",
        "Professional Certifications",
        "Colleges and Universities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mohammed Abdul Khader",
                "href": "/profile/Mohammed-Abdul-Khader-39"
            },
            "answer_text": "Actually, It is accepted by the vast majority of universities. almost all universities accept the IB diploma as an alternative to A-Levels. I went on a university trip recently, and the admissions tutor told us that he actually preferred IB, as it shows that you are a more well-rounded person. individual subject Certificates may be completed by students not wishing to complete the IB Diploma Program. Students who complete the course of study in an IB subject are eligible to take exams for individual subject Certificates. Colleges award course equivalent upon entry for students who earn scores of 5 or higher on a scale of 7on I.B. exams. A score of 38 or 39/45 points or more at IBin IB is a ticket into any university with IBs is like 6 A* at a level, If you get 45, you are officially a genius. Any score above 40 is absolutely amazing. It is more difficult than a course of A levels and is recognised all over the world as a leading qualification. ",
            "date": "Answered March 25, 2020",
            "views": "23",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Miguel Lopes",
                    "user_href": "/profile/Miguel-Lopes-49"
                },
                {
                    "user_id": "Iec Saudi",
                    "user_href": "/profile/Iec-Saudi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Markus Ng",
                "href": "/profile/Markus-Ng-7"
            },
            "answer_text": "The IB is an internationally recognized programme. This means that universities in many countries actually recognize the IB diploma. Most universities also have the required IB scores for their courses posted on their websites. In Singapore, although universities accept students who apply using their IB grades, there are many instances whereby the required IB scores are not shown. I think this is probably because IB is still relatively new in Singapore, especially with local students. Best to check with any particular university you want to apply with. ",
            "date": "Answered October 12, 2020",
            "views": "294",
            "upvotes": "0"
        }
    ]
}