{
    "title": "What is your PhD thesis in one sentence? - Quora",
    "tags": [
        "Graduate School Research",
        "Academic Research in Graduate School",
        "PhD Thesis",
        "Theses and Dissertations",
        "Academia",
        "Graduate School Education",
        "Academic Research",
        "Doctor of Philosophy Degrees",
        "Research",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pranav Vasanthi",
                "href": "/profile/Pranav-Vasanthi"
            },
            "answer_text": "This very question had been put to me by a diverse range of people during my PhD and my answer always depended upon the person who asked them. From the top of my head, here are a number of answers which I had given to a range of interesting people: Random stranger at the bus-stop/pub/subway/restaurant etc.): So basically…I am researching to see if e-cigarettes cause any harm or not…and I am doing this without using any animals…so just…you know…using human cells from the lungs…it is really cool! (Ends the conversation by giving them my personal opinion)School kid (interested in science, especially biology): Yeah so…I am looking into the possible effects of e-cigarettes, you know these products, don’t you? (waits for a response)…so I am basically trying to research what happens when I deliver e-cigarette vapours over a layer of human cells derived from the lung…what do you think might happen? (waits to hear their answer and continues to stimulate more interest)Rough school kid (not interested in science, me trying to stimulate an interest): Well, you know these e-cigarettes…the vaping stuff that everyone are using right? I am trying to find out if they are harmful to our lungs or not. And so far, my research has shown that they might not be that good…you know why? (Waits for a response from the kid and then continues to give moreinsight)Fellow PhD student (biologist): I’m investigating the cytotoxicity of e-cigarette aerosols using an in-vitro, co-culture model of differentiated human bronchial epithelium with underlying pulmonary fibroblasts. (Goes into an in-depth explanation of the experimental designs and the research questions being addressed)Fellow PhD student (non-biologist): I’m assessing the toxicity of e-cigarette vapours using relevant cell types from the human lungs. (The person’s response then steers the conversation in different directions)University Professors (biologist): I am investigating the mechanisms of cell death and pro-inflammatory mediators production, chiefly IL-6 and IL-8, by human bronchial epithelial cells and pulmonary fibroblasts in response to different doses of e-cigarette aerosols delivered via a bespoke breathing system. (Goes on to ask for the Professor’s insight on my experimental design and possible avenues to further explore)University Professors (non-biologist): Same answer as for ‘Fellow PhD student (non-biologist)’ (Ends with an interesting fact about e-cigarettes and how my research might help the scientific community!)Engineers (with an interest in biology): I am investigating the effects of e-cigarette vapour on the human lung cells and in order to deliver the e-cigarette vapour in a physiologically relevant fashion, I have constructed a automated ‘aerosol delivery system’ in-house. (Goes on to ask for the Engineers’s feedback on my system design and ways to simplify/improvise the design further. Note that more emphasis was placed on the engineering aspect and not the biological)Engineers (with no interest in biology): I am focused on exploring the toxicity profiles of different e-cigarettes and in this pursuit, to deliver e-cigarette aerosols in a controlled fashion to the cells, I have built a prototype using micro-controllers that would effectively ‘puff’ the e-cigarettes in a regulated manner. Would you like to have a look? (Again, Note that more emphasis was placed on the engineering aspect and not the biological)As you would have noticed, I change my answers considerably depending upon the level of scientific knowledge the questioner might possess (a random assessment). In fact, I strongly believe that one skill every PhD student should develop over the course of their study is this: the ability to explain their thesis in a number of different ways to both specialists as well as non-specialists, focusing only on the relevant areas of their research depending upon the person they are talking to. Trust me, this skill is a gem!  Also, this is obviously not to say that a lay man is less-intellectual than a scientist. In deed, some of the most brilliant counter-questions/arguments I have ever received and that I ever struggled to answer were from the general audience. I am sure it is true of many other scientists as well. The goal of the answer is to demonstrate the importance of developing science communication skills and how this skill can significantly improve you as a scientist, besides giving you an upper edge during job interviews, workshops, conferences and general presentations. P.S: If you would like to know my answer to any other personalities other than that listed above, feel free to add them in the comments. I would be delighted to attempt to answer them. The tougher, the better! Pranav ",
            "date": "Answered April 20, 2020",
            "views": "959",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nicholas Vitale",
                    "user_href": "/profile/Nicholas-Vitale-5"
                },
                {
                    "user_id": "Suheilah A",
                    "user_href": "/profile/Suheilah-A"
                },
                {
                    "user_id": "Oscar",
                    "user_href": "/profile/Oscar-753"
                },
                {
                    "user_id": "Narasimhan M.G.",
                    "user_href": "/profile/Narasimhan-M-G"
                },
                {
                    "user_id": "Shravasti Misra",
                    "user_href": "/profile/Shravasti-Misra"
                },
                {
                    "user_id": "Rajan Gupta",
                    "user_href": "/profile/Rajan-Gupta-1007"
                },
                {
                    "user_id": "Pedro Frazier",
                    "user_href": "/profile/Pedro-Frazier-2"
                },
                {
                    "user_id": "Jar Robinson",
                    "user_href": "/profile/Jar-Robinson-3"
                },
                {
                    "user_id": "Lucy Jacobs",
                    "user_href": "/profile/Lucy-Jacobs-15"
                },
                {
                    "user_id": "Roberta Ellis",
                    "user_href": "/profile/Roberta-Ellis-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Lewenstein",
                "href": "/profile/Bruce-Lewenstein"
            },
            "answer_text": "In the mid-20th century, when scientists said “public understanding of science,” what they meant was “public appreciation of the benefits that science provides to society.”  Lewenstein, Bruce V. (1987). 'Public Understanding of Science' in America, 1945-1965. (Ph.D. dissertation), University of Pennsylvania, Abstract:The 20 years after World War II (1945-1965) saw the rise of a formal, institutional concern with popular science, which came to be known as the \"problem\" of \"public understanding of science.\" This dissertation traces the rise of that concern, and the reaction to it by four groups: commercial publishers, scientific societies, science writers, and government agencies. Although each group had its own reasons for responding, they came to a consensus: the term \"public understanding of science\" meant \"public appreciation of and support for the benefits that science provides to society.\" The consensus developed because the groups shared common values, especially a moral commitment to the value of science in the modern world and a belief in the congruence of science with democracy. The thesis begins by examining two magazines created in the late 1940s, the short-lived Science Illustrated and the new Scientific American, to show that economic constraints dictated the response of commercial publishers to the public understanding of science problem. Next, a discussion of the American Association for the Advancement of Science's renewed commitment to public understanding of science in the early 1950s shows the institutional revitalization that popular science provided to scientific societies. Public understanding of science also provided a route to professionalization for science writers during the 1950s (especially through the National Association of Science Writers and its offshoot. the Council for the Advancement of Science Writing). At government agencies such as the Atomic Energy Commission, the National Science Foundation, and the National Aeronautics and Space Administration, \"public education\" proved an effective institutional rationale for public information activities. Finally, despite its institutional focus, the thesis acknowledges the special role of foundation executive Warren Weaver (1894-1978) in shaping public understanding of science programs during the postwar period. The thesis is based on extensive archival research, contemporary published materials, and interviews with participants. It is part of an emerging literature that treats popular science as an element of the history and sociology of science, rather than as a branch of journalism. ",
            "date": "Answered May 15, 2018",
            "views": "3",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leah Taylor",
                    "user_href": "/profile/Leah-Taylor-218"
                },
                {
                    "user_id": "Suzanne Mitchelle",
                    "user_href": "/profile/Suzanne-Mitchelle"
                },
                {
                    "user_id": "Miriam Burke",
                    "user_href": "/profile/Miriam-Burke-10"
                },
                {
                    "user_id": "Caleb Jackson",
                    "user_href": "/profile/Caleb-Jackson-138"
                },
                {
                    "user_id": "Jonathan Olson",
                    "user_href": "/profile/Jonathan-Olson-47"
                },
                {
                    "user_id": "Kaylee Walters",
                    "user_href": "/profile/Kaylee-Walters-12"
                },
                {
                    "user_id": "Tracey Bishop",
                    "user_href": "/profile/Tracey-Bishop-17"
                },
                {
                    "user_id": "Varanasi Rama Srinivas",
                    "user_href": "/profile/Varanasi-Rama-Srinivas"
                },
                {
                    "user_id": "Johnetta Hooper",
                    "user_href": "/profile/Johnetta-Hooper-1"
                },
                {
                    "user_id": "Barry Rountree",
                    "user_href": "/profile/Barry-Rountree"
                }
            ]
        }
    ]
}