{
    "title": "What is the admission criteria for IB school admission? - Quora",
    "tags": [
        "International Baccalaureate (IB)",
        "College and University Admissions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Isshu Mittal",
                "href": "/profile/Isshu-Mittal"
            },
            "answer_text": "The steps that must be completed for admission in good IB schools are mentioned below. Campus tour – In various best international schools like Mount Litera School International, a campus tour is compulsory.Registration process – After the tour, one needs to register by paying the registration fee. Parents then need to fill the form and submit the following documents:One passport size photograph of mother and fatherOne passport size photograph of the child.Attested photocopy of the child‘s birth certificate.Attested photocopy of the child‘s proof of current residenceAttested copy of the previous two years of old school reports.Student interaction- after submitting all of the documents as mentioned above, the admissions team will set up an interactive session with the child.Parent Interaction – Then, a parent-teacher interaction is conducted. As per the parent interaction, the school will send a confirmation email.Offer letter – The school will email the admission decision.Payment of fees and submission of school admission formConfirmation letter – The schools will send a confirmation email regarding admission to the parent.The points, as mentioned above, are mandatory to get admission to the best IB schools. ",
            "date": "Answered February 4, 2020",
            "views": "153",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rishabh Dubey",
                "href": "/profile/Rishabh-Dubey-111"
            },
            "answer_text": "The admission process of best international schools in Mumbai has been designed for transparency and providing equal opportunity to all students who are applying. The following steps must be completed for admissions: IB school admission procedure Campus tour In various IB schools a campus tour is mandatory as the schools are quite enthusiastic about welcoming new families to the school and introducing them to what they have to offer. Registration process After the tour, parents can register by paying the registration fees. Moreover with the form, one has to submit following documents: One passport size photograph of parentsOne passport size photograph of the studentAttested photocopy of the student’s proof of permanent and current residence (Aadhar card, passport, etc.)Attested photocopy of the students birth certificateAttested copy of previous two years of school reportsInteraction with student After the submission of the documents mentioned above, the admissions team of the school will set up an interaction session with the student. Interaction with parents After the student interaction there will be a parents interaction session as well to understand the family goals for the child’s education and answer the parents’ queries before admission. Based on the communication with parents and the team, the school will send a confirmation email about admission. Fee payment and collection & submission of Admission Form For parents to accept the admission offer in a formal manner, one needs to pay the caution money. And, then submit and collect the admission form within one week of payment. Parents can get the online school admission form on the schools’ websites. Welcome note The school’s admission team will send a welcome note email regarding admission. This is it! One can now easily apply for admission on the school's website. ",
            "date": "Answered July 27, 2020",
            "views": "61",
            "upvotes": "0"
        }
    ]
}