{
    "title": "What do intelligent people do to waste time? - Quora",
    "tags": [
        "Understanding Smart People",
        "Overcoming Procrastination",
        "Procrastination",
        "Recreational and Leisure Activities",
        "Smart People",
        "Time Management",
        "Intelligence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sean Robertson",
                "href": "/profile/Sean-Robertson-3"
            },
            "answer_text": "Duplicate of other answers, but yes, reading.  I read a TON of news, mainly politics from local DC and NYC up to international, plus some urban planning/development news.  I'm very interested in the world around me, my ability to interact with it, and how to effect positive change.  I end up reading an average of at least a hundred articles a day.  I also read a decent amount of tech stuff on Gizmodo. I also find myself killing quite a bit of time on Wikipedia, reading about whatever has piqued my curiosity at any given moment - during Hurricane Sandy, I think I blew about three hours just reading about Native American history/culture (thank God we never lost power or I'd have died of boredom!). I like Quora for much the same reason I like Wikipedia, except that it allows me to discover topics more randomly as well as answer them as with this one. When not reading news or other non-fiction, I tend to read a lot of science fiction, specifically hard sci-fi.  I'm a huge fan of technically detailed relatively plausible near-future stuff including most of Kim Stanley Robinson's work, anything by Gregory Benford, most of Greg Bear's work, of course The Martian by Andy Weir (which I LOVED), etc. I generally don't do games, but will play Words With Friends and I can generally kill it on a pool table (I'm in a league, was a coach last year, and won all of my games last night ;-)). I also love a good conversation, especially political leaning ones (you can imagine I loved living in DC, but NYC is good for that too).  I tend to have way more serious conversations in bars than the average bar-goer does (and can do it without it turning into an argument), and hang out with similarly motivated people.  There's something fun about discussing the merits of Glass Steagall or the failures of Robert Moses over cocktails. :-D I don't really any more (got too busy when I moved to DC), but I used to do a lot of 3D graphics work in my spare time, mostly of Star Trek bridge sets (see Sean Robertson Star Trek search on Google, though it picks up some stuff from others erroneously).  Almost never played video games - I'd rather have something I created to show for my time spent. In essence, there is really very little that I do that actually wastes time.  My brain never really stops running and I don't want it to.  I'm either learning, teaching or creating almost all the time. ",
            "date": "Answered October 20, 2015",
            "views": "369",
            "upvotes": " View 115 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Kaštánek",
                    "user_href": "/profile/David-Kaštánek"
                },
                {
                    "user_id": "Rylinn Kubota",
                    "user_href": "/profile/Rylinn-Kubota"
                },
                {
                    "user_id": "Emilia Kuc",
                    "user_href": "/profile/Emilia-Kuc"
                },
                {
                    "user_id": "Langston Mathews",
                    "user_href": "/profile/Langston-Mathews"
                },
                {
                    "user_id": "Morva Ory",
                    "user_href": "/profile/Morva-Ory"
                },
                {
                    "user_id": "Farhan Nitrate",
                    "user_href": "/profile/Farhan-Nitrate-1"
                },
                {
                    "user_id": "Jesué Agosto",
                    "user_href": "/profile/Jesué-Agosto"
                },
                {
                    "user_id": "Viktorija Bojanić",
                    "user_href": "/profile/Viktorija-Bojanić"
                },
                {
                    "user_id": "Tai Williams",
                    "user_href": "/profile/Tai-Williams-6"
                },
                {
                    "user_id": "Ale Ćefo",
                    "user_href": "/profile/Ale-Ćefo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marcus Geduld",
                "href": "/profile/Marcus-Geduld"
            },
            "answer_text": "I don't think of myself as intelligent, but my mind is on all day. My wife says I'm the least Zen person she's ever met and that I don't know how to \"just be.\" Perhaps thinking-all-the-time meets someone's definition of intelligence. I've never been able to meditate. You're supposed to acknowledge passing thoughts and \"let them go.\" (I have no idea what \"let them go\" means.) When I've tried to do it, I wind up acknowledging one thought after another. There's never a moment when I'm not acknowledging a thought. Many of them are stupid thoughts (e.g. \"my knee itches\") but they're still thoughts. Meditating just becomes internally reciting an endless list. And the list begets more thoughts, like, \"Wow! I've sure had a lot of thoughts about my knee itching!\" If I go too long without input, my thoughts turn in on themselves and get repetitive—like those poor zoo animals you see pacing back and forth in their cages. If a steady stream of external ideas enters my brain, I feel calm or excited. When there's no input, I get anxious. So I waste time by feeding my brain, not always in ways that people think of as \"intelligent.\" I can be happy reading Shakespeare or watching \"Lost in Space.\" I just can't tolerate sitting there and zoning. After a long, intellectually arduous day at work, I require an engrossing movie, a Philosophy book, a complex conversation, or some other sort of input that's just as intense as work but different.  This is TMI, I'm sure, but I always have a bathroom book -- or I'm checking my email -- because I get anxious if I have to sit there for three minutes without input.  If I'm at work, and I can't write code because there's a meeting in a few minutes (as is the case now), I immediately turn to Quora. I'll write a paragraph, go to the meeting, come back to my desk, code for an hour, and then go to the bathroom and read, come back to my desk and realize there's no point coding because another meeting's going to start in four minutes, so I'll add a bit to my Quora post. On the Subway to and from work, I read (fiction, History, Psychology, Biology, books about Theatre, Shakespeare...) and then, when I'm walking from the subway to work (or from the subway to home), I switch to an audiobook. I also listen to audiobooks at night, when I'm lying in the dark waiting to sleep. I have rigged a remote-control by the side of my bed, so that as soon as I feel myself drifting off, I can tap and make the audiobook stop.  When I wake up in the morning, I immediately check email (while still lying in bed) and then listen to more audiobook while taking a shower—with my iPhone in a ziplock back. ",
            "date": "Updated July 17, 2015",
            "views": "434",
            "upvotes": " View 226 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nimit",
                    "user_href": "/profile/Nimit-16"
                },
                {
                    "user_id": "Its Rikko",
                    "user_href": "/profile/Its-Rikko"
                },
                {
                    "user_id": "Dimitrij Maslov",
                    "user_href": "/profile/Dimitrij-Maslov"
                },
                {
                    "user_id": "Djamel Benali",
                    "user_href": "/profile/Djamel-Benali"
                },
                {
                    "user_id": "Luan Pham",
                    "user_href": "/profile/Luan-Pham-5"
                },
                {
                    "user_id": "Unknown Unknown",
                    "user_href": "/profile/Unknown-Unknown-1227"
                },
                {
                    "user_id": "Clare Gorman",
                    "user_href": "/profile/Clare-Gorman-4"
                },
                {
                    "user_id": "Nikhil Bhavar",
                    "user_href": "/profile/Nikhil-Bhavar-1"
                },
                {
                    "user_id": "Matylda Křižková",
                    "user_href": "/profile/Matylda-Křižková"
                },
                {
                    "user_id": "Alican Guleken",
                    "user_href": "/profile/Alican-Guleken"
                }
            ]
        }
    ]
}