{
    "title": "What is hope? - Quora",
    "tags": [
        "What Is Meant By X",
        "Hope and Hopes",
        "Word Definitions, Terminology, and Jargon",
        "Meaning (philosophy)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jay Bazzinotti",
                "href": "/profile/Jay-Bazzinotti"
            },
            "answer_text": "Aristotle said, “Hope is the dream of the waking man.”. Hope is the unshakeable belief that no matter how bad our circumstances, that somehow, someway, everything will turn out alright or even good for us in the end. Someone once said, “We can live a few weeks without food; a few days without water and a few minutes without air, but we cannot last a single second without hope.” Hope battles despair in our mind, the little evil voice that claims to be “realism” that claims to see things as they are - doomed to fail, without possibility of success, that we are luckless, loveless, unlovable. Hope fights despair and sees the sunrise or a vista or a world of imagination where anything is possible. It’s hope that drives us to seek that one small gap in the armor of despair and snatch victory from the jaws of defeat because despair is an illusion. There is no solid wall of failure; there is no certainty of defeat. In every situation there is the possibility of victory and the game is in finding that victory. Maybe not in the way we planned, or expected or even wanted - but in some transformational experience that we achieve firstly by hoping and then by acting. My brother is a cop. One day he stopped the cruiser to check on a drunk lying in an alley. The man was truly at the bottom. His clothing was grey rags, stained with piss. He reeked of Listerine. When drunks get so bad they can’t get booze they steal Listerine from CVS and drink it by the gallon until green sweat comes from their pores. He had few teeth. His eyes were red. He was close to death. My brother asked him, “Why? Why do you keep on living? What drives you?” The drunk looked up from the ground and puked out gruffly, “Tomorrow’s another day.” He died not long after that. But even in his own circumstances where his life probably could not possibly get any worse he had the hope that maybe, just maybe, a miracle would occur and succor him tomorrow. Because tomorrow is always perfect in our minds. Having hope allows us to envision the ways we can make that actually happen. ",
            "date": "Answered June 8, 2016",
            "views": "29",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zeinab Khaled",
                    "user_href": "/profile/Zeinab-Khaled-2"
                },
                {
                    "user_id": "Larry Ruzich",
                    "user_href": "/profile/Larry-Ruzich"
                },
                {
                    "user_id": "JJ",
                    "user_href": "/profile/JJ-718"
                },
                {
                    "user_id": "Binu Jasim",
                    "user_href": "/profile/Binu-Jasim"
                },
                {
                    "user_id": "Oskar Hauser",
                    "user_href": "/profile/Oskar-Hauser"
                },
                {
                    "user_id": "Nicholas Beck",
                    "user_href": "/profile/Nicholas-Beck-2"
                },
                {
                    "user_id": "Travis Conrad",
                    "user_href": "/profile/Travis-Conrad"
                },
                {
                    "user_id": "Sanjay Shanker",
                    "user_href": "/profile/Sanjay-Shanker"
                },
                {
                    "user_id": "Annette Blankenship",
                    "user_href": "/profile/Annette-Blankenship"
                },
                {
                    "user_id": "Sonia Jetli",
                    "user_href": "/profile/Sonia-Jetli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Darryl Lankford",
                "href": "/profile/Darryl-Lankford"
            },
            "answer_text": "Q: “What is hope?” …During a much needed break period at work many years ago, a cacophony of keyboard clicks, scanner calibrations and paper-spewing printers finally came to an abrupt halt. A close-knit group of talented 3D modelers began to breathe easy, lean back in our chairs and relax for a while. It was during these wonderful periods of down time that the most interesting discussions would surprisingly unfold. After discussing the prospects of a potential Super Bowl victory for the Cincinnati Bengals that year, the topic of “Hope” suddenly rose to the surface. It was a natural transition as any true football fan would know that desiring the Bengal’s to win just a single game during any given season requires a certain degree of hope. This speedy transition from football to philosophy evoked several emotionally-charged definitions as to what hope actually is. In the midst of our discussion, I tossed out the quote made famous by Father Everett from the movie Daredevil: “…a man without fear is a man without hope.” The subtle-but-deep philosophy operating behind this quote implies that if you fear nothing in your life, then there is no need for you to rely on hope. This movie quote was met with fierce intellectual opposition from my coworkers. Charles (one of the company owners) unexpectedly popped in and promptly offered his mic-drop response, “If I buy a $1 lottery ticket. I hope that I will win the lottery but I have no fear if I don’t.” …and then quickly exited the room to avoid any rebuttal. This prompted a round of applause for Charles and a pointed slurry of laughs and jeers directed toward me. After all …it’s always good fun to watch someone deliver a surprise haymaker to Darryl during a philosophical discussion.  …However, what Charles failed to realize was that he possessed exactly $1 worth of fear. It is true that Charles’ only risk was a single dollar bill and he had plenty more to spare. However, had Charles mortgaged his house, sold his business and liquidated all remaining assets to purchase lottery tickets, he would be experiencing an overwhelming amount of fear as the lottery drawing date quickly approached. Those cute, little round ping-pong balls all dancing away inside their plexiglass playground would have morphed into an ominously dark and foreboding Edgar Allen Poe-like torture chamber for Charles in the harrowing moments right before they popped into their respective tubes. Likewise, to a hungry and homeless Charles living on the streets, that single dollar bill would have represented a substantial financial loss should it be wasted on a lottery ticket which bore no fruit. Hope, Fear and Risk are all interconnected. Hope is a psychological desire for a favorable result based on a situation where the outcome is unknown and the stakes are high. The amount of fear one has is relative to whatever happens to be at risk at the time. In addition, the level of hope one has is relative to the amount of fear that exists for whatever happens to be at risk. Hope is not a process or technique that can be studied, honed and perfected. You cannot be taught hope nor can hope declared true or false. Hope represents the uncharted wilderness one is forced to cross whenever something of great value is at stake or one is suffering through a painful loss. We hope that our sadness will soon be replaced with joy. You can’t control, manipulate or enhance hope because it is secretly buried somewhere within the period of time which proceeds whatever reality is ultimately to come. Hope is considered a good thing when we are hoping for a successful achievement, but it is equally cruel with the risk of humiliation should we fail to achieve the level of success we have hoped for.Hope is considered a bad thing when someone hopes that an individual will suffer and die because of the level of brutality they have enacted upon them. At the same time, there is a strange favorable sense of vindication should our hopes become a reality.Personal Experience Regarding Hope: At my age, I don’t rely on hope nearly as much as I did when I was a child. There have been far too many situations during my life where my deep and personal hope for a favorable outcome has been met with the ever-present specter of catastrophic failure. I now find myself accepting the more reality-based outcomes ahead of time as opposed to relying on any potentially favorable hope-based outcomes. Life wears us down, breaks our spirit and steals our hopes with each passing day. It could be that as we grow older, the stakes are no longer as high and the risk becomes less and less right along with our hopes? …Maybe this is all by design? At this stage in life, what I find myself hoping for has become far less “tangible” within its nature. Instead of hoping for some viral, celebrity-like achievement, a lucrative career path or leaving behind some bold and profound legacy as I did when I was young, I now find myself quietly hoping for spiritual understanding, an inner peace to fill me …and forgiveness for my many failures along the way after I have passed. ",
            "date": "Answered May 25, 2017",
            "views": "31",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohamed Seddek",
                    "user_href": "/profile/Mohamed-Seddek"
                },
                {
                    "user_id": "Sheila Dehner",
                    "user_href": "/profile/Sheila-Dehner"
                },
                {
                    "user_id": "Stanislav Vladev",
                    "user_href": "/profile/Stanislav-Vladev"
                },
                {
                    "user_id": "Ryan Huxley",
                    "user_href": "/profile/Ryan-Huxley-2"
                },
                {
                    "user_id": "Shreya Chatterjee",
                    "user_href": "/profile/Shreya-Chatterjee-9"
                },
                {
                    "user_id": "Michelle de Kwiatkowski",
                    "user_href": "/profile/Michelle-de-Kwiatkowski"
                },
                {
                    "user_id": "Saad Shoaib",
                    "user_href": "/profile/Saad-Shoaib-5"
                },
                {
                    "user_id": "Rani Chatterjee",
                    "user_href": "/profile/Rani-Chatterjee"
                },
                {
                    "user_id": "Alan Camerer",
                    "user_href": "/profile/Alan-Camerer"
                },
                {
                    "user_id": "Natalie Kalos",
                    "user_href": "/profile/Natalie-Kalos"
                }
            ]
        }
    ]
}