{
    "title": "What's the best way to approach a case study? - Quora",
    "tags": [
        "Case Studies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Six Hats Consulting",
                "href": "/profile/Six-Hats-Consulting"
            },
            "answer_text": "The best way to approach a case study, based on our experience is as per the pointes below: Problem statement: The key in starting case study solutioning is identifying the right problem statement. The case might talk about multiple things, but identifying the right business problem will help you in ensuring that your further case analysis doens't get flawed.Theoretical concepts: Always try to relate the case study to the theoretical concepts you have learned or that you are aware of through your secondary research. For example, you may use Portera five forces for industry analysis or BCG matrix for product analysis. This shows how strong you are in applying theory.Exhibits: Case studies, especially finance ones will have key information in the exhibits. Analysing the exhibits thoroughly will help you in make your case analysis stronger.Structure: Make sure that you plan a definite structure to your case analysis rather than lengthy paragraphs. This will give a good foundation to your case study solution.Cross industry knowledge: Do extensive secondary research and see if you can use knowledge from problems solved in other industries and utilize the same in the business case under consideration. This often results in interesting and new perspectives.Data analysis: Ensure that you support your solution with adequate data wherever possible rather than just suggesting solutions based on assumptions.When it comes to case studies, the more you solve, the better you get at it. In case you are looking for solving case studies including Harvard ones, please feel free to visit Six Hats Consulting | Case study solutions online where we provide quality solutions to some of the best case studies. ",
            "date": "Answered January 23, 2020",
            "views": "685",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Juhi Singh",
                    "user_href": "/profile/Juhi-Singh-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shweta Arora",
                "href": "/profile/Shweta-Arora-72"
            },
            "answer_text": "The way we used to approach/prepare case studies during our MBA entailed a group process of at least 3 individuals: InterviewerIntervieweeObserverBut, you can also prepare for case studies on your own. I know of a batchmate, who used only consulting prep books and read as many case studies as possible (trying to solve them on his own without cue questions). For a first-timer, the best way is to watch someone solve a case. That's how freshers begin at B-schools. But, if you don't have anyone around, you can watch videos of mock consulting interviews. After you've got a gist of the entire process, you can start reading case studies and either solve them on your own or perform a mock drill with an interviewer. That's the reason it is recommended at B-schools to form a group of 2–3 enthusiasts who wish to work in consulting and are aiming for it during placements. I'm sharing a link to my blog which contains a list of resources along with some e-books on consulting cases that you can use for your preparation - Prepare for Consulting Interviews with these Consulting Case Studies Hope this helps. ",
            "date": "Answered June 21, 2020",
            "views": "12",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Oorjaa Mishra",
                    "user_href": "/profile/Oorjaa-Mishra"
                },
                {
                    "user_id": "Saman Singh",
                    "user_href": "/profile/Saman-Singh-2"
                },
                {
                    "user_id": "Karthikeyan R",
                    "user_href": "/profile/Karthikeyan-R-335"
                }
            ]
        }
    ]
}