{
    "title": "What should be done to improve physics of class 11 for neet? - Quora",
    "tags": [
        "Physics Exams and Tests",
        "Educational Exam and Test Advice",
        "National Eligibility cum Entrance Test (NEET)",
        "Academic and Educational Advice",
        "Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shagun Agrawal",
                "href": "/profile/Shagun-Agrawal-9"
            },
            "answer_text": "A little introduction first: (If you want, just skip to the main content) I got 161/180 in physics and I must say that Physics was the most trustworthy subject for me. I gave my 100% on Physics and it never failed to give me excellent results. When I came to 11th, I too suffered from this physics-phobia as most of my classmates (most of them still do). But with practice, it got better and after 2 years it became my strength. Okay then, coming to the question: Physics can only be mastered through practice, practice and lots of practice. 1.Read class notes again and again You may read anything which you can't or didn't understand from other sources you want. 2. Practice questions.. all kinds of questions. Since you're in 11th now, you have the time to practice nicely and with every understanding. First and foremost, target your coaching modules. Practice each and every question from them. Ask doubts. Read the above line 10 times. 3.Ask all the doubts you have.. you shouldn't let even a single question be left out from those modules. Our teachers used to recommend us to solve the module again if you finish it once. It is the best for you. But, i know that you won't be content and you'll want to get another book (due to various reasons) I'll suggest you to get DC Pandey for medical entrances. Don't get the ones for engineering entrances. They aren't necessary. I'll also like to add here that HC Verma, though being a great book won't give you as great results as DC Pandey for medical entrances as far as NEET or other medical entrances are concerned 4. Discuss questions with your friends. I believe once you get into it, it'll be great fun too. Do the same. Practice. Ask doubts. Repeat. I can assure you that if you invest a nice amount of time on Physics now, it'll benefit you greatly both in the short-term and the long-run. Again, Read notes again and again.Practice questions ( coaching modules are great and sufficient)Ask doubtsDiscuss questions with your friends.Hope this helps. All the best ! ",
            "date": "Answered October 7, 2017",
            "views": "13",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Virang Shah",
                    "user_href": "/profile/Virang-Shah-13"
                },
                {
                    "user_id": "Bhuvan A.V",
                    "user_href": "/profile/Bhuvan-A-V"
                },
                {
                    "user_id": "Ayushman Pattanaik",
                    "user_href": "/profile/Ayushman-Pattanaik-1"
                },
                {
                    "user_id": "Elango Arumugam",
                    "user_href": "/profile/Elango-Arumugam"
                },
                {
                    "user_id": "Farheen Jeelani",
                    "user_href": "/profile/Farheen-Jeelani-2"
                },
                {
                    "user_id": "Siya Singh",
                    "user_href": "/profile/Siya-Singh-161"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/PT-VENKATESWARLU"
                },
                {
                    "user_id": "Bishal Dey",
                    "user_href": "/profile/Bishal-Dey-6"
                },
                {
                    "user_id": "Tenacious Cobra",
                    "user_href": "/profile/Tenacious-Cobra-1"
                },
                {
                    "user_id": "Angshuman Sarmah",
                    "user_href": "/profile/Angshuman-Sarmah-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shefali Gupta",
                "href": "/profile/Shefali-Gupta-94"
            },
            "answer_text": "To crack Physics you should consider below points- **Conceptual Clarity** : Previous years’ papers analysis suggest that areas like Mechanics, Heat and Thermodynamics, Electrodynamics and Modern Physics are the most important areas from NEET perspective. You must focus on clearing the concepts related to these topics. Learning only the theoretical part is not going to help. Additionally, you must learn how to implement the concepts in solving the numerical problems and MCQs. **Refer Right Preparation Material: **You must refer to NCERT books for understanding concepts and additionally,you must solve all the numerical problems from NCERT since a lot of questions are picked from NCERT book in NEET exam. **Practice**: You must practice a wide variety of numerical problems based on the different concepts in order to attain firm grip in various topics. You must additionally follow 1-2 standard competition books for practicing MCQs. Dedicated Practice will help you learn how to implement the concepts in solving the questions. Exposure to a variety of questions will help you answer accurately and speedily. **Take short notes**: You must take short notes of important formulae, theorems and concepts. This will greatly boost up your revision during exam preparation **Solve Previous year question papers**: One of the best way to prepare for Physics section is to solve and analyze previous year question papers of AIPMT. **Thorough Revision**: You must revise and recall the concepts, formulas and theories on a regular basis which will help you remember the topic for a longer duration. A regular revision will greatly help to reduce burden during exam time. **Take online Mock Test series**: You must attempt mock test series on a regular basis as this will help you analyze your preparation level at every stage and will help improvise on weaker areas. ",
            "date": "Answered November 18, 2016",
            "views": "251",
            "upvotes": "0"
        }
    ]
}