{
    "title": "What is the best site to learn online courses in India? - Quora",
    "tags": [
        "Online Training",
        "E-learning",
        "Website Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Business World",
                "href": "/profile/Business-World-26"
            },
            "answer_text": "Online courses are the trend nowadays. It has become more popular after the Pandemic situation. Many people love to utilize their time in some fruitful works like doing online courses. Whether they want to pursue some unfinished hobby or upgrade their profiles, people are taking full advantage of the pandemic through this. There are many Online Course Providers In India who come up with different types of courses. The question is a tough one as in this highly competitive market, almost everyone has prepared their study materials too well. Along with that, not one site is good for all subjects. Selecting the best site should depend on the course you select. You have to find out which site provides the best course of the intended subject.  So, you have to decide the course first before selecting the website. However, there are some criteria to select the best site for the course you want to pursue. You have to keep in mind the following factors. You have to check whether they will provide any certificate for the course or not. Always select the website that provides the certificate after the completion of the course.You have to find out the faculty associated with the website. The online courses will help you to teach from the best talents from around the nation. So, you must take the opportunity.Check the online reviews of the website to know what the reactions of the previous students are and how satisfied they are from the course.",
            "date": "Answered September 29, 2020",
            "views": "247",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Devi Priya",
                "href": "/profile/Devi-Priya-635"
            },
            "answer_text": "Cool, Priced good, as most of our Market goes Online in Post Covid situation. Hope that would be the future of Corporate Enviroment. You took better decision to go Online.But, I’m surprised to see all market is moving to compelete online video site, Im not sure, How could you get real time work environment by just spending and viewing the Videos. One of my Cousin spent more of his investment in Udemy for his Professional course and I too spent most for my Son on Byju’s , But as QA Manager, Im not convienced with these platform, On searching for the solution, I got many connections & some references, in those, My Brother’s requirements are fulfilled by Mr.Kumar a Freelance Trainer, who works for Cognizant with some 8+ exp. If you’re looking for any Professional course, I would suggest him & his contacts. you can contact Kumar at 8940107799.If you’re looking for some grade level or Academic level training you can visit Fourcup Schools at 7550251906 , they may help you with Live virtual & offline classes for your requirement. Rock in Industry dude !!! ",
            "date": "Answered September 19, 2020",
            "views": "255",
            "upvotes": "0"
        }
    ]
}