{
    "title": "What do I do if I’m getting bad grades in school despite trying my hardest, but my parents are threatening to take away my electronics? - Quora",
    "tags": [
        "Grades (education)",
        "Academic and Educational Advice",
        "Family Relationships and Dynamics",
        "Parents"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rhonda Ferber",
                "href": "/profile/Rhonda-Ferber"
            },
            "answer_text": "You can start by voluntarily cutting down on the time you spend on your electronics, in case they really are interfering with your schoolwork. This can be tough because there’s an addictive quality to social media, gaming, etc., but it’s better to bite the bullet and cut down than have your electronics taken away completely. Be sure to let your parents know you are voluntarily cutting down on your electronics time so they can see you’re making an effort. Make sure they see you studying and doing homework. They’re less likely to take drastic action if they see you taking positive steps to resolve your issues. See how that works out, and if you’re still having trouble in school, ask your parents if they will help you find and pay for tutoring or remedial classes in the subjects you’re struggling with. You might also look for videos online that explain more about those subjects and might be more interesting than your teacher’s instruction. Just be sure to avoid social media and other online distractions while you’re looking for instructional videos. Your parents will probably want to help you all they can, if you show you’re making a sincere effort. No one wants their child to experience failure. They are on your side and want you to be successful in life. Remember that! ",
            "date": "Answered October 24, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Armando Bencomo",
                "href": "/profile/Armando-Bencomo-3"
            },
            "answer_text": "The first step is why you are not succeeding despite trying your best. Talk with your teachers. They must see you trying your best and failing, so ask what they think is going on. Ask them to refer you for an evaluation from the school psychologist. Maybe you have ADD or a specific learning disability. You don’t deserve to be punished if you are trying the best you can. ",
            "date": "Answered October 24, 2020",
            "views": "81",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anne Freeman",
                    "user_href": "/profile/Anne-Freeman-8"
                },
                {
                    "user_id": "Nicole Bedient",
                    "user_href": "/profile/Nicole-Bedient"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Rome",
                "href": "/profile/Tony-Rome-44"
            },
            "answer_text": "I had your same problem,,I am an auditory learner,,what you need to do is meet with your counselor,talk to your parents,get tested for a learning disability,,my son was given a tutor by the school..you and your parents might have to fight to get tested because schools don't like to spend the extra money,,or see a doctor on the outside,,you may have to get medication to help you concentrate—take care of this now or your life may be ruined forever,,I could have did so much better professionally if I had been diagnosed early… ",
            "date": "Answered October 24, 2020",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anne Freeman",
                "href": "/profile/Anne-Freeman-8"
            },
            "answer_text": "If you’re trying your hardest and not succeeding then #1 talk to your parents about what is going on, including anything you may not understand. #2 talk to the teacher and have the teacher recommend extra help resources or a tutor to your parents, and let the teacher reassure them that despite your difficulties you are working hard and that they believe in you, you just need extra assistance. Your electronics are obviously not the problem here. Tutoring and support are obviously going to be the key ",
            "date": "Answered October 24, 2020",
            "views": "90",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Elena Schumann",
                "href": "/profile/Elena-Schumann-1"
            },
            "answer_text": "You can ask your parents to get you a tutor. Not everyone is good at school. For example you might be really good at athletics but not at school. ",
            "date": "Answered October 24, 2020",
            "views": "10",
            "upvotes": "0"
        }
    ]
}