{
    "title": "What are some examples of highly interdisciplinary professions and academic areas? - Quora",
    "tags": [
        "Transdisciplinary Social Science",
        "Interdisciplinary Programs",
        "Interdisciplinary Topics",
        "Academia",
        "Academic Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Benjamin Felker",
                "href": "/profile/Benjamin-Felker-1"
            },
            "answer_text": "I'll tell you about mine. Archaeology is the study of past civilizations and societies through the material culture they left behind.  One of the reasons I love it so much is that is it so interdisciplinary.  Pretty much any subject can be adapted to the study of ancient society, whether it is the sciences, languages, medicine, etc.  For example, I have worked on excavation with chemists, geologists, forensic anthropologists, linguists, historians, even artists.  I had a class on the economics of the ancient mediterranean.  I know people specializing in ancient architecture, food and feasting, religion, linguistics and epigraphy, animal bones, human bones, and countless other specialties.  Archaeology is one of the most interdisciplinary subjects that I know of.  If I get interested in any subject, like paleoenvironmental research, or botany, or warfare, it can all be adapted to study ancient people and their interactions.  It's great. ",
            "date": "Answered July 29, 2014",
            "views": "32",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aman Ali",
                    "user_href": "/profile/Aman-Ali-4"
                },
                {
                    "user_id": "Manav Midha",
                    "user_href": "/profile/Manav-Midha-2"
                },
                {
                    "user_id": "Sarthak Agrawal",
                    "user_href": "/profile/Sarthak-Agrawal"
                },
                {
                    "user_id": "Thomas Adams",
                    "user_href": "/profile/Thomas-Adams-52"
                },
                {
                    "user_id": "Austin Bashaw",
                    "user_href": "/profile/Austin-Bashaw"
                },
                {
                    "user_id": "Jeff Wright",
                    "user_href": "/profile/Jeff-Wright-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mehmet E. Genc",
                "href": "/profile/Mehmet-E-Genc"
            },
            "answer_text": "Learning is an area that is interdisciplinary. It draws research from neuroscience, cognitive science, education and educational psychology. Business is another area of study that is highly interdisciplinary. Because it is an applied science, it draws upon fields as diverse as anthropology, economics, psychology and political science. In general, most complex real life phenomena are interdisciplinary in nature. Think climate change, sustainability, poverty, and many others. A full understanding of most of these phenomena, and developing feasible solutions to them requires an interdisciplinary approach and collaboration of scientists from fields as diverse as natural sciences (e.g. physics) and social sciences (e.g. Economics), not to mention city planning/architecture, engineering and many other disciplines. ",
            "date": "Answered September 19, 2017",
            "views": "16",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Manav Midha",
                    "user_href": "/profile/Manav-Midha-2"
                },
                {
                    "user_id": "Faqrul Islam Chowdhury",
                    "user_href": "/profile/Faqrul-Islam-Chowdhury"
                }
            ]
        }
    ]
}