{
    "title": "What was totally acceptable in high school 50 years ago that isn't today? - Quora",
    "tags": [
        "High Schools",
        "Social and Behavioral Norms"
    ],
    "response": [
        {
            "author_info": {
                "name": "Clay Reynolds",
                "href": "/profile/Clay-Reynolds-4"
            },
            "answer_text": "A great deal has changed in half a century. Fifty years ago, high school students were regarded pretty much as “young adults,” with some immaturity about them, a lack of wisdom, but not as children to be managed and protected from the world. It was not unusual for boys to come to school in coats and ties and girls to wear hose and heels; indeed, many high schools forbade girls to wear trousers or pants unless it was part of a uniform—such as a band uniform, i.e. Classes for girls included Home Economics, Typing and Shorthand, and other instruction designed to prepare them for life as adult women, such as it was defined at the time. Boys took courses in woodshop, metal shop, even automotive and appliance repair, for the same reasons. PE classes were strictly separated by gender. There weren’t many organized team sports available for girls—basketball, usually, softball, sometimes, or field hockey, for the most part. Boys played all sports, including baseball. Both genders participated in track and field, however. Open Displays of Affection (ODA) was forbidden on school grounds and certainly inside the buildings, but “steadies” were commonplace. Girls wore their boyfriends’ oversized letter-jackets (letter sweaters in a previous era) and senior rings, often made to fit by adding wound dental floss and then sealed with fingernail polish, as a kind of pre-pre-engagement signal that they were “taken” or at least somewhat committed. (“Lettering” in a sport was a huge deal in the fifties and sixties; by the mid-sixties, letters were also awarded for other extracurricular activities such as music and dramatics; when lettering became possible for pep squads and just about everything else, the system was devalued.) It wasn’t uncommon for commencement ceremonies—a huge deal with lavish presents bestowed on graduates—was often followed by a wedding ceremony a few months or a year or so later, with many marrying their high school sweethearts as a matter of course. (Note: Divorce was still stigmatized in the era; a divorced person was not well regarded socially.) Romance was not stymied, no matter what. Proms and other social events such as banquets and mixers were carefully planned and strictly chaperoned. Alcohol was strictly forbidden, although it was often in evidence. Smoking tobacco, while almost always forbidden, was winked at for the most part, with light punishments doled out to caught offenders. “Smoking in the Boys’ Room” was a huge hit song. Indeed the music of the era reflected the maturity of high schoolers in the fifties and sixties. Love songs, torch songs, laments for unrequited or unreturned admiration populated the charts, as did a huge array of dance tunes. American Bandstand set a standard for dance and music, and everyone watched it. The .45 rpm record, introduced in 1949, reigned. The schools themselves were wide open to the public. Access was open and easy, and school grounds were almost never fenced off or restricted to anyone. In many communities, high schoolers left campus for lunch. Some went home and some gathered in local drug stores (where there were lunch counters), soda shops, or hamburger joints near the campus that catered to young people. In some states—Texas, i.e.—one only had to be fourteen years old to have a full driving license, so many students had their own cars or drove their parents’ car to school, even though they lived in walking distance. Schools were positioned to be neighborhood institutions, substantial symbols of order and progress. Most schools had little or no air conditioning, although heating was generally common, since school dismissed during the hotter summer months and there was no reason to cool the buildings. Most older schools had large windows that could be opened on warm days in the autumn or spring. Desks were wooden, one-piece affairs, some still with inkwells from a period before ballpoint pens were common; pencil grooves remained even with modernization. Blackboards were actual blackboards requiring chalk and dusty erasers. Floors were generally hardwood, and most classrooms were connected to the Principal’s Office by a wired speaker over which would come announcements or possibly a voice leading the “Pledge of Allegiance” every morning. Class starts and ends were signaled by a bell that would ring in the hallways. On the whole discipline wasn’t a problem in most schools. Corporal punishment was usual, mostly by administering a few swats with a wooden paddle, and while this was sometimes abused by excess, it was seldom questioned by parents who tended to take the side of teachers in matters of their children’s behavior. A much smaller percentage of young people completed high school then than do now. Many dropped out as soon as they turned sixteen, or whatever the minimum age was for leaving without being truant in a state, to get married or join the army or merely to go to work; eighteen was considered “of age” in many states, although voting privileges had to wait until one was twenty-one; ditto legal purchase of alcohol. Pregnant girls were not allowed to continue in high school, nor were married students of either gender. College-bound students were not in the majority in many areas, and there was little curricular distinction between one group and another, although most schools had, by the end of the 1960s, begun to channel those with college ambitions into more advanced and difficult classes. Indeed, high school curricula were changing by the end of the sixties. Calculus replaced trigonometry as the class to take after geometry; lab sciences became more complex and technical; foreign language requirements modified (Latin or Greek had been dropped in the early fifties; “romance” languages continued to be required for a long time.) “Senior English” or “Senior History” were electives offered for college-bound students. There were no AP Courses or college-credit courses, although some students did sign up for correspondence courses with nearby universities; they completed their work by mail and received college credit for it. Many, though, were channeled into “professional schools” such as dedicated, private schools that taught accounting and business practices, skilled labor instruction in such fields as welding, appliance repair, plumbing, electrical work, all providing a certificat at the end of about a year of specialized instruction. Nursing and other technical medical fields had programs of their own and usually were attached to “teaching hospitals,” not to colleges or universities except, perhaps, through loose association. On-campus career counselling was not very effective, with many large high schools having but one counsellor of questionable credentialing on staff. Most schools functioned with only a single chief administrator, the Principal (usually a man), with Vice-Principals only occurring in particularly large, urban schools. In most of America, athletes ruled in high school. Football and basketball players emerged as the principal stars of the schools, although they competed in popularity against those youths who had more political ambitions on student councils and similar clubs of governance. For most of that generation and certainly for the previous generation, a high school diploma had great value both vocationally and socially. It was a rare thing to find in the nineteenth century; and for the first three decades of the twentieth, it became somewhat special to say, “high school graduate” of someone. Images of high school students in the 1950s and 1960s depicted them as young men and women, not children. Interestingly the word “teenager” was coined in this era; it was not known previously. In a nation where an eighth-grade education had been pretty much the American average at the end of the 1930s, the post-World War II generation elevated the status of high school in the 1940s through the 1970s to a high regard, something that would, in the 1980s, be more typical of the status enjoyed by undergraduate college students, then in the 1990s and forward by graduate students and those in professional schools for medicine or law, for example. For much of the nation’s history, though, high school was regarded as a kind of “finishing school,” a place where the young were prepared both intellectually and emotionally to be fully responsible adults. Today’s high school students are principally seen as oversized children, in need of social and parental guidance, of protection and shielding from the grimier aspects of real life. The mythology today is that they have no sense of personal responsibility, are hormone-raging embryos incapable of adult feelings and sensibilities, responding only to primary urges and emotionally charged reactions that are usually unwise. Much of the adult society in America deny that their teenaged charges have emotional depth or good sense when it comes to sex, drugs, crime or any sense of how to make their way in the world, let alone hold a job and have responsibility even for themselves. There might be some veracity in that, given that any group of individuals tends to rise no higher than the expectations society puts on them. But the more objective reality is that many of these young people if not most of them are capable of making more mature judgements and commonsense decisions than they are given credit for. The almost manic desire in American society to keep them in the role of dependent children in need of nurturing and guidance is somewhat perverse and may, in the long-run, be counter-productive. ",
            "date": "Answered October 25, 2020",
            "views": "27",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Linda Culp",
                    "user_href": "/profile/Linda-Culp-1"
                },
                {
                    "user_id": "David Koch",
                    "user_href": "/profile/David-Koch-50"
                },
                {
                    "user_id": "C. Bernie",
                    "user_href": "/profile/C-Bernie"
                },
                {
                    "user_id": "John Purtell",
                    "user_href": "/profile/John-Purtell-1"
                },
                {
                    "user_id": "Peter Londey",
                    "user_href": "/profile/Peter-Londey"
                },
                {
                    "user_id": "Holt Speir",
                    "user_href": "/profile/Holt-Speir"
                },
                {
                    "user_id": "Dennis Mondor",
                    "user_href": "/profile/Dennis-Mondor"
                },
                {
                    "user_id": "Isabelle Ong",
                    "user_href": "/profile/Isabelle-Ong-13"
                },
                {
                    "user_id": "Veruthas",
                    "user_href": "/profile/Veruthas"
                },
                {
                    "user_id": "Greg Sticker",
                    "user_href": "/profile/Greg-Sticker"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ray Loewe",
                "href": "/profile/Ray-Loewe-1"
            },
            "answer_text": "What was totally acceptable in high school 50 years ago that isn't today? I graduated from high school in 1984, so it’s been what, 36 years now? My, how time flies when you’re having fun. Or is it that because I’m getting old now and just don’t remember anymore? Anyway, here is what I remember we had/could do back then in my high school. There were no fences surrounding the school to keep people out. The only fences we had were around the athletic fields and football stadium to keep spectators off the fields and from getting hurt.Doors were not locked when school began to keep people out. I honestly don’t even remember our classrooms having locks on the doors “just in case”.My best friend carried a pocket knife on him constantly as he was a self professed “redneck”. It had a blade that was three inches long. As long as it wasn’t over 3 1/2 inches he was good to go as that was the then-legal lenght. Today, if you were caught at the metal dectector with that you’d face a mandatory suspension at minimum, if not expulsion for carrying a weapon.We all had full sized lockers to store our books and stuff, and often “set up” our friends lockers with practical jokes in them to have sprung on our classmates. Today, if you have lockers, this would be harrassment.Seniors were allowed to leave campus for lunch. Good luck with that now.Speaking of lunch, we could eat what we wanted. That includes bringing peanut butter sandwiches to school because no one was paranoid about peanut allergies. Yes, I know this is a real thing, it’s just back then people didn’t let things ruin your life because 1 person in the school had an allergy.We watched sex-ed films.Girls mostly) took home-ed classes, guys (mostly) took shop classes like auto, wood and metalWe still had mandatory music an arts classes. Do these still exist after budget cuts?There really were no dress codes aside from you don’t come to class naked and girls had to have tops that had shoulder straps that were at least 1″ wide, no “spaghetti strings” allowed.We had club fundraisers in the school that mostly sold junk food. One club I was in sold gummy bears, the other we sold Krispie Kreme donuts at lunch in the cafeteria. Food of the gods, I tell you.Speaking of junkfood, we had soda machines in the cafeteria and at the sports fields.And finally on this list, we had now socially unacceptable school names and mascots like “rebels”, “warriors”, “chiefs” and “Dixie”.I know things have changed, and in many cases had to change due to events and social evolution, but I do think that we’ve become too politically correct and afraid of things. These are supposed to be schools where kids learn, grow and start to become the people they will be later in life. Instead many have become fortresses to both keep physically bad people out as well as “bad ideas”, and that is an unfortunate thing. I really do wonder how the kids that have grown up in these new enviornments will turn out like considering how sheltered they have become? I welcome comments on this, but please keep things civil. ",
            "date": "Answered September 18, 2020",
            "views": "156",
            "upvotes": " View 131 Upvoters",
            "upvoters": [
                {
                    "user_id": "Silviu Mormocea",
                    "user_href": "/profile/Silviu-Mormocea"
                },
                {
                    "user_id": "Jay Shusterhoff",
                    "user_href": "/profile/Jay-Shusterhoff"
                },
                {
                    "user_id": "Jennifer Nybo Byrd",
                    "user_href": "/profile/Jennifer-Nybo-Byrd"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Bill-1366"
                },
                {
                    "user_id": "Jeffrey Lee",
                    "user_href": "/profile/Jeffrey-Lee-417"
                },
                {
                    "user_id": "David Tufte",
                    "user_href": "/profile/David-Tufte"
                },
                {
                    "user_id": "Christian Tanushev",
                    "user_href": "/profile/Christian-Tanushev"
                },
                {
                    "user_id": "Christian Servagnat",
                    "user_href": "/profile/Christian-Servagnat"
                },
                {
                    "user_id": "Michael Strutzel",
                    "user_href": "/profile/Michael-Strutzel"
                },
                {
                    "user_id": "James Thornton",
                    "user_href": "/profile/James-Thornton-61"
                }
            ]
        }
    ]
}