{
    "title": "What are compulsory subjects that I need to study law? - Quora",
    "tags": [
        "Compulsory Education",
        "Law Schools",
        "Studying",
        "Law"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashley Ro",
                "href": "/profile/Ashley-Ro-8"
            },
            "answer_text": "There aren’t really any compulsory subjects that you need to take prior to law school (though you need to have a college degree). While there maybe some mandatory coursework if you are applying from outside the U.S. (in which case you should reach out to some law schools you are interested in to find out their undergraduate requirements for international students), any bachelor’s degree (or higher) from an accredited U.S. university should be adequate. People go to law school after earning undergraduate degrees in history and political science, but also in physics, engineering and math. In fact, in some cases it might be easier to get into law school and get a job afterwards with one of the latter degrees. If you’re looking for what subjects you can take as an undergraduate to prepare you for law school, there are some courses that may help ensure you have a basic level of relevant knowledge. One is political science: in particular, any course on the constitution and/or the foundations and structure of the U.S. legal system. Another is any course that helps improve your research, writing, reading comprehension, or analysis skills. In addition, a course in logical reasoning may be useful for law school, but (perhaps more important) may help to help improve your lsat score. Overall, though, the most important thing is to take classes that you like enough to do well in, so you have a competitive GPA when you apply. ",
            "date": "Answered August 12, 2018",
            "views": "62",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Md Raj",
                    "user_href": "/profile/Md-Raj-89"
                }
            ]
        }
    ]
}