{
    "title": "What should I study after Bsc Agriculture? - Quora",
    "tags": [
        "Farming",
        "Bachelor of Science Degrees"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rajiv Kumar",
                "href": "/profile/Rajiv-Kumar-1491"
            },
            "answer_text": "B. Sc Agriculture is considered a professional degree. The graduates from this degree can find jobs in both public and private sectors. The importance of agriculture is growing rapidly and thereby is increasing the job prospects in the field of agriculture. Today Graduates with B. Sc. Agriculture are readily accepted in the government projects. Agricultural departments, Extension services, Research organizations, Commercial farming etc. are some of the sectors where graduates of this field can find job opportunities in. Following are some government sectors which have job opportunities for B. Sc. Agriculture graduates: Indian Agricultural Research InstituteNational Seeds Corporation LimitedState Farms Corporation of IndiaFood Corporation of IndiaNational Dairy Development BoardNABARD and other banksAgricultural finance corporationsIndian Council of Agricultural ResearchCouncil of Scientific and Industrial ResearchNorth Eastern Region Agricultural Marketing CorporationFollowing are the private sectors which offer jobs to agriculture graduates: Agro industriesAgriculture MarketingFinancial sector with focus on agricultureMicro-finance institutionsFertilizer companiesAgri-biotech organizationsFollowing are some job profiles that are offered to B. Sc. Agriculture graduates: Agriculture officerAssistant Plantation ManagerAgricultural Research ScientistAgriculture Development OfficersAgriculture TechnicianAgriculturistsBusiness Development ExecutiveMarketing ExecutiveRice BreederSeed TechnologistJunior Agriculture SpecialistJunior Associate – ResearchAverage salary offered to a B. Sc. agriculture graduates depends on area or industry he is working for.Some of the best agro based products’ companies that offer jobs to B. Sc Agriculture graduates have been mentioned below. DuPont IndiaRallies India LimitedAdvanta LimitedNational Agro IndustriesRaasi SeedsABT IndustriesPhalada Agro Research Foundation Limited.Basic salary after completion of course offered to these graduates ranges from 15K to 20K per month depending upon various factors like profile, industry etc. After B. Sc. Agriculture, one may also go for M. Sc Agriculture and take up a teaching job, or even go for PhD and build a career in the Research sector associated with the field of Agriculture. Institutions that offer these courses are:- Department of Science (Christ University) - Bangalore Miranda House – Delhi Lovely Professional University, Punjab Madras Christian College(MCC) - Chennai Hindu College - Delhi ",
            "date": "Answered June 25, 2018",
            "views": "111",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chainik Karmakar",
                    "user_href": "/profile/Chainik-Karmakar"
                },
                {
                    "user_id": "Thèri Vîjay Añna Ràsigañ",
                    "user_href": "/profile/Thèri-Vîjay-Añna-Ràsigañ"
                },
                {
                    "user_id": "Roopam Gupta",
                    "user_href": "/profile/Roopam-Gupta-37"
                },
                {
                    "user_id": "Jayaraman Girishkumar",
                    "user_href": "/profile/Jayaraman-Girishkumar"
                },
                {
                    "user_id": "Sudipta Nandi",
                    "user_href": "/profile/Sudipta-Nandi-21"
                },
                {
                    "user_id": "Sudheeran Murukan Syamala",
                    "user_href": "/profile/Sudheeran-Murukan-Syamala"
                },
                {
                    "user_id": "Akash Chavan",
                    "user_href": "/profile/Akash-Chavan-123"
                },
                {
                    "user_id": "Anuj Sharma",
                    "user_href": "/profile/Anuj-Sharma-2017"
                },
                {
                    "user_id": "Simran Agrawal",
                    "user_href": "/profile/Simran-Agrawal-49"
                },
                {
                    "user_id": "Jaga Jagadish",
                    "user_href": "/profile/Jaga-Jagadish-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Brister",
                "href": "/profile/Mary-Brister"
            },
            "answer_text": "Hmm. Did you have a particular area that caught your interest? Maybe get a job in the field for a year or two and think about it before coming back to school. And by “in the field” I mean, work at some agriculturally related position. It doesn’t have to necessarily have to literally be in the field. Again, did a particular area catch your interest? See if you can get a job in that field. If you liked horticulture, go work for a greenhouse or a florist. If you are stumped, go talk to your adviser or a professor you might be particularly close with. They might have an insight into what you might be good at doing and interested in. ",
            "date": "Answered June 25, 2018",
            "views": "46",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Samiksha Santoshwar",
                    "user_href": "/profile/Samiksha-Santoshwar-1"
                }
            ]
        }
    ]
}