{
    "title": "What's a sign of good parenting skills? - Quora",
    "tags": [
        "Skills",
        "Parents"
    ],
    "response": [
        {
            "author_info": {
                "name": "Misia Julia",
                "href": "/profile/Misia-Julia"
            },
            "answer_text": "Just like a garden, where you can look after, tend and maintain a garden and see signs in the short term that tell you the garden is doing beautifully. There may be foliage, flowering and signs of growth and health. These signs are important however they will not necessarily predict, guarantee or show you what the future will look like. So too with parenting - there may be happy children, good health and growth which would seem to be signs of good parenting. A sign that you may be providing all the essentials for physical health and growth. You will respond to growth spurts and get clothing that fits, you might respond to food preferences as well as allergies, you will ensure their safety and their very survival will show that you are a good parent. You may also have children who talk with you, share about their day, their highs, their lows, their frustrations and their joys. You may have children who simply want to play, eat and do their own thing. Either of these things could be a sign of a happy and content child as much as it could be a sign of an unhappy child. The question for you, as a parent is, what is the result of good parenting in your eyes? If you believe that your child being happy or at the least acting happy, is a sign of good parenting, then you will act towards that aim. If you believe that children should not be left wanting, and this is a sign of good parenting, then you will act towards that. and finally, before stepping into any decisions or changes to your parenting style, you must understand and accept that regardless of the amount of work, effort and attention you pay - like a garden - there is absolutely no guarantee of what your children will be like, nor their relationship with you will be in the future. You can have the best seedling, the most beautiful and nourished garden bed and even play music and ensure no pests … and this will not guarantee you fruit, nor a long living tree. All you have is your relationship every day. Every moment is what you can attend to. As a parent - you are likely to first ‘provide’ and ‘protect’. To ensure survival and growth. then you may provide ‘response and action’ which will develop curiosity and allow development of the senses and abilities. After that, as a child expresses their individuality you will look to ‘establish guidelines and provide choices’ to allow the child to learn how to navigate their world and interact with other people. finally…you will decide whether you want to learn and continue learning about your child or whether you prefer telling them what to do, giving them a framework for living. Each of these paths will create a different relationship and call for different communication approaches. maybe I should have written this at the beginning - but the short answer is ‘no’, there really aren’t any signs of good parenting. A child having a tantrum in a supermarket is not a sign of bad parenting as much as a child sitting still in a restaurant with a napkin on their lap isn’t a sign of good parenting. At the end of the day - just like a beautifully tended garden - there is still an environment and a world that contributes to our garden. So, the best parenting in the world cannot guarantee a certain result, nor does it prevent external happenings that can significantly impact a persons life. For me personally - good parenting is being available to my children and be the one person they can count on, regardless what happens. This doesn’t mean i can protect them at all times. This doesn’t mean I can solve their problems, not make things better. It just means that I am contactable and when I listen to them, I am wanting to hear what they are saying … not jumping to my own conclusions. And that I can be relied upon to tell them the truth, and be the support they need when sorting through confusions or issues in life. Finally, that I will respect that their world, their perspectives and their decisions are theirs and I am just there to hug, clap, cry and laugh with them, especially when there may be no one else. They do not have to look after me, but i am there to look after them in the way they need, not the way I think they need. ",
            "date": "Answered November 23, 2018",
            "views": "165",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kali Pritchard",
                    "user_href": "/profile/Kali-Pritchard"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wendy Faucett",
                "href": "/profile/Wendy-Faucett"
            },
            "answer_text": "Raising children is about leading them along a righteous path of modesty, humility, generosity, hard work, kindness and charity. It's every parent's job to intentionally teach their children to be respectful, responsible and resourceful family members, students and ultimately adults. From the day that little toddler can understand simple directions, such as “put your shoes in the closet,” the slow, critical process of emancipation begins. ",
            "date": "Answered November 23, 2018",
            "views": "41",
            "upvotes": "0"
        }
    ]
}