{
    "title": "What do teachers really think about students? - Quora",
    "tags": [
        "Teachers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jemima Jansfort",
                "href": "/profile/Jemima-Jansfort"
            },
            "answer_text": "Years after I stopped teaching I still think about some of my students. I wonder if Jay stopped cutting, if he got the right help after I discovered his wounds and scars and reported it to social services (as required by law), if I maybe hopefully made a difference and made him feel safe and accepted in my little specialized class of nerds. I wonder if Ken ever got past his bullying trauma and stopped tying himself in knots whenever he had to speak to other people. I wonder how Brian and Hussein are doing. They both struggled with dyslexia of astronomical severity. I wonder if Raz ever learned to manage his ADHD — cognitively or through meds — so it became possible for him to hold a conversation of more than 3 minutes. And if not how is he doing? I wonder if Toby ever really managed to deal with the grief of losing his older brother, when they were both teens. I wonder how Tom is coping with his auto-immune disease. I wonder if Cameron ever stopped hiding his inferiority complex and fear of failure behind an arrogant wall of superiority posturing. Just off the top of my head. I wonder a lot. Sometimes I run into some of my former students when they're back in town visiting their folks/family/old friends, and they sometimes let me have a glimpse of how they're doing. Once in a while I meet one who is brave enough to open up and tell me I made a difference back then, when I had the priviledge of being let into a little corner of their lives during their teens. That means the world. (All names have been changed) ",
            "date": "Answered October 15, 2018",
            "views": "939",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marvel Maniac",
                    "user_href": "/profile/Marvel-Maniac-3"
                },
                {
                    "user_id": "Sandeep Chadha",
                    "user_href": "/profile/Sandeep-Chadha-25"
                },
                {
                    "user_id": "Nicolás Oga",
                    "user_href": "/profile/Nicolás-Oga"
                },
                {
                    "user_id": "Rose Lynn",
                    "user_href": "/profile/Rose-Lynn-11"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Tychii"
                },
                {
                    "user_id": "Anne Fischer",
                    "user_href": "/profile/Anne-Fischer-31"
                },
                {
                    "user_id": "Sophia Alexandra Watson",
                    "user_href": "/profile/Sophia-Alexandra-Watson"
                },
                {
                    "user_id": "Franco Adkins",
                    "user_href": "/profile/Franco-Adkins"
                },
                {
                    "user_id": "Rose Flores",
                    "user_href": "/profile/Rose-Flores-48"
                },
                {
                    "user_id": "Colleen Matlick",
                    "user_href": "/profile/Colleen-Matlick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dean Monarch",
                "href": "/profile/Dean-Monarch"
            },
            "answer_text": "As a teacher with 18 years with high school students. I love about 95% of the students that walk in to class each day. The other 5% can be a challenge. That does not mean that I don't care about them and teaching the but they are different from the majority. Some of this group are just appathetic toward learning and I must work extra hard to motivate them. Others are socially awkward or have other issues that can make education more difficult. I teach in a manufacturing environment and most of the time all students are interested in learning what I offer them. They know that upon graduation they will have carrier opportunities if they do well in this course. So that is quite different from a traditional classroom in many ways. My classes are hands on and that helps to hold student interest. On a personal note I believe that if you don't love your students and want to see every one of them succeed then you should not be teaching. The students know the teachers that care and they will work harder for them. You must also have a passion for the subject that you teach, without passion your students will see that you are just going through the process and you really don't want the kids to learn what you have to offer. I have always told anyone that asked the day that I am not excited about what we are doing in class it is time to find a new job. And in 18 years I have never had a thought about going back in to the private sector. But I don't think most teachers would follow this idea. ",
            "date": "Answered March 13, 2018",
            "views": "11",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Tychii"
                },
                {
                    "user_id": "Yekaterina Patrusheva",
                    "user_href": "/profile/Yekaterina-Patrusheva"
                },
                {
                    "user_id": "Laurie Iversen",
                    "user_href": "/profile/Laurie-Iversen-2"
                },
                {
                    "user_id": "Barbara Martin",
                    "user_href": "/profile/Barbara-Martin-77"
                },
                {
                    "user_id": "Marc Ortega",
                    "user_href": "/profile/Marc-Ortega-4"
                }
            ]
        }
    ]
}