{
    "title": "What is it like to be born deaf vs. becoming deaf later in life? - Quora",
    "tags": [
        "Specific Life Experiences",
        "Deafhood (culture)",
        "Hearing Loss",
        "Deafness (physiological condition)",
        "Blindness",
        "Hearing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gregg Portch",
                "href": "/profile/Gregg-Portch"
            },
            "answer_text": "Wow…what a question… I really like this site…yet most of the questions are so surface leveled…yet this one is to the core. Not only is the question provocative, it strikes home in so many of us who are deaf, as well as those who are Deaf. For me, I am considered Late Daeafened because I lost my hearing when I was 7. I knew English and relished the written language. I grew up Oral, and was forbidden to use ASL. In fact, I did not learn ASL until I was in my late 40’s Those of you who have become deaf at an early age are blessed with a language that others strive for. Just like my grandfather that wished that he could speak English as well as his Irish brotheras…yet they where born her in America and he was born in Ireland. He would never achieve the level of English that his siblings achieved. As well as I will never achieve the level of ASL that those who where born Deaf have achieved. Yet, I have become who I am. I am me…and I believe that I agree who I had become. Hearing, deaf, or otherwise…I feel that I have become an asset to society…I have made the world a better place….and I love my children..my parents…and my grandchildren. I hope that when I am called to leave this world, I have left it better than when I was received here. ",
            "date": "Answered February 9, 2019",
            "views": "188",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dorothy Triantafilon",
                    "user_href": "/profile/Dorothy-Triantafilon"
                },
                {
                    "user_id": "Donna Tipton",
                    "user_href": "/profile/Donna-Tipton-6"
                },
                {
                    "user_id": "Devan Fronk",
                    "user_href": "/profile/Devan-Fronk"
                },
                {
                    "user_id": "Laurann Neill",
                    "user_href": "/profile/Laurann-Neill"
                },
                {
                    "user_id": "Lori Rubush",
                    "user_href": "/profile/Lori-Rubush"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Tierney",
                "href": "/profile/John-Tierney-20"
            },
            "answer_text": "Obviously no one can provide firsthand knowledge of both these situations. That said, my experience and observations may provide some insight. I’m not deaf but I was born severely hard of hearing. There are various ways to measure hearing but for for this purpose oral comprehension is relevant. In a earring test where someone says words, I understand just about everything if I can see the speaker and 10–15% if I can’t. Essentially I see what people say rather than hear what they say. When I was little my parents noticed that I seeemed fine when I looked at them, but was oblivious to anything they said if I wasn’t looking at them. It’s wasn’t until I started school that I was identified as HoH. I acquired language primarily through lipreading, or visual ques rather than aural cues. My brain is wired to process language visually rather than aurally. I’ve had hearing aids in the past, but they don’t help me much. If I don’t see what you say, I don’t know what you said. It doesn’t matter how loud the sound is; it just doesn’t register clearly with me. So. I’m 66 now. I’ve lived that way all my life. In the past 12–15 yrs I’ve noticed contemporary start losing their hearing, and wearing hearing aids - far smaller than anything I would wear so their hearing loss is quite mild. The interesting thing is that when these people don’t have their hearing aids they tend to be lost, or constantly asking for something to be repeated, or they simply clam up. For them, language is aural, and when their ears can’t deliver quality sound, their brains can’t process what sound they get. For them, amplification may help a lot. Learning other coping mechanisms like lipreading or signing will be tough - a lot like trying to learn a new language at their age. In a way, these people are struggling to cope in a hearing and aural culture world as I’ve struggled all my life. Their frustration and limitations are similar to what I feel when I’m in a social situation and can’t see what people are saying. I admit to feeling a bit of schadefruede sometimes. Some of those people who struggle today would have been sneering at me and getting others to laugh at me behind my back 20 yrs ago. But now? I’m going to cruise through the rest of life as I have so far (hearingwise) and for them its only going to get worse. All things considered, I would say that being born deaf or HoH is a very different experience from losing hearing later in life. ",
            "date": "Answered February 9, 2019",
            "views": "167",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deb Brayton",
                    "user_href": "/profile/Deb-Brayton"
                },
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                },
                {
                    "user_id": "Donna Tipton",
                    "user_href": "/profile/Donna-Tipton-6"
                },
                {
                    "user_id": "Laurann Neill",
                    "user_href": "/profile/Laurann-Neill"
                }
            ]
        }
    ]
}