{
    "title": "What degree can I do with my A levels with ICT chemistry and maths? - Quora",
    "tags": [
        "GCE A Levels",
        "Information Technology",
        "Mathematics Education",
        "Chemistry",
        "Mathematics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin J Pitt",
                "href": "/profile/Martin-J-Pitt"
            },
            "answer_text": "Fairly obviously, computing, chemistry and maths degrees. You can do chemical engineering at a few places, though most require physics. However those that do not will be prepared to teach you the subset of A level physics which is actually required. There is a fair amount of competition for jobs in computing, though many of the graduates are not particularly strong in mathematics (though have other useful attributes such as artistic ability) so I suggest you look for a degree where a good maths grade is a requirement. By contrast, many fewer people do maths degrees, but it should be said that you should only do it if you really like maths! Maths graduates can get into many fields where numbers (and usually computers) are used, including engineering, finance and some aspects of medicine. They do the stuff which is beyond the engineering, business and biological science graduates. There is a whole field of computational chemistry which you might be able to get into. Modelling really complex molecules and their reactions, e.g. in the development of new medical drugs. Chemistry is the key subject for forensic science. They will teach you the bits of biology required. There could be some opportunities in future because of your background, considering that criminals make use of computers, and the use of data analysis is increasingly used to detect and prove all sorts of crimes. The equipment and statistical methods are advancing all the time. A combination of chemistry and computation is developing in areas such as toxicology and environmental science, e.g. monitoring chemicals in effluent or waterways and drawing conclusions about what is going on in a complicated situation. If you choose chemistry, I would strongly advise going for the MChem rather than the BSc, as job prospects are better, and you may have opportunities in your final year to do modules and a project related to your career aim. Some chemistry careers are given here: Chemistry job profiles | RSC Education ",
            "date": "Answered October 24, 2020",
            "views": "53",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rod Rishworth",
                    "user_href": "/profile/Rod-Rishworth"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tricia Lockhart",
                "href": "/profile/Tricia-Lockhart"
            },
            "answer_text": "You’ve got a good set of subjects there. All sorts of engineering sorts of applications. Chemistry is also so strong these days - that phrase ‘what in the world isn’t chemistry’ comes to mind. And it underpins lots of current research/testing due to Coronavirus. We are also becoming more aware of the damage of plastics which means lots of openings for good ideas for alternatives. I remember being told that some of the materials science/ materials technology subjects even at Oxbridge were under subscribed making it a good choice if ytou fancy the kudos of having been to Oxbridge without the demand for very high grades. If you are not talking about further study in the form of a University courses those fields lend themselves to modern apprenticeships as well. ",
            "date": "Answered October 24, 2020",
            "views": "29",
            "upvotes": " Answer requested by Rafi Uddin"
        },
        {
            "author_info": {
                "name": "Riaan Labuschagne",
                "href": "/profile/Riaan-Labuschagne-3"
            },
            "answer_text": "There are so many - you can chop and change as you like. Anything in the medical and engineering and related fields. Part of choosing a field of study is the journey how you discover what it is that you want to be. When you find an interesting degree see if you can job shadow someone in that occupation. ",
            "date": "Answered October 25, 2020",
            "views": "36",
            "upvotes": " Answer requested by Rafi Uddin"
        },
        {
            "author_info": {
                "name": "Marcus Streets",
                "href": "/profile/Marcus-Streets"
            },
            "answer_text": "You are meant to have those discussions before you start your A-levels. However, it looks like Chemistry is your best option, possibly Chemistry with Maths. ",
            "date": "Answered October 24, 2020",
            "views": "3",
            "upvotes": "0"
        }
    ]
}