{
    "title": "What do I need to know before I become a journalist? - Quora",
    "tags": [
        "Tech News and Journalism",
        "Online Journalism",
        "Journalists",
        "Journalism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Tynan",
                "href": "/profile/Dan-Tynan"
            },
            "answer_text": "Let's start by parsing that question. What are you asking, exactly? What basic skills do you need to be a journalist? Or why should anyone become one? See, this is one example of what journalists (hopefully) do: Ask questions, drill down, clarify, explain.   Clarify that, and I'll edit this to answer the question you actually meant to ask. OK, I see that the original poster clarified that this is about the basic skills required to be a journalist. Here goes: 1. Curiosity. You have to want to learn stuff, all the time.  2. Persistence. People will put you off. Don't let them. 3. Skepticism. People will try to spin you, if not outright bullshit you. Pin them down. 4. Politeness. Missing from many of my journalistic brethren and sisterns, sadly, but still necessary. People are giving you their time, even if they have ulterior motives. You should be thankful and respectful, even if they're assholes. (The vast majority aren't.)  5. Intelligence. You don't have to be a PhD candidate. But you should be able to collect and synthesize information. If you don't have the brain power to handle conflicting and sometimes paradoxical information, choose another profession.  6. Good written communication skills. This should probably be number one, but... you'd be surprised how many J's fall down here. It's why God created editors. (Or was that Satan?) 7. Good verbal skills. Slightly different from the above. Journos get asked to do other media a lot, to host panels, give speeches, etc.  8. Excellent interviewing skills. This takes some practice, but a good J will be able to have a conversation with a source to the point where he/she forgets he/she is a source. 9. A willingness to be poor. Nobody gets into this racket for the money. Some manage to make decent coin regardless. But don't expect to. 10. The ability to take criticism. Both in the form of an edit (if you can't take an edit, get out now) and from the public. Being able to respond in a civil tone to the trolls and assclowns who try to drag you down is a real skill, one I am still honing. That help? ",
            "date": "Updated October 16, 2014",
            "views": "886",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kayla Mitria",
                    "user_href": "/profile/Kayla-Mitria"
                },
                {
                    "user_id": "Baiyusan Chang",
                    "user_href": "/profile/Baiyusan-Chang"
                },
                {
                    "user_id": "Margaret Weiss",
                    "user_href": "/profile/Margo-Weiss-1"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                },
                {
                    "user_id": "Diana Tan (陈丽梅)",
                    "user_href": "/profile/Diana-Tan-陈丽梅"
                },
                {
                    "user_id": "Shiloh Frederick",
                    "user_href": "/profile/Shiloh-Frederick-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Al Eisenmenger",
                "href": "/profile/Al-Eisenmenger"
            },
            "answer_text": "I have been asking this question for a long time. A perfect example is after getting fired by one main street media for unethical reporting another one hires them, so what qualifications are needed? Now days there is no such thing as journalism, it’s all show, and write or talk about what the highest bidder tells you. There used to be something called an investigating journalist, but now if anyone does this type of work and it doesn’t fit a liberal agenda then it’s not reported or down played by other so call journalists. Journalism is dead as we knew it. Now journalism just use scripted news (fake) or opinions disguised as news. Journalist have generally been liberal leaning, however they used to have scruples and did report the facts, but not any more for the most part. Maybe some go into journalism for the right reasons, but some how get indoctrinated to become a person who just follows the blogs and opinions of politicians and ideologies. There used to be an honer being a good journalist doing your own thing reporting honestly and going where the facts take you, however now if the story doesn't fit a main street media agenda or late night talk show host opinions, your eaten alive by your own kind. So sad there is no more honesty in journalism. The good journalist is a dying breed and most never got rich doing their jobs. ",
            "date": "Answered August 6, 2019",
            "views": "922",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Milos Vasic",
                    "user_href": "/profile/Milos-Vasic-8"
                },
                {
                    "user_id": "Rebecca King",
                    "user_href": "/profile/Rebecca-King-171"
                }
            ]
        }
    ]
}