{
    "title": "What do you learn in personality development classes? - Personal Development Base - Quora",
    "tags": [
        "Personality Development",
        "Classes",
        "Personality",
        "Productivity",
        "Learning New Things",
        "Character and Personality",
        "Learning",
        "Self-Improvement",
        "Education",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vanessa Dye",
                "href": "/profile/Vanessa-Dye-3"
            },
            "answer_text": "As an ex teacher I have never undergone personality development classes, but I know quite a bit about self – evaluation and how valuable it is in enabling both personal and professional development. WHY SELF EVALUATE? Increases self-awareness and hence improves self-evaluationIt enables the identification of :-needs and wantsdrivesprogressgaps in learningStrengths, weaknesses, opportunities and threats (SWOT analysis)Promotes individualised learning, especially through the action planning approaches e.g.:-Build on strengthsReduce weaknessesSeek opportunities for further developmentAvoid threats or develop strategies for dealing with themDevelops skills in assessment, to enable the assessment of othersIts acts as a source for personal empowermentHOW TO BEGIN A SELF-EVALUATION CYCLE SELF -AWARENESS —SELF-ANALYSIS —SELF-DISCLOSURE —SELF - DEVELOPMENT Self-awareness is the start of this process. We are aware in 3 main areas: Thinking Feeling Doing These areas can be further divided such as spirituality, sexuality, appearance, verbal activity and such like. Self – analysis – involves being honest about yourself and making the decision to begin to explore your characteristics and personality and what makes you, you. Self- disclosure - does not mean talking to yourself! It means being more specific about what you want to change, or enhance about yourself and focussing on that particular characteristic and working on it. Self-development overlaps with self-disclosure, and follows up with realigning yourself to see if you have changed as you wanted to. Turning a mirror on yourself is not easy and it is often useful to find out how others see you. You can usually ask a work colleague or mentor to give you some feedback about your performance in a certain situation. Providing them with some pointers to direct them to what you want them to look at. After you have their feedback marry it up to your self-evaluation. This will give you a better picture of the real you. SOME DISADVANTAGES OF SELF-EVALUATION • Hinges of self-awareness as a pre-requisite • Embarrassment at the outset i.e. self-consciousness is a negative versions of self-awareness • Under and over rating of self • Person does not have the skills USING THE MODEL – AN EXAMPLE Self-awareness stage – I think I say ‘you know’ too much when I speak. Self – analysis – when am I using ‘you know’. Is it in all conversations, or is it in particular circumstances. I will audio myself to check out my problem. Self – disclosure – when I am with my friends I will ask them to count the number of ‘you knows’ I use in a 5 minute conversation. Self- development – I will work out from my analysis the extent of my problem and try to become hyper aware of my use of ‘you know’. I will update myself firstly on daily intervals to see if I improve. I hope the model is useful for your self development. ",
            "date": "August 17, 2020",
            "views": "162",
            "upvotes": " Submission accepted by Shamima Akter "
        }
    ]
}