{
    "title": "What are the disadvantages of a part time job? - Quora",
    "tags": [
        "Part-time Job Search Advice",
        "Part-Time Job Search",
        "Part-Time Jobs",
        "Job Search Advice",
        "Job Searches",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Philip Edwin",
                "href": "/profile/Philip-Edwin-3"
            },
            "answer_text": "Part-time workers usually do not receive benefits such as health insurance, sick leave, holiday pay or vacations. When they are not working, they earn no income, which may prove detrimental during sudden illnesses or if they need to take a break. When times are bad, they are typically laid off before full-timers, because they have less time on the job and do not have the expertise of full-time workers. Part-timers may not be promoted as quickly as regular employees, if at all. Employer Disadvantages Administrative costs for part-timers may prove higher because employers must process paperwork and provide more management oversight than what one worker entails. Part-timers have neither the experience nor the same security that a full-time worker brings. Consistency of performance may be more difficult when more than one person works at the same task. Part-timers are more inclined to leave when offered full-time work or higher salaries elsewhere. They may work more than one job in a day, making it difficult to change their schedules and making them prone to exhaustion more quickly and more often. ",
            "date": "Answered March 6, 2020",
            "views": "685",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bernadette Green",
                    "user_href": "/profile/Bernadette-Green-2"
                },
                {
                    "user_id": "Ashley Mintz",
                    "user_href": "/profile/Ashley-Mintz-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sudeep Kumar",
                "href": "/profile/Sudeep-Kumar-631"
            },
            "answer_text": "Do you really need to ask that question, \"Is working part time bad?\" The answer is yes. If you are hoping to work in the future and earn a full time income with your current employer, then you will need to get some extra money by changing positions. Working full time is hard work, sometimes demanding and lonely. It is not the best way to go if you are hoping to earn a full time income and support yourself. If you want to be a professional and get paid a lot, working part time is the answer for you. Working part time can allow you to earn a significant amount of money, however this is only true if you are willing to put in the effort. You will have to be willing to do whatever it takes to become successful. If you want to be successful at something, you will have to be willing to dedicate your life to that thing. Your life will become a lot easier when you have less responsibilities to attend to. This means that you will be able to enjoy more free time, as well as getting paid a great deal of money. The best way to find out if working part time is bad or not is to simply get some experience and find out where you fit in at different places. It is very important to find out what your strengths and weaknesses are. Remember that if you decide to continue to work full time, your skills will decrease, but you should still be happy with your results. As long as you are still enjoying your work, you will be happy with your career and will not be too bothered about working part time. ",
            "date": "Answered March 14, 2020",
            "views": "400",
            "upvotes": "0"
        }
    ]
}