{
    "title": "What are objectively the easiest and hardest languages to learn without knowing any other language? - Quora",
    "tags": [
        "Language Acquisition",
        "Educational Psychology",
        "Human Development",
        "Specific Languages",
        "Self-Teaching",
        "Learning Languages",
        "Learning New Things",
        "Linguistics",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ryan McCarl",
                "href": "/profile/Ryan-McCarl"
            },
            "answer_text": "A person’s native language makes it easier to learn some languages rather than others. Setting that aside, it is debatable whether any language can be said to be objectively more difficult to learn than any other; I am guessing that linguists and experts in developmental psychology might say no, because (as far as I know) children do not normally learn different native languages at different rates. But I think we can say that some languages are objectively more difficult to learn than others with respect to specific characteristics such as the complexity of the language’s writing system, phonology, and grammar. I can think of at least one example of a phenomenon in which native-speaker children learn an aspect of their own language at a slower pace due to its complexity. Japanese and Chinese children learn Chinese characters (kanji or hanzi) over a period of years, while native English speakers typically master the alphabet and learn to at least sound out (“decode”) the words they see by the time they are 5–7 years old. So it seems fair to say that a writing system that uses a simplified, phonetic script such as the Latin or Cyrillic alphabets is objectively simpler than a writing system that uses thousands of ideographs whose meanings and sounds must be learned individually. One could similarly argue that languages that use fewer possible sounds (for example, Japanese’s five vowel sounds compared to English’s 12) use objectively simpler sound systems or phonologies. Languages that use tone (such as Thai and Chinese) are objectively more difficult in that respect because the tone of each word must be memorized and pronounced accurately.Languages that use noun gender (the Romance languages, German, etc.) are more difficult in that respect than languages that do not.Languages that inflect verbs to show tense, person, number, mood, voice, politeness, or all of the above require learners to learn conjugations, and this task is more complex in some languages (e.g. French, Latin, or Greek) than in others (e.g. Portuguese). Languages that avoid verb inflection entirely (e.g. Chinese) are the easiest in this respect.Languages that use noun cases to show the grammatical role of each noun in a sentence are more challenging than those that do not. And, as with verb conjugations, the difficulty of learning noun cases varies widely across language. Finnish and Hungarian notoriously use many noun cases, and Russian, Latin, and German are not too far behind; in English, however, word order is the primary indicator of what role a noun plays in a sentence, and noun cases appear mostly as a relic of English’s origins as a Germanic language (for example: “I,” “he,” and “who” for the subject as opposed to “me,” “him,” and “whom” for the object).These are just a few examples of ways we can attempt to objectively compare the difficulties that different languages pose to learners. It would be worthwhile to compile these in a chart. —-Ryan from WordBrewery ",
            "date": "Answered August 23, 2016",
            "views": "18",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kelsey Ray",
                    "user_href": "/profile/Kelsey-Ray-1"
                },
                {
                    "user_id": "Carlee Brown",
                    "user_href": "/profile/Carlee-Brown-3"
                },
                {
                    "user_id": "Rafał Biel",
                    "user_href": "/profile/Rafał-Biel"
                },
                {
                    "user_id": "Jody Boginski Barbessi",
                    "user_href": "/profile/Jody-Boginski-Barbessi"
                },
                {
                    "user_id": "Gavin McGregor",
                    "user_href": "/profile/Gavin-McGregor-1"
                },
                {
                    "user_id": "Joachim Pense",
                    "user_href": "/profile/Joachim-Pense"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lara Novakov (ლარა ნოვაკოვ)",
                "href": "/profile/Lara-Novakov-ლარა-ნოვაკოვ"
            },
            "answer_text": "I think that learning any language is easy/hard depending on the language you already speak. However, I will say this and people are free to disagree with me, but that’s my opinion after all, so it is not a rule. I think that generally, Caucasian languages are among the hardest to learn. Again, those who already speak a Caucasian language might find it easier to get the grip with the others from the same group, but I think that these languages are generally hard for anyone else who doesn’t speak a Caucasian language. By Caucasian languages, I am talking mostly about those lesser known languages that have a very complicated phonology and sounds that are quite hard for non-natives to learn how to say. Georgian, Abkhaz, Adyghe, Chechen, Ingush, Avar etc. Especially Adyghe, Abkhaz and Chechen are known for their notorious phonology. Adyghe has so many unfamiliar sounds that require a lot of practice in order to say them properly. It also has a large consonant inventory (as most Caucasian languages do) and not only does it have complicated phonology, but the lack of material (for those who decide to learn it - but they are in really small numbers) doesn’t help either. Also, the Black Sea dialect of Adyghe has a very uncommon sound called the Voiceless bidental fricative h̪͆ and it is a sound present only in Adyghe and more specifically - in that dialect of the language. Chechen is known for more than 20 pharyngealized consonants. Without writing an answer that could be really long, I’ll leave some pages instead. Adyghe language - Wikipedia Chechen language - Wikipedia The Synchronic and Diachronic Phonology of Ejectives http://journals.linguisticsociety.org/proceedings/index.php/BLS/article/viewFile/3147/2866 ",
            "date": "Answered February 8, 2017",
            "views": "19",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Remi Whiteside",
                    "user_href": "/profile/Remi-Whiteside"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Art-Moorhouse"
                },
                {
                    "user_id": "Abdul Majid",
                    "user_href": "/profile/Abdul-Majid-112"
                },
                {
                    "user_id": "Bahram Amiri",
                    "user_href": "/profile/Bahram-Amiri"
                },
                {
                    "user_id": "Ahmad Ryad Altajar",
                    "user_href": "/profile/Ahmad-Ryad-Altajar"
                },
                {
                    "user_id": "Anna Stepanova",
                    "user_href": "/profile/Anna-Stepanova-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/José-Antonio-35"
                },
                {
                    "user_id": "Jack Pal",
                    "user_href": "/profile/Jack-Pal"
                },
                {
                    "user_id": "Chrys Jordan",
                    "user_href": "/profile/Chrys-Jordan"
                },
                {
                    "user_id": "Shanfa Chaiyadi",
                    "user_href": "/profile/Shanfa-Chaiyadi"
                }
            ]
        }
    ]
}