{
    "title": "What do teachers do with a student who smells bad? - Quora",
    "tags": [
        "School Teachers",
        "Body Odor",
        "Smell and Smells",
        "Teachers",
        "Teaching",
        "Students"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jhon Kinggxg",
                "href": "/profile/Jhon-Kinggxg"
            },
            "answer_text": "I’m not a teacher I actually just graduated hs 2 years ago. This girl I knew of not personally. I had two classes with and had to ride the bus for 30 minutes to go to boces (pretty much a hands on learning environment where I went for mechanics on cars) she smelled so bad I swear I could smell it all the way from front to the back of the bus. I live in the country my school how ever is supposed to be a very great high end type rich type school it has gone so down hill it’s not even funny but that’s besides the point. I told my school counselor 4 times In a month about this girl smelling. Now I had no intention of being friends with her or even getting to know her. But the excuse I used to bring up the problem was people talking about her etc. so finaly like the Fourth or goth time my counselor said and I quote “man you really are concerned about her aren’t you? Does someone have a little crush? “ I was in 10th grade at the time. I started laughing and said are you kidding me??? I’m telling you the problem because I’m forced to be around her and I’m about to puke anytime I am. You guys are to damn worried about hurting her feelings to do anything about it. I got up to leave and said either you guys fix the problem or I’ll find a way of switching classes around and I’ll tell them it’s your fault. Surprisingly a week goes by. No more smell. I don’t want to sound like an awful person but imagine have to smell a Septic tank for 30 minutes 4 times a day 5 days a week against your will. You wouldn’t be happy. ",
            "date": "Answered October 29, 2020",
            "views": "34",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Evelyn Copper",
                "href": "/profile/Evelyn-Copper"
            },
            "answer_text": "We had a kind of different situation at my school. Because our school is over crowded, many of the teachers have to share rooms during their free periods. My history teacher had free period for first period and then I had her for second period. Well, every day when we would get into class, it had a horrible smell to it. Every inch of the room had a terrible stench of BO. One day, the teacher for the period before ours came in and explained that the class before us was for some of the special needs students. In particular, she apologized for the smell and said she had one student with a coat that always stunk. This was a fine explanation and kind of what we expected, but nothing had been done yet. It was then that the teacher told us that the school would not contact his parents unless other kids had their parents call and complain to the school. As far as I know, no one ever did this because the room continued to stink throughout the year. It's always been a difficult situation because I'm sure the boy was struggling as an outcast because of how he smelt (even if he couldn't tell). On the other hand, I also have a special needs brother. Different teachers have called several times to complain about small things my brother was doing. This always led to my parents being angry because they were already doing their best. I never even suggested they call the school because I had seen how they felt when people complained about their own kid. ",
            "date": "Answered May 25, 2019",
            "views": "86",
            "upvotes": " View 51 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deirdre Dougherty",
                    "user_href": "/profile/Deirdre-Dougherty"
                },
                {
                    "user_id": "Akilah Gamil",
                    "user_href": "/profile/Akilah-Gamil"
                },
                {
                    "user_id": "Karina Masso",
                    "user_href": "/profile/Karina-Masso"
                },
                {
                    "user_id": "Zara Styles",
                    "user_href": "/profile/Zara-Styles-5"
                },
                {
                    "user_id": "Chris Paw",
                    "user_href": "/profile/Chris-Paw"
                },
                {
                    "user_id": "Marie Jones",
                    "user_href": "/profile/Marie-Jones-454"
                },
                {
                    "user_id": "Michellynn Schroeder",
                    "user_href": "/profile/Michellynn-Schroeder"
                },
                {
                    "user_id": "B. Rathkeale Timmins",
                    "user_href": "/profile/B-Rathkeale-Timmins"
                },
                {
                    "user_id": "Katy Gilbraith Colvin",
                    "user_href": "/profile/Katy-Gilbraith-Colvin"
                },
                {
                    "user_id": "Ruth Calvin",
                    "user_href": "/profile/Ruth-Calvin-1"
                }
            ]
        }
    ]
}