{
    "title": "What are the problems for a primary school teacher? - Quora",
    "tags": [
        "School Teachers",
        "Elementary School and Elementary Schools",
        "Teachers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Viscuso",
                "href": "/profile/Thomas-Viscuso"
            },
            "answer_text": "There are many obstacles to teaching primary school kids. There are many kids that have sense of entitlement. They expect exceptional grades for mediocre work. They fail to recognize that grades are earned not “given”. Cell phones are a major distraction in class. I personally don't understand why a child needs a cell phone. If parents need to contact a child they can call the school! I have been teaching for almost 18 years and have never failed to deliver a message from the office to a student. The evaluation system for teachers is unreasonable. There is not human alive let alone any teacher that can accomplish all of the things this system of evaluation requires of us. I am a dedicated educator but I also have a personal life. I could not possibly accomplish all that is required of me under this system. It basically is designed so that you can not ever perform at that level. If you dont believe me look up any school systems Danialson evaluation rubric and tell me that you could do everything that is listed. No child left behind and standardized tests have all but destroyed our ability to teach what they need to survive and thrive as adulds. Some of us have more then 100 students on any given day. How could we possibly provide any individual support with that many kids. These are just a few of the problems with trying to teach today. Our schools have been turned into “factories” that churn out kids by the thousands. The system is broken. ",
            "date": "Answered February 4, 2018",
            "views": "28",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Visalani",
                    "user_href": "/profile/Visalani"
                },
                {
                    "user_id": "Elena Gossin",
                    "user_href": "/profile/Elena-Gossin"
                },
                {
                    "user_id": "Christine Ellen Spadano",
                    "user_href": "/profile/Christine-Ellen-Spadano"
                },
                {
                    "user_id": "Erin Noel",
                    "user_href": "/profile/Erin-Noel-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akhtar Hayat",
                "href": "/profile/Akhtar-Hayat-2"
            },
            "answer_text": "The primary school teacher is ever engaged with innocent kids in classes for to fulfill the students studying needs and as well as school curriculum requirements all the time. In whole the world, it's really more tough job to be with an enthusiastic energetic stamina to work deal and sort out the Strategical ways plans how to feed little world of cute innocent Angeles. A primary teacher has to focus on his role in his class until the other teacher come in class. We through our oxfordcadets com fun learning ways curriculum deal the children. That would enable them to face the tomorrow's challenging successfully awesomely through a process of learning. A primary school teacher main problem is that he has to be well familiar with all the kids nature, their mental level capabilities and other things. If he doesn't know how to tackle the kids, and or unaware about their psychology, he never show up an outstanding balanced result that parents and schools curriculum criteria require. Conclusion is that he must be well trained, passionate, humble, creative, problems solver, helpful, talented, well dressed, with smiley-face impression, artful and a professional bit experienced to know how to tackle engage the children's attention so that each of them could learn lifelong skills for an exemplary future professional degrees or prosperous life. ",
            "date": "Answered October 17, 2019",
            "views": "1",
            "upvotes": " View Sharers"
        }
    ]
}