{
    "title": "What is your hope? - Quora",
    "tags": [
        "Hope and Hopes"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Pettit",
                "href": "/profile/David-Pettit-13"
            },
            "answer_text": "I wake up in our bed. She is still asleep, and she pulls the blankets over her shoulder with a bit of annoyance. I get out of bed, waking her briefly because she's a light sleeper. The sun has grayed the sky as it begins it's ascent. I can see her puffy little face from the twilight, and her mess of toussled hair about the pillow. I'm going to let her sleep and enjoy her rest. Instead, she turns to me as I stand up, and she says “Oh?”, like I was surprising her by leaving. I come over by her side of the bed, caveman naked, and very gently put both of my hands on her cheeks. I kiss her lips softly, brush the hair off of her face, and I look straight into her eyes and I whisper “I choose you today.” I kiss her again, and she smiles and says “And I choose you, mi amor,” to me. She snuggles up against a pillow as I put on my robe, and Goliath the Wonderdog rousts himself off the floor. We go outside together. I open the French doors and go out to sit on our covered patio. Goliath starts doing all of the sniffing and running around that a dog will do in the morning, and I pull out my phone. We live in the mountains, North of Boise, between Horseshoe Bend and Idaho City. Our cabin of a home is kept exemplary by my bride, who takes great pride and joy in her homemaking talents. Me? At home I do what she tells me to do, and try not to screw up anything. And while our nearest neighbours are 50 yards away, our backyard is a mile wide prairie frequented by all manners of wild game in the early hours. The lightening sky allows me to see a small herd of elk who are making use of the century old pasture land, and Goliath doesn't feel the need to see if this herd wants to be his friends or not. He's 0 for 87 so far. I think about our morning ritual as the birds start to chirp in the day. I recall how our Priest told us that “forgiveness is a choice, as trust is a choice, as love is a choice. Every day, commit to make the choice to love, trust and forgive each other no matter what,” and we do. In my mind, I wonder if she thinks it's a little corny that every day I wake up, kiss her and tell her directly that on this day, too, I choose her. That everything that goes with such an open declaration comes with it. It's been two years, so I'm hoping that she doesn't think that it's lost its meaning, because my love for her has continued to only grow. I open up Quora, of course, and see that a $5000 deposit has been made from the Quora Partner Program. That's 2 months full expenses for us! The question I offered up about the new tax plan has millions of views and hundreds of answers. Finally! I can use my mind to make a living. My wife will be so, so thrilled for us to be able to afford everything through the next 2 months! We'd been struggling a bit in the factory with the onset of autumn, and this will mean that our winter is secure. A few minutes of calm reverie ensue, as I enjoy the feeling of accomplishment and consider how I'll tell my bride the news. As I watch the elk, my bride comes outside wrapped up in a blanket. She gives me a hot mug of coffee, and says “Juan Valdez was calling us, I couldn't resist his offer this morning.” She sits down next to me and holds my hand in hers. I smile, thank her, cover her legs with the trailing blanket, and then give a mischievous look with my broad grin. “My love, I have news this morning,” I begin…. This moment, this moment right here, this exact moment when I know I'm about to make her so proud of me, so relieved, and so overjoyed, this moment is what everything is for. This moment is my highest hope in this life. ",
            "date": "Updated November 1, 2018",
            "views": "198",
            "upvotes": " View 159 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jennilyn Overbeek",
                    "user_href": "/profile/Jennilyn-Overbeek"
                },
                {
                    "user_id": "Betty Nota",
                    "user_href": "/profile/Betty-Nota"
                },
                {
                    "user_id": "Vandana",
                    "user_href": "/profile/Vandana-320"
                },
                {
                    "user_id": "Aishwarya Yadav",
                    "user_href": "/profile/Aishwarya-Yadav-30"
                },
                {
                    "user_id": "Melissa Barham",
                    "user_href": "/profile/Melissa-Barham-2"
                },
                {
                    "user_id": "Julia Brown",
                    "user_href": "/profile/Julia-Brown-324"
                },
                {
                    "user_id": "Mary George",
                    "user_href": "/profile/Mary-George-258"
                },
                {
                    "user_id": "Bill Rawlins",
                    "user_href": "/profile/Bill-Rawlins-1"
                },
                {
                    "user_id": "John Lundquist",
                    "user_href": "/profile/John-Lundquist-2"
                },
                {
                    "user_id": "Sherin Santosh",
                    "user_href": "/profile/Sherin-Santosh-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elliot Jackson",
                "href": "/profile/Elliot-Jackson-7"
            },
            "answer_text": "I'll begin this answer with a story. Today in my forensics class, our teacher announced that despite his best effort and several meetings over the summer, transgender team members may only sleep in hotel rooms with members of their sex on school trips this year. The overwhelming reaction from my class was of outrage and frustration. There are several out trans kids on the team, and many of them have spoken up about their discomfort with this policy. It's such a little thing, who someone shares a bed with, but it can mean a great deal to a kid who already feels like they’re fighting the world to be accepted as who they are. Several people in my class, which is overwhelmingly composed of Catholic and Mormon students, emailed our principal right then and there to complain. Many of them hugged S, the sole out trans kid in the class, and commiserated with him. The teacher promised S that he would arrange for him to have his own bed in the hotel room if he wanted it. Like I said, my class is full of people whose religious leaders have been known to speak out against LGBT+ people. We live in Arkansas, and Arkansas can be a very unsafe place to be trans. But in my classroom today, I saw students who cared about how their friend felt. I saw people look beyond gender in pursuit of compassion. I saw the people who are going to run the country someday speaking out in support of their trans friends, and it made me hope that the future will be brighter when my classmates rule the world. ",
            "date": "Answered August 21, 2017",
            "views": "17",
            "upvotes": " View 53 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sahar-118"
                },
                {
                    "user_id": "Russell Lee",
                    "user_href": "/profile/Russell-Lee-71"
                },
                {
                    "user_id": "Chandrika Sarania",
                    "user_href": "/profile/Chandrika-Sarania"
                },
                {
                    "user_id": "Perseus Jones",
                    "user_href": "/profile/Perseus-Jones"
                },
                {
                    "user_id": "Lora Alexander",
                    "user_href": "/profile/Lora-Alexander-3"
                },
                {
                    "user_id": "Alex Coninx",
                    "user_href": "/profile/Alex-Coninx"
                },
                {
                    "user_id": "Ian Rothman",
                    "user_href": "/profile/Ian-Rothman-1"
                },
                {
                    "user_id": "Krista Lundelin",
                    "user_href": "/profile/Krista-Lundelin"
                },
                {
                    "user_id": "Kate One",
                    "user_href": "/profile/Kate-One"
                },
                {
                    "user_id": "Naï Damato",
                    "user_href": "/profile/Naï-Damato"
                }
            ]
        }
    ]
}