{
    "title": "What does 'learning needs' mean? What are they? How are these needs best met? - Quora",
    "tags": [
        "Self-Teaching",
        "Skills",
        "Understanding Self-Improvement",
        "Learning New Things",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nan Waldman",
                "href": "/profile/Nan-Waldman"
            },
            "answer_text": "The term \"learning needs\" in education is about as practically meaningless as the term \"nutritious food\" is in the field of human biology. That is, in each case, the use of these general terms have to be considered in their context. In education, a student's learning needs in public schools in the USA are defined by: The state curriculumThe classroomThe class teacherThat teacher's lesson plansThe class assignmentsParticipation in classAttendance in classStudent's social-emotional-psychological abilitiesThe student's academic ability to access and execute as expected by the teacher with respect to all of the above.The student's combined abilities to access and execute all of the above as expected by the teacher, parent, student (depending on age and ability to participate), school administration, and state rubrics.When I am teaching a student I try to assess what that student needs from me in order to love to learn and improve the skills, knowledge and ability to love learning and to desire continual improvement.  When I was a freshman in college I turned and lifted my eyebrows. I was with my dorm roommate. We watched graduate students in the student union. They were earnestly discussing something and we heard many words we never heard before. \"What are they talking about?\" I asked. \"Matters of Greater Importance,\" she said. That was all I needed for motivation in college. I wanted to know what the grad students knew. Matters of Greater Importance motivated me to ask questions and learn more in anthropology, journalism, and law.  For my own learning modalities I prefer a combination of teacher modeling, relationship with teacher as motivation, and then quiet time to practice, read, absorb information, and practice again by myself. My earliest experiences on Quora with Marc Bodnick selectively up voting and briefly commenting on my answers let me know the standard of writing he felt would earn his vote. This experience illustrates some of my learning needs. But what are internally defined learning needs? The gap between what is learned, and what one wants to know. ",
            "date": "Updated May 19, 2018",
            "views": "165",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andrew James",
                    "user_href": "/profile/Andrew-James-97"
                },
                {
                    "user_id": "Krati Shekhawat",
                    "user_href": "/profile/Krati-Shekhawat"
                },
                {
                    "user_id": "Sed Chapman",
                    "user_href": "/profile/Sed-Chapman"
                },
                {
                    "user_id": "Seda Karatas",
                    "user_href": "/profile/Seda-Karatas-1"
                },
                {
                    "user_id": "Madeleine Bolger",
                    "user_href": "/profile/Madeleine-Bolger"
                },
                {
                    "user_id": "Dakota Lim",
                    "user_href": "/profile/Dakota-Lim"
                },
                {
                    "user_id": "Amanda Tendler",
                    "user_href": "/profile/Amanda-Tendler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Dillard",
                "href": "/profile/Steven-Dillard"
            },
            "answer_text": "In most places in the US, children can be assessed for learning disabilities. Even geniuses can have disabilities. These assessments identify the learning needs of the child. After the assessment, teachers meet with parents to develop a plan that includes accommodations to help the child do better. My son is damn smart, but he has problems with executive functioning and reading and learning math facts. He's great with mathematical theory. He teaches other kids how to do things, but when he has to multiply six by nine, he counts up on his fingers.  For reading, he was given permission to use books on tape or a computer reader that would read aloud to him. He's a lovely writer, although that is very painstaking for him. His handwriting is unreadable. He needs a computer in order to be understood. As a result of his learning needs, he gets extra time on standardized tests, due to his difficulties in using math facts and slowness in reading.  I find this to be a rather egregious example of backwards thinking on the part of educators. Why, in this time of calculators and universal visual media, do kids need to learn math facts and reading? They can use calculators and they can watch videos to do tasks for learning.  But most schools seem mired back in the 19th century. Some of them still even have blackboards!!!  Children are part of a system they don't understand, and their parents can run interference for them. But at some point in time, we have to learn how to navigate these shoals on our own. We won't always be taking standardized tests on which we can get extra time if we have a psychologist attesting to the need for that. I blame George Bush's \"No Child Left Untested\" for this.  Testing, in my opinion, is laziness on the part of teachers. It is useless. I believe we need to assess people, child and adult, by asking them to do tasks and then evaluating the resulting work in terms of usefulness to the organization. This requires a lot more work, but the make work of tests really doesn't help anyone learn anything useful, except how to do well on tests. Which isn't really useful -- or shouldn't be useful. I always did well on tests. I got decent grades. Not straight As, but mostly As and Bs and the occasional C. But doing well in school did nothing to prepare me for life, which required a whole new set of skills and I had to learn those skills on the job, after I graduated. Later on in life, it turned out that knowing how to write papers and understanding statistics and the scientific method was useful to me. But I still had to learn those things on the job, because I remembered little of what I learned many years before in school. For me, my learning need is relevance. I need to be interested in a subject and I need to be able to use it right away, or it's pretty much wasted on me. And I don't think I'm the only one. I think most students want learning to be relevant and interesting. I'm an adult now, so I can focus on things that I actually need. So I do that. I am on my own, and I can arrange things to meet my learning needs in a way that I might not have been able to do back in grade school. ",
            "date": "Answered December 10, 2014",
            "views": "79",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Dakota Lim",
                    "user_href": "/profile/Dakota-Lim"
                }
            ]
        }
    ]
}