{
    "title": "What are the major obstacles in public education? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Claudia Gold",
                "href": "/profile/Claudia-Gold"
            },
            "answer_text": "Limited and unequal distribution of funding, and the political difficulties involved in reversing it; economic inequality on a family level. In America, the system with which I'm most familiar, we actually have many great public schools.  They just tend to be concentrated in wealthy areas with abundant resources.  From the physical buildings to technology to rates of parent involvement, schools in wealthy areas fare better than those in poor areas. Funding in American schools is determined by local property taxes.  This means that schools in wealthy areas get far more funding per student than schools in poor areas. In theory, the fix is simple:1. Distribute funds on a state-wide level.  (Country-wide would be preferable but is politically infeasible 2. Increase the size of the entire budget.   Here are some of the political obstacles involved in this plan: 1. Parents in wealthy schools will generally do not support fix #1 on its own, because it will reduce the per-student budget of their children's schools.  On average, parents of working families have less time and resources to be more politically involved, so the wealthy parents often win out here. If the difference between wealthy and poor families were not so vast, this would be less of an issue.  Therefore, another option could be to increase economic equality statewide.   2. #2 requires either increasing taxes or shifting the budget away from other areas.  Both of these are politically challenging, though of course possible.  You can imagine various difficulties involved: most of the wealthy do not want their taxes raised, and most organizations, government or not, do not like to see their spending cut. If it were up to me, I would cut military spending, which is higher than the military budget of the next 20 countries' military budgets combined.  Despite the fact that our most recent wars in Iraq and Afghanistan did nothing to improve the lives of ordinary Americans, many people here still prioritize US military predominance over domestic issues.  This makes a shift away from spending on wars politically difficult.  (I'm cautiously optimistic that President Obama's choice of Hagel for Secretary of Defense could be the first indication of a shift in the opposite direction in decades.) ",
            "date": "Answered January 13, 2013",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Kemp",
                    "user_href": "/profile/Daniel-Kemp-1"
                },
                {
                    "user_id": "Anirudh Joshi",
                    "user_href": "/profile/Anirudh-Joshi"
                },
                {
                    "user_id": "Jim Kenyon",
                    "user_href": "/profile/Jim-Kenyon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Felix Bazgan",
                "href": "/profile/Felix-Bazgan"
            },
            "answer_text": "Unrealistic expectations with unwillingness to accept accountability at all levels by all stakeholders. ",
            "date": "Answered December 26, 2011",
            "views": "44",
            "upvotes": "0"
        }
    ]
}