{
    "title": "What university skills did the IB teach you? - Quora",
    "tags": [
        "International Baccalaureate (IB)",
        "Skills",
        "Teaching"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carlos Páez",
                "href": "/profile/Carlos-Páez-1"
            },
            "answer_text": "Two big ones: critical thinking and writing. The critical thinking is very important in university no matter what you major in. I think this is obvious if you follow a career in the Arts & Humanities or Social Sciences. Essay writing and problem solving in these fields is all about critical and analytical thinking. IB through it’s focus on essay-based exams for Language A and Humanities classes, forces you to be able to use critical thinking on your feet. Even if you do a career in Science or Engineering, you will still need to have critical thinking when you do it at a university level. This is not only because you will still need to write lab reports, where you use these skills in data interpretation, but when it comes to exam-taking and projects these skills still come in handy. IB can give you these skills if you take Math or Physics HL (which are the ones I have experience with), because at this level the questions become quite unpredictable, which means that you can’t just memorize an algorithm to solve problems in exams. You have to think creatively, and that is a muscle that develops over time with practice - which the IB can give you. Writing is also ridiculously important in university. At NYUAD (where I study) many students come from schooling systems where academic writing is not emphasized, and it took them longer to adapt to university level writing than the IB students. After doing IB you will be comfortable with: doing citations (thanks to the papers you write for classes as well as the Extended Essay), with planing out an essay (thanks to long essay questions in exams), and if you are a procrastinator like me, in writing decent essays under time pressure. All this will allow you to be much more comfortable with essay writing, and so you can quickly start dealing with the more nuanced aspects of writing, which take years to master. Some people might say that it also teaches you good time management skills. That’s not always true. I’m in my second year of university now, and I still struggle with those. ",
            "date": "Answered March 31, 2018",
            "views": "352",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Claudia Lam",
                    "user_href": "/profile/Claudia-Lam-4"
                },
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "RH",
                    "user_href": "/profile/RH-64"
                },
                {
                    "user_id": "Athena Thomas",
                    "user_href": "/profile/Athena-Thomas-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carl Gavin",
                "href": "/profile/Carl-Gavin-1"
            },
            "answer_text": "The IB Diploma teaches students to become independent learners but the main advantage it gives over many other educational systems is the 4000 word research based extended essay. Most universities see this as putting IB learners a year ahead of A-Level, AP and other undergrads. ",
            "date": "Answered March 11, 2018",
            "views": "180",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hareesh Ramasubramanian",
                    "user_href": "/profile/Hareesh-Ramasubramanian"
                },
                {
                    "user_id": "Shima Mohamed",
                    "user_href": "/profile/Shima-Mohamed"
                },
                {
                    "user_id": "Jad Khoury",
                    "user_href": "/profile/Jad-Khoury-7"
                }
            ]
        }
    ]
}