{
    "title": "What are the trends in digital publishing? - Quora",
    "tags": [
        "Digital Publishing",
        "Publishing",
        "Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cinimol Nair",
                "href": "/profile/Cinimol-Nair"
            },
            "answer_text": "From its humble beginnings as a print media to the present-day mobile device, publishing has come a long way. And according to industry experts, it still has got a long way ahead. Digital publishing underwent many changes to adapt itself to user’s preferences and readability. Here are some trends in digital publishing which are a result of rapid digitization and which will also define the future of digital publishing. Flash to HTML5 There was time when flash was all the rage. Now it has begun to fade out since Google and Microsoft announced that they will not be using flash anymore. Adobe has announced they will not support the flash player plug-in. The reason behind this move was that flash failed to adjust with different devices and operating systems. Whereas HTML5 is mobile ready and it is compatible with most mobile devices and platforms. Audio Audio consumption is also on the rise. There are a number of podcasts and audio books which are available now. It makes data consumption easier. Improved readability Latest eReaders are designed keeping in mind the readability of the users. Users can now adjust the font, text, brightness of their eReaders. Publishers would want to further enhance this experience by introducing new features. Less ads Ads have started disguising themselves as content. It’s not until you reach the end of the article that you realize that it is in fact a very neatly drafted advertisement of a product/service. Since most people get frustrated at seeing a pop up ad and keep disabling them, organizations are now coming up with new ideas to promote their products and services. So in future you might see less direct advertisements, and more of indirect advertisements. Data protection We already have DRM in place. It pretty much ensures the safety of your online content. But is it enough? Data protection is kind of a big deal now, with the GDPR coming into picture, it is essential to take note of what data the publishers are collecting from their readers. Protecting the user’s online identity has become as important as protecting the online content itself. Organizations are now carefully examining all the data that they collect and publish in order to comply with the GDPR rules. Google analytics Every writer is trying to impress Google. Because Google decides who gets the top position on its rankings. If you try to heavily infuse your articles with SEO, Google will not consider you as a genuine content provider. So publishers also need to keep in mind the Google analytics and algorithms while publishing a content. ",
            "date": "Answered October 12, 2018",
            "views": "353",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Oleg Sergeykin",
                "href": "/profile/Oleg-Sergeykin"
            },
            "answer_text": "One of the most powerful trends in online publishing is the increasing shift in publishers' attention to mobile user experience, as more and more traffic comes from mobile platforms. AMP (Accelerated Mobile Pages) Stories aka Web Stories is probably the most popular and fastest growing mobile platform since it was introduced in 2018 by Google based on their AMP technology. This format can provide on your own website an experience which is very similar to stories on Instagram, Snapchat, or other social media: How 9 Companies are Redefining the Story Format Here is a quick guide on how to make an AMP Web Story for editorials that shows how to make it sharp, clear, and easy to digest: Create and publish your first editorial Web Story in 15 minutes.  These stories are a visually tappable experience that provides content publishers with a mobile-focused format for delivering news and information. This highly immersive medium will ensure your message is being delivered to your users during their daily micro-moments in quick and condensed bites.  There have been a number of new SaaS were developed for no-code options to create AMP Web Stories. You can use one of the widest range of Web Stories development features in Tappable (as in shown in the manual linked above) that will help you create Web Stories in the smoothest way possible and the following is meant to explain to you how to use these features to their full potential:  ",
            "date": "Answered October 16, 2020",
            "views": "72",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Daisy Hudson",
                    "user_href": "/profile/Daisy-Hudson-3"
                },
                {
                    "user_id": "Hafa Bahar",
                    "user_href": "/profile/Hafa-Bahar"
                }
            ]
        }
    ]
}