{
    "title": "What is Diwali and why is it celebrated? - Quora",
    "tags": [
        "Diwali (Deepaavali festival)",
        "Festivals"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aishwarya",
                "href": "/profile/Aishwarya-796"
            },
            "answer_text": "Diwali is celebrated as festival of lights where everywhere is illuminated with lights and diyas. Most of the festivals celebrated signify the harvest season or when something new is born of the earth. Diwali falls during the season of harvest of kharif crops, which brings in lakshmi that is opportunity for earning money. Another reason, Diwali falls during winter, the time of year when it darkens early outside. On the day of amavasya when Diwali is celebrated, it is utterly dark outside. Olden days there weren't any provisions for lights and surroundings were filled with forests. In order to drive away this darkness oil lamps were lighted outside the houses. Since surrounded by forests there were animals which could stray along. Crackers were burst to keep them at bay. Also in winter the body loses heat, hence one feels more hungry to fulfil the energy requirement of the body. Sweets are made of ghee and oil which helps keep the body heat stable by providing fats to the body. Fats are known to maintain the temperature of body. Lots of food rich with fats were prepared to fulfill the requirements of the body. Winter is also the time when everything around dies. The trees turn devoid of leaves and flowers and there is no color left in the surrounding. Rangolis were drawn outside houses to spread colour and cheer. Also, the rice flour were used to draw rangolis in order to feed small ants and insects which strays out. This practice came to be celebrated as Diwali which also signifies how when darkness cripples one's mind, lighting the light of knowledge can shed away evil. Ignorance is the evil and it can be aged only through knowledge. This light needs to be lighted inside our mind by ourselves to overcome obstacles and walk in the path of goodness. Other legends associated with Diwali include: Killing of narakasur- narakasur used to be a demon who had stolen indra’s mother's earrings and his crown. He asks Lord Krishna to rescue him out his torture. Lord Krishna along with satyabhama goes to heaven which was taken over by narakasur and redeems 16,000 women who were kept hostage by him. They eventually marry Lord Krishna as nobody is ready to accept them. Narakasur has a boon of being killed only by his mother. It is understood that satyabhama is none other than narakasur’s mother who is also the incarnation of mother earth. During kurma avatar when earth was pushed inside the ocean by hiranyask, she was rescued by Lord Vishnu through his boar avatar. At this time his seed fell on the earth and that is how narakasur was born. Narakasur is killed by the hands of satyabhama and Lord Krishna brings back the lost earrings and crown of aditi to indra. This is celebrated as a victory over bad by good.Return of Lord rama- after slaying ravana, Lord ram returns back from his 14 year of exile. This day is celebrated in triumph over his victory.Churning of ocean- We all are well aware of the churning of ocean, where Lord Vishnu took kurma or tortoise avatar and took the Mandar mountain on his back. With the help of vasuki the ocean was churned by devas having the tail of the snake and asuras having the mouth of snake facing them leaving poisonous venom. On churning the ocean a lot of things came out of it namely parijat tree, the moon, paras stone, kamadenu, iravati, halahal(poison drunk by Lord shiva),dhanavantri (who is known as Lord of medicine- In his name is celebrated dhanteras), goddess lakshmi. This day also celebrated as the birth of goddess lakshmi from the ocean as laxmi puja and dhanteras as the birth of dhanvantri, Lord of medicine.It is said there was a king who was bestowed by a son who would die 1 day after his marriage. The king eventually gets his son married. His wife is made aware of the fact. She contemplates to save his life. On the night when Lord yama was to come to take away her husband's life she decorates the whole house and surrounding with lights and diya. She also keeps all her gold outside the house. Lord yama comes in the form of a snake to kill her husband. But due to shinning gold and lights his vision gets blinded and he goes away. Thus she is able to save her husband's life. A small lamp is kept burning outside the house in order to wade away Lord yama from entering the house. The lamp is known as yamadeepam.Yami and yama : yami and yama were twins who were extremely close to each other. It is said aditi who is mother of yama and yami was unable to take the heat of Sun God and thus leaves creating a clone of her named chhaya. Sun God is unaware of this. One day due to some argument chhaya curses yama is die. Thus he turns out to be first mortal to die on earth eventually turning into a God. On being aware Sun God curses chhaya from his palace. Based on the curse yama eventually dies and goes to earth. It is said he comes once in a year to meet yami which is celebrated as bhaidoj as a reunion of brother and sister and cherish their unblemissed and unconditional love.This day also hold signifance in Jain and Sikh community as well. It is celebrated in different parts of the country in different way.Thus, this day came to be celebrated as Diwali throughout the country which nowadays lends time for people to get out of their stressful lifestyle and enjoy festivities with family and friends. ",
            "date": "Answered October 22, 2017",
            "views": "81",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Prabhu Agrawal",
                    "user_href": "/profile/Prabhu-Agrawal-8"
                },
                {
                    "user_id": "Krishna Bendre",
                    "user_href": "/profile/Krishna-Bendre"
                },
                {
                    "user_id": "Urvashi Gurjar",
                    "user_href": "/profile/Urvashi-Gurjar-2"
                },
                {
                    "user_id": "Priya Jha",
                    "user_href": "/profile/Priya-Jha-12"
                },
                {
                    "user_id": "Swarnali Chatterjee Yokota",
                    "user_href": "/profile/横田-チャタジー-スワルナーリ-Swarnali-Chatterjee-Yokota"
                },
                {
                    "user_id": "Abhishek Bilimagga",
                    "user_href": "/profile/Abhishek-Bilimagga"
                },
                {
                    "user_id": "Shreya Kumar",
                    "user_href": "/profile/Shreya-Kumar-83"
                },
                {
                    "user_id": "KP Rathore",
                    "user_href": "/profile/KP-Rathore-1"
                },
                {
                    "user_id": "Abhisek Senapati",
                    "user_href": "/profile/Abhisek-Senapati-1"
                },
                {
                    "user_id": "Hemanth Apte",
                    "user_href": "/profile/Hemanth-Apte"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hari Sankar Chockalingam",
                "href": "/profile/Hari-Sankar-Chockalingam"
            },
            "answer_text": "What connection his there with Lord RamDiwali, the festival of lights, celebrates the victory of good over evil, light over darkness, and knowledge over ignorance. Lamps are lit on this day not just to decorate homes, but also to communicate a profound truth about life -- when the darkness within is dispelled through the light of wisdom; the good in us wins over the evil.Diwali, in essence, is celebrated to kindle the light of wisdom in every heart, the light of life in every home, and bring a smile on every face. Diwali is the shortened form of Deepavali, which literally means rows of lamps. Life has many facets and stages to it. It is important that we throw light on all of them, for if one aspect of our life is in darkness, we cannot express life in its totality. The rows of lamps lit on Diwali remind us that every aspect of life needs our attention.Lighting Good Qualities Every lamp that we light is symbolic of a good quality. There are good qualities in every human being. Some have forbearance, some have love, strength, generosity; others have the ability to unite people. When all these qualities are lit, awakened, that is Diwali. Don't be satisfied with lighting one lamp; light a thousand! If you have the value of service in you, don't be satisfied only with that. Light the lamp of wisdom in yourself and acquire knowledge. Awaken all the facets of your being.Letting GoAnother profound symbolism of Diwali is in lighting firecrackers. In life, you often become like a firecracker, waiting to explode with your pent-up emotions, frustration and anger. When you keep suppressing your emotions, cravings and aversions are bound to reach a point where they explode. Bursting crackers is a psychological exercise from ancient times to release bottled-up emotions. When you see an explosion outside, you feel similar sensations within as well. Along with the explosion, there is a lot of light as well. When you let go of these suppressed emotions, the light of knowledge dawns.Being in the Present Diwali means to be in the present -- dropping the regrets of the past, the worries of the future, and living in the moment. The sweets and exchange of gifts symbolize forgetting the bickering and negativities of the past, and renewal of friendship for the times to come. A true celebration means dissolving all differences. Happiness and wisdom have to spread in society, and that can happen when all come together and celebrate. Even if one member of the family is shrouded in darkness, you cannot be happy. You need to kindle wisdom in every member of your family. Extend it to every member of society, every person on the planet.Spirit of ServiceAny celebration is incomplete without the spirit of service. Whatever we have received from the Divine we should share it with others, for it is in giving that we receive. That is true celebration.Diwali is a time when you throw light on the wisdom you have gained and welcome a new beginning. When true wisdom dawns, it gives rise to celebration. Celebration is the nature of the spirit and every excuse to celebrate is good. For the one who is not in knowledge, Diwali comes only once a year, but for the wise, Diwali is every moment and every day.For the one who is not in knowledge, Diwali comes only once a year, but for the wise, Diwali is every moment and every day. This Diwali, celebrate with knowledge and take asankalpa (vow) to serve humanity. Light the lamp of love in your heart; the lamp of abundance in your home; the lamp of compassion to serve others; the lamp of Knowledge to dispel the darkness of ignorance and the lamp of gratitude for the abundance that the Divine has bestowed on us.Courtesy :article by Sri Ravi shankar in huffpost. ",
            "date": "Updated September 10, 2020",
            "views": "68",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Manu Gupta",
                    "user_href": "/profile/Manu-Gupta-60"
                },
                {
                    "user_id": "Krishna Reddy",
                    "user_href": "/profile/Krishna-Reddy-1108"
                },
                {
                    "user_id": "Keshav Srivastav",
                    "user_href": "/profile/Keshav-Srivastav-1"
                },
                {
                    "user_id": "Lavanya Kovuru",
                    "user_href": "/profile/Lavanya-Kovuru"
                },
                {
                    "user_id": "Naveen Kumar",
                    "user_href": "/profile/Naveen-Kumar-19434"
                },
                {
                    "user_id": "Pranav Anand",
                    "user_href": "/profile/Pranav-Anand-114"
                },
                {
                    "user_id": "Girish Gangadkar",
                    "user_href": "/profile/Girish-Gangadkar"
                },
                {
                    "user_id": "Aravind Swamy",
                    "user_href": "/profile/Aravind-Swamy-6"
                },
                {
                    "user_id": "Dristi",
                    "user_href": "/profile/Dristi-3"
                },
                {
                    "user_id": "Krithika Jagannathan",
                    "user_href": "/profile/Krithika-Jagannathan"
                }
            ]
        }
    ]
}