{
    "title": "What are schools doing about mental health? - Quora",
    "tags": [
        "Mental Illness",
        "Schools",
        "Mental Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Heart It Out",
                "href": "/profile/Heart-It-Out-1"
            },
            "answer_text": "What are schools doing about mental health? Mental health is a subject that has so far not got the attention and importance it deserves.Our mental health has a direct impact on our ability to take in new information, understand new concepts and master new skills. Health includes mental as well as physical health but because of the stigma associated with mental health very little attention is paid to it. While schools have now woken up to the need for a school counsellor and there is more conversation on mental health and exam pressure, or cyberbullying, suicide prevention but we still have a lot of ground to cover. It goes without saying that school has a very significant place in a child’s life and potentially in their development too. Hence they have a critical role to play in any kind of mental health initiative also. Unfortunately the pace of the efforts has not kept up with the challenges a student faces today e.g: competitive environment, peer pressure, substance abuse,self harm etc. That being said some of the things that schools around the world are doing are as follows: We are finally talking about the elephant in the room and not wishing it away. There is more openness and agreement in schools about the need to talk about mental health and not trivialize it by saying things like ‘get over it’ ‘these things happen, its a phase, you will be fine.’ Now more than ever most schools acknowledge the stress and anxiety children go through and are willing to help with resources and support like a school counsellor.Teachers are trained and encouraged to watch out for behavioural and academic red flags like struggling to read/write, excessive fidgeting, or threat of harm to self and others. In such cases they should refer the student to a mental health professional for diagnosis and suitable interventions.Schools are moving towards an inclusive environment. This means that the school is gradually adapting to the special needs of each learner and not the other way round where the student has to learn to adapt to the system. An inclusive school has a belief and methods in place to ensure all students can access mainstream education. Eg A child with dyslexia listens to the audio book rather than reading the text to overcome his/her reading challenges.There are few more country specific initiatives e.g a few states in USA like New York have made it mandatory for mental health to be included as as subject in the school curriculum. Clearly a lot more needs to be done. e.g: life skills training (covers topics like communication, skills for coping with emotions and stressors,empathy, self awareness) should be mandatory in schools as it will help students adjust and manage life stressors better. A concerted effort has to be made not just by schools, but by the parents, the community at large and the government too. Only then a consistent and long lasting change will happen. ",
            "date": "Answered August 11, 2020",
            "views": "119",
            "upvotes": " Answer requested by Rupsa Bhowmik"
        },
        {
            "author_info": {
                "name": "Keith Guinn",
                "href": "/profile/Keith-Guinn"
            },
            "answer_text": "I can’t really answer this straightforwardly, as every state and county is different. I’m sure some schools tackle it for sure, but not nearly as much as it should be. In high school, some of the biggest issues are the parents. God forbid any mental health professional or advocate shares mental health information for their kids to talk to their parents about…the parents will flip a shit toward schools and suddenly be defensive with things like “you’re telling me my kid has issues — THEY DON’T.” One of two things are happening here: A) The parent is afraid of looking like a bad parent because their kid might have mental health issues (even if it’s not their fault). B) The parents DO think their kids have issues, but it actually has a lot to do with the parents and not so much the kids. We see this in mental health all of the time. Parents want to throw their kids at us and say “fix them,” when the parents are the real issue. When you move into college, mental health resources become quite plentiful. Sadly, I wish more high schools had not only mental health professionals, but advocates that can share crucial mental health information for teenagers and their parents. I think this is why I prefer to work with teenagers. They’re going through such a rough time in their lives trying to discover themselves and handle issues thrown their way. With the right guidance during these crucial years, they can come out ahead. Anyways, that’s just my opinion on the matter! ",
            "date": "Answered April 27, 2020",
            "views": "175",
            "upvotes": "0"
        }
    ]
}