{
    "title": "What are some short course for science student? - Quora",
    "tags": [
        "Science Student",
        "Short Term Courses",
        "Educational Courses"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sharma RS",
                "href": "/profile/Sharma-RS"
            },
            "answer_text": "Science: online short courses (1) Science: sport, the science behind medals Science is an important aspect of virtually every sporting event, playing a major role in the training and performance of elite athletes at competitions such as Olympic Games. In this online course you'll develop an understanding of the physical science that underlies sport. You'll learn about the science that is a basic part of the way that athletes move and interact with their environment, and also about scientific concepts that athletes need to understand if they are to compete at elite level. A variety of sporting phenomena associated with Olympic sports will be investigated, including track and field, swimming and diving, and cycling. To understand these phenomena, you will be introduced to a range of scientific concepts that include speed and acceleration, forces, gravity, aerodynamics and the technology of new materials. (2) Science: galaxies, stars and planets What makes a black hole ‘black’? Why do some stars appear red and others blue? This course answers questions like these and explores the fascinating science behind the galaxies, stars and planets of our Universe. You will learn more about the exploration of our own solar system, the discovery of planets orbiting other stars, the birth, life and violent death of stars, distant galaxies seen as they were billions of years ago and the creation of the Universe itself. It will develop your understanding of a range of topics in astronomy, with sections on the Sun, planets, stars, extraterrestrial life, galaxies, and the origin of the Universe using cutting-edge astronomy software. It will also develop your understanding of some aspects of science that you can apply to other situations. (3) Science: the weather This course provides an introduction to weather patterns and events around the world, explaining the main drivers that determine the weather on a seasonal and daily basis. It will enable you to understand how the professional weather forecasts for your area will have been made and how reliable they are likely to be. You will be required to undertake a small project in which you will develop your ability to observe your local weather in a systematic way and to make your own short-term predictions on the basis of those observations. The course is produced in partnership with the Royal Meteorological Society. (4) Science: the frozen planet Exploring the wonder of the polar world, this short course is about the science of the frozen planet that covers over one-third of the Earth at any one time. Using specially-shot film clips from the spectacular Frozen Planet BBC series, the course investigates the ecosystems and animals that prosper in the polar regions, the global climate, the influence of humans on the environment and the motivations of early explorers. You will also learn about the current management of the polar regions and their fate in the near future. (5) Science: plants and people The theme of this course is 'plants and the living planet' and it explores the crucial role that plants play in the everyday lives of all of us. Plants and their products are important not just as staple foods but also increasingly as biofuels, bioplastics, medicines and even for catching criminals and in combating climate change. (6) Science: microbes Explore the intriguing world of bacteria, viruses, yeast and other microscopic organisms – an empire of creatures that extends into every facet of human life and the environment. Microbes have brought us terrible afflictions such as Black Death, flu pandemics, MRSA and food poisoning, but at the same time they ferment our beer, help our bread rise and work in the soil to enable crops to grow. This course provides an introduction to microbes, explaining their practical uses and important role in health and environmental sciences, and even the possibility of their discovery on other planets. (7) Science: human genetics and health issues An area at the forefront of developments in medical science, this course examines the patterns of inheritance of genes, how genes function and why there are differences between individuals and between populations. You will also explore some of the issues surrounding the research into genes, from biological, medical and ethical points of view. (8) Science: molecules, medicines and drugs Modern research at the molecular level constantly adds to the range of drugs available to combat ill health. This course tells the fascinating stories behind the development of a variety of drugs that provide us with medicines to cure illnesses, alleviate the symptoms and reduce the risk of infection and disease. This course has been partly funded by the Wolfson Foundation in collaboration with The Royal Society of Chemistry. (9) Science: living without oil Crude oil is currently our most important global source of energy. It is vital in the manufacture of many modern materials. But the world’s supply of oil is finite, its price is unstable and our reliance on oil has damaging environmental consequences. Can we sustainably fuel our transport needs with biofuels, electricity or hydrogen? Can we replace the plastics we derive from crude oil with ones made by microorganisms or plants? This introductory course explores oil’s vital role in the modern world, as a source of both energy and modern materials, and discusses the issues arising from our dependence on it, assessing some of the exciting scientific developments that could lead to sustainable alternatives to oil. This course has been partly funded by the Wolfson Foundation in collaboration with The Royal Society of Chemistry. (10) Science: nuclear energy Nuclear energy is back in the news as governments around the world increasingly commit to building new nuclear reactors. This course looks at the motivations driving this new commitment, and considers the development and history of nuclear energy as well as the difficult issues around safety and nuclear waste disposal. The underlying science, the technology, the biological effects of radioactivity and the costs of producing electricity are all examined in such a way as to help explain why nuclear energy seems so certain to form a part of our energy future. ",
            "date": "Answered September 24, 2017",
            "views": "113",
            "upvotes": " Answer requested by Niyati Jalpa Joshi"
        }
    ]
}