{
    "title": "What subject did you hate most in school? Why? - Quora",
    "tags": [
        "Hate",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Samantha Coupe",
                "href": "/profile/Samantha-Coupe-2"
            },
            "answer_text": "I have three main subjects, none of which I take anymore. Last year was the final year in which I had to take them, and I’m so glad that I no longer have to. The subjects, in order from least to most soul-crushing are: ART  Generally, the content of art lessons was pretty bearable. I was actually good when it came to shapes and colours, where I came up with good designs, even if the paint and pencil work was poor. The year after that, all the work was on tone - AKA using many, many grey pencils that are apparently somehow different from each other. All I got from this was grey splodges that vaguely resembled leaves, rocks, or whatever I was supposed to be drawing. Then, we went onto drawing humans. To put it nicely, that was complete and utter heck. When it comes to drawing people, I’m shit. I cannot draw people for the life of me. Though I was terrible at art, that was not the main reason. The main reason was that it made my hands hurt. So. Much. I have hypermobility, which massively hinders precise manual dexterity, and makes using my hands painful. Because most of art involves activities that hurt due to this, it’s not very pleasant. However, even if I’m terrible at art and it causes physical pain, I did enjoy many lessons. IT  The dreaded IT lesson… 3 hours every two weeks holed up in that damn computer room… working on that stupid AQA ICT GCSE. I get it, knowing the tools is useful. But all the writing… so tedious. Why couldn’t we have done a GCSE on something like Drama or Music? Plus, I only got a C. DT  I was so bad it this… When it came to Food Tech, I was decent, and I wasn’t too bad at Graphics or Electronics… But Resistant Materials… Oh God, Resistant Materials! I was hopeless a this. It took me ten minutes to saw a plank in half. I almost never got close to finishing my projects, even when the teacher did half my work for me. It combined the boredom of IT and the pain and difficulty of art. Not just that, but DT also had various group topics. Naturally, I was in a group all by myself, meaning that nothing actually got done - I had the fortune of having music lessons and support sessions almost every DT lesson in that time. Unfortunately, it meant that my result was terrible - all I could produce for my powerpoint regarding my product was a kiwi was photoshopped onto a gif of Naruto running. I hated DT so much. ",
            "date": "Answered November 7, 2018",
            "views": "21",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zoe Anastasia Karran",
                    "user_href": "/profile/Zoe-Anastasia-Karran"
                },
                {
                    "user_id": "Tony Williams",
                    "user_href": "/profile/Tony-Williams-864"
                },
                {
                    "user_id": "Leo Barker",
                    "user_href": "/profile/Leo-Barker-6"
                },
                {
                    "user_id": "Theo",
                    "user_href": "/profile/Theo-458"
                },
                {
                    "user_id": "Ashton Hennessy",
                    "user_href": "/profile/Ashton-Hennessy"
                },
                {
                    "user_id": "Kritika Chauhan",
                    "user_href": "/profile/Kritika-Chauhan-76"
                },
                {
                    "user_id": "ThienLuan Le",
                    "user_href": "/profile/ThienLuan-Le"
                },
                {
                    "user_id": "Hannah Watson",
                    "user_href": "/profile/Hannah-Watson-66"
                },
                {
                    "user_id": "Alex Boxall",
                    "user_href": "/profile/Alex-Boxall-4"
                },
                {
                    "user_id": "John Al",
                    "user_href": "/profile/John-Al-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Austin Schopper",
                "href": "/profile/Austin-Schopper"
            },
            "answer_text": "I’m going to take school to mean college, as that was my most recent experience at being a student. There were several very challenging classes, but those I didn’t hate. There were also a few classes that I disliked. There was, however, only one that I completely remember hating, start to finish. I should, as I had to take the class three times, which was, interestingly, the average for people taking it. That class was Teaching Reading (later rebranded to another name, which I honestly don’t remember). It seems like a fairly straightforward class based on that title. It was also a requirement for anyone getting a degree in education. And why not? Reading is necessary, and all teachers should know how to teach it, right? The problem was that the name is misleading. This class was actually about aligning your class to the state and national standards, frankly, not a difficult task. The problem was that a) every teacher for every subject was stuffed into the same room, so the class couldn’t be tailored to your needs, b) the teacher that taught it was a committee member for the Common Core initiative, so she literally wrote the book on the new program that they were trying to implement, and in order to do that, they needed new teachers to be on board with the program, and c) the class was two hours twice a week. At this point, you may see the problem. The class was essentially four hours a week of listening to the woman talk about how great her program was, then writing various papers and worksheets about how how great we thought the program was and how we planned on using it. Any questioning or deviation was immediately shut down, and, because the grading was arbitrary, put you at risk of failing the class. By mid semester each time that I took it, half of the class had quit coming, instead hoping that the next year would bring a different teacher. Basically, if it helps, imagine a two hour timeshare meeting twice a week, during which you have to do assignments about how great the timeshare program is, and if you don’t, your future career is put on hold. Yeah. ",
            "date": "Answered February 28, 2018",
            "views": "999",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Leo Barker",
                    "user_href": "/profile/Leo-Barker-6"
                }
            ]
        }
    ]
}