{
    "title": "What are some of the best ways to learn programming? - Quora",
    "tags": [
        "Computer Programming Advice",
        "Learning New Things",
        "Learning to Program"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Altucher",
                "href": "/profile/James-Altucher"
            },
            "answer_text": "“I will kill you if you repeat this conversation,” Shlomo told me. “I think this web thing is going to be big.” This was 1995. “I want to undercut all of the stores on the street and sell diamonds direct to people at cheaper prices.” Shlomo was the wholesaler to all the retail shops in NYC’s diamond district. “But my name can’t be anywhere on the site at all or else these guys here,” and he waved his hand around his head, “will kill me” I had $0 in the bank. I knew nothing about diamonds. He showed me the “4 Cs”, he showed me what a GIA certificate was. He showed me his spreadsheet of all the diamonds he had. I told him we could make a website where people could search on price, any of the 4Cs, and then I would generate a GIA certificate that would look like the diamond and people would be able to buy directly. I would also make the content explaining the 4Cs and why each was important. —-  —- “How long will it take?” “About a month,” I said. But I had no clue. I had no idea how I was going to do this. If I did this in C or C++ it would take me too much time. At the time there were no tools for making websites. No Wordpress. No Python. No MySQL. Nothing. Everything had to be created from scratch. And I had no idea how to generate graphics, like the certificate, on the fly. But I had been living in New York for over a year and I was living on a foam futon in Astoria, Queens with no other belongings and I wanted to make some money. He was going to pay me $17,500 cash. I would be rich.  When I got to NYC I had an undergrad degree in Computer Science and had spent two years in grad school for Computer Science. After I got kicked out of grad school (another story) I then spent three years as a programmer. I had put in my 10,000 hours of programming. I thought I was good. When I got a job offer at HBO to work as a “junior analyst programmer” for $40,000 a year, I took it! I was so happy.  HBO felt like the real world. New York City felt like the real world. I bought a suit. I wanted my co-workers to like me so I would go down and talk when they took their cigarette breaks. But I was awful at my job. I couldn’t do anything. It was so much harder than an academic environment. Whenever I asked “how can I do this?” my boss would say, “if you want to work here you have to learn how to figure things out without asking.” One time, only about a week after I started, he came into my cubicle. I had an 8x8 cubicle. He breathed loudly and took up the entire cubicle. My boss, Ken, spoke loudly enough so that everyone could hear. I turned red almost instantly. I was hoping he would quiet down. He said, “You are not doing well. But we want to give you a chance. We want you tp take a month or two of remedial programming classes.” He gave me a pamphlet and told me to sign up. Everyone in the cubicles around me had all quieted down. Nobody was moving. I knew everyone was listening. I could’ve reached over right then and grabbed Ken’s neck and twisted it until he died. I thought about doing it while he was talking. If I were in prison I’d have an 10x10 cell and my own toilet. Here I was stuck in my 8x8 cubicle and I was being punished.  I took the remedial classes. I got up to speed. But when I wanted to take this side job to build this website I felt a bit overwhelmed. I was afraid to fail. I didn’t really know how to do it when I said, “I’ll do it!” But I wanted that $17,500. It was more money than I had ever seen before.  I called Chet. Chet was the best programmer I knew. He worked at IBM but we had been in school together. One time, from his apartment, he networked all of IBM’s computers together so they would have the bandwidth to stream the Olympics live on the web. I think it was the first video streaming. Chet and I would hang out and he told me about the projects he was working on. I told him all of that was BS. “Just learn the Internet,” I said. And he did. He ended his career 23 years later at Google, a very rich man. [ Chet’s latest:  ] One time he did me a favor that saved a business I had started. But that was a long time later. In 2008. I offered to give him a piece of the company in return for what he did. “No,” he said. “Please Chet, I owe you.” “Consider the debt repaid that I owe you.” “What debt?” “You told me to switch to the Internet. Thanks.” But that was 12 years later. Now I was stuck. How could I quickly program this diamond dealer’s website. I didn’t want to use C to go through his excel spreadsheet and I wasn’t sure how to make the graphics on the fly. He said, “No no no no. What are you doing? Use PERL.” “What’s that.” I was lying down on my foam mattress. I had a phone and a 3 inch black and white TV in the apartment that didn’t work. Every night, if I got up to go to the bathroom, I had to jump up and down before opening the door. That would make all the cockroaches disappear before I opened the door. “Just trust me. Get O’Reilly’s book on mastering PERL. Get it right now. Call me later.” I got the PERL book. About eight hours later I called Chet. “You were right,” I told him. “PERL was the way to do it.” “Did you read the book?” “I’m done with the whole project. The website is finished.”  Many years later Chet stopped talking to me. I wrote an article saying no war could be justified. He didn’t agree with me. He unfriended me and we never spoke again. I remember one time he stayed with me in grad school. I gave him a novel to read. “Cockpit” by Jerzy Kosinski. I’m remembering this because I’m rereading the book today. We were once close friends.  I took the PERL book and here’s what I did and here’s how I learn every programming language I’ve ever learned since 1984. It’s sort of how I learn everything I’ve had to learn ever since then. The key for any learning is: make it easy as possible, then get more difficult. SET UP YOUR ENVIRONMENT - Download whatever you need to do to program, compile, and run a basic “Hello, world” program.DOWNLOAD SOME SIMPLE PROGRAMS YOU CAN MODIFYPLAY. Make changes in the programs. Simple changes. See if it works. Then change back. Then Play again, a little more aggressively. Use the book as reference.That’s it. That’s the way I’ve learned every programming language before or since. And the same technique applies to learning everything. PERL turned out to be perfect for what I needed to do. I set up my environment. Started playing with some simple programs. When I made mistakes I used the book as reference. Eventually I modified the programs enough to make Shlomo’s website.  Years later I wrote software to make predictions in the stock market. It used a new language I had never used before. I took a sample program that looked for certain patterns in stock prices. Without knowing the language at all, I changed the patterns. Whenever I made an error I would look up the specifics of the language until I didn’t make errors. The more I modified programs, the more I learned about the language. These programs became the basis of my first hedge fund. This is the key: get a REFERENCEset up your ENVIRONMENT so you can program. This is the key part. Now you can play, program, learn.DOWNLOAD basic programsMODIFY themSTART MODIFYING to get closer to your final goal. MAKE THE TARGET CLOSER Tony Robbins once told me how he taught Marines how to shoot guns better. “I was in my early 20s and they asked me to teach these elite Marines how to shoot better. I had never even shot a gun,” he said. “But I watched them for awhile and then I had an idea.” “I put the target very close to each of the shooters. Maybe three feet away. They all shot bullseyes. “Then I moved the targets another foot away. They all shot bullseyes. And so on. I kept moving the target further away until it was all the way on the other side of the room. “They told me they had never seen a class of Marines learn how to shoot faster then in that class.” He looked at me and pounded the table to emphasize. “Always bring the target as close as possible. Start with that whenever you have to learn something. Then after you master it at that distance, move it slowly further away.”  (from my slideshare: “Ten things I learned from Tony Robbins”) —— I delivered the website. Shlomo was very happy. “So fast?” He was almost suspicious. But everything worked. He launched the website a few days later. It still exists (although has since been rewritten I think). diamondcutters.com. He gave me the $17,500, in cash, in a paper bag. I took it immediately to The Chelsea Hotel on 23rd Street and paid for a year in advance to live there. Shlomo was my first client. I started a business making websites. It changed my life. It began a period that was the worst decade of my life. Life was stress-free and simple before I started being an entrepreneur. Many years later, Shlomo died in a plane accident over Namibia. He was looking for uncut diamonds and crashed. —  — Shlomo had a secretary that I had a crush on. She had a big red wine stain birth scar that stretched from the corner of her eye, across the landscape of her cheek, and touched the end of her smile. I would stare at it when she spoke to me. I would try to make her laugh. To see that wine-stained smile. I wanted to lick the scar right off of her face. ",
            "date": "Answered December 24, 2019",
            "views": "1194",
            "upvotes": " View 895 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jason Brewer",
                    "user_href": "/profile/Jason-Brewer-4"
                },
                {
                    "user_id": "Usama Ahmed",
                    "user_href": "/profile/Usama-Ahmed-290"
                },
                {
                    "user_id": "Vivek Shukla",
                    "user_href": "/profile/Vivek-Shukla-1033"
                },
                {
                    "user_id": "Younes Outaoussout",
                    "user_href": "/profile/Younes-Outaoussout-1"
                },
                {
                    "user_id": "Raushan Kumar",
                    "user_href": "/profile/Raushan-Kumar-5917"
                },
                {
                    "user_id": "Sagi Nevet",
                    "user_href": "/profile/Sagi-Nevet"
                },
                {
                    "user_id": "Matthew Phillips",
                    "user_href": "/profile/Matthew-Phillips-338"
                },
                {
                    "user_id": "Khine June",
                    "user_href": "/profile/Khine-June"
                },
                {
                    "user_id": "Anubhav Mishra",
                    "user_href": "/profile/अनुभव-मिश्रा-Anubhav-Mishra"
                },
                {
                    "user_id": "David Júnior",
                    "user_href": "/profile/David-Júnior-1-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emmanuel Eyob",
                "href": "/profile/Emmanuel-Eyob"
            },
            "answer_text": "You can learn to code in so many different ways now that we have something called the internet.  When I was in the 8th grade, I was introduced to something called HTML in my computer class. It was incredible. My friends and I used to have competitions on who could make the coolest website. We were beginners having the time of our lives! This led me to learning new languages that can make my site look awesome like CSS and Javascript. The thing you have to know is that, generally, there is no best way to learn programming. It’s all about you. If you want some of the paths you can choose from, here: You can go to college, get a CS degree, and learn how to code from your CS knowledge. This is the most common path but if you’re older, can’t afford this, or just don’t want to go to college, there are still many other ways.You can go to a coding bootcamp. This method is becoming very popular nowadays and people are choosing to go this route over an expensive CS degree. Some famous coding bootcamps include App Academy, Make School, Ironhack, Flatiron School, etc.MOOCs. If you aren’t familiar with Massive Open Online Courses, they are online courses used to teach yourself a certain skill. You can learn any programming language with a bit of practice and a MOOCs. They are incredibly cheap and even some are free. You can take intro to CS on Coursera for absolutely nothing.Building projects. This method can be a really fast way to get a great understanding of programming. And the best part is you will be engaged in the whole process of learning! Say you want to make an Android app that gives users the opportunity to find a mentor in a specific field. You will want to make your idea a reality and do whatever it takes to build it as long as your committed. This gives you drive and inspire you to writing code. As you’ve seen above, there are many ways you can get into programming. But at the end of the day, it comes down to one thing. Writing code. If you are passionate about becoming a software engineer or programming for the fun of it, the only way you can become good at code is by writing code. Think about it this way, if you want to learn to swim you can’t just watch videos and read about how to become a swimmer. You must take action! Building a skill is a matter of practice. Practicing with a growth mindset will make you unstoppable. Practice. Practice. Practice. I cannot stress this enough. The people that actually become software engineers don’t become software engineers by just reading about the perks of working at Google or Facebook although it can be tempting. They practice. And when the going gets tough, they don’t give up. Why would you give up if you’re in it to win it. There is a saying that goes “when the going gets tough, the tough get going.” Learning to code isn’t easy. Why do you think software engineering jobs pay so well. It’s not a stroll in the park. You’ve got to know your stuff. If you persist and keep going when it gets hard, you’ll make. That is the difference between success and failure. So if you really want to become a programmer, keep on coding. Never give up. Never. Never. And I mean NEVER.  And if you make it past the obstacles, you’ve now got a whole new perspective of the world. Hello World :) ",
            "date": "Answered August 15, 2018",
            "views": "47",
            "upvotes": " View 298 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jasmin Alagic",
                    "user_href": "/profile/Jasmin-Alagic-2"
                },
                {
                    "user_id": "Mahmoud Saad",
                    "user_href": "/profile/Mahmoud-Saad-202"
                },
                {
                    "user_id": "Raghavendra Poosa",
                    "user_href": "/profile/Raghavendra-Poosa"
                },
                {
                    "user_id": "TEDDY PIT",
                    "user_href": "/profile/TEDDY-PIT"
                },
                {
                    "user_id": "Ultrazul Out",
                    "user_href": "/profile/Ultrazul-Out"
                },
                {
                    "user_id": "Caitlin Blumer",
                    "user_href": "/profile/Caitlin-Blumer"
                },
                {
                    "user_id": "Sam Truett",
                    "user_href": "/profile/Sam-Truett-1"
                },
                {
                    "user_id": "Brock Herion",
                    "user_href": "/profile/Brock-Herion"
                },
                {
                    "user_id": "Văn Trường",
                    "user_href": "/profile/Văn-Trường-5"
                },
                {
                    "user_id": "Santor6 .",
                    "user_href": "/profile/Santor6"
                }
            ]
        }
    ]
}