{
    "title": "What is okay to be written on the school walls? - Quora",
    "tags": [
        "School Principals",
        "Teachers",
        "The High School Experience",
        "Schools",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zel Rai",
                "href": "/profile/Zel-Rai"
            },
            "answer_text": "In the context of formally added text or other information on walls. As mentioned by Maxene Kupperman-Guiñals, inspiratinal quotes an interesting facts are always uplifting. Other things that could be done. Those old things called borders, that used to be either painted or papered just below the ceiling. One could use those to say put up the alphabet of different languages or basic words and their meanings in different languages.Student general use (with guidelines) bulletin boards and permanent notices for regularly occurring school and community events are great things too.Tasteful student made art is a must have feature of a welcoming and warm hallway. That being said turning the whole hallway into an overtly large and/or messy art collage may have the opposite effect. The goal is to show coordination, bonding, and communal ties between students and the school.These suggestions are all things I’ve seen at learning institutions I’ve attended both exceptional and lack luster. Even in the lack luster ones these things foster a much more productive environment. ",
            "date": "Answered October 29, 2020",
            "views": "143",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maxene Kupperman-Guiñals",
                "href": "/profile/Maxene-Kupperman-Guiñals"
            },
            "answer_text": "In one school where I taught, I hated the blank walls in the hallways. Kids pass them every 45–60 mins, and they might like to look at something fun. I checked with the administration, and I took a lesson from billboards and put up posters about subject matter. So every month or so, I would put up little factoids or quotes from subjects kids were studying. They liked it! Emily Dickinson wore only white and stored all her poems in a trunk. “I cannot live without books.” Thomas Jefferson Ask your math teacher about Gauss! Lewis Latimer worked to develop the light bulb. 61 degrees F.=16 degrees C.; 82 degrees F.=28 degrees C. Easy way to remember! How many months have 28 days? (All of them!) And like that… You can’t write directly on the walls, but you may be able to enhance the environment! ",
            "date": "Answered October 25, 2020",
            "views": "96",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Rowe",
                    "user_href": "/profile/David-Rowe-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Chao",
                "href": "/profile/Aaron-Chao-23"
            },
            "answer_text": "Nothing at all. It is vandalism to write anything on the school walls, because school walls are part of the public school property and not your property, thus writing on school walls is considered defacing school property. I don’t care what you write on the school walls or what you use to write on school walls, I don’t care whether what you wrote on the school wall was nice or not, I don’t care whether you wrote on the school walls in pencil or not, IT’S STILL VANDALISM!!!!! Regards, Aaron Chao ",
            "date": "Answered October 24, 2020",
            "views": "77",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Rowe",
                    "user_href": "/profile/David-Rowe-11"
                },
                {
                    "user_id": "Nev Anderson",
                    "user_href": "/profile/Nev-Anderson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susan Morrison",
                "href": "/profile/Susan-Morrison-15"
            },
            "answer_text": "Ask the person in charge of your school what is acceptable to put on the walls and get permission to post anything. This goes for adult students and employees of universities, too, although probably the department head’s permission is sufficient if the school is quite large, as most universities are. ",
            "date": "Answered October 24, 2020",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Gregg",
                "href": "/profile/Andrew-Gregg-14"
            },
            "answer_text": "Greetings, Nothing. Every school maintenance worker is stretched thin in pursuit of their duties as assigned. Any kind of graffiti constitutes vandalism, and reduces everyone’s standing in the learning community. Please consider valuing your school property with the same reverence you reserve for your own most valued possessions. Best wishes for every success. Sincerely, AJG. ",
            "date": "Answered October 25, 2020",
            "views": "54",
            "upvotes": " Answer requested by Aaron Chao",
            "upvoters": [
                {
                    "user_id": "Aaron Chao",
                    "user_href": "/profile/Aaron-Chao-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Helene Davies",
                "href": "/profile/Helene-Davies-1"
            },
            "answer_text": "You don’t say where you are living and that may matter. In the United States, it’s normally illegal to write on school walls. There may be special occasions where it’s permitted. Otherwise, to my understanding, no writing is permitted on school walls. ",
            "date": "Answered October 25, 2020",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ananay Saharan",
                "href": "/profile/Ananay-Saharan"
            },
            "answer_text": "If you want to write something on school walls so you can write the following things: a qoute about study or subjectif you want to write something else you can write anything except abusive controversial or other thing",
            "date": "Answered October 24, 2020",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Guy Granger",
                "href": "/profile/Guy-Granger-1"
            },
            "answer_text": "I dont think anything is ok to write on any walls that you dont own. If someone wants to get the word out to everyone,,I say ,,,get your own wall. ",
            "date": "Answered October 25, 2020",
            "views": "20",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Aaron Chao",
                    "user_href": "/profile/Aaron-Chao-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Meredith Anne Fraser",
                "href": "/profile/Meredith-Anne-Fraser"
            },
            "answer_text": "Nothing. It is not okay for you to write anything on the school walls. Why do you want to? ",
            "date": "Answered October 27, 2020",
            "views": "29",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ellen Dearden",
                "href": "/profile/Ellen-Dearden"
            },
            "answer_text": "Unless you're a prophet getting the word out or a custodian posting a sign indicating where the bathroom is, nothing. ",
            "date": "Answered October 25, 2020",
            "views": "12",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Andrea Utzman",
                "href": "/profile/Andrea-Utzman-1"
            },
            "answer_text": "Nothing should be permanently on school walls — public or private — which is not approved by either the principal or school district. ",
            "date": "Answered October 26, 2020",
            "views": "20",
            "upvotes": " Answer requested by Aaron Chao"
        },
        {
            "author_info": {
                "name": "Karen Wideman",
                "href": "/profile/Karen-Wideman"
            },
            "answer_text": "Writing on school walls is vandalism. Never write on school walls, or any walls, at all!!! ",
            "date": "Answered October 25, 2020",
            "views": "35",
            "upvotes": "0"
        }
    ]
}