{
    "title": "What would happen if public education was privatized? - Quora",
    "tags": [
        "Private Education",
        "Privatization of Government Services",
        "Education in the United States of America",
        "Public Education",
        "Education Reform",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Santhakumar V",
                "href": "/profile/Santhakumar-V"
            },
            "answer_text": "This answer of mine to another question is relevant here. It will reduce the access to higher education if the fees that students have to pay increaseIt will reduce the diversity of students and hence the quality of educationPrivate management may try to reduce the cost and they may not appoint enough number of qualified teachersThis may lead to a shrinkage of the liberal academic space for students. Some private managements may not like public debates on social issues.",
            "date": "Answered October 10, 2020",
            "views": "114",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Michael Lowrey",
                    "user_href": "/profile/Michael-Lowrey-7"
                },
                {
                    "user_id": "Melaku Teguegne",
                    "user_href": "/profile/Melaku-Teguegne"
                }
            ]
        },
        {
            "author_info": {
                "name": "Drew McCormick",
                "href": "/profile/Drew-McCormick"
            },
            "answer_text": "Mostly bad things. Look to the private, for-profit colleges for an example. As I have explained before, privatization is mostly a scam to skim the profitable parts of the government off and take the profits for individuals, leaving the taxpayers with higher taxes (Drew McCormick's answer to Is privatization the best and only answer to building a strong economy and functional institutions?). Also, private schools do not do any better than public schools, so there would be no change in educational quality. ",
            "date": "Answered March 9, 2019",
            "views": "167",
            "upvotes": " View 2 Upvoters "
        }
    ]
}