{
    "title": "What is veterinary medicine? Why is it important? - Quora",
    "tags": [
        "Veterinary Medicine (college major)",
        "Learning About Veterinary Medicine",
        "Veterinarians",
        "Veterinary Medicine"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sidharth Kaistha",
                "href": "/profile/Sidharth-Kaistha-1"
            },
            "answer_text": "Veterinary medicine Veterinary medicine are also considered as veterinary science, medical specialty which is generally concerned with the prevention, control, diagnosis, and treatment of diseases which effects the health of domestic and wild animals and with the prevention of transmission of animal diseases to people. Veterinarians make sure safe food supply for people by monitoring and maintaining the health of food-producing animals. Importance of Veterinary Medicine 1. Health and Welfare: Veterinary medicines are the most important tool for veterinarians, farmers and pet owners in order to make sure that animals remain healthy. They help to lower pain in animals and, therefore, support their welfare. Animals need medicines too. 2. Food Safety and Public Health: Additionally Veterinary medicines have positive impact on food safety and availability and on people’s health. They support the provision of safe animal products - milk, meat and eggs - and protect public health from harmful food-borne pathogens. 3. Competitiveness: Veterinary medicines always support veterinarians and the farming community by offering them with tools in order to keep animals healthy and make sure their welfare. Good health, in turn, has a positive impact on both the productivity and the efficiency of farming. ",
            "date": "Answered July 14, 2017",
            "views": "31",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sylver N",
                    "user_href": "/profile/Sylver-N"
                },
                {
                    "user_id": "Abdo Barakat",
                    "user_href": "/profile/Abdo-Barakat-2"
                },
                {
                    "user_id": "Bhupender",
                    "user_href": "/profile/Bhupender-32"
                },
                {
                    "user_id": "Arpit Bankhede",
                    "user_href": "/profile/Arpit-Bankhede"
                },
                {
                    "user_id": "Karthik Pvd",
                    "user_href": "/profile/Karthik-Pvd"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Euclid",
                "href": "/profile/Jim-Euclid"
            },
            "answer_text": "Veterinary medicine is to animals what doctors are to people. It is important because of the value we place on animals as: an important part of nature which has to be preservedan important food source (food animals)emotional value as pets (dogs, cats, horses, etc)Veterinary comes from the Latin word veterinae, meaning cattle. In some languages the term animal doctor is used. Veterinary Medicine relates to medicinal treatment of disease, while veterinary surgery relates to surgical treatment of disease. A veterinary clinic is any authorized place where veterinary work is conducted. A veterinary hospital is a larger clinic that is board certified and usually provides more specialized services. ",
            "date": "Answered October 29, 2015",
            "views": "12",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Nichols",
                    "user_href": "/profile/David-Nichols-45"
                },
                {
                    "user_id": "Bhupender",
                    "user_href": "/profile/Bhupender-32"
                },
                {
                    "user_id": "Marge Chandler",
                    "user_href": "/profile/Marge-Chandler-1"
                },
                {
                    "user_id": "Ashley Klein",
                    "user_href": "/profile/Ashley-Klein-2"
                },
                {
                    "user_id": "Karen Tiede",
                    "user_href": "/profile/Karen-Tiede"
                },
                {
                    "user_id": "Maya Deva Kniese",
                    "user_href": "/profile/Maya-Deva-Kniese"
                }
            ]
        }
    ]
}