{
    "title": "What is it like to have a 4.0 GPA in high school with all-AP-and-honors classes? - Quora",
    "tags": [
        "High School Grade Point Averages",
        "Grade Point Average and University Admissions",
        "Grade Point Averages",
        "College and University Admissions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew Olmedo",
                "href": "/profile/Matthew-Olmedo"
            },
            "answer_text": "I think your question needs to reworded.  \"What is it like to take all AP/honors classes in high school and get a 4.0 gpa?\" Cause the way it is worded now eludes to a high school that only offers AP and honors classes. (which i am unfamiliar of. I do not think it is even legal for a high school to only offer AP and honors classes) ~~ With that said, I didn't take ALL AP and honors classes. I took 9 classes a year for 4 years. (well 2 of them were band related. and since i was at a religious school, one of them was our religion class. So that meant that 6 classes a year were academic based) And in each given year, i had an average of 3 AP/Honors classes. And at the end of my high school career, i had a weighted gpa of 4.27. What it was like for me was pretty much what it was like for any other student. I felt pressure to get good grades. I participated in extra/co curriculars like marching band, jazz band, percussion ensemble etc.... I was unofficially in the chess club; sometimes when the band room was locked at lunchtime we went into the chess room to eat and me and my friends played amateur chess. On the weekends if i didn't have a band competition or a jazz festival, i was busy hanging out with friends, jamming in my garage writing music. At the time, i still attended church frequently and was one of the musicians in the orchestra and worship band at the church on Sundays. Over the summers i taught music camps. During the school year i helped tutor my peers in our AP classes.  And during the week when i got home, i would watch tv for hours before getting to my homework.  I don't think my high school experience was any different than many of my peers who were not an AP student. OH and in my senior year i was taking both AP Calculus and AP Statistics. Only I and this other student were taking both at the same time. Because of that, i was featured in the school's yearbook on the math department's page. So it felt good to be featured there and pretty much advertised as one of the few smartest kids in school. Once, my AP physics class had a dry ice lab. My physics teacher brought in a bucket full of dry ice. he told us that the lab was to determine what the coefficient of kinetic friction was between dry ice and the lab bench surface. there was not written procedure and instruction given. Our teacher just gave us the goal. because of this, no one actually did the lab. We all just goofed off and played with dry ice. A few of us ran to get an empty plastic soda bottle. And we made a dry ice bomb out of it.  The class ended up leaving the classroom, and tossing the dry ice bomb down the hallway. It exploded. And if you do not know, dry ice bombs are REALLY FUCKING LOUD! It interrupted a dozen or so classes in that hallway. I should also add that our physics teacher was with us the entire time and was laughing his ass off when the ice bomb went off. Teachers came out of their room freaking out. And when they saw us with our physics teacher, they gave a \"WTF\" stern kind of look at all of us.  And the only reason why we got away with it was because our physics teacher has/had a reputation of being somewhat crazy and doing unorthodox things. (like this dry ice lab that went awry).  So being smart can have its benefits: allowing ones class to be mischievous. lol OK so i am probably boring all of you so, i will just end it there. Being an AP student was challenging, fun, and fulfilling. ",
            "date": "Answered April 5, 2016",
            "views": "18",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nouzhan Vakili Dastjerd",
                    "user_href": "/profile/Nouzhan-Vakili-Dastjerd"
                },
                {
                    "user_id": "Ummi Coats",
                    "user_href": "/profile/Ummi-Coats"
                },
                {
                    "user_id": "James Zhang",
                    "user_href": "/profile/James-Zhang-164"
                },
                {
                    "user_id": "Anisha Lennin",
                    "user_href": "/profile/Anisha-Lennin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Jones",
                "href": "/profile/Mike-Jones-669"
            },
            "answer_text": "Because the AP courses were weighted, I had a 4.57 average, except for my last year when a teacher dropped my grade due to my refusal to participate in a competition.  The standard answer is that I was bored with the school work.  I also felt discriminated against because all the academic teachers gave me the hardest assignments or extra assignments, the latter I refused to do.  Due to my placement in the AP classes, I had no contact with my friends during school hours. I did have after school activities.  I practiced basketball with the team, but I refused to be on the team.  The school district would not allow the chess club to use one of their rooms whereas the other sports were given funding.  I protested that the academic enriching activity was not allowed, and the jocks were given special treatment.  (Now I understand that insurance fees would rise with every student on school grounds.  Therefore the chess club would have cost the district more in fees.) Some people like the prestige of seeming intelligent, some burn out due to the course load, and I felt like it was a prison. ",
            "date": "Answered April 5, 2016",
            "views": "773",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tarun Rajan",
                    "user_href": "/profile/Tarun-Rajan-4"
                },
                {
                    "user_id": "Nouzhan Vakili Dastjerd",
                    "user_href": "/profile/Nouzhan-Vakili-Dastjerd"
                },
                {
                    "user_id": "Shubham Sharma",
                    "user_href": "/profile/Shubham-Sharma-75"
                }
            ]
        }
    ]
}