{
    "title": "What is ServiceNow, and where can I learn it? - Quora",
    "tags": [
        "ServiceNow",
        "ServiceNow (product)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rahul Sharma",
                "href": "/profile/Rahul-Sharma-10917"
            },
            "answer_text": "ServiceNow is a software company that provides service management software as a service. ITSM-IT Service Management ITOM-IT Operations Management ITBM-IT Business Management IaaS(Infrastructure as a service) In short, IaaS gives you a server in the cloud(virtual machine) that you have complete control over.In Iaas, you are responsible for managing everything from the Operating System on up to the application you are running.PaaS(Platform as a Service) With PaaS, you have a combination of flexibility and simplicity.Flexible because it can be tailored to the application’s needs.Simple as no need of OS maintenance, versions, patches.SaaS(Software as a Service) A software distribution model in which a third-party provider hosts applications.Instead of installing and maintaining software, you simply access it via the Internet.Automatic updates reduce the burden on in-house IT staff.ServiceNow deals mostly with management services and it specifies a defined workflow.   ",
            "date": "Updated June 9, 2020",
            "views": "191",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chaitanya Kumar",
                    "user_href": "/profile/Chaitanya-Kumar-714"
                },
                {
                    "user_id": "Yamini G",
                    "user_href": "/profile/Yamini-G-39"
                },
                {
                    "user_id": "Stephen Roll",
                    "user_href": "/profile/Stephen-Roll-1"
                },
                {
                    "user_id": "SRINIVAS KUNCHAM",
                    "user_href": "/profile/SRINIVAS-KUNCHAM-4"
                },
                {
                    "user_id": "Rani Varma",
                    "user_href": "/profile/Rani-Varma-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/RAVI-KANTH-784"
                },
                {
                    "user_id": "Vidhya Kuchipudi",
                    "user_href": "/profile/Vidhya-Kuchipudi"
                },
                {
                    "user_id": "Vijay Chowdary",
                    "user_href": "/profile/Vijay-Chowdary-62"
                },
                {
                    "user_id": "Priyanka Reddy",
                    "user_href": "/profile/Priyanka-Reddy-231"
                },
                {
                    "user_id": "Mindbox Trainings",
                    "user_href": "/profile/Mindbox-Trainings-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suniti Sharma",
                "href": "/profile/Suniti-Sharma-18"
            },
            "answer_text": "ServiceNow was founded as Glidesoft, Inc. in 2003 by Fred Luddy (the previous CTO of software companies Peregrine Systems and Remedy Corporation), and later incorporated in California in 2004. Luddy had previously served as chief technology officer for Peregrine Systems, an enterprise software company based in San Diego, until Under Construction founding the company, Luddy intended to provide the same services previously available from the then defunct Peregrine Systems. For ServiceNow Implementation contact ServiceNow India. inMorphis Best in online Servicenow Training, the Best institute for service now training. For informationcontact Servicenow India.80 views 0 Upvotes Share ",
            "date": "Answered September 14, 2019",
            "views": "108",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rik Smith",
                    "user_href": "/profile/Rik-Smith-16"
                }
            ]
        }
    ]
}