{
    "title": "What are the advantages & disadvantages of spot round counselling of the JEE(Main)? - Quora",
    "tags": [
        "Pros and Cons",
        "Joint Entrance Examination Main"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harshita Kalsi",
                "href": "/profile/Harshita-Kalsi-1"
            },
            "answer_text": "I did participate in the spot round though I had got a college and good branch. I was aiming to get a better college for the lowest ranking branch. But I didnt get it. And this is what I witnessed there SPOT ROUND IS GOOD Because Last hope to get into college You can try there for another college/branch even when you get one It is very very beneficial for outside state seats, as all the outside state applicants do not reach the venue. Those who reach, are almost all of them soaked in. BUT You cannot count on it for the seat. No guarantee as seats are alloted rankwise.And no matter how confident you are ,the next point is the major heart break. The main disadvantage is that many students who could have secured a seat in even better branches ( with ranks within 20000 ) in previous rounds come out of no where to take part in the spot round and they take the seats :( And as in previous answers they said be physically present and fill some fees. Also it consumes your entire day, it is very tedious process.Like I had to be there at 9 and then I left by 4 but they continued till 5:30 and around. I hope my answer was helpful. All the best ",
            "date": "Answered February 26, 2017",
            "views": "311",
            "upvotes": " View 50 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jee Mains",
                    "user_href": "/profile/Jee-Mains-9"
                },
                {
                    "user_id": "Abhinav Dwivedi",
                    "user_href": "/profile/Abhinav-Dwivedi-87"
                },
                {
                    "user_id": "Shantanu Agwan",
                    "user_href": "/profile/Shantanu-Agwan-1"
                },
                {
                    "user_id": "Ankit Kumar",
                    "user_href": "/profile/Ankit-Kumar-7538"
                },
                {
                    "user_id": "Aviral Srivastava",
                    "user_href": "/profile/Aviral-Srivastava-72"
                },
                {
                    "user_id": "Raj Ansh",
                    "user_href": "/profile/Raj-Ansh"
                },
                {
                    "user_id": "Akshat Kumar Verma",
                    "user_href": "/profile/Akshat-Kumar-Verma"
                },
                {
                    "user_id": "Binita Malik",
                    "user_href": "/profile/Binita-Malik-1"
                },
                {
                    "user_id": "Sharan Manthalkar",
                    "user_href": "/profile/Sharan-Manthalkar"
                },
                {
                    "user_id": "Ranjit Kumar",
                    "user_href": "/profile/Ranjit-Kumar-2038"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saloni Laddha",
                "href": "/profile/Saloni-Laddha-3"
            },
            "answer_text": "Advantages This is the last hope for candidates who have not been allotted any seat in previous rounds.Every candidate ( both who is allotted a seat in any NIT, IIIT, GFTI and who hasn't been allotted) have the chance to fill their choices again if they aren't satisfied.This is the final chance for students to even change their branch or institute if they aren't satisfied.It is beneficial to government as less no. of seats are left vacant than before hence less fund wasted.Disadvantages For spot round, Candidate has to be physically present at the desired institute for physical reporting. This is quite impossible for people living far off from the institute.Now the seat allocation is not according to merit. It is like first come first serve basis. So not worth it.You can't get refund of participation fee in spot round once you pay.Getting a seat in spot round is not guaranteed and you may lose your candidature for JEE next year.Seeing the above disadvantages, CSAB came up with a special round. In this special round instead of spot round, counseling was done online according to merit of the applicants. So this became an advantage for both the government and the candidates. ",
            "date": "Answered February 25, 2017",
            "views": "471",
            "upvotes": " View 79 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abhinav Dwivedi",
                    "user_href": "/profile/Abhinav-Dwivedi-87"
                },
                {
                    "user_id": "Laavanaya Dhawan",
                    "user_href": "/profile/Laavanaya-Dhawan"
                },
                {
                    "user_id": "Ankit Kumar",
                    "user_href": "/profile/Ankit-Kumar-7538"
                },
                {
                    "user_id": "Keshav Bhatia",
                    "user_href": "/profile/Keshav-Bhatia-21"
                },
                {
                    "user_id": "Ansh Gupta",
                    "user_href": "/profile/Ansh-Gupta-34"
                },
                {
                    "user_id": "Nitin Gupta",
                    "user_href": "/profile/Nitin-Gupta-2590"
                },
                {
                    "user_id": "Aviral Srivastava",
                    "user_href": "/profile/Aviral-Srivastava-72"
                },
                {
                    "user_id": "Jyotishman Hazarika",
                    "user_href": "/profile/Jyotishman-Hazarika-5"
                },
                {
                    "user_id": "Nivedita Chatterjee",
                    "user_href": "/profile/Nivedita-Chatterjee-42"
                },
                {
                    "user_id": "Devesh Anand Srivastava",
                    "user_href": "/profile/Devesh-Anand-Srivastava"
                }
            ]
        }
    ]
}