{
    "title": "What's the worst school you've been to? - Quora",
    "tags": [
        "Experience and Life",
        "People",
        "Adulthood",
        "The Worst Thing",
        "The High School Experience",
        "Schools",
        "Teenagers and Teenage Years",
        "Children",
        "Experiences in Life",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nicôle Laghuwitz",
                "href": "/profile/Nicôle-Laghuwitz"
            },
            "answer_text": "A school for handicapped kids. Now they told me the school would be like a warm bath. They told me they would support me etc. But 2/3 of the school wasn’t even handicapped. And I’m not even kidding. Those kids were the autistic kids that didn’t fit in the autistic school and were thrown away to a handicapped school. I got nothing against autists at all, but that school was only experienced in helping autistic kids and not handicapped kids. And even that they were bad in. I was in class with all my other classmates, we were doing different courses so we mostly learned in split groups. I was in the group that was getting instructions from the teacher. Then this one kid that’s only here with autism (And I think aggression is a reason too) suddenly got pissed at nothing and took a nearby scissor to throw it and threaten classmates with it. And the teacher did nothing. She choose to ignore it with the simple reason that he’s autistic so he has a reason to do it. And that while all other classmates try to calm him down while tackling him. Being autistic at that school means you could do ANYTHING and get away with it. That same kid was screaming when we had to do a test. He didn’t study for it so he shouldn’t have to make it was his reason. And that while me the handicapped kid got nothing, no help at all. They didn’t want to give me any help as it was best to do it yourself, I did that for over sixteen years now, give me something new. The handicapped kids at that school were mostly there since they were four. They’ve been pampered and spoiled because they were handicapped. So my class was instead of being helped, being ignored to learn how to things on their own as they had enough help as a kid. Sorry but I didn’t have that and I still have to follow the process to get rid of the help I never had? And the teachers didn’t have a teacher’s license to teach. Teachers gave multiple subjects, meaning my German teacher gave me Math too. And my Dutch teacher gave me Science. They had no clue what they were talking about. One of my teachers even proudly proclaimed she never followed a single lesson of her subject while in school because she hated it. We didn’t even have enough teachers and enough classrooms. We had to fight for classrooms, if you lost you would get the smallest room there is, the room no one wants because you can’t even fit one wheelchair in, it’s smaller than the bathrooms we had. The schedules were made with mistakes. What can happen to any school of course. But they said they would change it. Sadly it meant you would have that schedule for the rest of the year. Which means having two teachers in one classroom planned or two classes for one teacher. We had roaming classes because their room was taken or their teacher was taken. I had to do lessons in the hallway with my classes. In the damn hallway. Then the school made all sorts of promises they would never fulfill. They didn’t even start it, saying yes it’s done while they haven’t told the one supposed to do it yet. After it failed they would point fingers at each other saying “BUT YOU”. Communication was impossible. And they say that they can do things they can’t. On their website it says you can follow classes from home completely. But you can’t do that because the teacher is too lazy to put the work in the website. And honestly, it’s more like a school app every school has, make chapter 1 till 5. Not something that gives you the whole lesson so you wouldn’t miss anything. I had a talk with them once. They said they would support me in anyway, even if it meant having one on one classes. So I ask if they can do one on one classes. What do you think they answered? Of course they couldn’t do that, who do I think they are? They don’t have time for that. Then why bother using that as example while you can’t do it. And this is just one example, it happened on everything they said. They would proudly proclaim three seconds ago that this was possible. When you ask for it it isn’t. This is a long answer, I’m sorry for that. But this school was so bad, not saying all this would really misinform you. Thanks for reading. ",
            "date": "Answered May 29, 2017",
            "views": "153",
            "upvotes": " View 86 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gregory Hands",
                    "user_href": "/profile/Gregory-Hands"
                },
                {
                    "user_id": "Photosh Goh",
                    "user_href": "/profile/Photosh-Goh"
                },
                {
                    "user_id": "Zach Sanner",
                    "user_href": "/profile/Zach-Sanner-1"
                },
                {
                    "user_id": "Eden Wyandon",
                    "user_href": "/profile/Eden-Wyandon"
                },
                {
                    "user_id": "Musaf Syed",
                    "user_href": "/profile/Musaf-Syed"
                },
                {
                    "user_id": "Matthew Conklin",
                    "user_href": "/profile/Matthew-Conklin-7"
                },
                {
                    "user_id": "Georg Thomas",
                    "user_href": "/profile/Georg-Thomas-2"
                },
                {
                    "user_id": "Alexa Solaris",
                    "user_href": "/profile/Alexa-Solaris"
                },
                {
                    "user_id": "Sadia Naseem",
                    "user_href": "/profile/Sadia-Naseem-2"
                },
                {
                    "user_id": "Alix Châtillon",
                    "user_href": "/profile/Alix-Châtillon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michelle Lin",
                "href": "/profile/Michelle-Lin-104"
            },
            "answer_text": "The worst school I have ever been to was a Chinese local elementary school in Taiwan. I went there for the rest of my 6th grade years. It was horrible. The students believed in stereotypical “Americans” and never knew there were such things as “Asian Americans”. How things were was that “if you looked Asian you were Asian”; it didn’t matter if you were Asian American. And by that, they would treat you as one of them, but treat “American looking” students really nicely. The teachers were nice to those American students but they yelled at the other Asian students whenever they bullied the Americans. The students lined up in order from the tallest to the shortest and students were given numbers and called by their numbers. By far, that was my worst experience in a Chinese local school. It was 5 years ago and it still stings like if it was a fresh wound. But from putting myself in their shoes, they have lived in Taiwan their whole lives not knowing that there were such races like “Asian Americans”. Still to this day, if you are an Asian American and you talk English in the streets of Taiwan, many pure Taiwanese people will stare at you like if you are an alien compared to if you were a foreigner. If you are a foreigner or look American of any kind in Taiwan, local Taiwanese people will treat you really nicely. Sometimes, I wish they could treat people of different races equally. :/ P.S: I will not name any names because I have already forgiven them. ",
            "date": "Answered May 29, 2017",
            "views": "906",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Dnfh"
                },
                {
                    "user_id": "Gerard Marszałek",
                    "user_href": "/profile/Gerard-Marszałek"
                }
            ]
        }
    ]
}