{
    "title": "What is the important chapter in class 11 chemistry? - Quora",
    "tags": [
        "Class 11th in India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mudit Jain",
                "href": "/profile/Mudit-Jain-34"
            },
            "answer_text": "Important : (for concept building) Basic Concepts of Chemistry Structure of Atom & Classification of Elements & Periodicity in Properties(for knowing what happens inside an atom) Chemical Bonding and Molecular Structure(for how atoms combine) States of Matter: Gases and Liquids(for how gases and liquids behave) Thermodynamics(if we study while going into a specific system) Equilibrium Redox Reactions(all about balancing chemical equations) Hydrogen(all about hydrogen or for the love of hydrogen) For more knowledge about the Periodic table : (all about the earth metals which are basic in nature) s-Block Elements Some p-Block Elements This is important because understanding these processes can make your 12th easy for organic. Organic Chemistry: Basic Principles & Techniques Hydrocarbons For knowing what happens around you : Environmental Chemistry(less important as compared to above one’s) -MJ ",
            "date": "Answered January 27, 2018",
            "views": "72",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Astha Singh",
                    "user_href": "/profile/Astha-Singh-569"
                },
                {
                    "user_id": "Sunita Srivastava",
                    "user_href": "/profile/Sunita-Srivastava-133"
                },
                {
                    "user_id": "Kaalees Kaaleeswaran",
                    "user_href": "/profile/Kaalees-Kaaleeswaran"
                },
                {
                    "user_id": "Shriram Arul",
                    "user_href": "/profile/Shriram-Arul"
                },
                {
                    "user_id": "Dude Uduman",
                    "user_href": "/profile/Dude-Uduman"
                },
                {
                    "user_id": "Twinkle Sahu",
                    "user_href": "/profile/Twinkle-Sahu-7"
                },
                {
                    "user_id": "Koyana Khubber",
                    "user_href": "/profile/Koyana-Khubber"
                },
                {
                    "user_id": "Khutija Naaz",
                    "user_href": "/profile/Khutija-Naaz"
                },
                {
                    "user_id": "ARCHANA KUMARI",
                    "user_href": "/profile/ARCHANA-KUMARI-663"
                },
                {
                    "user_id": "Tilak Raj",
                    "user_href": "/profile/Tilak-Raj-280"
                }
            ]
        },
        {
            "author_info": {
                "name": "Purnima",
                "href": "/profile/Purnima-74"
            },
            "answer_text": "Chemistry is a mind-blowing subject for some students because there are some difficult concepts to understand. You have to study the basic concepts of Class 11 Chemistry and then move on to important questions from each chapter. The concepts like structure of the atom, the classification of elements, molecular structure, periodicity in properties, and chemical bonding are important. There are 14 chapters in Class 11 Chemistry. Revise all the chapters to tackle exams with confidence. Chapters in Class 11 Chemistry Some Basic Concepts of ChemistryStructure of AtomClassification of Elements and Periodicity in PropertiesChemical Bonding and Molecular StructureStates of MatterThermodynamicsEquilibriumRedox EquilibriumHydrogenThe S Block ElementsThe P Block ElementsOrganic Chemistry: Some Basic Principles and TechniquesHydrocarbonsEnvironmental Chemistry",
            "date": "Answered September 28, 2019",
            "views": "2",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "ARCHANA KUMARI",
                    "user_href": "/profile/ARCHANA-KUMARI-663"
                }
            ]
        }
    ]
}