{
    "title": "What is the impact of online classes on students? - Quora",
    "tags": [
        "Online Classes",
        "Classes",
        "Impact",
        "Online",
        "E-learning",
        "Students"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vaishnavi Talloji",
                "href": "/profile/Vaishnavi-Talloji"
            },
            "answer_text": "Due to covid-19 pandemic. Educational institution continues their respective classes through technology with students. The online classes have good impact on students as well as have some side effects too. When it comes to impact. We have to know both advantages and disadvantages.online classes are more like a friendly and can also be a foe to students. Firstly, let's know about the advantages: Without any fear of pandemic,the students can continue their studies. I guess without this facility. Students would get lot of troubles because of longgap. They loses their interest and confidence too.I was so ecastatic about the classes which are so Cooperative.I think that students gets more cautious to learn from online because now a days we find students gasping knowledge and information from online.Parents who curious to know about their children's education. They will understand the capabilities of their child.Lastly, we being students have lot of time In this quarantine why not to spare exploring new things right being in resident.Disadvantages of online class: The foremost complication is not all Parents can efford computers and internet cases.Personally,I believe that students are getting quite lazy.The custom of reading books will decrease.",
            "date": "Answered July 29, 2020",
            "views": "116",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jigyasa Tripathi",
                    "user_href": "/profile/Jigyasa-Tripathi-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Avighn Theatre Group (ATG) - Gurgaon",
                "href": "/profile/Avighn-Theatre-Group-ATG-Gurgaon"
            },
            "answer_text": "Covid Pandemic and social distancing has blossomed the online learning system. We, being theatre people, have also started to work online by training interested ones. So far, we've successfully completed two online theatre workshops and ready for the 3rd one from first Monday of August, 2020 with participants from different parts of the country. ",
            "date": "Answered July 29, 2020",
            "views": "53",
            "upvotes": "0"
        }
    ]
}