{
    "title": "What skills do I need before starting hacking courses? - Quora",
    "tags": [
        "Computer Programming Skills",
        "Hackers",
        "Skills",
        "Computer Hacking (security)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barry Rountree",
                "href": "/profile/Barry-Rountree"
            },
            "answer_text": "Have the courage to use a search engine. That’s it. For example, had to put <how to become a hacker> into Google, you would have seen this: How To Become A Hacker (see also: How To Ask Questions The Smart Way). Had you used the Quora interface instead: How does one become a hacker?What skills do I need to learn to become a computer hacker?What are the best steps for me to take to learn and become a good computer programmer and hacker?How did you become a hacker?How can a person become a hacker?How do hackers learn how to hack?How do you become a hacker? What did you learn?What should you know and how/what should you learn as a hacker?How do I start becoming a hacker? What should a hacker be mastered with?How do I become a hacker and what are all the scopes? Should I be proficient in programming?How can I become a hacker? I know HTML, CSS, JS, and C.How does someone become a great hacker?How can one become a 'real hacker' (from the basics) and not a 'script kiddie'?How do I become a successful hacker?What are the main skills needed to be capable of hacking?You have a computer. You have an internet connection. Thus, you have access to an ocean of information that has been carefully indexed and curated by people who are far smarter than either one of us. You also have, here at Quora, occasional access to some of those really smart people. Don’t waste their time and yours by asking things you could have looked up yourself. ",
            "date": "Answered October 11, 2017",
            "views": "2",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kunal Ambavale",
                    "user_href": "/profile/Kunal-Ambavale"
                },
                {
                    "user_id": "Bill Boland",
                    "user_href": "/profile/Bill-Boland-2"
                },
                {
                    "user_id": "Ali Mohammad Yousuf",
                    "user_href": "/profile/Ali-Mohammad-Yousuf"
                },
                {
                    "user_id": "Johnny Zavala",
                    "user_href": "/profile/Johnny-Zavala"
                },
                {
                    "user_id": "Shivdev Kumar",
                    "user_href": "/profile/Shivdev-Kumar-2"
                },
                {
                    "user_id": "Ankit",
                    "user_href": "/profile/Ankit-296"
                },
                {
                    "user_id": "James Hazuga",
                    "user_href": "/profile/James-Hazuga"
                },
                {
                    "user_id": "Hamza Azeem",
                    "user_href": "/profile/Hamza-Azeem-13"
                },
                {
                    "user_id": "Carrie Cutler",
                    "user_href": "/profile/Carrie-Cutler"
                },
                {
                    "user_id": "Jennifer Edeburn",
                    "user_href": "/profile/Jennifer-Edeburn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pranav Banerjee",
                "href": "/profile/Pranav-Banerjee-1"
            },
            "answer_text": "You do not need to be a programming genius of sorts to be a “hacker”. Here’s what you’ll need to start with. Hacker mindset: A hacker is always looking for flaws and vulnerabilities in a system. It’s not for computer systems alone.Will To Learn: Let me tell you this right now. THIS STUFF IS FRUSTRATING. So, you need to stick with it. You will get errors in your kali platform about outdated repositories and other kinds of errors. You just need to go with it, everyone does.Now, with that being said, let’s get to the fun part. Get a basic knowledge on the following. Linux Based Operating Systems.: Don’t just jump right into Kali from the start. Kali is not a basic Linux distro. I’ll suggest install Ubuntu in a virtual machine and LEARN the commands in Linux. Get a hang of the file system and get into habit of doing stuff using your command line instead of the mouse.Googling efficiently: Learn to google your problems efficiently. Here’s an advice - Don’t search “how to hack Facebook accounts.” That is just plain stupid -.-After all of that..get into Kali Linux and try out the following “ON AN AUTHORIZED MACHINE”. 1. NMAP 2. AIRMON 3. REAVER 4. METASPLOIT ( How this can be missed? ;) ) 5. SQL INJECTION 6. SSL STRIPS After all of this, you must possess the basic knowledge of vulnerability assessment and exploitation. Once you master all of that. Learn about the following to expand your skills. Networking.Programming (Python, Ruby, C++, PHP, JAVA )Social Engineering.Cyber Forensics. Well, this is not necessary, but a hacker must know how investigation is done in the cyber world.Listen, no one is going to teach you how to hack a website. All you can learn from them are the tools. The ones I have mentioned above are only few of the many tools available for pen testing. Learn the tools and use them for good ( pfft ). Well, good luck with your journey. ",
            "date": "Answered June 22, 2018",
            "views": "12",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saadad Choudhury",
                    "user_href": "/profile/Saadad-Choudhury"
                },
                {
                    "user_id": "Ramya J",
                    "user_href": "/profile/Ramya-J-102"
                },
                {
                    "user_id": "Pranav Banerjee",
                    "user_href": "/profile/Pranav-Banerjee-5"
                },
                {
                    "user_id": "Gibraan Jafar",
                    "user_href": "/profile/Gibraan-Jafar"
                },
                {
                    "user_id": "Ravindra Waghmare",
                    "user_href": "/profile/Ravindra-Waghmare"
                },
                {
                    "user_id": "Rohit Buddabathina",
                    "user_href": "/profile/Rohit-Buddabathina"
                },
                {
                    "user_id": "Arvind Prakash",
                    "user_href": "/profile/Arvind-Prakash-12"
                },
                {
                    "user_id": "Javeed Yara",
                    "user_href": "/profile/Javeed-Yara"
                },
                {
                    "user_id": "Ayush Choubey",
                    "user_href": "/profile/Ayush-Choubey-7"
                }
            ]
        }
    ]
}