{
    "title": "What is your bed time routine? - Quora",
    "tags": [
        "Bedtime",
        "Routine",
        "Sleep Habits",
        "Sleep"
    ],
    "response": [
        {
            "author_info": {
                "name": "Victoria Elder",
                "href": "/profile/Victoria-Elder-1"
            },
            "answer_text": "What time do you go to bed and why? I am a bit of an insomniac. I go to bed when I know I’m falling asleep. I try really hard to make sure the room is ready before this. I spend in an inordinate amount of time trying to get my husband, who is snoring loudly by this point, to turn off his light and his computer… and remind him that if he would do this before he goes to sleep, I wouldn’t be waking him up. If I’m already up and walking around for some reason, I’ll do it myself, but if we’re having the same fight every night with me repeatedly waking him up for the same thing, you would think he would get the hint. I already know that if I wait until I’m ready to go to bed to get him to do this, the fight I have to go through is going to have me awake and frustrated just as I was going to sleep, so I try to make him do it before he goes to sleep, which is incredibly irritating and difficult because he insists he isn’t falling asleep and that he wasn’t just snoring (and I heard it through my headphones it was so loud). ",
            "date": "Answered September 30, 2019",
            "views": "892",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Currey",
                "href": "/profile/David-Currey"
            },
            "answer_text": "If clock time is considered to run from one midnight to the next midnight, then the average time I get in bed is at noon. That’s because I have no set time. Being retired, I go to bed when I’m tired, and not because of any society conventions. I generally sleep about 8 to 9 hours. If I have a nap during the “day”, I may sleep less at “night”. It’s a bit of a hassle sometimes when I have a set time during the day I have to meet somebody for lunch or attend a club meeting or play in disc golf league, but it beats the hell out of lying in bed trying to go to sleep when I’m not sleepy. Last night I got in bed about 8:00 pm. I awoke about 12:30 am, so I guess that would be a nap. I had no supper before hitting the sack, so I’m hungry right now. I’ll eat something shortly, and that should make me a little sleepy, so maybe around 5:00 am I’ll get in bed for another nap and wake up around 10:00 am, but who knows. I’ve actually toyed with the idea of going to a 28-hour day (which would be six days a week, with two days approximately matching two from the seven-day week), which seems like it would fit my preferred length of time being awake better than a 24-hour clock, but that would still mean trying to force myself to a set time frame for sleep, which I’ve discovered does not work for me. ",
            "date": "Answered January 7, 2018",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Barbara Holladay-Vernon",
                    "user_href": "/profile/Barbara-Holladay-Vernon"
                }
            ]
        }
    ]
}