{
    "title": "What are your experiences with online tutoring on Vedantu? - Quora",
    "tags": [
        "Vedantu",
        "Online Tutoring",
        "Tutoring",
        "E-learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anand Gautam",
                "href": "/profile/Anand-Gautam-3"
            },
            "answer_text": "Disclaimer: I am working full time with Vedantu for last 10 months, but have been associated with Vedantu as a teacher for almost two years now. I will only limit my answer to my experiences as a teacher. My experience teaching on Vedantu has been, in one word, “Awesome”. I started teaching while I was working at Flipkart, had very limited time. But teaching was a bit of passion for me and really wanted to do it. Vedantu turned out to be a wonderful platform providing me complete flexibility and control over my schedule. Given the limited time I had, I was primarily teaching only one kid about 1–2 hours every week. The kind of bond we developed, even in an online setup, was simply amazing. This kid was very naughty and his dad tells me that he simply doesn’t study with any other teacher. What is beautiful about the personalized learning at Vedantu is that I was able to understand the kid and teach him in his own way. So all our sessions would as a rule start with a game for the first five minutes. First it was tic-tac-toe, and in just 4–5 sessions, all our games where a draw as he picked up the game. We even managed to play a lame version of football on Vedantu’s awesome whiteboard (both of us love football). He also made me compete with him in solving Rubic’s cube online with the video on. I did beat him everytime, but he got better and better. When the first 5 minutes of every session used to be so much fun for him, it was very easy for me to make him concentrate on what I taught for the next 55 minutes. Also, he somehow started to look up to me or maybe had a special bond, so I could control is naughty behaviour in between the session. I could even scold him (mildly) and he would listen to me :) All this was only possible because of Vedantu. I would never have been teaching if it weren’t possible from the comfort of my home. The kid would probably have never interacted with me outside of Vedantu. And given the one on one attention, I was really able to connect with the kid and make a difference in his learning. I got a great kick out of it, immensely satisfying. Some of the other advantages which I realized teaching on Vedantu: Flexibility to study/teach when you want and where you wantConvenience to study/teach from the comfort of homeFor students, accessibility to best teachers across the countryAbility to use amazing teaching tools - pics, gifs, videos, etc.Automated session notes printed at the end of every sessionRecordings of every session available for review laterVedantu ensures that teachers keep becoming better at teaching by constant review, guidance and peer benchmarkingAnd now as I am part of Vedantu, my conviction towards the idea has increased many times over. We are trying to change the world of eduation, one small step at a time. ",
            "date": "Updated March 3, 2017",
            "views": "552",
            "upvotes": " View 95 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vamsi Krishna",
                    "user_href": "/profile/Vamsi-Krishna-4"
                },
                {
                    "user_id": "Garima Tamrakar",
                    "user_href": "/profile/Garima-Tamrakar-1"
                },
                {
                    "user_id": "Dinesh Thakur",
                    "user_href": "/profile/Dinesh-Thakur-20"
                },
                {
                    "user_id": "Debashrita Panda",
                    "user_href": "/profile/Debashrita-Panda"
                },
                {
                    "user_id": "Harshita Tiwari",
                    "user_href": "/profile/Harshita-Tiwari-123"
                },
                {
                    "user_id": "Anshika Agnihotri",
                    "user_href": "/profile/Anshika-Agnihotri-5"
                },
                {
                    "user_id": "Adarsh Goswami",
                    "user_href": "/profile/Adarsh-Goswami-2"
                },
                {
                    "user_id": "Rishi Kashyap",
                    "user_href": "/profile/Rishi-Kashyap-107"
                },
                {
                    "user_id": "Deepankar Thakur",
                    "user_href": "/profile/Deepankar-Thakur-2"
                },
                {
                    "user_id": "Pavani Mankonda",
                    "user_href": "/profile/Pavani-Mankonda"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanket Tiwari",
                "href": "/profile/Sanket-Tiwari-45"
            },
            "answer_text": "Well I am studying in NIT Allahabad I haven't joined Vedantu for teaching as well as not used it in my preparation days. I have heard about it when I I joined college too late to join as student. (Preparation for Jee) I have seen Vedantu teachers on YouTube teaching various topics & I can only say that it's normal nothing new, one more thing on YouTube it's tough for a student to study with focus and they know this very well. So there main focus is not teaching (same with other channels on YouTube they just tell you little things and try to make you there customer. (Nothing new everyone know this already) In starting itself they will tell you that they have this and this courses. Instead of buying them I would prefer some self study or if I need a teacher then I ll go with the best available, most of you don't know that who is the best in teaching including me - when I was preparing I also don't know much about online materials and some amazing stuff out there by which you can enhance your preparation. In my college I got to know from my seniors about this online coaching platform Ahaguru & the best thing about Ahaguru is that founder himself is rank 4 in IIT JEE Dr. Balaji Sampath you can search on google as well. So, it's really amazing to study from toppers + best faculty & they are only focused on teaching and guiding not on YouTube views and likes.  There students doing wonders in examination as well. So, obviously outcome will be best when you get mentored by best. Now days you will see alot TV advertisement regarding 7year old kid make an app and getting investors - it's funny na : ) but one can really get into desired college with best possible branch if he/she start there preparation from class 7th . Just try to develop intrest in subjects while studying means indirectly you are getting ready for your Jee preparation. That's why Ahaguru also offering courses from class 7th itself - means you will introduced to your teachers from class 7th itself so if will be amazing or so easy to understand a topic when you start your preparation for Jee or other competitive examination. This much I know when it comes to online coaching and I always tell this to everyone because I have faced problems while my preparations and I don't want others to miss such amazing opportunity to be taught by amazing teachers. Regards: Sanket Tiwari | NIT Allahabad ",
            "date": "Answered October 28, 2020",
            "views": "13",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sachin Roy Sky",
                    "user_href": "/profile/Sachin-Roy-Sky"
                },
                {
                    "user_id": "Nanda Krishna",
                    "user_href": "/profile/Nanda-Krishna-52"
                },
                {
                    "user_id": "Unknowunknow Unknow Unknow Unknow U",
                    "user_href": "/profile/Unknowunknow-Unknow-Unknow-Unknow-U"
                },
                {
                    "user_id": "Abhash Anand",
                    "user_href": "/profile/Abhash-Anand-6"
                },
                {
                    "user_id": "Akshat Sagar",
                    "user_href": "/profile/Akshat-Sagar-1"
                },
                {
                    "user_id": "Ananya Venkateswaran",
                    "user_href": "/profile/Ananya-Venkateswaran"
                },
                {
                    "user_id": "Joel Steeve",
                    "user_href": "/profile/Joel-Steeve"
                }
            ]
        }
    ]
}