{
    "title": "What is the IB board like? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Tumul Kumar",
                "href": "/profile/Tumul-Kumar-2"
            },
            "answer_text": "International baccalaureate(IB) is one of the hardest high school “boards” currently available. It's not only rigorous and (college level)difficult, but also requires constant dedication and good time-management from the students. There are 2 choices with IB: IB Diploma or IB Certificate. IB Certificate is the “easier” out of the two as it only requires to study the courses that you like and not do any of the “extra things”. While IB Diploma is the more comprehensive and rigorous out of the two. It requires you to take 6 core classes, 3 or 4 at Higher Level and others at standard. Along with that a compulsory TOK(Theory of knowledge or Epistemology) class, CAS activies (sports, service clubs and creative clubs) and Extended essay(a 4000 word independent research paper). For every single subject in IB, you not only need to take the final IB exams and internal projects, but do an independent IA(Internal assessment) i.e. a research paper written in about 1500–2000 words on a topic inside that subject area. Due to all this factors, the IB workload is not only insane, but consistent i.e. you don’t slack off here and work extremely hard there but rather keep up the good job. IB is famed across the world for it’s rigorous Diploma program, which prepares you well for any college experience. It’s a board that is recognised and used for admission criteria in over a 100 countries. Hence, I conclude that IB board, although difficult and demanding, gives an overall holistic education experience which also boosts your chances of getting into any university. Best of Luck for your upcoming high school experience! ",
            "date": "Answered August 21, 2017",
            "views": "1097",
            "upvotes": " View 168 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nathan Iel",
                    "user_href": "/profile/Nathan-Iel-2"
                },
                {
                    "user_id": "Jagoda Wyczolkowska",
                    "user_href": "/profile/Jagoda-Wyczolkowska"
                },
                {
                    "user_id": "Emily Leung Chung Tseung",
                    "user_href": "/profile/Emily-Leung-Chung-Tseung"
                },
                {
                    "user_id": "Amritha Rameshkanna",
                    "user_href": "/profile/Amritha-Rameshkanna"
                },
                {
                    "user_id": "Farah Elgaweesh",
                    "user_href": "/profile/Farah-Elgaweesh"
                },
                {
                    "user_id": "Motty Potter",
                    "user_href": "/profile/Motty-Potter"
                },
                {
                    "user_id": "Mamta Dassani",
                    "user_href": "/profile/Mamta-Dassani-1"
                },
                {
                    "user_id": "Eric He",
                    "user_href": "/profile/Eric-He-42"
                },
                {
                    "user_id": "Sagnik Sarkar",
                    "user_href": "/profile/Sagnik-Sarkar-104"
                },
                {
                    "user_id": "Garima Ojha",
                    "user_href": "/profile/Garima-Ojha-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hamzah Jameel",
                "href": "/profile/Hamzah-Jameel-1"
            },
            "answer_text": "The IB “board” so to speak is one of the most academically challenging of them all. It is not for everybody and some students might be better off doing A-Levels. This is because consistency is god in IB. A slight summary on the IB is that you have to do 6 subjects (3 HL and 3 SL). Importantly, here, is that the 6 subjects have to be from different groups. That is, you have to have Maths, a first language, a second language a science, a humanity and an art. You could substitute the arts for another humanity or another science. Thus, the IB focuses on both breadth and depth. In addition, you need to complete your research essay, 50 hours of creativity, 50 for action and 50 for service. Plus, you need to finish a Theory of Knowledge (TOK) course. There are 45 points to achieve. 3 for the ‘core’ topics (the essay, TOK and Creativity, Action and Service). For each subject, you get at max. 7 points. All in all, IB is an all-rounder subject. It is consistently challenging, but not undo-able. It is for those who can handle juggling all six subjects plus so much other additional “stuff”. I am not going to suggest that it is easy, but it’s not as insane as others deem it to be. The secret to success in IB is therefore not your knowledge or academics. Instead, it is consistency. It’s like life - those who succeed are those who try their hardest, all the time. If you want to do IB, then make sure you enjoy all different types of subjects, can make links between them, can handle a consistently demanding timetable and have great time management skills. One thing for sure, however, while IB is not for everyone, it’s a great preparation for University - which is, to say the least, much more demanding. ",
            "date": "Answered August 24, 2017",
            "views": "14",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aditya Gandhi",
                    "user_href": "/profile/Aditya-Gandhi-109"
                },
                {
                    "user_id": "Karan Kapoor",
                    "user_href": "/profile/Karan-Kapoor-409"
                },
                {
                    "user_id": "Deepika Lingareddy",
                    "user_href": "/profile/Deepika-Lingareddy"
                }
            ]
        }
    ]
}