{
    "title": "What are the pros and cons of different SAT prep options? - Quora",
    "tags": [
        "Kaplan Test Prep",
        "Magoosh",
        "Pros and Cons",
        "Standardized Tests",
        "SAT (Scholastic Assessment Test)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Linda Baer Williams",
                "href": "/profile/Linda-Baer-Williams"
            },
            "answer_text": "Good for the middle of the pack. If you are just starting your prep or are trying to move a score from the low range to the middle range, an in-person group course will help you accomplish this. If you have an already strong score (90th percentile and above) a group course is not going to get you the refinement you need to improve upon that score.Same as in-person group course, except has the convenience of not having to travel to a class, not having to deal with potentially disruptive classmates, and potentially having a much better instructor than you might find locally. If the choice is between 1 and 2, choose 2 because you can usually go back and review the session online which is extremely useful.Excellent choice if in fact the tutor is excellent and not just a tutor who happens to live near you. Potentially expensive but money well-spent for the right tutor.Excellent choice if you like the convenience of meeting from your computer. Also great for ease of scheduling because you can whip out your laptop and meet for an hour between, say, school and practice, or perhaps at 9 at night when a tutor is not likely to want to come to your house to tutor you. Private Tutoring, Test Prep & Math Tutoring | Revolution Prep is my favorite for really phenomenal tutors and instruction. Potentially expensive but again money well-spent. Between 3 and 4, I would choose 4.Excellent choice for a small sub-set of students: self-driven, who will actually put in the time and watch and learn and take practice tests and use that information to drill down into areas that need to be improved upon, without having someone else holding them accountable and using their experience to help guide the instruction in the right direction.Only you can decide which combination of convenience, personalization, and expense is right for your situation. No matter which way you go, it is absolutely essential that you start by taking a full-length practice test and that you continue to take practice tests as you progress. It’s the best way to target and direct your prep. ",
            "date": "Answered July 1, 2016",
            "views": "820",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zoë Martin",
                "href": "/profile/Zoë-Martin-1"
            },
            "answer_text": "I have taken and taught online test-prep classes, and I highly recommend doing one in-person if possible. It’s convenient to skype from home, but the possibility of internet problems and the extra complications that come from not being able to interact face-to-face or see each other’s work real-time in high-definition definitely outweigh those benefits for me. Whether you choose private tutoring or a bigger class depends on what type of a learner you are, and how much money you are able to spend. Private tutoring is more expensive, but many students enjoy the one-on-one attention they get; the class can be organized entirely around your needs. Some students work better with other students, enjoy sharing ideas with peers, and like hearing other students ask questions. These students would obviously do better in a larger classroom environment. There are many benefits of working with an actual teacher (as opposed to self-study), but the main two are: It’s the teacher’s job to know about the SAT, and teach the important stuff to you (whereas it’s easier for you to miss stuff)A teacher usually provides motivation to keep to a certain study schedule, so you don’t get distracted or unmotivated.",
            "date": "Answered July 2, 2016",
            "views": "648",
            "upvotes": "0"
        }
    ]
}