{
    "title": "What are the different levels of Freemasonry? What do they represent? - Quora",
    "tags": [
        "Freemasonry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel M. Tomlinson",
                "href": "/profile/Daniel-M-Tomlinson"
            },
            "answer_text": "In traditional Freemasonry there are only three levels that we rather call degrees. These are traditionally conferred on candidates based on merit and ability. Craft Degrees The first, called the Entered Apprentice degree is deemed to symbolise that of birth, as a new man and a Mason. It forces you to deal with the world starting a new in some aspects. To learn, and work towards bettering yourself. The second, that called the Fellow Craft degree is deemed to represent man in his middle age. It tasks him to continue learning and refining himself as a man and a Mason. To study such things as considered the liberal arts and sciences to further smooth himself and become an upstanding and refined member of society. The third, called the Master Mason degree is deemed to represent old age. It is sombre and helps a man make piece with the inevitable, death, the grand leveller. It is the final piece of the puzzle as a man that lives in fear of death cannot live to the fullest. It thus brings a well rounded individual to the precipice of his being and asks him to look back on his life, evaluate choices and leaves him to move forward a wiser man for the experience. In some parts of the world, you can now have these three degrees conferred in a one day session. Although it cheapens the experience a bit, it is considered to be as valid as that of a Mason that worked a year or two to become a Master Mason, which is common elsewhere in the world. Furthering Your Masonic Knowledge There are many other side orders, and dependent bodies that confer their own degrees. Just as Craft Lodges do. These we see as optional and do not increase the standing of a Mason within the Craft Lodges. They, just like the Craft Degrees similarly teach their own lessons. One of these (one of the most famous) being the Scottish Rite. It is the York Rite’s equivalent the A&AR. Both being quite similar as they confer the conspiracy theory favourite, and much referred to, 33 degree. This many in the Southern Jurisdiction in America would argue is the pinnacle of their view of Freemasonry. Truth is that as with American Craft Masonry, you can become a 32 degree in just two weekend sessions, again in contrast to other places in the world were it takes up to 7 years to progress to the next, and that is only if there is space for you. ",
            "date": "Updated December 7, 2016",
            "views": "105",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Oleg Whimp",
                    "user_href": "/profile/Oleg-Whimp"
                },
                {
                    "user_id": "Mike Canavan",
                    "user_href": "/profile/Mike-Canavan-1"
                },
                {
                    "user_id": "Robert Walker-Smith",
                    "user_href": "/profile/Robert-Walker-Smith-1"
                },
                {
                    "user_id": "Solomon Stringer",
                    "user_href": "/profile/Solomon-Stringer-1"
                },
                {
                    "user_id": "Rinesh Hegde",
                    "user_href": "/profile/Rinesh-Hegde"
                },
                {
                    "user_id": "Rhushida Kashalkar",
                    "user_href": "/profile/Rhushida-Kashalkar"
                },
                {
                    "user_id": "Dwayne Mack",
                    "user_href": "/profile/Dwayne-Mack"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Hartjen",
                "href": "/profile/Gary-Hartjen"
            },
            "answer_text": "There are three degrees of Freemasonry: Entered Apprentice, Fellowcraft and Master Mason. An Entered Apprentice is at the beginning of his Masonic career. His role is that of being a student of the Craft, of learning symbology, traditions and protocols, and serving his Lodge. It is the beginning of the “internal work” that each man should undertake. In ancient times, Entered Apprentices were basic laborers learning the basics of being a stone Mason. A Fellowcraft Mason is a man who has learned and is proficient in the basics. His role in the Lodge can assume more responsibility. He is working on himself to become a better man. In terms of being a stone mason , he is a Journeyman. In the 18th and 19th Centuries, that may have been as far as he went in Masonry. The “Sublime Degree of Master Mason” represents the pinnacle of Masonic degrees. A Master Mason is a full voting member of his Lodge, subject to its Bylaws and entitled to all the rights and privileges thereof. He is eligible to be one of the officers of the Lodge and may one day be the Master of his Lodge. In terms of stone masonry, he is in a supervisory position and can design the work. This is not to say that this is the end of his Masonjc journey or education, though. The Scottish Rite offers degrees 4–32, culminating in a degree called Master of the Divine Secret — plus an honorary 33°. This Rite is in the French/Scottish tradition. The York Rite offers a similar path onwards in the English tradition, culminating in the conferral of the Degree of Knight Templar. These two systems provide greater depth of Masonic knowledge, but are not considered to be higher degrees than the Master Mason degree. I hope this is helpful. ",
            "date": "Answered November 30, 2016",
            "views": "122",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Oleg Whimp",
                    "user_href": "/profile/Oleg-Whimp"
                },
                {
                    "user_id": "Karl Venter",
                    "user_href": "/profile/Karl-Venter-3"
                },
                {
                    "user_id": "Mike Canavan",
                    "user_href": "/profile/Mike-Canavan-1"
                },
                {
                    "user_id": "Chris Freeman",
                    "user_href": "/profile/Chris-Freeman-175"
                },
                {
                    "user_id": "Leonardo Bonaducci",
                    "user_href": "/profile/Leonardo-Bonaducci"
                },
                {
                    "user_id": "Laurette Looney",
                    "user_href": "/profile/Laurette-Looney"
                },
                {
                    "user_id": "Malsawmkima Chhiarchuang",
                    "user_href": "/profile/Malsawmkima-Chhiarchuang"
                },
                {
                    "user_id": "Tony Hampton",
                    "user_href": "/profile/Tony-Hampton-12"
                },
                {
                    "user_id": "Scott Schwartzberg",
                    "user_href": "/profile/Scott-Schwartzberg-1"
                },
                {
                    "user_id": "Steve Smith",
                    "user_href": "/profile/Steve-Smith-903"
                }
            ]
        }
    ]
}