{
    "title": "What is applied anthropology? - Quora",
    "tags": [
        "Anthropology (college major)",
        "Learning About Anthropology",
        "Cultural Anthropology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Angela Rockett Kirwin",
                "href": "/profile/Angela-Rockett-Kirwin"
            },
            "answer_text": "Applied anthropology is when you apply your degree in anthropology to work in a  job that is not in academia. Applied anthropologists are paid to use their education and research skills to figure out the cause of a problem and give a recommendation on how to solve it to their client or employer. Examples of applied anthropology positions (for cultural anthropology) would be the following: user experience research for designing apps and web sites (done that), international development to improve educational, health, housing, or economic outcomes for people harmed by wars, natural disasters, or who members of socially marginalized communities (done that), or working as a public archaeologist at an excavation site to ensure the land owner's compliance with indigenous cultural resource or historical site protection laws (done that too) and to make sure local Native American artifacts or sacred sites are respected, protected and if artifacts repatriated. Since most anthropologists seem to get their primary employment at a college or university, they are usually just called \"anthropologists\"  or \"archaeologists\". These academic or research anthropologists teach  courses, and if they are at a research university, also work to get grants funded, support their grad students (well, they are supposed too...), do scientific research, and publish reports on their research.  ",
            "date": "Answered April 12, 2016",
            "views": "52",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mae Corpuz",
                    "user_href": "/profile/Mae-Corpuz-4"
                },
                {
                    "user_id": "Jai Jeon",
                    "user_href": "/profile/Jai-Jeon-2"
                },
                {
                    "user_id": "Alison Read",
                    "user_href": "/profile/Alison-Read-4"
                },
                {
                    "user_id": "Doreen",
                    "user_href": "/profile/Doreen-90"
                },
                {
                    "user_id": "Ram Parmaksiz",
                    "user_href": "/profile/Ram-Parmaksiz"
                },
                {
                    "user_id": "Jay Cee",
                    "user_href": "/profile/Jay-Cee-170"
                }
            ]
        },
        {
            "author_info": {
                "name": "Subhash Jha",
                "href": "/profile/Subhash-Jha-31"
            },
            "answer_text": "Applied anthropology is simply \"anthropology put to use\" (to quote John Van Willigen). It is any kind of anthropological research that is done to solve practical problems. This means that there are stakeholders and clients who stand to gain or lose from the project. Anthropology can be used to solve problems in an enormous variety of fields. Here are some common examples: Health and medicineBusinessHuman rightsEducationEnvironmental issuesCommunity developmentMuseumsDisaster research & managementInternational developmentApplied anthropologists can take on very different roles in their work. They may be one or more of the following: ResearchersPolicy analystsProgram evaluatorsNeeds assessorsImpact assessorsCommunity advocatesTrainersCulture brokersManagersChange agentsConsultants",
            "date": "Answered July 15, 2018",
            "views": "23",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jai Jeon",
                    "user_href": "/profile/Jai-Jeon-2"
                },
                {
                    "user_id": "Ram Parmaksiz",
                    "user_href": "/profile/Ram-Parmaksiz"
                }
            ]
        }
    ]
}