{
    "title": "What's a good age to give your kids a phone? - Quora",
    "tags": [
        "Age",
        "Children",
        "Parenting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ronda Stuart",
                "href": "/profile/Ronda-Stuart"
            },
            "answer_text": "There isn’t a single “right age.” It depends on if your child needs one or not. As an elementary school teacher, it drove me nuts to see kids with phones, especially if mom was picking them up and dropping them off. If they’re walking home alone and it’s used as a safety measure, then yes it’s fine. If not, then no. Kids need to learn to play outside, be creative, and have fun without being attached to a screen all the time. My son got a very basic cell phone in 7th grade, due to the fact that he had to walk home and be home alone for the first time and I was a nervous mommy! He’d always been in the same schools I taught in, but transferring to middle school was hard for us all! One of the biggest questions is always, When Should Your Child Get a Cellphone? By looking at the pros/cons/needs you can determine the right time! Pros Many cell phones allow access to the Internet, which can help a child obtain answers to questions very quickly and easily. This can help with studies as well as other simple daily questions like daily weather or finding directions to go someplace new.Some cell phones have tracking devices in which a parent or guardian can track where their child is to ensure that they are safe and where they are supposed to be at any moment.Cell phones allow parents and children to stay in touch. If a child needs to stay after school and needs a ride, they are able to call their parents and let them know by simply using their cell phone. This is especially important because pay phones are become more and more rare. Cell phones can be important in emergency situations as well when a parent needs to quickly get in touch with their child or vice versa.Cell phones can help teach children responsibility. Parents can set guidelines for their children such as staying within a certain minute or text message range. Children are also responsible for their individual cell phone and parents can set rules about misplacing it or breaking it.Cell phones can be a learning tool for children as they can learn a new form of technology as well as explore the Internet if the phone has the capability to do so.Parents can set guidelines for their children on when they are able to use their cell phones. This can help teach them discipline, time management, and also allow them to learn to enjoy their time without using their cell phone.Older children who can drive will be able to have a phone on hand in case they face any type of emergency situation on the road.Cons Cheating with cell phones has become a huge issue in many schools. Students can text answers under their desks during tests. Since many phones are now Internet compatible, children can sometimes even use a search engine on their phone to find answers to test questions. If the child is caught cheating they can face serious consequences from the school.Cell phones are not cheap. If a child goes over the limitations on a plan, the cost can increase rapidly. Prepaid phones can limit overall payments, but the cost per minute may end up being more expensive depending on amount of usage.Cell phones can be very distracting from more important events in a child’s life such as studying, doing homework, or even crossing the street. Studies have shown that children are more likely to be hit by a car if they are talking or texting on a cell phone while crossing the street. Since cell phones can connect children to their friends and the Internet, they can take away from study or homework time.Older children who can drive may be tempted to call or text while driving which can severely increase their risk of a car accident.Sexting, sending sexual messages or pictures to another person’s cell phone, is also an issue for parents to consider before purchasing a cell phone for their child. If a child does not have any blocked numbers on their device they can receive message which may include sexual explicit messages from anyone who has their number and chooses to send them the message or picture.Children can also receive calls from anyone who has their number unless there are specific blocks on their phone. Parents have no way of knowing who is saying what to their child.Hope this helps! ",
            "date": "Answered July 18, 2017",
            "views": "52",
            "upvotes": " View 28 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ethan White",
                    "user_href": "/profile/Ethan-White-237"
                },
                {
                    "user_id": "Angel Duncan-Robinson",
                    "user_href": "/profile/Angel-Duncan-Robinson"
                },
                {
                    "user_id": "Nodnarb Kropenski",
                    "user_href": "/profile/Nodnarb-Kropenski"
                },
                {
                    "user_id": "Kat Sane",
                    "user_href": "/profile/Kat-Sane"
                },
                {
                    "user_id": "Aiden Mathew",
                    "user_href": "/profile/Aiden-Mathew-8"
                },
                {
                    "user_id": "Caleb Abreu",
                    "user_href": "/profile/Caleb-Abreu-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Clea-Whisper"
                },
                {
                    "user_id": "Troler Noob",
                    "user_href": "/profile/Troler-Noob"
                },
                {
                    "user_id": "Jeff Moses",
                    "user_href": "/profile/Jeff-Moses-14"
                },
                {
                    "user_id": "Matthias Lyan",
                    "user_href": "/profile/Matthias-Lyan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carol Miller",
                "href": "/profile/Carol-Miller-75"
            },
            "answer_text": "I would never give a toddler or a young child a mobile phone. The data on this is pretty conclusive that the risk outweigh the benefits. Consider this……Imagine it’s 2035 and you get a call from your son who proceeds to inform you that, at the young age of 32, he’s going blind as a result of macular degeneration. Your immediate thought is how is this possible? Macular degeneration is a disease of the old. It is not a disease for young, vibrant people in the midst of their careers, just starting a family, and buying and furnishing their first home. This cannot be possible… Your son explains that all of the years playing with your iPhone in a restaurant and playing “educational” games on the tablet you bought him when he was 3, have damaged his eyes. Blue light emitted from these devices was the cause. If you had known this at the time, his eye damage could have been avoided with a simple blue light filter for a nominal fee of less than $10. He tells you that he doesn’t blame you because the industry knew and ignored the risk. You think back to all of the times you handed him your iPhone, or your spouse’s Android, to keep him occupied at dinner with the relatives, at ball games, and while shopping. You remember the number of times you opened an app for him or a video on Amazon Fire and Amazon Kids. You recall the time, you and his mother, bought him his own tablet to keep him entertained and how you bought the kids a tablet or iPad so they would leave yours alone. No one ever told you that his iPad tablet or the Android device, you had lying around the family room, would hurt your son. You ask yourself, how did this happen? You feel guilty and full of remorse. You are a good parent. You were very contentious of everything your son did and what he ate. You made sure he studied, was involved in extracurricular activities and every opportunity was available to him. The Connected Consumer  Today’s youth may be known as the “App Generation” or the “Connected Consumer.” They were born during the growth of apps and tablet technology and grew up with devices at their fingertips. According to a Nielsen Study, more than 70 percent of children under 12 use tablets and iPads. A recent Journal of Pediatrics study showed that: 20% of 1-year-olds own a tablet.28% of 2-year-olds could navigate a mobile device without assistance.28% of parents said they use a mobile device to put their kids to sleep.The use of tablets and smartphones among young children has simply become child’s play, with kids able to skillfully tap and swipe before they can walk or talk. Other studies have shown that that nearly half of U.S. consumers couldn’t last a day without their mobile devices. This makes sense because, for many of us, the first thing that we do in the morning is catch up on email before we even get out of bed; our kids are no different. Kids model parents behavior… Then, you head straight to your computer at work and spend a majority of the day on it or using one of the many other digital devices, iPads, mobile phones and tablets that are available in today’s increasing technological driven society. What if you were told that these electronics were negatively impacting your overall health and vision by emitting a dangerous blue light? This is a factual statement and is a primary concern for eye doctors across the country. The NIH has been studying the impact of blue light on human eyes since the early 2000’s. Continual extended screen time can impact your eyes in two significant ways. The first and most common side effect is digital eyestrain.When we look at a screen, our blink rate drops significantly, and our eyes won’t put up with that for too long without fuss. Have you ever experienced slightly blurry vision after staring at the computer all day? This is a sign of digital eyestrain. Do your eyes feel dry, runny or tired after scrolling through your Facebook or Instagram feed, or maybe you get a headache after a few hours on the computer? These symptoms are often so common that we don’t even recognize them as real issues. Digital eyestrain is temporary. However, if left unaddressed, it can turn into a chronic problem. The easiest way to address digital eyestrain is to blink more. This might sound simplistic, but blinking helps to keep eyes lubricated. Another effective way to avoid or help to resolve digital eyestrain is to follow the “20-20-20 Rule” — every 20 minutes, staring at something at least 20 feet away for at least 20 seconds. This exercise engages your distance vision and helps the eye to “reset” and rest. The more severe impact that too much technology consumption can have on our eyes is damage from blue light exposure. Blue light is just what it sounds like — it’s a type of light that gives off a blue color. Blue light is harmful because it’s the highest energy wavelength of visible light. This energy is also able to penetrate all the way to the back of the eye, through the eyes’ natural filters, and that’s the issue. Long-term exposure causes damage to the retina. Dr. François Delori, of the Schepens Eye Research Institute of Mass. Eye and Ear, has been studying the effect of blue light on retinas and the resulting damage. Blue light is nothing new. The issue is the amount of blue light exposure that we get each day through digital device use. With this exposure increasing over time, we are causing permanent damage to our eyes. The effects of blue light are cumulative and can lead to eye diseases like macular degeneration. Children are especially at risk when it comes to the harmful effects of blue light exposure. These days, a lot of homework is done online, and many children own or have access to digital devices, e.g. tablets, Android devices, iPads, iPhones, Amazon Fire and Kindles that they are using for longer periods of time each day. Tablet light and toddler’s eyes Evidence shows intense blue light causes damage to the back of the eye and the retina. Exposure in children could lead to early onset macular degeneration, the leading cause of blindness for those over 50, and to earlier incidences of cataracts. Intense blue light causes damage to the back of the eye, the retina and exposure in children could lead to early onset macular degeneration, the leading cause of blindness for those over 50, and to earlier incidences of cataracts While we know that blue-light from tablets and smartphones can have long-term effects on our vision, it’s still too soon to tell the extent of the damage. However, there are a few widely accepted tips that will help keep your kids’ eyes healthy until more information is available. The risk is less for adult eyes that have a natural defense; as we age, the lens starts to yellow, which then acts to block out some of the blue light. The difference for children is that their eyes are still developing and they don’t yet have the protective pigments in their eyes to help filter out some of this harmful blue light. As children’s eyes are still developing, blue light can penetrate much more efficiently and directly into the retina. Blue wavelengths are crucial during daylight because they boost our attention, reaction and mood but are disastrous at night as they interfere with circadian rhythm and disrupt sleep. Just about every digital screen, computer, tablet, and smartphone now uses Light Emitting Diode (LED) backlight because it produces brighter and more colorful images as well as being energy efficient. LED also emits more blue light directly into the eye than previous screen technology like Liquid Crystal Diode (LCD) technology. The closer we hold the devices to our eyes, the more intense the light exposure, and the higher the risk of possible damage. This makes smartphones the worst offenders and television the least harmful. A US study showed retina cells grown in a laboratory were completely destroyed when exposed to blue light. World Health Organization: The World Health Organization recently published an extensive article on what digital devices are doing to our eyes and the resulting eye strain. They stated ““Digital eye strain” is now a real condition, defined as the physical eye discomfort felt after two or more hours in front of a digital screen. As screen time increases – at home and in the office – so do symptoms like blurred vision, burning eyes, headaches and disrupted sleep. In total, nearly two thirds of American adults now experience symptoms of digital eye strain due to prolonged use of electronic devices like computers, tablets and cell phones.” Our health is being impacted negatively by the amount of time we spend with computers, phones and tablets. “The majority of Americans now report symptoms of digital eye strain, including neck, shoulder and back pain (36%), eye strain (35%), headaches (25%), blurred vision (25%) and dry eyes (24%). Worryingly, the percentage of sufferers is greater among young people. Some 73% of adults under 30 now experience these symptoms, suggesting a generational trend.” The growing concern is the kind of light most digital devices emit. We are all framiliar with the dangers of ultraviolet or UV light, but not many people are aware of the risks of high energy light that we can see: blue light. Light on the blue end of the visual light spectrum contains more energy than warm colours like oranges and reds, and is known as high energy visual light (HEV). Blue light is everywhere, you experience it daily with sunlight. That stated, digital screens, fluorescent and LED office lighting drastically increased our exposure. Blue light’s does have some beneficial effects, it boosts our alertness. When we are continually exposed to HEV light constantly, the sustained exposure may well add up, preventing our bodies from settling into healthy sleep. And unlike with UV light, human eyes do a poor job of filtering out blue light. The biggest concern is recent studies suggest HEV (blue) light can contribute to retinal damage and macular degeneration – an irreversible loss of vision. Research on this subject is just beginning, but early signs point to an association between long-term exposure and serious consequences. “Half the world will need glasses by 2050 due to screentime. Research suggests that 4.8 Billion people will be nearsigthed by 2050. Research has found a link between screentime and nearsightedness. The more time we spend on screentime increases the risk of developing myopia or nearsigntness.” Technology has pernamently changed how we live and work. Our vision health has not caught up with technology and is dangerously behind. For today’s digital workforce, awareness of dangers – and solutions – is critical. Technology may be evolving rapidly, but we still only get one set of eyes. So what can you do about it? First, you can take steps to protect your eyes from the harmful effects of blue light. If cannot limit your digital device of tablets, iPhones, iPads or Android devices such as tablets and mobile phones, cut back on using any digital technology a few hours before bed. A Harvard study shed a little bit of light on the possible connection to diabetes and possibly obesity, and Harvard researchers have shown that exposure to blue light, a couple of hours before bedtime, actually suppresses melatonin and delays deep REM sleep significantly. Blue light suppressed melatonin for about twice as long as the green light and shifted circadian rhythms by twice as much. So cutting back on digital technology, iPads, tablets, Amazon Fire, Mobile Phones, and Android driven devices use at night means getting better sleep, making people more productive at both work and school (and speaking from my personal experience, it makes children more pleasant). Second, you should talk with your eye doctor about lenses that filter out blue light. The lenses have little-to-no tint and can help to minimize the direct blue light exposure that you get throughout the day from mobile devices. Many people who have these lenses noticed an immediate increase in eye comfort because of the improved contrast, which helps to relax the eyes. And if you have children, I would absolutely recommend blue light filter lenses or a blue light screen protector, and even more so if they have trouble sleeping at night. Blue light filters are a few simple ways to protect the eyes of all ages. Knowing that our children’s eyesight is more valuable and will last much longer than our trusty smartphones, tablets and computer screens is the lesson. In fact, Amazon has added a blue light filter to the Kindle Fire. The Blue Shade feature on your Fire tablet lets you adjust the color and brightness of your screen. Blue Shade blocks blue light. Tablets and kids social-emotional development Researchers with the Boston University School of Medicine have now weighed in on those questions in a new set of recommendations published in the journal Pediatrics. “Mobile devices are everywhere, and children are using them more frequently at young ages,” Jenny Radesky, a clinical instructor at Boston University’s Developmental-Behavior Pediatrics, said in a statement. “The impact these mobile devices are having on the development and behavior of children is still relatively unknown.” Nevertheless, the researchers have arrived at a series of unsettling conclusions. They said children younger than 30 months “cannot learn from television and videos as they do from real-life interactions.” To use a mobile device before that age on tasks that aren’t educational can be “detrimental to the social-emotional development of the child.” According to the study, tablet technology “could “interfere” with a child’s growing sense of empathy or problem-solving skills. Kids acquire empathy and problem-solving skills by playing and interacting with peers and exploring their immediate surroundings “Kids acquire that capacity by playing and interacting with peers and exploring their immediate surroundings. If these devices become the predominant method to calm and distract young children, will they be able to develop their own internal mechanisms of self-regulation?” “It has been well-studied that increased television time decreases a child’s development of language and social skills,” Radesky said. “Mobile media use similarly replaces the amount of time spent engaging in direct human-human interaction.” Tablets and fine motor skill development Toddlers who use tablets or smartphones may develop long-term problems with their hands and fingers, experts warn: When children use touchscreens, they are not building up muscles needed for writing, which means they suffer from decreased muscle strengthAs touchscreens are relatively new, no one knows what the long-term health consequences will beAlso, these kids face a ‘healthcare time bomb’ of neck and back pain linked to the use of computers, video games and smartphones. The research showed nearly three-quarters of primary school children, and two-thirds of secondary school students, have reported back or neck pain within the last year. Today’s modern lifestyles and the increase in technology are having detrimental effects on musculoskeletal health and, if not addressed, will have far-reaching consequences for our children, the future working generation, and society. The other issue that kids face is the use of tablets inhibits or reduces their fine and gross motor skill development. Schools are experiencing students with the physical development of a 3-year-old at age 5. Kindergartners arrive at school without enough hand strength and coordination to use scissors or hold a pencil correctly. In fact, only about half can hold a pencil correctly, versus the fisted approach they should have grown out of by age 3. The Rise of the Sedentary Lifestyle As it is, the overuse of technology and lack of active and free play is limiting kids’ physical activity and the increase in screen time has led to the rise of a sedentary lifestyle. In 1982, the childhood obesity prevalence in the United States was less than 4%. By 2004, that number had grown to about 30%. So how do you minimize the potential damage to young eyes from blue light? Follow the 20-20-20 rule: put the tablet or cell phone down every 20 minutes, look into the distance for 20 seconds and blink 20 times.Get kids outdoors. Reduce the risk of developing myopia from a lack of exercising long distance vision.Exercise and a healthy diet, if it’s good for the body its good for the eyes.Limit screen time to no more than one hour a day for young children.Educate kids on the importance of blinking and taking frequent screen breaks.Get annual eye check-ups until the age of 18.Use a blue light blocking filter on your screensEncourage your kids to participate in arts and crafts projects, science/STEM experiments and projects, and similar to develop fine motor skillsPrint our coloring pages and work with your children to learn how to hold a pencil correctlyAs a family, get out in the back yard and play a physically active game to help develop gross motor skills and muscles.[1] The Hidden Hazards of Digital Devices and Blue Light on Kid’s Eyes Footnotes[1] The Hidden Hazards of Digital Devices and Blue Light on Kid’s Eyes - Play2Health",
            "date": "Answered August 7, 2017",
            "views": "36",
            "upvotes": " View 27 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Md. Zakir Hossain",
                    "user_href": "/profile/Md-Zakir-Hossain-12"
                },
                {
                    "user_id": "Justin Tu",
                    "user_href": "/profile/Justin-Tu-8"
                },
                {
                    "user_id": "Kat Sane",
                    "user_href": "/profile/Kat-Sane"
                },
                {
                    "user_id": "Nancy D Carpenter",
                    "user_href": "/profile/Nancy-D-Carpenter"
                },
                {
                    "user_id": "Olivia Boyle",
                    "user_href": "/profile/Olivia-Boyle-21"
                },
                {
                    "user_id": "Kaylee Kawaii Cat",
                    "user_href": "/profile/Kaylee-Kawaii-Cat"
                },
                {
                    "user_id": "Mehul Shah",
                    "user_href": "/profile/Mehul-Shah-248"
                },
                {
                    "user_id": "Zufar Hazim",
                    "user_href": "/profile/Zufar-Hazim"
                },
                {
                    "user_id": "Shelley Sawicki",
                    "user_href": "/profile/Shelley-Sawicki"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        }
    ]
}