{
    "title": "What are some things kids ages 10-14 are into? - Quora",
    "tags": [
        "Teenagers and Teenage Years",
        "Children"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amelia Williams",
                "href": "/profile/Amelia-Williams-132"
            },
            "answer_text": "This is often around the time kids really start figuring out what they like. Having said that though, it's an extreme generalization. Every kid is different and I can't speak on behalf of all tweens/early teens. This is simply what I've noticed kids my age like. Technology/Social Media Most kids around the age range you've given have smartphones or access to some sort of technology. If I had a dollar for every time I saw a kid walking around filming a Musically, posting something to Instagram, or taking a picture with the dog filter on Snapchat, I'd be rich! Social media is extremely popular for kids in that age group and even kids older than that. Personally though, I don't use that sort of social media. My internet life consists of Quora, memes, and YouTube. Sports I can't say a lot for this one, because unless running out of money is classified as a sport than I'm the most un-athletic person ever. I couldn't tell you the first thing about basketball but I know plenty of kids ages 10-14 who can. Whether it's soccer, football, baseball, or basketball, many kids enjoy doing sports-related activities for exercise, physical health, and/or just to have fun! Oh, I do karate though, does that count? It's exercise and it teaches you some pretty important things. (Currently I'm an advanced brown belt, so that means I still have red, advanced red, and then black!) Music I know for a fact that music has taken over my life. I've fallen in love with the piano and play it nearly every day. I'm into classical music, which I know sounds kind of weird considering most kids 10-14 are into pop, rap, and other similar styles. Again though, that is a generalization based off of my experiences with other 10-14 year olds. I am not speaking for everyone. Some kids I know are into rappers like Eminem, while others listen to Hamilton all day long. (Guilty!) A lot of young musicians start finding their talent for whatever instrument at this age too. For example, my 11 year old cousin plays the cello and I've been teaching myself piano since I was 12. Drawing Almost everybody likes drawing, you don't have to be a kid to enjoy creating art. The amount of delicate, creative, talented people I've met spend their time drawing and honestly, I can't wait to see where they take their skills. I'm also into drawing, but I'm not very good. Oh well. Dancing I guess this could be counted as a sport, because it's exercise, it can be competitive, and many people love it. A huge portion of my life was dedicated to ballet, jazz, and lyrical dancing but I stopped at age 12 after about 4 years of it, 3 of those years being competitive. Don't get me wrong, I absolutely adored dance and put my soul into it, but my parents took me out of it because of the company I was with. The company was ridiculously bad and we were honestly falling short of money at the time too. I was heartbroken because of how much I loved it. (Luckily, I do karate now.) My school is filled with dancers, girls and boys. Lots of people who are 10-14 are definitely into dancing. Spending time with friends Obviously. Ages 10-14 is definitely a hormone-ridden time, and even beyond those ages is an embarrassing \"journey\" as parents call it, to adulthood. Our emotional needs and self-esteem levels are often met through hanging out with friends. It's fun and builds a meaningful relationship with others. Knowing you have someone you can laugh with, share secrets with, and depend on can mean everything in the world to you. A lot of kids spend time with their friends at the movies, at the mall, or simply hanging over at their house. These are only a few of the hobbies and activities kids 10-14 are into. If you're fortunate, that is. Some 10 year olds might be trying to escape poverty, some 12 year olds might be caring for a disabled family member, and some 14 year olds are being abused and are just trying to survive. It all depends on where you live and the experiences you've had. I'm extremely lucky to be living in a place where I can pursue my talents in school and at home. I just recently turned 14 (yesterday actually!) and that's why I'm qualified to answer. I've also got cousins and a brother ages 10, 11, 12. I go to a middle school filled with other kids my age! Sources: My mind.My life.Kids ages 10-14 that I know.",
            "date": "Answered April 3, 2017",
            "views": "922",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charlie Bloom",
                    "user_href": "/profile/Charlie-Bloom-8"
                },
                {
                    "user_id": "Amelia Paine",
                    "user_href": "/profile/Amelia-Paine-2"
                },
                {
                    "user_id": "Claire Yang",
                    "user_href": "/profile/Claire-Yang-56"
                },
                {
                    "user_id": "Jay Sapinsky",
                    "user_href": "/profile/Jay-Sapinsky"
                },
                {
                    "user_id": "Lior Bey",
                    "user_href": "/profile/Lior-Bey"
                },
                {
                    "user_id": "Chahat Kalsi",
                    "user_href": "/profile/Chahat-Kalsi"
                },
                {
                    "user_id": "Astrid Star",
                    "user_href": "/profile/Astrid-Star"
                }
            ]
        },
        {
            "author_info": {
                "name": "Savitha Kartha",
                "href": "/profile/Savitha-Kartha"
            },
            "answer_text": "I can answer this cos my elder daughter is 10. She is into : Drawing . She loves to draw anything. It could be a flower, or some random girl picture, smiley faces , whatever comes into her mind. Games. She playes games on the tab. Dancing . She loves dancing around the house on crazy music and made up dance steps. Music. She loves listening to her favourite songs on you tube . Dress up like a tom boy. She hates dressing up with all the girly stuff . She prefers no clips, no fancy chains and bangles. Food. She loves experimenting new dishes, mostly spicy and sometimes junk. Arguing. She argues with her younger sibling if the younger one takes her stuff without asking and I stand there like a referee. Sigh! Diary. She loves maintaining a diary and writing her personal things . Box. She has a secret box in which she keeps her ‘ precious' stuff like her favorite pen, key chains, small diary and she's kept a sticker on it which says,’No one to touch it, and I mean strictly NO ONE'. Saying NO to some things when we tell her to do like telling her put on a specific dress, or go have a bath, and her reply would be, ‘I like to do things when I feel like.’ Making faces . When it's photo time she would be least interested and make clumsy faces . Making videos. This is the most loved activity by her. Making videos with goofy faces or enacting some video she saw on you tube . These are some things which I have observed. ",
            "date": "Answered April 3, 2017",
            "views": "519",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ja Ru",
                    "user_href": "/profile/Ja-Ru-13"
                },
                {
                    "user_id": "Malini Rajendra",
                    "user_href": "/profile/Malini-Rajendra"
                },
                {
                    "user_id": "Alexander Loo",
                    "user_href": "/profile/Alexander-Loo-3"
                },
                {
                    "user_id": "Radhika R Babu",
                    "user_href": "/profile/Radhika-R-Babu"
                }
            ]
        }
    ]
}