{
    "title": "What happens to the paid interest on a loan moratorium if the government takes the responsibility for interest? - Quora",
    "tags": [
        "Interest Rates",
        "Loans",
        "Government"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sekhar Mahalingam",
                "href": "/profile/Sekhar-Mahalingam"
            },
            "answer_text": "The government has been planning to give relief for the interest on interest which in reality the interest during the moratorium will be paid by the borrower whereas the interest on interest deferred during the moratorium period has to be paid as a relief . The simple interest is to be charged on the outstanding in the loan account as on 01.04.2020 . * For example loan outstanding amount is Rs . One lakh as on 01.04 . 2020 . Rate of interest 12 % . Under compounding . Interest 1000 next month interest 1010 1020 , 1030 , 1041 , 1051 Hence the total payable Rs . 6 , 152 . Under simple interest Rs . 6 , 000 only. The interest on interest of Rs . 152 will be compensated by the government . * If the loan is repaid regularly the interest component Rs . 6000 plus the part amount of principal as EMI which is to be paid . ",
            "date": "Answered October 18, 2020",
            "views": "93",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amuthan Subbiah",
                "href": "/profile/Amuthan-Subbiah"
            },
            "answer_text": "While applying interest in a loan account, the system will first apply the regular interest and then the penal interest as both the calculation modules ate different in the system. You can view your account for this. If you find any such additional entry, that portion has to be reversed by the bank as per the affidavit submitted by the government to the court. ",
            "date": "Answered October 18, 2020",
            "views": "54",
            "upvotes": "0"
        }
    ]
}