{
    "title": "What is the importance of Philippine history? - Quora",
    "tags": [
        "History of the Philippines",
        "The Philippines"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vyron Loares",
                "href": "/profile/Vyron-Loares"
            },
            "answer_text": "History, obviously, has a great impact on the present. It explains why are we in certain situation and what events led to that situation. If History is taken with just dates and events then it is limited and may not truly answer the \"why\".  If History, taken with a multidisciplinary approach then it can explain a lot as you are looking under different lenses such as Psychology, Political Science, Sociology, Economics, among others. In the context of Philippine History, the answer is the same. If we know and understand the reasons behind the smalls events that led to our \"current\" situation then we may know how to solve our that situation. For example, the \"current\" situation of OFWs working for other countries, What caused them to become an OFW? Here is just a list of possible reasons for being an OFW Low Wage, e. i. not enough to support familyNo work availableNo educational attainment (e.g. only finished High School)We can trace those reasons to other situations that led to that event,  Economics: From micro events such as no money for college to macro events such as the economy crashed or it is bad to begin with. Sociology: We can also say that many are attracted to become OFWs because others are doing it. Psychology: Being an OFW may only be the last resort in order to satisfy the needs of the family. Political Science: In terms of the concept of power, a higher authority such as a parent may then coerced that person to become an OFW. (This stretches PoliSci far but this is only used as an example). The reasons then have their own situations that led to it. Also, in \"my\" field which is Psychology, \"History\" is also used to assess a company to improve its efficiency or to help person who has a problem. Note that History is just a lens to understand society. The others \"lens\" include disciplines such as the ones mentioned above. A multidisciplinary approach is the best way to understand the reasons behind our current situation, history is just one of those approaches. ",
            "date": "Answered August 19, 2013",
            "views": "601",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Juvelyn Flores",
                    "user_href": "/profile/Juvelyn-Flores-1"
                },
                {
                    "user_id": "Eliza Mie Rivera",
                    "user_href": "/profile/Eliza-Mie-Rivera"
                },
                {
                    "user_id": "Don Zhe",
                    "user_href": "/profile/Don-Zhe"
                },
                {
                    "user_id": "RedToroMoto PH",
                    "user_href": "/profile/RedToroMoto-PH"
                },
                {
                    "user_id": "Anicel Tan",
                    "user_href": "/profile/Anicel-Tan"
                },
                {
                    "user_id": "Kenneth Castañares Mendoza",
                    "user_href": "/profile/Kenneth-Castañares-Mendoza"
                },
                {
                    "user_id": "Sherah Porteza",
                    "user_href": "/profile/Sherah-Porteza-1"
                },
                {
                    "user_id": "Elle Delrosario",
                    "user_href": "/profile/Elle-Delrosario"
                },
                {
                    "user_id": "Gigi Pilcher",
                    "user_href": "/profile/Gigi-Pilcher"
                },
                {
                    "user_id": "Michael Figueroa",
                    "user_href": "/profile/Michael-Figueroa-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emmanuel Ikan Astillero",
                "href": "/profile/Emmanuel-Ikan-Astillero"
            },
            "answer_text": "The importance of Phil History is it explains many present-day phenomena. For ex: Spanish and American colonial history explains that the white men ruled supreme over the dark-skinned natives, and this could explain why th concept of “beauty” in the Phils today is “fair-skinned”, and lotsa skin whitener sell like crazy. Phil history also tells us that Phil independence was formally declared by Prees Emilio Aguinaldo in Kawit June 12 1898. The Americans “granted” th Phils independence on July 4 1946 - a comedy to coincide our independence with the American’s. President Macapagal put the date back correctly to June 12 in 1965. The colonial history of the Phils, from 1521–1946 is populated with rebellions, the most notable in 1521, was the defeat of Fernao de Magalhaes in the hands of Lapu-Lapu at the foreshore of Mactan. Lapu-Lapu decided to engage the heavily armored Spaniards in the foreshore where the Spaniards had heavy armors which made them slow. In contrast, Lapu-Lapu’s men were half-naked and had only long knives - fighting very light. Phil history is full of many escapades, of romance, of bloody battles, etc. It’s a very interesting narrative. Read my book: “Filipinos are Austronesians” at Amazon.com. ",
            "date": "Answered August 17, 2018",
            "views": "59",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Myles Delfin",
                    "user_href": "/profile/Myles-Delfin"
                }
            ]
        }
    ]
}