{
    "title": "What are currently the hot topics in computer science research? - Quora",
    "tags": [
        "Assignment Help Usa",
        "Assignment (computer science)",
        "Computer Science Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vijay Nadadur",
                "href": "/profile/Vijay-Nadadur"
            },
            "answer_text": "Here’s some of my picks, for hot topics in CS research. 1) Data Science: The term Data Scientist was coined by DJ Patil a few years ago, and HBS termed Data Scientist as the sexiest job. Why? With growing amount of data, there have been tons of patterns emerging from historic data, streaming data, data from social media, etc which are important to make valuable predictions, take corrective actions etc. I am positive this trend will remain hot, for at least next 5 years. 2) Advanced Machine Learning: A lot of young graduates already are aware of basics of ML. Advanced techniques such as Deep Learning, CNN, etc are constantly making advancements and then the areas in which these are applied are becoming wider. Along with business applications, there are scientific applications too. 3) Internet of Things (IoT): It might not be correct to restrict IoT to just a CS hot topic. It’s a perfect example of how the future is going to be, very interdisciplinary. 4) Virtual Reality and Augmented Reality (VR/AR): This is similar to the IoT area. I have seen a lot of startups come in from this segment. A lot of them are perceived as game changers. Unlike in the past, people are not viewing this just as an enhancements in gaming, but actual impact of businesses. 5) Hardware: With maturing technologies, more data will be produced / processed than ever before. So, storing this data is always going to be an interesting research. The goal here would be to store a lot of data, on least amount of space, and consuming least amount of power. Hardware research in CS will never fade out. I’m sure there will be more areas that might be considered hot in CS, which I might have missed. ",
            "date": "Answered August 8, 2016",
            "views": "105",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sim Mohanty",
                    "user_href": "/profile/Sim-Mohanty"
                },
                {
                    "user_id": "Koya Vasudha",
                    "user_href": "/profile/Koya-Vasudha"
                },
                {
                    "user_id": "Aami Kakakhel",
                    "user_href": "/profile/Aami-Kakakhel"
                },
                {
                    "user_id": "Parthvi Jain",
                    "user_href": "/profile/Parthvi-Jain"
                },
                {
                    "user_id": "SAMEER SINGH",
                    "user_href": "/profile/SAMEER-SINGH-396"
                },
                {
                    "user_id": "YUVARAJ V",
                    "user_href": "/profile/YUVARAJ-V-1"
                },
                {
                    "user_id": "Amrit Jha",
                    "user_href": "/profile/Amrit-Jha-11"
                },
                {
                    "user_id": "Celine Okumah",
                    "user_href": "/profile/Celine-Okumah"
                },
                {
                    "user_id": "Ujjwal Verma",
                    "user_href": "/profile/Ujjwal-Verma-13"
                },
                {
                    "user_id": "Adarshkumar Pavani",
                    "user_href": "/profile/Adarshkumar-Pavani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul King",
                "href": "/profile/Paul-King-2"
            },
            "answer_text": "The hot topics lie at the boundaries where computational paradigms are changing. In terms of the theoretical models underlying technology creation, here are some places where major shifts are happening: program structure -- computer science is constantly reinventing how to represent functionality most intuitively, concisely, and flexibly. First there were procedural languages, then object oriented programming. Now program structure is represented as a hybrid mixture of loosely typed languages, opensource libraries, and decentralized multithreaded cloud architectures over multi-layer data representations. What are the central patterns underlying the optimality of these new architectures? How are open APIs changing the definition of an application? virtualization -- Time-sharing operating systems and virtual memory were the first attempts at virtualization. Then it was the virtual machine for software execution (e.g. Java VM, Microsoft CLR). Then the virtual machine architecture that enabled cloud computing. How far can virtualization as an approach to abstraction go? statistical machine learning -- The use of statistics against large data sets has taken over artificial intelligence. This has been proven in industry as well (Google, collaborative filtering, ad targeting, \"big data\"). This area of math has also taken over theoretical neuroscience, not to mention computer vision. representation of data at scale -- How do you represent data when there is too much to fit in one database and millions of people are accessing it simultaneously? Many hybrid complex data structures have evolved that include clever caching, layers of servers, NoSQL, sharding, inverted text indexes, and cloud base archives. What ties all these patterns together? computer security -- Computer security is the central contact point at which the irresistable force of openness meets the immovable object of privacy. Whether this is encryption, security layers, permission models, or system integrity techniques, the future is both open and protected. How to achieve both? network models -- Networks and the graphical models that underlie them have become profoundly complex. Networks now include social networks, computing node networks, web-page link graphs, network data models, and neural networks. Network structures are unwieldly to analyze, but central to the future of computing. boundary between hardware and software -- Since the formulation of the Von Neumann architecture, this has been under continuous evolution in CS. Hardware is becoming more programmable and configurable (GPU computing, FPGAs), and hardware is adapting to software (hyperthreading and virtualization features in CPUs). Cloud computing is arguably a form of soft-configurable large-scale hardware infrastructure. All of these fit into a central theme of computer science, which is the quest for ever greater abstractions that expand power while simplifying design. ",
            "date": "Updated May 11, 2012",
            "views": "1583",
            "upvotes": " View 273 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aarthi Iyer",
                    "user_href": "/profile/Aarthi-Iyer-12"
                },
                {
                    "user_id": "Sim Mohanty",
                    "user_href": "/profile/Sim-Mohanty"
                },
                {
                    "user_id": "Yash Malhotra",
                    "user_href": "/profile/यश-मल्होत्रा-Yash-Malhotra"
                },
                {
                    "user_id": "Prajwal Agarwal",
                    "user_href": "/profile/Prajwal-Agarwal-2"
                },
                {
                    "user_id": "Smarak Patra",
                    "user_href": "/profile/Smarak-Patra-1"
                },
                {
                    "user_id": "Deepak Mishra",
                    "user_href": "/profile/Deepak-Mishra-415"
                },
                {
                    "user_id": "Rajnikant Yadav",
                    "user_href": "/profile/Rajnikant-Yadav-18"
                },
                {
                    "user_id": "Jeffrey Arukwe",
                    "user_href": "/profile/Jeffrey-Arukwe-1"
                },
                {
                    "user_id": "Rajib Bahar",
                    "user_href": "/profile/Rajib-Bahar"
                },
                {
                    "user_id": "Ayush Sharma",
                    "user_href": "/profile/Ayush-Sharma-1764"
                }
            ]
        }
    ]
}