{
    "title": "What do top students actually think of other top students? - Quora",
    "tags": [
        "Studying at College and University",
        "Classmates",
        "Studying in Higher Education",
        "College and University Students",
        "The High School Experience",
        "Students",
        "Studying",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sam Cheung",
                "href": "/profile/Sam-Cheung-1"
            },
            "answer_text": "As a teacher, I almost never see the rivalry that results in hatred that you see in these teen movies. Usually it’s fairly obvious who’s naturally best at a given subject, but hard work can overturn that difference and then there’s friendly competition to see who can score the highest mark. Occasionally, you get a student who scores the top mark effortlessly, but usually it’s as a result of a combination of hard work and natural ability. Usually top students get on well, work with each other and spar well off each other. From my experience, with girls the rivalry can go deeper and it can be an unspoken comparison which can be not only incredibly fierce, but also unhealthy. It is what is commonly known as “hot housing”, which occurs quite a lot in top academic girls schools. I’m not a fan. I was one of the top mathematicians in my school. I hung out with three other guys who were also the other top mathematicians. One of them was my best friend and I still keep in touch with him over 20 years later. The others were good friends, but I have lost touch with them. There was friendly rivalry and bragging rights over scores, but we never felt threatened or envious of one another. The best natural mathematician was lazier than me and sloppy, so we almost always beat him, but he had a brilliant mind. My best friend was probably on par with me, but worked a lot harder than me, so usually beat me. The fourth guy, was good, but wasn’t as good as the rest of us, but also worked phenomenally hard. He went to Oxford to study Chemistry and did extremely well. I’m not in touch with him, but I’m sure he probably did the best academically. ",
            "date": "Updated July 8, 2018",
            "views": "15",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karan Bains",
                    "user_href": "/profile/Karan-Bains-19"
                },
                {
                    "user_id": "Maria Karushkoav",
                    "user_href": "/profile/Maria-Karushkoav"
                },
                {
                    "user_id": "Sam Yap",
                    "user_href": "/profile/Sam-Yap-24"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/S-Bubtu"
                },
                {
                    "user_id": "Rachel Zhou",
                    "user_href": "/profile/Rachel-Zhou-10"
                },
                {
                    "user_id": "Lukas Obermajer",
                    "user_href": "/profile/Lukas-Obermajer"
                },
                {
                    "user_id": "Goh Kang Hao",
                    "user_href": "/profile/Goh-Kang-Hao-1"
                },
                {
                    "user_id": "Arnav Goel",
                    "user_href": "/profile/Arnav-Goel-13"
                },
                {
                    "user_id": "Ambi Na",
                    "user_href": "/profile/Ambi-Na"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan LaPierre",
                "href": "/profile/Nathan-LaPierre-2"
            },
            "answer_text": "I might qualify as a “top student” at my undergraduate institution. I had a near-perfect GPA and won a number of scholarships and departmental awards (I mention this only to qualify myself to answer the question). The answer to this question depends on the psychology of the individuals involved, which varies, but I can share my personal perspective. To paraphrase a common saying, “you never want to be the smartest person in the room”. I wanted to surround myself with the smartest students so I could learn from them and improve my own performance. What is more, I always respected them for being high achievers like myself and befriended many of them. However, I have also seen the dark side of students passive-aggressively competing with each other to see who would score higher on every test, or people bragging to others about their “god-tier GPA” (Yes, someone actually said that to a friend of mine who was less well off. Not cool.) In my opinion, the very smartest students realize that GPA is a sorely inadequate indicator of one’s underlying intelligence. It is affected by many factors other than raw intelligence, including hard work, gaming or understanding the system, test taking tactics, and even cheating in some unfortunate cases. The most intelligent students also don’t brag often because they understand how smart the top students and professors are around them and understand how much they still don’t know. ",
            "date": "Answered June 8, 2016",
            "views": "25",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amman Abbasi",
                    "user_href": "/profile/Amman-Abbasi-1"
                },
                {
                    "user_id": "Maria Karushkoav",
                    "user_href": "/profile/Maria-Karushkoav"
                },
                {
                    "user_id": "Manan Taneja",
                    "user_href": "/profile/Manan-Taneja-2"
                },
                {
                    "user_id": "Sam Yap",
                    "user_href": "/profile/Sam-Yap-24"
                },
                {
                    "user_id": "Hanifah Salma",
                    "user_href": "/profile/Hanifah-Salma"
                },
                {
                    "user_id": "Libing Cao",
                    "user_href": "/profile/Libing-Cao"
                },
                {
                    "user_id": "Rose Chou",
                    "user_href": "/profile/Rose-Chou-2"
                },
                {
                    "user_id": "M O",
                    "user_href": "/profile/M-O-199"
                },
                {
                    "user_id": "Abhishek Mahajan",
                    "user_href": "/profile/Abhishek-Mahajan-4"
                },
                {
                    "user_id": "Lisa Illés",
                    "user_href": "/profile/Lisa-Illés"
                }
            ]
        }
    ]
}