{
    "title": "What happens if you are 15 and in 8th grade? - Quora",
    "tags": [
        "7th Grade",
        "8th Grade",
        "15 (age)",
        "Grades (education)",
        "High School Education",
        "The High School Experience",
        "Academic and Educational Advice",
        "Studying",
        "Higher Education",
        "Teenagers and Teenage Years"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dania Pearson",
                "href": "/profile/Dania-Pearson"
            },
            "answer_text": "Plenty of students in the U.S. are 15 years old in the 8th grade. There is no evidence of long term negative consequences for these students. In other words, nothing happens if you are 15 and in the 8th grade. If you follow the typical path through the rest of your schooling, then you will be 19 when you graduate from high school. But you will not be singled out on this fact. No one will care unless you make it a big deal. My brother was 19 when he graduated from high school. He earned a college degree and was able to support himself through his 20’s. He’s now in his 30’s, happily married and passionate about his work. If you want to graduate early, there are lots of ways to do that, such as participating in an independent study program, or dual enrollment at a local community college or university. However, there are pros and cons to these programs. They aren’t for every student. Honestly, don’t worry about how old you are in 8th grade. There’s nothing magic about graduating high school at 18. ",
            "date": "Answered November 29, 2019",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lily Young",
                    "user_href": "/profile/Lily-Young-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aisha Barker",
                "href": "/profile/Aisha-Barker-1"
            },
            "answer_text": "It is very common for a student to be 15 and in year eight. For example. To be in year eight this year (Australian Schooling System) you would have had to been born October 2004 - April 2006. Sorry if this doesn’t make sense. But it is very normal to be 15 in year eight. Nothing special happens, everyone is treated equally. Also, if you don’t understand, in Australia, the school year starts at the beginning of the year (January/February) and ends near the end (December). ",
            "date": "Answered November 5, 2019",
            "views": "745",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karthik M",
                    "user_href": "/profile/Karthik-M-986"
                },
                {
                    "user_id": "Daisy Morgan",
                    "user_href": "/profile/Daisy-Morgan-6"
                },
                {
                    "user_id": "Jack Murphy",
                    "user_href": "/profile/Jack-Murphy-337"
                }
            ]
        }
    ]
}