{
    "title": "What is a liberal art business degree? Where can it take you? - Quora",
    "tags": [
        "Business Degree",
        "Learning About Liberal Arts",
        "Liberal Arts Colleges",
        "Liberal Arts",
        "Higher Education",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Derek Sathre",
                "href": "/profile/Derek-Sathre"
            },
            "answer_text": "I have an AA in liberal arts and an AS in business… I paid ~$20k for it and I am now working in the goulags at a factory… $15 an hour. It’s not a glamorious office job or whatever, but I earn my keep. I can also (shocking) afford my lifestyle. The bachelor’s gets you into a damned if you do situation… I kept my debt low so I could fall back on high school jobs. Once I pay that debt off, I can go again… or not. It’s nice too because you gain experience while supporting yourself. You appreciate people who bust their asses every day to put food on the table… With a Bachelors being almost 66% more expensive you are in a situation if you’ve borrowed where you are desparate for a “high paying” job. So, 4 years at university put you at the point where “high school” jobs wont pay the bills. You gotta play smart. As to your question, liberal arts (if done right) gives you immense soft skills… while the business gives you money prowless. So you are literate as much as a 4-year student, and have a smidgen of a specialty. The business part teaches you the way to invest though they wont outright tell you… you can use ALL of it for investing… I got informed for a 1/3rd of the price of university… I can afford living on high school job wages… and use my “useless” education to put myself ahead… ",
            "date": "Answered March 21, 2020",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Argenis Garcia",
                    "user_href": "/profile/Argenis-Garcia-3"
                }
            ]
        }
    ]
}