{
    "title": "What are the best universities in Europe for IR students? - Quora",
    "tags": [
        "Higher Education in Europe",
        "Colleges and Universities in Europe",
        "International Students",
        "Students",
        "Europe",
        "Higher Education",
        "Colleges and Universities",
        "International Relations",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Khandu Patel",
                "href": "/profile/Khandu-Patel-1"
            },
            "answer_text": "I take it by IR you mean international relations. Also you do not say whether it is undergraduate, masters or doctorate programs you want to know about. Another thing to know is that the liberal order to which universities have rendered their expertise less influential in a the post global obsessed world sceptical of self proclaimed experts. If your taking IR is more than interest but have a career path in mind, the country and university should have an important bearing. IR expertise is developed and valued in the practical world of policies and politics. Where you come from is as important as your intended destination to get practical experience of the field. The cost of studying and scholarships will also need to be explored. Studying in the UK will have fee and living costs. Oxford and Cambridge are foremost without saying. Manchester, Essex, LSE and SOAS are well ranked. You have a choice of no fee and fee paying universities to choose from in continental Europe. Free Berlin University, Leiden University are two that receive mention. Finland is something of a powerhouse in education is worth looking into. Other Scandinavian countries used to have no fees but that does not always obtain now. As an active conservative I am not able to stomach the liberal bias of universities and they of me. Academic as opposed to active conservative political interest would make study tolerable. I developed my expertise in foreign affairs from politics and historical studies. Please feel free to message me. ",
            "date": "Answered October 24, 2020",
            "views": "58",
            "upvotes": "0"
        }
    ]
}