{
    "title": "What do employers think of online course certificates? - Quora",
    "tags": [
        "edX",
        "Udacity",
        "Coursera",
        "E-learning",
        "Business"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ngak Cruise",
                "href": "/profile/Ngak-Cruise"
            },
            "answer_text": "Course certificates are always good as long as the applicant is as efficient and effective. It should go together, skill plus proof. If someone with an academic award lands a very good job he has to prove his worth. Company this days are more on performance especially when you work remotely or online. The best thing is to choose a legit online platform that will allow you to increase your knowledge and skills in order to be globally competitive. One site I would recommend would be AI Training | Experfy @ Harvard Innovation Lab. They also have 30% off on all courses in line with Thanksgiving and Cyber Monday deals so there, hope this helps! ",
            "date": "Answered November 24, 2019",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Fitzgerald",
                "href": "/profile/David-Fitzgerald-26"
            },
            "answer_text": "I look at it this way: If an applicant shows that they are investing their own time and intellect into improving themselves, that’s a good thing. If they are doing it without spending a fortune, that means they have some wisdom. If they are taking a subject that has nothing in common in a direct sense to what they want to do for/with me, thatmeans they are intellectually curious, and might be someone I can learn something from. So it’s not a get out of jail free card, but I can’t think of any negatives. Just don’t violate my company’s Acceptable Use Policies. ",
            "date": "Answered January 6, 2018",
            "views": "64",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lee-Ann Zii",
                    "user_href": "/profile/Lee-Ann-Zii"
                },
                {
                    "user_id": "Darlaurie Pierre",
                    "user_href": "/profile/Darlaurie-Pierre"
                },
                {
                    "user_id": "Anindita Paul",
                    "user_href": "/profile/Anindita-Paul-15"
                },
                {
                    "user_id": "Harish Nair",
                    "user_href": "/profile/Harish-Nair-30"
                },
                {
                    "user_id": "Caleb Lipan",
                    "user_href": "/profile/Caleb-Lipan-1"
                },
                {
                    "user_id": "Tomas Arano",
                    "user_href": "/profile/Tomas-Arano"
                },
                {
                    "user_id": "ValliAnuu D Drizzlin Dew",
                    "user_href": "/profile/ValliAnuu-D-Drizzlin-Dew"
                },
                {
                    "user_id": "Hasani Mason",
                    "user_href": "/profile/Hasani-Mason"
                },
                {
                    "user_id": "Milan Shrestha",
                    "user_href": "/profile/Milan-Shrestha-120"
                },
                {
                    "user_id": "Yi Xiang Chong",
                    "user_href": "/profile/Yi-Xiang-Chong"
                }
            ]
        }
    ]
}