{
    "title": "What are the pros and cons of Lynda.com vs Udemy? - Quora",
    "tags": [
        "lynda.com (product)",
        "Udemy (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ahmed Balfaqih",
                "href": "/profile/Ahmed-Balfaqih"
            },
            "answer_text": "I have been a subscriber to Lynda for more than 10 years. One of the best investment I have ever made. I have also bought more than 15 courses from Udemy. Most I bought when there was a 90% discount. The advantages of Lynda over Udemy would be the following in my opinion. Quality of videos produced at Lynda is flawless. Everything about the videos speak quality. The sound, the screen capture, the presentation.The educators at Lynda are better at teaching or know the subject better.There are thousands of video to choose from. One fee and you have them all for a year or a month until you renew your subscription.Lynda is focusing on three major subjects. Programming, graphics and recently sales, management and marketing. Great addition in my opinion.Lynda has fantastic and well designed iOS and Android apps that allow you to download the courses and watch them offline.You receive a certificate of completion which is nice to have. It would have been great if there were some form of testing or you can submit your work for evaluation.The advantages of Udemy over Lynda are in my opinion: Better feed back. There is a dashboard where you post your questions and the author or other students will try to help you.Some of the courses are fantastic value for money. I bought few for USD10 each only. I learnt a lot for this amount I paid. You pay for them and they are yours forever.Some of the courses cover real life projects. And some of these projects are almost something you would want to learn how to do.A very wide selection that cover how to put your lipstick or makeup to how to create a freaking iOS app.Generally, the quality of videos from Udemy aren't as polished, sound and video wise, as Lynda's one. ",
            "date": "Updated November 24, 2018",
            "views": "407",
            "upvotes": " View 80 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ardit Sulce",
                    "user_href": "/profile/Ardit-Sulce-1"
                },
                {
                    "user_id": "Ganso Jalloh",
                    "user_href": "/profile/Ganso-Jalloh"
                },
                {
                    "user_id": "Tamia Paschall",
                    "user_href": "/profile/Tamia-Paschall"
                },
                {
                    "user_id": "Higor Costa",
                    "user_href": "/profile/Higor-Costa-1"
                },
                {
                    "user_id": "Taimi Bek",
                    "user_href": "/profile/Taimi-Bek"
                },
                {
                    "user_id": "Mostafa Almasry",
                    "user_href": "/profile/Mostafa-Almasry-1-1"
                },
                {
                    "user_id": "Shid N. Birgani",
                    "user_href": "/profile/Shid-N-Birgani"
                },
                {
                    "user_id": "Daniel Silva Ferreira Bruno",
                    "user_href": "/profile/Daniel-Silva-Ferreira-Bruno"
                },
                {
                    "user_id": "Nicola Rainiero",
                    "user_href": "/profile/Nicola-Rainiero"
                },
                {
                    "user_id": "Arundhati Mukherjee",
                    "user_href": "/profile/Arundhati-Mukherjee-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lakenya Shequan Williams",
                "href": "/profile/Lakenya-Shequan-Williams"
            },
            "answer_text": "Udemy Pros Wait a week and you'll just pay the $10-15 for each course and that's all you should pay.I've found the instructors here are good for getting both practical examples of how to use what you're learning and for feedback. That said, I never buy a course without looking very thoroughly through the feedback and comparing reviews about teaching style and about the teacher's ability to quickly respond to questions on the message board.Cons If you want something, you might have to wait a week or two to get it for $15 as opposed to $400 or something insane.You can easily get courses that are either poorly taught or are way over year head.Sounds like instructors can be ripped off.Lynda Pros Instructors are very knowledgeable and often focus on the very fundamentals. This is great if you have zero background in a skill you're trying to learn.Courses are typically very, very thorough.Cons I find they are good for a thorough understanding of the basics but often fall short in practical examples. Sometimes I can watch three hours of a Lynda tutorial on something and not have any idea on who to actually use that piece of information then watch a Udemy instructor build an app with it in 20 minutes and have a much, much better understanding. Both are helpful, and using them in unison is best, but if you can pick only one, it's worth knowing that.There appears to still be no way to get feedback from other students or the instructors if you get stuck.Visit here to know more details about Udemy VS Lynda Reviews ",
            "date": "Answered August 6, 2017",
            "views": "245",
            "upvotes": " View 25 Upvoters",
            "upvoters": [
                {
                    "user_id": "Taimi Bek",
                    "user_href": "/profile/Taimi-Bek"
                },
                {
                    "user_id": "Daniel Silva Ferreira Bruno",
                    "user_href": "/profile/Daniel-Silva-Ferreira-Bruno"
                },
                {
                    "user_id": "Tryphon Kormaniotis",
                    "user_href": "/profile/Tryphon-Kormaniotis-1"
                },
                {
                    "user_id": "Senay Sirin",
                    "user_href": "/profile/Senay-Sirin"
                },
                {
                    "user_id": "Anil Batra",
                    "user_href": "/profile/Anil-Batra"
                },
                {
                    "user_id": "Jonathan Beasley",
                    "user_href": "/profile/Jonathan-Beasley-11"
                },
                {
                    "user_id": "Malay Translator",
                    "user_href": "/profile/Malay-Translator"
                },
                {
                    "user_id": "Nala",
                    "user_href": "/profile/Nala-77"
                },
                {
                    "user_id": "Ratneshwar Tiwari",
                    "user_href": "/profile/Ratneshwar-Tiwari"
                },
                {
                    "user_id": "David Song",
                    "user_href": "/profile/David-Song-79"
                }
            ]
        }
    ]
}