{
    "title": "What are the most relevant subjects to study? - Quora",
    "tags": [
        "Studying in Higher Education",
        "Subjects (education)",
        "Studying",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Spruill",
                "href": "/profile/Chris-Spruill"
            },
            "answer_text": "You should learn the subjects that you need to survive. I can provide a list (which I do below), but it would in no way be exhaustive and the list for every person would be slightly different anyway. For example, I might tell you that it would be a good idea to learn how to change a tire, but if you never own a car and live in a place where car travel is unnecessary and rare, why would that be important? You should learn the basics.You should know how to start a fire and maintain & control it once you’ve done so.You should know how to cook basic foods.You should know the difference between poisonous and non-poisonous (for plants) and venomous and non-venomous (for reptiles).You should know how to properly communicate without the need of tablets/screens and through both the written and spoken word.You should know basic mathematics (A/S/M/D, percentages, etc).You should understand basic finance.You should learn to at least be able to keep yourself afloat in water (even better, learn to swim).You should learn the difference between love and lust.You should learn how to care more for at least one other person than you do for yourself. Like I said, this is not an exhaustive list, but it is a place to start. Perhaps people could add other items to the list in the comments… ",
            "date": "Answered November 10, 2017",
            "views": "28",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Suvvari Nanda Kishore",
                    "user_href": "/profile/Suvvari-Nanda-Kishore"
                },
                {
                    "user_id": "Duy Luu",
                    "user_href": "/profile/Duy-Luu-3"
                },
                {
                    "user_id": "Sagnik Chakraborty",
                    "user_href": "/profile/Sagnik-Chakraborty-62"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terry Loder",
                "href": "/profile/Terry-Loder"
            },
            "answer_text": "Beneficial as an advantage to you and all others is propelled by your station in life, though antlers to a deer means little to a squirrel even though generic applies to beneficial learning being the architect of what our society becomes. Although however so much significant generic has ot still means little to the squirrel, but the student of everything in my opinion is the architect of our development and his most beneficent subjects are psychology and philosophy. And it weren't for the architects of the genus all disciplines would be forlorn and forgotten in a short space of time, fortunately time is consistent with progress moving towards the determination of what we understand as beneficient, which may not be beneficial for the individual so the question is a bit ambitious. In my view of things that have been and will become because of the present Reality is ambiguous and so everything conceived by it must only be a shadow of itself, reflecting a lie in order to allow existence to correct what Reality passed down to become the newly acquired advantage of Reality as far as possibility allows, this is known as beneficial development the subjects of which are Philosophy and Psychology. ",
            "date": "Answered November 13, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sagnik Chakraborty",
                    "user_href": "/profile/Sagnik-Chakraborty-62"
                }
            ]
        }
    ]
}