{
    "title": "What is a comprehensive self-study curriculum for math? - Quora",
    "tags": [
        "Learning About Mathematics",
        "Teaching Mathematics",
        "Self Study",
        "Self-Teaching",
        "Mathematics Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Monika Rizova",
                "href": "/profile/Monika-Rizova"
            },
            "answer_text": "Let's suppose you have the Internet as the only source of materials. These are the sites I would use for start: 1. Khan Academy (from fundamentals to high school and beyond)2. Math is Fun - Maths Resources (covering many Math areas good to high school level - very well organized)3. Arithmetic Practice  (more basic math with a lot of exercises)4. Art of Problem Solving (online courses and many books - all paid) There is this tool that you can use for checking your solutions or getting them during your process of studying:- Computational Knowledge Engine (Step-by-step Mathematical solutions ) You can use this tool whether you need solving: Elementary mathematicsDiscrete mathematicsNumbersApplied mathematicsPlotting and graphsLogic and set theoryAlgebraMathematical functionsCalculus and analysisGeometryMathematical definitionsNumbers theoryContinued fractionsFamous math problems- pretty much everything you can imagine.. After coping with this material you can continue with Calculus. This is more advanced math requiring good books.   1. Calculus - H.Anton, I.Biven, S.Davis2. Calculus with analytic geometry - Robert Ellis, Denny Gulick The last area in more advanced math is Probability and Statistics. I recommend these books: 1. Applied Statistics and Probability for Engineers - Douglas C. Montgomery, George C. Runger2. А First Course in Probability - Sheldon Ross (Prentice Hall, 7th edition, 20052. Probability and statistics for computer scientists - Michael Baron Also there are many books for dummies, that can be very helpful.These resources should be more than enough to a very high level of Math knowledge. ",
            "date": "Answered June 17, 2015",
            "views": "32",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "T H",
                    "user_href": "/profile/T-H-318"
                },
                {
                    "user_id": "Liz Elliott",
                    "user_href": "/profile/Liz-Elliott-1"
                },
                {
                    "user_id": "Martin Kocev",
                    "user_href": "/profile/Martin-Kocev"
                },
                {
                    "user_id": "Ervah Azad",
                    "user_href": "/profile/Ervah-Azad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amar Doshi",
                "href": "/profile/Amar-Doshi-3"
            },
            "answer_text": "Please see my answer for a list of resources: Amar Doshi's answer to Can you provide me with sources to teach myself Maths from zero to hero? ",
            "date": "Answered June 27, 2019",
            "views": "363",
            "upvotes": "0"
        }
    ]
}