{
    "title": "What is some advice for someone in the 9th grade who has just started taking algebra? - Quora",
    "tags": [
        "Advice",
        "Academic and Educational Advice",
        "Algebra"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rachel Moore",
                "href": "/profile/Rachel-Moore-156"
            },
            "answer_text": "So you just started algebra, eh? I had to retake Algebra I in ninth grade. My school had a placement exam to determine what math class you belonged in, on which I scored a 30%. However, because I took Algebra I in eighth grade and the rest of my scores were above average, they gave me a pass and let me into Honors Algebra I. at the time, I thought it would be so hard that I would die. I didn't die. I am now in eleventh grade and taking AP Calculus AB, so I managed to improve my math skills quite a bit in two years. Here are my tips. Identify what aspect of math is most difficult for you. For me, it's the nitty gritty rules and details. I can understand a concept pretty easily, but I’ll forget that I have to carry the two. What helped me with this was reading the chapters in the textbook and copying the rules for whatever I was learning and putting them in the folder of my notebook. For you, it may be the broader concepts. To help with that, I recommend looking ahead in your textbook so that you can become familiar with what you are about to learn before you are thrust into example problems by your teacher. I've been there. Nothing is worse than following the steps that your teacher is giving but actually haveing no idea what is happening. This horrible situation can be avoided with looking ahead and giving your brain time to process more difficult concepts. Also… Don't stop trying to understand a concept just because you've already tested on it. Everyone know the feeling that they get when the teacher moves on to the next chapter, but they never understood the last one. It's kind of like this.  No!! I'm not ready!! But student, you must! Maybe it will take you longer than your teacher gave you to learn the material, but you can still learn the material. Math builds upon itself. What you leaned last chapter might be really important next semester, or next year. And besides; you'll see it again on your midterms and finals anyway, so study it again now so that you aren't cramming (and crying) the night before your exam. If you know the basics and do the aforementioned things, I don't think you'll have any problem with algebra. Have fun! ",
            "date": "Answered September 8, 2017",
            "views": "27",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hayley Grimes",
                    "user_href": "/profile/Hayley-Grimes-3"
                },
                {
                    "user_id": "Jonathan Rampagoa",
                    "user_href": "/profile/Jonathan-Rampagoa-1"
                },
                {
                    "user_id": "Buckspath .",
                    "user_href": "/profile/Buckspath"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Michi-Bee-1"
                },
                {
                    "user_id": "Peter Zellars",
                    "user_href": "/profile/Peter-Zellars"
                },
                {
                    "user_id": "Leonardo Aristokrat",
                    "user_href": "/profile/Leonardo-Aristokrat"
                },
                {
                    "user_id": "Christopher Reynolds",
                    "user_href": "/profile/Christopher-Reynolds-52"
                },
                {
                    "user_id": "Joshua Kaufman",
                    "user_href": "/profile/Joshua-Kaufman-15"
                },
                {
                    "user_id": "Reece Harvey",
                    "user_href": "/profile/Reece-Harvey-1"
                },
                {
                    "user_id": "Ryan Boyle",
                    "user_href": "/profile/Ryan-Boyle-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Lehar",
                "href": "/profile/Steven-Lehar"
            },
            "answer_text": "The secret to understanding algebra is to think of it in pictures. Imagine numbers as points on the number line. Imagine addition as moving to the right, subtraction is moving to the left. Multiplication is moving in jumps, division is splitting a distance into equal sub-intervals. The symbols that we shuffle around in equations are not the real math, they are just symbols to represent the math. But the real math is the mental images that you see when you understand the mathematical ideas. You have to “see the picture” in your mind to understand the math. ",
            "date": "Answered September 8, 2017",
            "views": "206",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hayley Grimes",
                    "user_href": "/profile/Hayley-Grimes-3"
                },
                {
                    "user_id": "Christopher Reynolds",
                    "user_href": "/profile/Christopher-Reynolds-52"
                }
            ]
        }
    ]
}