{
    "title": "What’s something new you learned today? - Quora",
    "tags": [
        "Learning New Things",
        "Learning",
        "Experiences in Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chinmay Dhake",
                "href": "/profile/Chinmay-Dhake"
            },
            "answer_text": "There is a new theory that I came across today, an I found it very interesting. It is titled as “Nervous system manipulation by electromagnetic fields from monitors.” Here it goes… The subject of mind control has been keenly contested for some time now. Mind or thought control is broadly defined as human subjects being indoctrinated in a way that causes an impairment of autonomy – the inability to think independently, and a disruption of beliefs and affiliations. Mind control was initially considered a mere conspiracy theory. During the early days of the term, its adherents believed a human’s mind could be controlled through the dissemination of propaganda messages to suit the person disseminating the message. Even media theories such as Agenda Setting, Framing and Priming supported the notion that the human mind could be controlled to think in a certain direction the media wanted. This, in theory, becomes possible through the messages the media disseminate to the public. As the media constantly bombard people with a specific message or idea, over time, people become addicted to it, adopting it as a reality. Of course, if this happens, it means the thinking faculties of people have been altered. However, mind control moved from mere communication messages of the media to something deeper after a shocking revelation. In 1999, the forensic psychologist Dick Anthony revealed that the United States Central Intelligence Agency (CIA) invented damning brainwashing techniques against communism during the Korean War. Anthony’s revelation led to further scrutiny of the CIA. It later emerged that the United States government had been experimenting on how to control the human mind immediately after the end of the Second World War. In 1945, the government secretly recruited many Nazi scientists, some of whom had been identified and prosecuted as war criminals during the Nuremberg Trials. The recruitment was code-named Operation Paperclip. The objective of Operation Paperclip was to tap into the knowledge of these Nazi criminal scientists. The Nazis were told that if they would agree and work for the United States government, the government would protect them from prosecution. The Nazis agreed rather than being sent to the gallows. After recruiting them into the United States, the government used the Nazis in many highly clandestine experiments. One of such experiments was how to control the human mind through technology and science. With the help of the Nazis, in the 1950s, the CIA and the Defense Department conducted secret research codenamed MKULTRA. The project was later renamed Project ARTICHOKE. The purpose was to study mind control, interrogation, behavior modification and related topics. When these secrets were made public, the CIA never contested them, except to say it discontinued the programs. But the big question here is: can we trust the CIA? What if they succeeded in inventing a technology to control the human mind with which we are unaware of? In 2013, the BBC published an article titled “Are we close to making human ‘mind control’ a reality?” In the article, it was said that Rajesh Raoa, a researcher at the University of Washington, had succeeded in playing a computer game with his mind without using any physical controllers. Mr Raoa’s invention convinced many researchers that mind control is no longer a conspiracy theory, that it is real. Some researchers expressed grave concerns about the invention of Raoa, saying it could lead to a Zombie apocalypse. “When we have full links into the brain directly and you can control someone like a robot then we might have problems,” said Dr Ian Pearson, a futurologist with a background in science and engineering. To further prove to you without any ambiguity that mind control is real, and that the technology to do the highly immoral, unethical and corrupt job is available, we look at something we have chanced upon on the internet. Media come across scientific research published on the internet with patent number US 6506148 B2. It is titled “Nervous system manipulation by electromagnetic fields from monitors.” The Abstract of the work reads: “Physiological effects have been observed in a human subject in response to stimulation of the skin with weak electromagnetic fields that are pulsed with certain frequencies near ½ Hz or 2.4 Hz, such as to excite a sensory resonance. Many computer monitors and TV tubes, when displaying pulsed images, emit pulsed electromagnetic fields of sufficient amplitudes to cause such excitation. It is therefore possible to manipulate the nervous system of a subject by pulsing images displayed on a nearby computer monitor or TV set. For the latter, the image pulsing may be imbedded in the program material, or it may be overlaid by modulating a video stream, either as an RF signal or as a video signal. The image displayed on a computer monitor may be pulsed effectively by a simple computer program. For certain monitors, pulsed electromagnetic fields capable of exciting sensory resonances in nearby subjects may be generated even as the displayed images are pulsed with subliminal intensity.” Now, to put the work in a simple context, let’s consider a simple definition of the nervous system. According to neuroscientists, the human nervous system controls everything from breathing and producing digestive enzymes, to memory and intelligence. In fact, the central part of the nervous system is the brain. If patent number US 6506148 B2 says that the nervous system can be manipulated by electromagnetic fields from monitors, need I not tell you that Your Mind is Being Manipulated with Monitors? Especially televisions, they have become deadly weapons to us. From the recent WikiLeaks Vault 7 disclosure, it emerged how the CIA used Samsung smart TVs to spy on people. From all indications, the United States government has secret technologies. The secret technologies are increasingly becoming embedded in most of the technology we use every day. This helps the United States government to maintain its hegemony over every being on this planet. The secret knowledge the Nazis had under Adolf Hitler is now in the hands of the United States, and is being put to use. From now on, never dismiss any conspiracy theory. Take your time to read about the theory, google the patent number US 6506148 B2 and do a little research about it first. Research on such topics shouldn’t be difficult since we are in the Information Age. ",
            "date": "Answered February 25, 2018",
            "views": "24",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ja Thy",
                    "user_href": "/profile/Ja-Thy"
                },
                {
                    "user_id": "Olajide Alabi",
                    "user_href": "/profile/Olajide-Alabi"
                },
                {
                    "user_id": "Ashva Sen",
                    "user_href": "/profile/Ashva-Sen"
                },
                {
                    "user_id": "Omkar Solse",
                    "user_href": "/profile/Omkar-Solse"
                },
                {
                    "user_id": "Rohan Mishra",
                    "user_href": "/profile/Rohan-Mishra-77"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashish Agrawal",
                "href": "/profile/Ashish-Agrawal-178"
            },
            "answer_text": "Nowadays we are surrounded by masks. Ever thought how the N95 masks work?  When we think about the functioning of masks, we assume them to work like sieve, which inhibit the entry of particles of some sizes but very small particles may still pass through them. But that is not the way N95 masks work. Filtering of very large size particle and very small size particles is easy, it is the medium size particles that are the issue. Surprised right? Why would filtering small particles be easy. The reason is that N95 mask acts more like sticky spider web rather than a sieve. The fibres which makes up the layer of N95 mask, keeps the particles stick to itself to avoid its passage. This is the reason the masks are to be disposed after use. The particles are so small in size that the force required to hold them on fibres is very less and hence particles stick to the fibre automatically once it comes in contact with it. Large sized particles have comparatively larger weight and tend to move in straight line and hence chances for them sticking to various layers of fibres and quite high. The very small particles have little weight and it gets bounced of by air particles and due to this moves in a zigzag fashion which is principle behind 'brownion motion'. This zigzag motion also has high chances to intercept the various layers of fibre. But the problem is with medium sized particles, they neither follow straight motion nor zigzag motion, they tend to move along with the air. Now, the air has the tendency to move around objects and same it does with the fibres and hence the medium sized particles have the highest chances of getting through. To overcome this problem, the fibres are permanently electrically charged ( like iron pieces could be permanently made magnet if kept in strong magnetic field, similarly fibres are made permanent electrically charged and this are called electranet). Due to the presence of electric field, the medium size particles gets polarised and stick to the fibre. The masks are called N95 because they can block 95% of this medium sized particles. The pandemic has lead to shortage of this ppe and hence health workers are told to reuse this mask which usually should be disposed. But washing it with normal procedure like washing with soap water or alcohol is not advisable as this will destroy the electric field capacity and defeat the purpose of mask. Hence, scientific community have given certain ways to disinfect the mask before reuse. ( UV-C radiation for example) FUN FACT 1- While the particle size of virus and bacteria may be small, the size of cough particle is large. The virus and bacteria do not transmit on its own but moves with cough particles and hence particles size of virus and bacteria is irrelevent but the cough particles size determines the efficiency of the mask. FUN FACT 2 - The design of masks (respirators) are taken from a bra cup design by Sophia Turnbull. P.S. - The quality of mask wont matter if the mask isnt wore properly. The mask should be worn such that it leaves no passage for entry of virus and is tightly held that way. ",
            "date": "Answered June 22, 2020",
            "views": "27",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Natashaefp Theodorovna",
                    "user_href": "/profile/Natashaefp-Theodorovna"
                },
                {
                    "user_id": "Sandy Patterson",
                    "user_href": "/profile/Sandy-Patterson-8"
                },
                {
                    "user_id": "Lucia Wallace",
                    "user_href": "/profile/Lucia-Wallace-4"
                },
                {
                    "user_id": "Steve Estes",
                    "user_href": "/profile/Steve-Estes"
                },
                {
                    "user_id": "Lyz Anne Hampton",
                    "user_href": "/profile/Lyz-Anne-Hampton"
                },
                {
                    "user_id": "Matt Porter",
                    "user_href": "/profile/Matt-Porter-68"
                },
                {
                    "user_id": "Donovan Minckler",
                    "user_href": "/profile/Donovan-Minckler"
                },
                {
                    "user_id": "Doug Manship Jr",
                    "user_href": "/profile/Doug-Manship-Jr"
                },
                {
                    "user_id": "Malky McEwan",
                    "user_href": "/profile/Malky-McEwan"
                },
                {
                    "user_id": "Kesavarapu Sateesh",
                    "user_href": "/profile/Kesavarapu-Sateesh"
                }
            ]
        }
    ]
}