{
    "title": "What are the best arguments for American exceptionalism? - Quora",
    "tags": [
        "\"U.S. is in Decline\" Theme",
        "American Exceptionalism",
        "Foreign Relations of the United States of America",
        "Foreign Policy of the United States of America",
        "Pros and Cons",
        "Culture of the United States of America",
        "International Relations",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce Watson",
                "href": "/profile/Bruce-Watson-23"
            },
            "answer_text": "The best arguments for American exceptionalism used to be true. In the late 18th and 19th centuries, America was unique among nations in having: one of the few democracies in the worldEnormous economic opportunityMore free land than most placesAn ideal, though not realized by all, of equal treatment under the law. Please remember I said \"an ideal.\"These days, however, these are hardly unique claims among the world's nations. Those who cling to American exceptionalism, alas, have not updated the arguments. They long for a fabled past, ignoring the huge social price it took on women, minorities, and immigrants. If we must think of ourselves as exceptional, what say we update the arguments? Today, I still think America is, if not exceptional, at least exemplary in that we have: a remarkably free pressMore tolerance than most nations toward individual differences,A spirit of individualism and opportunityAn optimism you simply don't find in many other countriesA vibrant culture that gave the world rock music, the blues, pop culture, blue jeans, etc.This country has long been the place the world's poor, disenfranchised, and rebellious have looked to for inspiration. It can be again. ",
            "date": "Answered April 19, 2018",
            "views": "540",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kes Sparhawk Amesley",
                    "user_href": "/profile/Kes-Sparhawk-Amesley"
                }
            ]
        }
    ]
}