{
    "title": "What type of ESL teachers do other ESL teachers dislike? - Quora",
    "tags": [
        "Teaching English as a Foreign Language (TEFL)",
        "English as a Second Language (ESL)",
        "Teachers",
        "Teaching"
    ],
    "response": [
        {
            "author_info": {
                "name": "Revel Arroway",
                "href": "/profile/Revel-Arroway-1"
            },
            "answer_text": "Hey. Over my 30+ years as an ESL teacher, I will admit to having some difficulties with certain types of teachers (and I am among that group, but don’t dislike myself!). Here are a couple of “types” that at times got my goat: “I speak English natively so I can teach it” I came upon these teachers mainly once I moved to Spain. These were “teachers” who were actually overstaying tourist visas and paying their way by giving the natives so-called “conversation classes”. These “teachers” basically placed an ad in a free ad paper or left a small poster at the local copy shop and then gave classes to their students by sitting with them, either in their homes (the student’s) or sometimes in public places like bars (the student always paying for the teacher’s coffee or beer!). Problem with this type of class was that the “teacher”, who usually lacked even the most basic concepts of pedagogy or ESL itself, so the “classes” were limited to the “teacher” talking 90% and overcorrecting the student’s broken English the other 10%. These teachers also tended to charge a great deal more than the average ESL teacher, which was damaging to those of us who made a living through private classes. They also soured many students to private classes, through the frustration of feeling that native private teachers where simply chatter boxes with no actual teaching experience. English Only teachers Related to the “I speak English” teachers, these can also be very well educated ESL teachers with both formal training as well as years of experience. And most who fall into this category are mono-lingual. While there are some cases in which using “English Only” in the classroom is beneficial, the true English Only teacher is often very pig-headed about the so-called method and students spend hours listening to someone blab away in a language they do not understand, knowing that important information is being shared, but unable to assimilate that information. I can’t think of any other broad types of ESL teachers that rubbed me the wrong way. There were individuals with horrible attitudes or personalities that just didn’t go along with education, but highlighting those would be nit-picking. I might add the “there’s only one way to speak English, and that’s the right way”, which I have actually seen some teachers say in forums, doesn’t matter where they are from, their English is the only correct English (and yes, this happens both with American and British teachers, though I’ve noted it more among Brits, that’s not statistically reliable). ",
            "date": "Answered October 2, 2018",
            "views": "293",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Susan Ma",
                    "user_href": "/profile/Susan-Ma-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abigail Fulbrook",
                "href": "/profile/Abigail-Fulbrook"
            },
            "answer_text": "There are a lot of ESL teachers in the world, even as the most passive person you’re likely to bump into someone who rubs you the wrong way. The teachers who are the worst (as people) are ones who: disparage the host country/ their students for things beyond their control, who assume everyone else hates teaching too, who put no effort into their lessons, and don’t care about their students. ",
            "date": "Answered October 1, 2018",
            "views": "211",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mihaela Praun",
                    "user_href": "/profile/Mihaela-Praun"
                },
                {
                    "user_id": "Evelyn Elwell Uyemura",
                    "user_href": "/profile/Evelyn-Elwell-Uyemura"
                }
            ]
        }
    ]
}