{
    "title": "What is creative destruction? - Quora",
    "tags": [
        "Creative Destruction",
        "Innovation",
        "Word Definitions, Terminology, and Jargon",
        "Entrepreneurship",
        "Economics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Baskerville",
                "href": "/profile/Peter-Baskerville"
            },
            "answer_text": "Definition‘Creative Destruction’ is a paradoxical term introduced to economic theory in 1942 by the Austrian economist Joseph Schumpeter (1883–1950). He used the term to describe the special form of economic growth that entrepreneurs particularly bring to the capitalist system. Schumpeter argued that it was the entrepreneur’s introduction of radical innovation into the capitalist system that was the real force that sustained long-term economic growth, even as it destroyed the economic value of established enterprises who may have previously enjoyed a degree of monopolistic power.  In Schumpeter’s mind, the net economic benefit from the radical innovation, in spite of the destruction of existing economic value, was greater than if the radical innovation had never been introduced. So, the term ‘creative destruction’ describes a process of creating net economic growth in the capitalist system where entrepreneurs create more economic value from their radical innovations than is destroyed as their innovation replaces and supplants the established way of doing things. Fundamental to Schumpeter's belief was that “The essential point to grasp is that in dealing with capitalism, we are dealing with an evolutionary process”  While not happy with his visioned outcome, Schumpeter believed that capitalism would ultimately be destroyed by its successes and that this ‘creative destruction’ was just part of the prognosis of capitalism’s future. His great defence of capitalism however, was built on the grounds that capitalism sparks entrepreneurship. He was one of the first economists to truly provide us with a clear concept of this term. His theory described the more expanded role of entrepreneurs as innovators not just inventors. He saw that entrepreneurs did far more than just invent as they introduced new means of production, new products, and new forms of organization. These innovations, he argued, take just as much skill and daring as did the process of invention. ‘Creative destruction’ and politicsToday “creative destruction,” is almost a throwaway line used by economists to describe the free market’s messy way of delivering progress. In his book Capitalism, Socialism, and Democracy (1942), Schumpeter wrote: “This process of Creative Destruction is the essential fact about capitalism.” In fact he described it as “the perennial gale of creative destruction”. Schumpeter saw that creative destruction provided a powerful force for making societies wealthier because it made scarce resources more productive as they flowed from the least to the more efficient industries. US house majority leader Dick Armey described Schumpeter’s theory when he stated \"The market must clean itself out by taking resources away from the losers, so it creatively destroys the losing companies and reallocates resources to the winning companies. That's really what's going on.\" Schumpeter saw that this ‘creative destruction’ that caused lost jobs, ruined companies, and vanishing industries was an inherent part of the growth system. He saw that societies that allowed ‘creative destruction’ to operate grew more productive and richer. While Schumpeter clearly saw that capitalism’s pain and gain are inextricably linked, politicians today are not so accommodating of the thought that some individuals (voters) would become worse off, not just in the short term, but perhaps forever.  There are new sirens of protectionism that are singing right around the world as today we face a second Global Economic Crisis. If Schumpeter were alive today he would be arguing that to try and preserve jobs or protect industries that have been ‘creatively destroyed’ will ultimately lead to stagnation and decline and so short-circuit the march of progress. ‘Creative destruction’, while obviously the better course in the economist’s mind, is never welcomed by those on the destructive side of the paradoxical term. For the disruption of lost jobs and shuttered businesses is immediate, while the payoff from ‘creative destruction’ comes mainly in the long term. As a result, politicians will always be tempted to block the process of creative destruction by implementing policies to resist this underlying economic change for the better. The ironic point of Schumpeter’s iconic phrase is this: societies that try to reap the gain of ‘creative destruction’ without the pain, find themselves enduring the pain but not the gain. Examples of ‘creative destruction’For an historical example of ‘creative destruction’ you need look no further than in transportation where jobs and industries relating to horses and mules were creatively destroyed by steam powered railways, which were creatively destroyed by automobiles incorporating the internal combustion engine which in some ways have been creatively destroyed by the jet engine airplane.  A more modern example is the way in which the iPod has creatively destroyed the CD. The iPod made listening to music more convenient in that there was a greatly reduced need to carry around replacement batteries, a heavy, bulky CD player or the user's entire CD collection. iPod’s emergence spurred the decline of CDs and in creating new economic value for the iPod destroyed the economic value of the CD. But on the whole, consumers and societies are now economically better off in satisfying more wants with lesser resources. Another evolving ‘creative destruction’ that is taking place before our eyes is in news. The immediacy, accessibility and low cost of online news is leading to the declining circulation of newspapers and a reduction in the number of broadcast news viewers. We are witnessing the creative development of a new industry as we watch the destruction of the old.  Maybe the former treasury secretary Lawrence Summers and his ex-deputy Bradford DeLong were right when they observed that \"the economy of the future is likely to be 'Schumpeterian'\"   Sourceshttp://www.wired.com/wired/archive/10.03/schumpeter.htmlhttp://www.econlib.org/library/Enc/CreativeDestruction.htmlhttp://blogs.vanderbilt.edu/writing/wp-content/uploads/2009/01/wilson-sarah.pdf ",
            "date": "Updated August 31, 2011",
            "views": "321",
            "upvotes": " View 58 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yair Livne",
                    "user_href": "/profile/Yair-Livne"
                },
                {
                    "user_id": "Benjamin Golub",
                    "user_href": "/profile/Benjamin-Golub-2"
                },
                {
                    "user_id": "Vignesh",
                    "user_href": "/profile/Vignesh-295"
                },
                {
                    "user_id": "Volen Vashev",
                    "user_href": "/profile/Volen-Vashev"
                },
                {
                    "user_id": "Summerikutha",
                    "user_href": "/profile/Summerikutha"
                },
                {
                    "user_id": "Sava Chankov",
                    "user_href": "/profile/Sava-Chankov"
                },
                {
                    "user_id": "Max Reydman",
                    "user_href": "/profile/Max-Reydman"
                },
                {
                    "user_id": "Chris Zintelis",
                    "user_href": "/profile/Chris-Zintelis"
                },
                {
                    "user_id": "Bart Zhang",
                    "user_href": "/profile/Bart-Zhang-1"
                },
                {
                    "user_id": "Sean Culey",
                    "user_href": "/profile/Sean-Culey"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Soroushian",
                "href": "/profile/John-Soroushian"
            },
            "answer_text": " Imagine you are a billionaire oil baron with a vast business empire and thousands of clients that depend on you. You are both feared and revered for your economic power. From a financial standpoint, life has never been better. Unexpectedly, a young entrepreneur discovers a way to create a renewable fuel that can be quickly mass produced. The no-name entrepreneur's fuel is cheaper and more efficient than your oil, but you dismiss it and don’t believe anyone would buy it. You are wrong and soon see all your clients abandon your oil for the new fuel. Your business’s revenues drop to zero and your oil fields become worthless. You watch your company go from being one of the most valuable companies in the world to being bankrupt, while you are forced to lay-off all your employees. How do you think you and your employees would feel? The new fuel has dramatically reduced overall fuel costs and benefited most of society, but it has also destroyed your wealth and cost your employees their jobs in the process. The tension between the wealth creation and destruction in this process is what creative destruction is about.  The term “creative destruction” was coined by Joseph Schumpeter in his book Capitalism, Socialism, and Democracy. According to Schumpeter, creative destruction is the “process of industrial mutation that incessantly revolutionizes the economic structure from within, incessantly destroying the old one, incessantly creating a new one.” Schumpeter believed this process helps drive economic growth, but that it would inevitably doom capitalism, because people would demand for more and more government intervention to stifle its disruptive nature. ",
            "date": "Answered May 4, 2018",
            "views": "163",
            "upvotes": " View 342 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alex Niu",
                    "user_href": "/profile/Alex-Niu-3"
                },
                {
                    "user_id": "Joseph Lopingco",
                    "user_href": "/profile/Joseph-Lopingco"
                },
                {
                    "user_id": "Kandaswamy Chandrasekaran",
                    "user_href": "/profile/Kandaswamy-Chandrasekaran"
                },
                {
                    "user_id": "Abdul Samim Khan",
                    "user_href": "/profile/Abdul-Samim-Khan"
                },
                {
                    "user_id": "Mike Montgomery",
                    "user_href": "/profile/Mike-Montgomery-59"
                },
                {
                    "user_id": "Adolfo Oubiña Neto",
                    "user_href": "/profile/Adolfo-Oubiña-Neto"
                },
                {
                    "user_id": "Danyel Kanlibicak",
                    "user_href": "/profile/Danyel-Kanlibicak"
                },
                {
                    "user_id": "Amogh",
                    "user_href": "/profile/Amogh-59"
                },
                {
                    "user_id": "Andre Alamillo",
                    "user_href": "/profile/Andre-Alamillo"
                },
                {
                    "user_id": "Raghvendra Thakur",
                    "user_href": "/profile/Raghvendra-Thakur"
                }
            ]
        }
    ]
}