{
    "title": "What are the best ways to avoid a car accident? - Quora",
    "tags": [
        "Auto and Traffic Accidents",
        "Driving",
        "Police and Law Enforcement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eddie Xue",
                "href": "/profile/Eddie-Xue"
            },
            "answer_text": "Here's a long list of advice and lessons I've received, with broadly applicable rules at the top and really specific ones at the bottom. Feel free to suggest edits.  Mentality0. Don't be cocky. You're not invincible, you or someone else could kill you at any moment.  Habits: 1. Follow at a proper distance (2 second rule), more at highway speeds and in bad weather. You're not wasting space here, you need enough room to react in case the car in front of you stops suddenly. 1a. Keep a safety margin on all sides - avoid being boxed in, don't drive in blind spots, position yourself so you can see the most road ahead (avoid follow large trucks)2. Scan the road ahead of you (10-15 seconds ahead) instead of staring in one place. Look for hazards and prepare by lane positioning and changing speed/gear3. Drive predictably and smoothly. Don't make impulsive moves. Impulse is when you forget to check your blind spots or forget that your car can't actually turn that fast.4. Check your mirrors occasionally to maintain observational awareness (peripheral vision works too)5. Use your turn signals. Signal at least 3 seconds beforehand11. Don't assume intentions. If someone waves you by double check to make sure there isn't a blocked lane. If someone signals a right turn, don't immediately jump in front of them. They might change their mind. 17. Avoid \"lazy steering\" with one hand all the time. It can make you more tired too since you aren't balanced. 13. Drive at a safe speed, flow of traffic usually works in urban areas. 14. Don't rage at people. Avoid honking since that pisses people off easily. 15. Turn your headlights on whenever it's cloudy, rainy, nighttime or 1 hour before sunset. (In California it's sunny enough to warrant the \"cloudy\" rule.) Headlights help others see you especially when there's glare. 8. Avoid unnecessary lane changes. Turn into the lane you want to be in next. In heavy traffic, don't change lanes every minute. Choose a reasonably fast lane and stay there8a. Don't change lanes right before an intersection (you might lose 1 second to react to a yellow light), or when other hazards are around8b. Check blind spots, but not when the space you're entering is \"protected\" i.e. dedicated left turn lane, new lane opening up9. Double check all stop signs you get to to make sure it's not actually a 2 way (where cross traffic doesn't stop)10. Make complicated manuevers slowly like parking in tight spots. If you tap a curb at 2mph there's going to a lot less damage than at 5 or 10mph. 12. Don't make blind turns. If you really can't see past a left turn area or there's too much cross traffic, make extra right/U turns. Even swapping a side street left for a main street or traffic light left can help. 12a. It's safer to make a left turn from a 2 lane road onto a 1 lane than the other way around (2 lanes of cross traffic vs. 4 lanes to wait for), and side collisions are much more dangerous than other types. 12b. Wait for all lanes to clear when turning at a stop sign or red light, or at least the nearest 2. Someone might change lanes into you. 12c. Keep your wheels straight when waiting for left turns. If someone rear ends you you won't be pushed into oncoming traffic. 12d. When turning left at a yield on green intersection, wait until you're SURE approaching traffic has stopped before turning. It's fine if you need to wait until the light turns red, you're not breaking any laws. 16. Use high beams at night when traffic isn't near. If you're going 55mph with low beams and no street lights you can barely see 2 seconds, which is not enough. 7. Pass on 2 lane roads only when you have enough room, and avoid in general. Your closing speed can easily reach 120mph on these roads and you need 12-15 seconds of room. If approaching cars aren't far away enough to appear almost still, it's probably too close. Use proper technique - downshift beforehand. 8. Freeway driving: Avoid changing lanes when the speed differential is large. Wait until their speeds match better, and leave a large gap in front of you so you can accelerate more beforehand (and have a cushion in case you suddenly need to brake again). 9. When merging onto highways match the speed of traffic in the right lane, usually 50-60mph is good. 10. Urban highways (4+ lanes) Don't stay in the right lane unless exiting within 2 miles, driving very slowly, or traffic is very light. People are always getting on and off, so this lane has the most weaving and most potential accidents.11. Highways in general: Select a lane that matches your speed and stay there. Don't hog the left lane. On 2 lane each way roads, stay in the right lane except when passing or about to pass. 12. If you're going above 40mph, drive with enough buffer to avoid braking. If you brake a lot either everyone is being really erratic or you're following too closely. If one car takes the gap in front of you that's 3 seconds lost, no big deal. And they might easily move out anyway. 13. When being tailgated, increase following distance slightly (by 1 second) but don't try to \"punish\" them. Move over to let them pass if you can. 14. Understand other vehicle behavior: Buses stop near intersections, taxis drive erratically and aggressively, garbage trucks stop constantly, etc.  Theory: 1. Recognize the most dangerous moments of driving and bad habits. Night driving has over 2x as many accidents per mile, for instance. 2. See the link at the end Driver Preparation: 1. Get enough rest.2. Don't be distracted. Don't text while driving. Pull over if needed to look at stuff, dial only one or two digits at a time on a phone. Even talking on a cell phone with hands free increases the chance of a risk vs. talking to a passenger for focus/psychological reasons. 3. Wear proper equipment. Drive barefoot rather than wear sandals. 4. Get yourself to chill somehow. Don't be nervous. 5. Learn traffic laws.  Vehicle Preparation:1. Get to know your car. How fast can you accelerate? How fast can you brake? Then stay well within the limits of your car. 2. Keep your car properly maintained: Tire pressure and fluids are the most important easily checked things.  This website is an excellent source, especially the segment on road and traffic managementhttp://www.drivinghandbook.co.uk/part4.htm#rtman ",
            "date": "Answered July 23, 2012",
            "views": "122",
            "upvotes": " View 94 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Siddiqui",
                    "user_href": "/profile/Siddiqui-3"
                },
                {
                    "user_id": "Tony Scott",
                    "user_href": "/profile/Tony-Scott-168"
                },
                {
                    "user_id": "John Davids",
                    "user_href": "/profile/John-Davids-39"
                },
                {
                    "user_id": "Mindy Jung",
                    "user_href": "/profile/Mindy-Jung"
                },
                {
                    "user_id": "Vanshikaa Raj",
                    "user_href": "/profile/Vanshikaa-Raj"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Platinum-Blitz"
                },
                {
                    "user_id": "Mohammed Haafiz",
                    "user_href": "/profile/Mohammed-Haafiz-1"
                },
                {
                    "user_id": "Anthony Smith",
                    "user_href": "/profile/Anthony-Smith-1389"
                },
                {
                    "user_id": "Jude Morgan",
                    "user_href": "/profile/Jude-Morgan-14"
                },
                {
                    "user_id": "John Elder",
                    "user_href": "/profile/John-Elder-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce A McIntyre",
                "href": "/profile/Bruce-A-McIntyre"
            },
            "answer_text": "There have been many very good answers here, (especially Eddie Xue  so I will try and make it simple here. When you are driving, you have to assume that every other driver on the road is an idiot and totally crazy. Yeah, I know that they all aren't, but the reality is that the one that hits you is an idiot and paying no attention to what they are doing. So it is your responsibility to stay out of their way. No, I don't mean stay off the road, but accept that this is a very dangerous environment. You have to be aware of the car that is two cars ahead, and the car that is two cars behind. Any time that you hit another vehicle, YOU ARE AT FAULT! You were not in complete control of your vehicle. That fact that the other driver was an asshole is no defense.  Never, EVER drive at a speed that puts you at risk. If you don't believe me, ask any professional race car driver. When are they paranoid when they drive? When they drive to or from the track. When they are on the track, they know that the other drivers are professional, and they are all running at an approximate skill level. But when he drives home, he can be victim of every asshole that is just not paying attention. Did you ever drive on a freeway, and see the guy driving beside you eating his breakfast, or even reading the paper? Did you ever try and drive during the \"rush hour\" when all of the people that are just too pissed off and distracted, so that they are nothing more than a guided missile? That's when the crazies come out. I raced SCCA when I was young, and that was a dangerous time, but all of the drivers were competent. Shit happens, but in most cases, if it was avoidable, it was avoided. Driving this way taught me to be a very defensive driver. Something else, I only ever saw one of the drivers I worked with that would not automatically put on a safety belt in his private car. And he got killed when a truck T-boned him.  Believe me, professionals want to stay alive. They will take calculated risks because they  know the skills and character of the drivers around them. So you want to run that red light because you \"know\" that no one is coming? Being a defensive driver is not \"stupid\" or \"scared.\" It is only smart. Always drive fully aware of the car two places in front, and two places behind, and look for the asshole coming in from left and right. That will keep you alive. And reduce your insurance costs. ",
            "date": "Answered February 15, 2016",
            "views": "17",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Siddiqui",
                    "user_href": "/profile/Siddiqui-3"
                },
                {
                    "user_id": "John Davids",
                    "user_href": "/profile/John-Davids-39"
                },
                {
                    "user_id": "Sohail Ahmed",
                    "user_href": "/profile/Sohail-Ahmed-7"
                },
                {
                    "user_id": "Joey Butner",
                    "user_href": "/profile/Joey-Butner"
                },
                {
                    "user_id": "Aseza Msutu",
                    "user_href": "/profile/Aseza-Msutu"
                },
                {
                    "user_id": "Rob Bruins Slot",
                    "user_href": "/profile/Rob-Bruins-Slot"
                },
                {
                    "user_id": "Kenny William",
                    "user_href": "/profile/Kenny-William-10"
                },
                {
                    "user_id": "Arvindh Kumar",
                    "user_href": "/profile/Arvindh-Kumar-4"
                },
                {
                    "user_id": "Skot Weiland",
                    "user_href": "/profile/Skot-Weiland"
                },
                {
                    "user_id": "Tan Yong Han",
                    "user_href": "/profile/Tan-Yong-Han"
                }
            ]
        }
    ]
}