{
    "title": "What is more worse, being in prison or going through military training? - Quora",
    "tags": [
        "Military Education and Training",
        "Prisoners"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rostislav Yemelyanov",
                "href": "/profile/Rostislav-Yemelyanov"
            },
            "answer_text": "I spent a year as a Conscript and a few months (4) in a ‘State’ prison. Both in Russia. The experience is actually remarkably similar. In both your reputation is largely what makes your experience. Prison is a bit easier since the likelihood that someone you know knows a guy that knows a guy and can vouch for you, Military - you are usually sent to bumfuck nowhere and have to get by on your own capabilities. Their’s some forced labor involved in both, the military had more of it. Prison was a bit more violent, but the punishment for violence was less severe. Fighting in Prison? ‘SHU’ like conditions for a week and reduced rations. Fighting in the Army? If your Officers are complete assholes, you are looking at a year in a Detention Battalion which is basically Prison on steroids. If they aren’t monsters, you are likely doing bitch-duty for a couple of weeks, usually 3 days at a time. To put into perspective what is involved in bitch-duty, you sleep about 2 1/2 hours a day and have to clean the barracks and adjacent territoy the whole day alternating with your partner, the one who isn’t cleaning stands on this stupid lil podium and greets any Officers/NCOs entering the Barracks. There’s also a lot more drugs and at far more affordable prices in Prison. Granted, Conscript is pretty different from Enlisted in the Military. So this experience will vary, as will the Prison. Fortunately enough for me, the pen was 99.9% white so it was pretty peaceful. Mostly just druggies and guys on fraud. Along with your usual gaggle of sexual deviants and deranged. ",
            "date": "Answered January 27, 2018",
            "views": "22",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Bulsa",
                    "user_href": "/profile/Jason-Bulsa-2"
                },
                {
                    "user_id": "John Smifyio",
                    "user_href": "/profile/John-Smifyio"
                },
                {
                    "user_id": "Jennifer Weaver",
                    "user_href": "/profile/Jennifer-Weaver-36"
                },
                {
                    "user_id": "Cassidy Potts",
                    "user_href": "/profile/Cassidy-Potts"
                },
                {
                    "user_id": "Scott MacDonald",
                    "user_href": "/profile/Scott-MacDonald-19"
                },
                {
                    "user_id": "Douglas Casey",
                    "user_href": "/profile/Douglas-Casey"
                },
                {
                    "user_id": "Roland van Kurland",
                    "user_href": "/profile/Roland-van-Kurland"
                },
                {
                    "user_id": "Darius Finner",
                    "user_href": "/profile/Darius-Finner"
                },
                {
                    "user_id": "Zoey Coen",
                    "user_href": "/profile/Zoey-Coen"
                },
                {
                    "user_id": "Y. Gonzalez",
                    "user_href": "/profile/Y-Gonzalez-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael W. Rickard II",
                "href": "/profile/Michael-W-Rickard-II"
            },
            "answer_text": "Can’t say which is worse, but you can’t get out of prison until you serve your time, whereas you can get out of the military if you can’t hack it. What happens when an attorney goes to federal prison? Check out my book about prison life Laughing All the Way to the Bank (Robbery): My Education in Con College. ",
            "date": "Answered October 8, 2017",
            "views": "198",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Steven Cateris",
                    "user_href": "/profile/Steven-Cateris"
                }
            ]
        }
    ]
}