{
    "title": "What are the best institutes to study BS Physics in Pakistan? - Quora",
    "tags": [
        "Pakistan Institute of Engineering and Applied Sciences (PIEAS)",
        "University of Engineering and Technology, Lahore",
        "University of the Punjab",
        "National University of Sciences and Technology, Pakistan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shaheryar Khan",
                "href": "/profile/Shaheryar-Khan-41"
            },
            "answer_text": "Short answer: Between LUMS and NUST, definitely LUMS for BS Physics.  Long answer : Even though NUST is one of the best universities for engineering in Pakistan, it is not very good for pure maths/sciences. And the primary reason is lack of good STUDENTS.  The student body of NUST mainly comprises of students from FSc/ Matric background which tends to be greatly biased against pure maths/science fields (I know, I am grossly generalizing; there are OF-COURSE exceptions. I'm just painting the bigger picture). Consequently, the top merit students pick Electrical, Mechanical, Civil, Software, or some other engineering. Who goes to BS Physics or BS Maths? Mostly those who could not get into engineering because of their low merit no but wanted to be a part of NUST anyway. I know that with an NET score of 156 you do not fall in this category; however, most of your peers would.  You may ask why this is important! After all it's the faculty and resources that actually matter but I'm willing to bet that your peers in your university will influence you more than you can imagine right now. These are the people you are going to spend next 4 years. If you join NUST for physics, expect to be surrounded by students who have little to no interest in their major. LUMS on the other hand does not face this issue. Every student in BS Physics can easily pick Electrical Engineering or CS but does not because he or she is interested in Physics. I'm willing to bet that you would find more enthusiasm about Physics in LUMS than in NUST. The only downside of LUMS is that it is extremely expensive compared to NUST.  You should also look into QAU. Recently a very smart friend of mine, Shahryar Khan, started BS Physics from QAU. He also was confused between NUST, LUMS, and QAU and eventually chose QAU. I'm sure he can share more relevant details. I'm tagging him in the hope that he can write something too.   Good luck with one of the most important decision of life. No pressure :)   ",
            "date": "Answered February 26, 2016",
            "views": "59",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shaheryar Khan",
                    "user_href": "/profile/Shaheryar-Khan-41"
                },
                {
                    "user_id": "Syed Tihaam Ahmad",
                    "user_href": "/profile/Syed-Tihaam-Ahmad"
                },
                {
                    "user_id": "Sadaf Tahir",
                    "user_href": "/profile/Sadaf-Tahir-8"
                },
                {
                    "user_id": "Laiba Masood",
                    "user_href": "/profile/Laiba-Masood-6"
                },
                {
                    "user_id": "Haleema Sadia",
                    "user_href": "/profile/Haleema-Sadia-306"
                },
                {
                    "user_id": "Shah Sahab",
                    "user_href": "/profile/Shah-Sahab-46"
                },
                {
                    "user_id": "Aashir Khan",
                    "user_href": "/profile/Aashir-Khan-53"
                },
                {
                    "user_id": "Talha Mahboob",
                    "user_href": "/profile/Talha-Mahboob-4"
                },
                {
                    "user_id": "Maryam Navid",
                    "user_href": "/profile/Maryam-Navid"
                },
                {
                    "user_id": "Shahryar Khan",
                    "user_href": "/profile/Shahryar-Khan-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Uzma Naz",
                "href": "/profile/Uzma-Naz"
            },
            "answer_text": "I would say QAU. It has one of the best faculty in natural sciences and specially physics. The research output in the subject is the highest in Pakistan. Moreover, the following link shows QAU as the best Physics institute in the country.   Top Universities for Physics & Astronomy in 2015  As per my knowledge, NUST hasn't developed as much in natural sciences as it has in engineering. It's going to take some time to reach that level.I am not sure about LUMS but I believe they must have a pretty good setup.   Finally, it is recommended to explore each institute's Physics program thoroughly. Check out the faculty, publications, laboratory status, etc. It will be better if you can visit as it can provide you with a much better and clearer idea of what to choose. Good luck! Footnotes: Quaid -i- Azam University  Home | Physics  Department of Physics  ",
            "date": "Answered February 27, 2016",
            "views": "41",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Syed Tihaam Ahmad",
                    "user_href": "/profile/Syed-Tihaam-Ahmad"
                },
                {
                    "user_id": "Haleema Sadia",
                    "user_href": "/profile/Haleema-Sadia-306"
                },
                {
                    "user_id": "Liaqat Ali",
                    "user_href": "/profile/Liaqat-Ali-196"
                },
                {
                    "user_id": "Talha Shahid",
                    "user_href": "/profile/Talha-Shahid-14"
                }
            ]
        }
    ]
}