{
    "title": "What are the differences between university in the US and the UK? - Quora",
    "tags": [
        "British/American Differences",
        "Colleges and Universities in the United Kingdom",
        "College and University Comparisons",
        "Colleges and Universities in the United States of America",
        "Comparisons",
        "The United Kingdom"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kaitlyn Hanrahan",
                "href": "/profile/Kaitlyn-Hanrahan"
            },
            "answer_text": "I'll give the American perspective to complement Andrew Crawford. I think the biggest difference is the price. American's laugh at what European's consider \"expensive private universities\". I probably spent over $1k some years on textbooks. Tuition? Here are some prices: My school, Northeastern, a good school but not one of the 7 ivy league schools. Tuition link: Page on northeastern.edu It's $21,267 per term (meaning each spring or fall semester, there is a lower rate for shorter summer terms). Times 4 years with two semesters per year, that is $170,163 for a degree (Northeastern actually encourages students to spend 5 years there taking 3 6-month breaks for full-time internships, but this works out to the same amount of in-class time as the standard 4-year system, otherwise the degrees wouldn't be accredited, but pay no attention to this, it is not typical of American Universities). This does not include housing, or any other expenses. Here is a list provided by Northeastern on some yearly expenses a first year student can expect: Tuition $42,534Student Center Fee $140Student Activity Fee $120Undergraduate Student Fee $490Campus Recreation Fee $92Residence Activity Fee $64Standard Double Room $7,78015 Meal Plan $6,270 The most respected list of US University rankings is the US News and World Report. They also supply yearly tuition and fee numbers:US News Best Colleges For comparison, Andrew seems to be right about UK schools having government standardized tuition costs. Universities there are allowed to charge students up to 9,000 pounds per year, since 2012. Not all charge the maximum, but many do. Tuition fees in the United Kingdom So now, assuming that spending an extra $100,000 on your education has not sent you running. I'll touch on some other things that I think might be differences. But since I only went to university once, and that time was in the US, it is all \"normal\" to me so I can only guess at what might not be to an outsider. Everyone does 4 years. In the US, when we talk about University, we are normally talking about 4-year \"bachelor\" degrees. Often shorted to a BA (Bachelors of Arts) or a BS (Bachelors of Science). There is also a 2-year Associates Degree. This degree has largely fallen out of fashion. I think the only people who still get Associate Degrees are those who go to Community Colleges -- see following section. I live in Italy now, and there every field of study requires a different amount of years. I don't know if the UK does this, too. But I thought it worth mentioning.  Graduate School / Graduate Degrees are any degree after your Bachelors. When working on your bachelors, you are an \"undergraduate\" after you are a \"graduate student\". Grad degrees come in Master and Doctorate flavors. A Masters is normally 2 years of study after finishing your Bachelors. Some students commit to getting both a bachelors and masters at once (at age 18) then take some of their normal undergrad classes at the grad level. They normally then finish both in 5 years. Many universities offer these combined programs. To be a doctor (in anything) you need a phd. This is typically generalized to 6 years more after a bachelors or 4 years more after a masters -- but it can vary a lot. If you want to be a medicine doctor, you will also have a few years of residency. As I'm not in Medicine, I don't know much about this. Besides a doctor's residence, Lawyers need to pass the bar in any state that they wish to practice law, Accountants need to pass a CPA exam, nurses a nursing exam, and many other professions also require supplementary exams.  For all of these, I'm saying years, but it is of course credits that matter. These are the standard times, but if you under-load your course schedule or fail a class, you'll take longer. If you overload and test out of a few classes (via AP Exams), you can finish early. Students who transfer from one school to another often need an extra year to catch up. It is very common to go to Community College, which is cheaper, for your first two years then finish your last two at a better school. Your degree will only say the place where you graduated. However, students who do this often have to re-take so many classes (the second school doesn't recognize credit for some courses) that they don't save much money in the end. It does work well with Community Colleges that have relationships with State Universities in the same area, and the administrators at the Community College can help you manage your schedule to avoid losing credits when you transfer.  Sidebar on Private, Public, and Community Colleges.I'm assuming that anyone weighing the options between US and UK colleges is not interested in Community College, but let me explain what it is.  First off, Americans use the words \"College\" and \"University\" almost interchangeably. For a College to call itself a University, it must offer graduate (after Bachelors) degrees. A few Universities (particularly very old women's colleges) now offer graduate programs and are considered VERY good schools, but have kept their name as ___ College for historical reasons. In general, if you hear an American say \"College\" just change it in your head to \"University\".  A private university is generally speaking considered more expensive. A Public University sounds funny to my ears, but I guess it's basically a State University. State Universities typically offer a largely reduced tuition for residents of the state (how long you need to be a resident depends on the state). The biggest and most reputable (IMHO) State University system is the California one, including the likes of University of California Berkeley. The difference between state and private is at the administrative level, and not really relevant to the student. These two categories only matter is you are considering two similar schools, one state school in the state you grew up in and one that is either out of state, private, or both. Then the second school may cost WAY more than the first for you. These State schools are not to be confused to Community Colleges. Community colleges normally only offer Associates Degrees (2-years). There are not likely to be any on-campus housing, these are meant for people who live in the same county after all. There probably isn't going to be any sports team, or greek life, etc. It's more \"practical\". Many of the students will be adults, finding time later in life to get their education. These are considered less prestigious.  For profit schools are another animal all together. These are non accredited institutions that mostly just want money. A British comedian on American TV's perspective:     Rounding your education. As a Computer Science and Information Science Dual major at Northeastern, I had exactly 2 \"General Elective\" credits, I used them both to study Italian. I had exactly 2 \"Arts and Science Electives\" -- I took Macro then Microeconomics. My other classes included one science requirement (I took Biology 101). Every other single class I took was directly related to my majors and required. Now, I'm a little extreme, my dual degree took away electives that I otherwise would have had to study History or whatever else struck my fancy. But it's not as \"general study\" as you might think even with just a single major. At the other extreme is the \"Liberal Arts College\". Wikipedia can describe this better than I can: Liberal arts collegeI think this might be what other answerers are thinking of when they say American schools are more about general study.  Outside the classroomFrom what I've gathered from non-Americans, American Universities are bigger into college life outside the classroom.  We have student groups ranging from A cappella to ski club to out doors club to university chapters of professional societies to board gaming clubs to video gaming clubs to literally anything you can think of because most universities will let any group of 8 students start an official club.  Greek life was already mentioned. It can range from very important, like you *have* to be a member of a frat or sorority, to there not being a greek system at all at the university. My school was in the middle, we had them but they were not a very visible part of student life. Sports. College sports at top sports schools (a different and not related rank from academics) feed directly into the Pro's. They're a big deal at these schools and still a somewhat big deal at lower ranked schools.  Drinking.Most US undergraduates are below the legal drinking age until the very end of their degree. This does not slow them down. In the US, college undergrads are considered the population who drink the MOST. Cops can break up a party, but they can't break up many of them. And you're not buying each drink at these parties, like you would if you went out to a pub. At most college parties you pay $5 (maybe gone up with inflation since my day?) at the door for a red Solo cup that you refill with cheep bear from a keg all night long. From everywhere I've traveled, the UK drinking culture is the most similar to the US. But student in the US, normally living away from their parents for the first time, are anything but slowed down by the legal drinking age being 21.  Internships. Americans are really pushed into internships. My school actually had them be required. If you graduate without any work experience, you are considered behind. I think, but I don't know, that all of Europe does Stage (their word for internship) AFTER they finish their degree. Really weird to me.  UPDATE to complement Andrew Crawford's update: Payment and quality of internships varies a lot. As a Computer Science major I made $15 per hour at my first internship, for my second I was in Italy and just given a stipend at the end, and $29 per hour on my third -- all full-time 40hr/week jobs while I was not enrolled in classes. This was the 2000's, salaries have gone up of course. In contrast, the Music Industry majors at Northeastern were told not to expect to get paid internships -- we actually call them co-ops there and at some other schools. I was given more \"compartmentalized\" low-risk projects, but otherwise worked along the normal/regular employees just like I was one of them, except everyone knew I was just there for 6-months. Northeastern, my university, had to approve our co-ops and they were supposed to be related to our majors. CS had an easy time finding these, other fields had a harder time -- just like the real world! Haha. Friends outside Northeastern got shorter summer internships or part time ones while they were still in classes. It's typical enough for \"the intern\" to mostly make coffee and photocopies.  Grades.Andrew is right, we mostly use a A, B, C, D, F system for both grade school and university. F is for failure. C is supposedly \"average\" but it's not really \"good\" so I think B's are probably the mode grade. These are typically assigned 100-90% A, 89-80% B, 79-70% C, and 69% below is a failure. These are also normally broken down into plus (ex A+), regular (ex D), and minus (ex C-) flavors. Some schools don't like the system and make up their own. Obviously this is all very subjective, so your rank is normally taken into account when applying to university, grad school, medical residencies, and any academic endeavor where grades are considered. So if you're ranked #100 in a class of 1,000 students, you're in the top 10% of your class (barely). Combine this with the school you go to (ex top 10% at Northeastern would be impressive, top 10% at Harvard would be much more impressive), and you have a pretty good idea of a person's academic level.  </update> Quality. Many of my professors were European, and they said that the American university system was much better than anywhere else. I have no idea, having only done it once.  One key difference I've noticed at least with the Italian system is that the Italian system is all about exams. I don't know if the UK is like that, too. For US universities, each professor decides how their course will be graded. She may make it 50% the midterm exam, 50% the final exam, but that is kind of extreme. Normally there is coursework (homework), smaller exams, and even attendance that all get weighed in to make your final grade (they let you know the first day of class). This makes you work really hard all term long, rather than just study a ton before the exam at the end. I think it's better. It may not be as unbiased as giving everyone standardized exams, but being unbiased at this point in your life doesn't matter. No one has ever, EVER asked to see my grades from university. Since the day I graduated all that has mattered is what I know, my reputation, and my professionalism.  Best of luck! ",
            "date": "Updated January 29, 2015",
            "views": "58",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lalit Krishna",
                    "user_href": "/profile/Lalit-Krishna-13"
                },
                {
                    "user_id": "Amirali Monshizadeh",
                    "user_href": "/profile/Amirali-Monshizadeh"
                },
                {
                    "user_id": "Sanjay Jori",
                    "user_href": "/profile/संजय-जोरी-Sanjay-Jori"
                },
                {
                    "user_id": "Elton Zack Welford",
                    "user_href": "/profile/Elton-Zack-Welford"
                },
                {
                    "user_id": "Muhammad Zaman",
                    "user_href": "/profile/Muhammad-Zaman-4"
                },
                {
                    "user_id": "Arul Asveen",
                    "user_href": "/profile/Arul-Asveen"
                },
                {
                    "user_id": "Simon Todd",
                    "user_href": "/profile/Simon-Todd-8"
                },
                {
                    "user_id": "Syed Yusuf Ali",
                    "user_href": "/profile/Syed-Yusuf-Ali"
                },
                {
                    "user_id": "Laura Ochoa",
                    "user_href": "/profile/Laura-Ochoa-6"
                },
                {
                    "user_id": "Rushabh Shah",
                    "user_href": "/profile/Rushabh-Shah-112"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Crawford",
                "href": "/profile/Andrew-Crawford-3"
            },
            "answer_text": "I can't tell from the question whether the OP would prefer a US or UK focussed answer. I'm British so the following is UK-focussed. For starters we don't have fraternities or sororities in the UK. We have 'societies' but for the most part this is just a loose association of people who occasionally go drinking together and not taken too seriously. Sports societies do practise hazing, but they have limited means to do so (too many people have accidentally died as a result of sports initiations). Speaking of drinking, the legal drinking age in the UK is 18, the age at which everyone bar a handful of prodigies starts university. So there's a lot more drinking. Each university in the UK has a Students' Union (in some places, like my alma mater, this is called the Guild of Students) to represent the interests of the students. These all report to a national council called the National Union of Students (NUS). Staying in on-campus accommodation is uncommon after the first year. Normally students rent a house together with a few friends they've made in their first year. Having a roommate is relatively uncommon in most universities - most student rooms are single-occupant. There is also no requirement to study both a major and minor subject. A great way to confuse a British student or graduate is to ask, \"What's your major?\" as the vast majority of students study only one subject, or a 'combined honours' course made up of two related, compatible subjects in equal measure (e.g. Politics and International Relations). However there is some flexibility, depending on the university - a friend of mine planned to be a teacher and was able to fill one quarter of her credits with teacher training modules. This is at the discretion of your faculty. The exception is Scottish universities, where students are conventionally expected to take a break in their third year (of four) and study something else that doesn't have to be related to their main degree. Crucially there are no 'private' universities in the UK - all are public and, as far as I'm aware, all charge students the same amount. This means that there are no scholarships, but there are grants and other public funds available to applicants from less privileged backgrounds. The cost of university has risen twice since I started way back in 2004. Since both of my parents were retired and thus had no salary, I was entitled to grants and paid just ~£100 of ~£1,100 per year. It tripled two years later, and tripled again in 2010. However even at nearly £10,000 per year, university in the UK remains cheaper than many American universities. Student loans are also different. The government is in charge of the loan system, the interest rate is tied to inflation and there are a number of seemingly-generous rules about when and how you need to start paying it back (e.g., if you don't earn at least a certain pre-tax amount within ten years, the loan is written off). Also it doesn't affect your credit rating. This means that UK graduates leave uni mostly free from back-breaking debt. Update I can now expand my answer a little, thanks to Kaitlyn Hanrahan. \"College\"In the UK, college usually refers to secondary education, specifically the final two years of high school. It may also mean a private institution offering vocational training, e.g. Kaplan, or an adult education centre. No college ever offers an undergraduate degree, but I think some teach courses that can count towards university credit. Thanks to a lot of American TV and movies, most people are comfortable with college = university, but what's sometimes confusing is when US students refer to their university as \"school\". For Brits, school ends at age 18 and uni is a different beast altogether. CreditAt British universities there are 120 credits in a year, usually broken down into four modules of 30 credits each. There are smaller classes worth 15 credits, and double modules worth 60, as well as other combinations. DurationUniversity in England and Wales lasts 3 years. This is because undergraduate courses in the UK are focussed on only one major subject. Scottish universities, as mentioned above, offer a slightly more general education and so last four years.It is possible to take a significant minor subject, which would extend the duration of your studies. To graduate you need a minimum number of credits in your main subject - I think 300. So if you add an extra year, you'll have 480 credits with 180 to indulge in other interests. It has been known for people to take liberties with this and keep studying forever. We had one guy in my department who had been attending the university for nearly 10 years. The faculty made the decision to just graduate him (they were kind of sick of him). Grad and Post-GradMost university students in the UK finish after three years with a bachelor's degree, BA or BSc. As far as I know there are no dedicated \"graduate schools\" for master's degrees - most UK universities offer master's programs as well as bachelor's. Typically a masters course takes two years, but sometimes less depending on the applicant. A Phd takes around five years.Some universities offer highly specialised combined bachelors-masters degrees. These usually take four years and the student finishes with and MA or MSc. Oxford and Cambridge do this with most subjects, and my university offered a four-year masters course in physics since we had a shiny well-funded physics department. InternshipsKaitlyn mentioned this so I'll give the UK perspective. Internships (we do call them that) are fairly rare, and often a little controversial since they are generally unpaid so that some companies use them as free labour. Most degrees don't require them, though naturally they can make a graduate more attractive to employers. Some courses do require them, for example my brother studied finance and was required to arrange an internship in a financial institution, and I believe most law students are expected to gain vocational experience while studying. GradingUS universities, I believe, are graded A - D, A being the highest. UK universities are different: \"First\" = top grade, >70%\"2:1\" = good, >60%\"2:2\" = adequate, >50%\"Third\" = Poor, >40%Fail = you done messed up, <40% I have heard that it is much harder to get the top grade in the UK than it is in the US. Most people gain a 2:1. Some employers even prefer this, as having a first class degree is seen as an indicator of a poorly-rounded individual. ",
            "date": "Updated January 26, 2015",
            "views": "152",
            "upvotes": " View 38 Upvoters",
            "upvoters": [
                {
                    "user_id": "Awais Ahmed",
                    "user_href": "/profile/Awais-Ahmed-110"
                },
                {
                    "user_id": "Lalit Krishna",
                    "user_href": "/profile/Lalit-Krishna-13"
                },
                {
                    "user_id": "Kofi Chandler",
                    "user_href": "/profile/Kofi-Chandler"
                },
                {
                    "user_id": "Amirali Monshizadeh",
                    "user_href": "/profile/Amirali-Monshizadeh"
                },
                {
                    "user_id": "Addie Arte",
                    "user_href": "/profile/Addie-Arte"
                },
                {
                    "user_id": "Forbes Lopez-Forbes",
                    "user_href": "/profile/Forbes-Lopez-Forbes"
                },
                {
                    "user_id": "Sarah Noah",
                    "user_href": "/profile/Sarah-Noah-2"
                },
                {
                    "user_id": "Peter Ackroyd",
                    "user_href": "/profile/Peter-Ackroyd-1"
                },
                {
                    "user_id": "Juan Cook",
                    "user_href": "/profile/Juan-Cook-9"
                },
                {
                    "user_id": "Leonard Hawkins",
                    "user_href": "/profile/Leonard-Hawkins-9"
                }
            ]
        }
    ]
}