{
    "title": "What are the top engineering colleges in the UK? - Quora",
    "tags": [
        "Engineering Students and the College and University Experience",
        "Software Engineering Education",
        "Computer Science Students",
        "Facebook Engineering",
        "Engineering Colleges",
        "Studying Abroad",
        "Computer Science Education",
        "Software Engineering",
        "The College and University Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Smith",
                "href": "/profile/Andrew-Smith-3006"
            },
            "answer_text": "I’m guessing you mean University rather than College? College in the UK is equivalent to the last 2 years of American high school, usually. There are roughly 30 universities in the UK that offer degrees at a similar top quality. Depending on the discipline of engineering you might get 10–20 which stand out amongst those 30, where disciplines offered by relatively few universities such as Biomedical will have ~10 top grade unis, and something like Mechanical will have more like ~20, maybe slightly more. Amongst those top X, it’s really down to the person as to which is best. Each uni will have different teaching styles, different environments, different opportunities but give a similar quality degree. So you need to figure out the best combination of those for you. For example some people don’t get on well with the collegiate teaching of Oxford and Cambridge, or they might not like living in a big city like London for Imperial or equally a smaller one like Durham, or they might be very interested in automotive engineering in which case they should find somewhere which does Formula Student. ",
            "date": "Answered September 13, 2017",
            "views": "170",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shubham Fialoke",
                "href": "/profile/Shubham-Fialoke"
            },
            "answer_text": "UK has some top class universities for engineering and sciences (in general) such as:1. Imperial College London2. Cambridge University3. University of Bath4. Cardiff University5. University of Leeds6. University of Edinburgh7. Cranfield University 8. Sheffield University9. Loughborough University 10. University of Manchester 11. University of Warwick 12. University of Southampton 13. Queen's University Belfast 14. Bristol University 15. University of Nottingham ",
            "date": "Answered August 29, 2015",
            "views": "792",
            "upvotes": "0"
        }
    ]
}