{
    "title": "What happens in a tutoring session? - Quora",
    "tags": [
        "Online Tutoring",
        "Tutoring"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yunlok Lee",
                "href": "/profile/Yunlok-Lee"
            },
            "answer_text": "Answer: A tutorial session can be referred to a study session at college or university, where following each lecture, such a session is scheduled for a smaller group of 12 to15 students, to discuss a set of questions relating the a given lecture’s topic. Conducted by a tutor, this study session provides opportunities for students to do some further readings, thinking on the topic, and it also allows them to prepare answers to the set tutorial questions, before hand, where these will be discussed in the tutorial. The tutor will lead in the tutorial session, and students will be encouraged to particapte, and ask further questions on the topic, to gain further explanations if unsure, thus, helping them to improve their understandings on things being taught in the lecture. As such, this is another learning session for the students, besides lecture. A tutoring session can be referred to a music learning session, where a student is taught in a musical instrunent by a music teacher in an musical instrument. It can also be referring to a learning session of a given course such as computer, painting, cooking, where are a smaller group of learners are taught the knowledge and the skills of these courses by a teacher. All thd best. ",
            "date": "Answered March 24, 2020",
            "views": "74",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Gene Crawford",
                    "user_href": "/profile/Gene-Crawford-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Taylor",
                "href": "/profile/Jonathan-Taylor-79"
            },
            "answer_text": "A more specific question would be helpful. I'm not sure if your asking as a potential tutor or a student. You create a comfortable environment and make the student feel comfortable to ask you questions. Depending on the subject the student will offer up questions. It is then the job of the tutor to explain the idea in a simpler manner. Break the idea down until it is understood by the student. Creation of notes is appreciated and the cleaner they are the better as the notes are usually offered to the student. Students will most likely have current work. The idea is to help not to do homework. The work problems are an avenue to the end goal of the student no longer needing your assistance. ",
            "date": "Answered March 23, 2020",
            "views": "29",
            "upvotes": " View 1 Upvoter"
        }
    ]
}