{
    "title": "What is the best age to teach a child how to swim? - Quora",
    "tags": [
        "Swimming Lessons",
        "Teaching Children",
        "Swimming",
        "Aging",
        "Children"
    ],
    "response": [
        {
            "author_info": {
                "name": "J L Van Dijk",
                "href": "/profile/J-L-Van-Dijk"
            },
            "answer_text": "Teach them before they start school, at the latest. You never know when swimming skills might save a child's life. I had often wondered whether the cost and effort of lessons was worth it for my older son, who seemed to learn swimming very slowly. When my son was 4½, my husband took him interstate to visit family. He was playing with his cousins on a long pier when he slipped on a crab and fell into the river, which was thirty feet deep. The adults were quite a distance away and the water was dark and muddy. A few months earlier my son would have panicked, but this time he deliberately pushed himself up toward the surface and began dog-paddle. His quick-thinking 12-year-old cousin fished him out of the water, and by the time the white-faced adults had reached his side, my son was fine. He told his father he had been scared, but he had known what he should do. In such deep, murky water, he probably would have drowned without that confidence and ability. The cost and effort of swimming lessons has been well worth it for that one event alone! Both my sons began swimming lessons when they were three years old. In each case, there were children in the class who had taken swimming lessons since they were babies. I couldn’t see any difference in the swimming ability of those who started as babies and those who began as toddlers, but those who had taken lessons since babyhood were much more comfortable in the water. Both my children were scared of the water to begin with, especially putting their faces in the water, and it took some time to get them accustomed to it. However, considering the cost of weekly swimming lessons for two children from infancy, I’m happy that we waited. I think it’s a good idea for children to be used to putting their face under the water before they start lessons. That will ensure you don’t waste paid lessons mastering that basic skill. Don't wait too long, though—getting lessons while the child is young might save your child’s life. ",
            "date": "Updated November 3, 2016",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jasmine Madison",
                    "user_href": "/profile/Jasmine-Madison-14"
                },
                {
                    "user_id": "Stijn Hommes",
                    "user_href": "/profile/Stijn-Hommes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laura Ringle",
                "href": "/profile/Laura-Ringle"
            },
            "answer_text": "I taught my son when he was 5 months old because I had a swimming pool available. I taught my daughter to hold her breath in the bathtub until she could float on her back in the tub at age 2. I was so glad i taught them so young, because i was visited by a girl i went to school with when my kids were 2 and 6. She had lost her child to a drowning just a couple of years before that. She was teaching her child to swim, i I want to say the child was 6. She was watching her, and had to turn her head for a moment and thats all it took. Seconds. You can blow in a newborns face and it will suck in air. Thats when you dip them underwater and bring them straight up. Try blowing a few times and watch them inhale a huge gulp of air. But it only works when they are brand new to a few months old. They lose the instinct before they are one. If they are older you can practice blowing bubbles in the bath water with your mouth. Tell them they are little motor boats. I taught most of the kids at our pool to swim and dive in a summer. I would never want you to feel the pain and guilt my friend felt. Water can be their friend. If you have trouble washing their hair get a washrag or towel ready and tell them to look at the sky while you pour water over their heads. If you run a shallow bath tell them if they lay on their backs and get their ears in the water they can hear their heart beat and hear their lungs breathe. Help them float on their backs while they do it. That gets their hair all wet for you, and you're not lying to them. You can hear it if it's quiet. It gives them an interest so they aren't focusing on water in their face. And you've got the towel handy if they do get water and want to dry. I just splashed water in my face and eyes so they would see I could still breathe and see just fine. I just had to blink. If you bathe kids together to save time at night, you can do everything in the tub i mentioned with 2 kids and it will take less time than if you're fighting them to get their hair washed. It's all calm. As they age you can let them take turns seeing who can hold their breath longer…in or out of the water. They learn to count, its fun, you dont dread it and you arent STRESSED…a wonderful thing for tired parents dying to get the kids to bed so they can get to bed. And the biggest benefit is knowing you've trained them to jold their breath, and hopefully float on their back. Its unlikely for anyone to drown if they can float on their back. A lady was missing from the campsite when all her friends woke up after a night of partying. Apparently she had gotten up to potty during the night, passed out in the water, and was found by the park rangers asleep, floating on her back in the water, where she had been they surmised for 8 hours. This was a lake in Texas. ",
            "date": "Answered December 26, 2018",
            "views": "28",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Randall Brooks",
                    "user_href": "/profile/Randall-Brooks-1"
                },
                {
                    "user_id": "Garren Du",
                    "user_href": "/profile/Garren-Du"
                },
                {
                    "user_id": "Jasmine Madison",
                    "user_href": "/profile/Jasmine-Madison-14"
                },
                {
                    "user_id": "Derek Bedell",
                    "user_href": "/profile/Derek-Bedell-1"
                },
                {
                    "user_id": "Emmaleigh Norton",
                    "user_href": "/profile/Emmaleigh-Norton-1"
                },
                {
                    "user_id": "Janet Miller",
                    "user_href": "/profile/Janet-Miller-203"
                },
                {
                    "user_id": "Mark Perry",
                    "user_href": "/profile/Mark-Perry-84"
                }
            ]
        }
    ]
}