{
    "title": "What are the benefits of going to a liberal arts school versus a university? - Quora",
    "tags": [
        "Liberal Arts Colleges"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas L. Johnson",
                "href": "/profile/Thomas-L-Johnson-1"
            },
            "answer_text": "I attended both and taught at both types of schools and I really think that it is hard to beat a liberal arts environment for undergraduates. The departments are smaller, the teaching is generally better, and they are really great at things like study abroad, participation in extra-curriculars, advising, and course availability. I remember being asked the same question by a brother-in-law who had two daughters, one heading the the University of Wisconsin while the other applied to Luther College in Iowa. He thought it was ridiculous to pay twice as much for the small Iowa school, but I have kept close contact to my nieces and we have discussed the decision. It took the older girl five years to get her undergraduate degree due to the difficulty getting courses in her chosen field. Her sister flew through Luther in 3.5 years including a semester abroad. Both have had great careers after college, but the Luther graduate is still connected to her school friends while the University of Wisconsin graduate isn’t. I think that they are pretty typical. My private school experience was pretty similar. I was able to play two varsity sports and participate in some writing activities. I had great advising and was able to get the sort of GRE scores that got me into the graduate schools of my choice and into a Fulbright Fellowship. While a graduate student at the University of Minnesota, I taught undergraduates in large classrooms. In my first semester, I had a student who committed suicide by jumping off a bridge but the university never informed me of his death. I felt that my students at the Big Ten University were getting shortchanged in terms of the total experience. They certainly were not being prepared for graduate school and enjoyed one major advantage: their tuition and fees were lower. I later worked on the staff at Indiana University and felt that it did a somewhat better job with undergraduate education, but the experience was still one of bureaucratic impersonality. I think that is largely a function of both size and mission. ",
            "date": "Answered May 4, 2018",
            "views": "864",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Sandeep Albert Mathias",
                    "user_href": "/profile/Sandeep-Albert-Mathias"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                },
                {
                    "user_id": "Matthew Gordon",
                    "user_href": "/profile/Matthew-Gordon-7"
                },
                {
                    "user_id": "Irvin L. Ortega",
                    "user_href": "/profile/Irvin-L-Ortega"
                },
                {
                    "user_id": "Edward Melaika",
                    "user_href": "/profile/Edward-Melaika-1"
                },
                {
                    "user_id": "Jean Komatsu",
                    "user_href": "/profile/Jean-Komatsu"
                },
                {
                    "user_id": "Jerry Mc Kenna",
                    "user_href": "/profile/Jerry-Mc-Kenna"
                },
                {
                    "user_id": "Varun Raj",
                    "user_href": "/profile/Varun-Raj-4"
                },
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "MaryBeth Lizek",
                "href": "/profile/MaryBeth-Lizek"
            },
            "answer_text": "These are not mutually exclusive—Harvard University is considered a liberal arts university, albeit a national one. Students at Harvard typically earn liberal arts degrees, and major in subjects ranging from Economics, English, History, and German to Biology, Chemistry, Sociology, and Mathematics. All of those subjects and more are liberal arts subjects. A university is usually bigger, while a college is smaller. In my area, Amherst College and Smith College are liberal arts colleges, with the same wide range of majors (Biology, Microbiology, Chemistry, Mathematics, Physics, Theatre, English, French, German, Spanish, Religion, English, History, Sociology, Anthropology, Music, Art, Art History, Economics, etc.) as UMass Amherst (they offer the same kinds of majors). UMass Amherst is huge, has about 30,000 students including graduate students, while Amherst and Smith are much, much smaller. Any differences are in the reputations of those schools and whether you learn better in a small college setting vs a large state university setting. But they both offer liberal arts majors and degrees. ",
            "date": "Answered April 1, 2019",
            "views": "138",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hazel Scott",
                    "user_href": "/profile/Hazel-Scott-4"
                },
                {
                    "user_id": "Evan Zilber",
                    "user_href": "/profile/Evan-Zilber-1"
                }
            ]
        }
    ]
}