{
    "title": "What are some tips for getting into the Air Force Academy? - Quora",
    "tags": [
        "United States Air Force Academy",
        "U.S. Air Force"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael P. Cronin",
                "href": "/profile/Michael-P-Cronin"
            },
            "answer_text": "I went to OTS vs the Academy, so take my thoughts with the understanding I’m speaking from second-hand experience. That said: USAFA make officers, and officers are above all supposed to be leaders. Demonstrate you are leadership material by showing you already have been assigned, and handled, increased responsibilities over time. When you start getting jobs, do well and advance.If you aren’t on the NJHS or student council, think about joining/running. If you are on one or both, run for president.Get involved in extracurricular activities and/or volunteer work. If you can, take a leadership role in them, or be able to show that you recruited others to help.Unless one of your parents was awarded the Medal of Honor, you need to be recommended by your congressman or senator. Consider writing them now to introduce yourself and ask what they are looking for in a candidate, then, once a year or so, write them again to tell them how you are progressing. Be succinct and respectful in your letter (and it can’t hurt to make a donation to their re-election campaign).Good luck! ",
            "date": "Answered February 11, 2017",
            "views": "430",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adrian Bryant",
                    "user_href": "/profile/Adrian-Bryant-11"
                },
                {
                    "user_id": "Samved Iyer",
                    "user_href": "/profile/Samved-Iyer"
                },
                {
                    "user_id": "Greg Boerum",
                    "user_href": "/profile/Greg-Boerum-1"
                }
            ]
        }
    ]
}