{
    "title": "What does it feel like to teach an incredibly bright student? - Quora",
    "tags": [
        "Teaching",
        "Students"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hilary Yamtich",
                "href": "/profile/Hilary-Yamtich-1"
            },
            "answer_text": "I had a student who came to the United States from Mexico at age 16. He didn’t speak any English and he had never learned any algebra. I taught him during his junior and senior year of high school. He refused to speak to me in either English or Spanish, and he didn’t know much math, so I had no idea what he knew. After a few months of his junior year, he wrote on a whiteboard that he wanted me to teach him how to graph a line. I showed him. The next day, he could still graph lines, including with equations in different forms. He not only remembered everything I had showed him, but he somehow knew more. I realized then that he could learn really fast. One year later, he had advanced through algebra and pre-calculus, and was doing integrals that were challenging for me. How did it feel to teach this student? It felt inspiring. I had never seen anybody learn so quickly, and be so intrinsically motivated to learn. He was able to overcome countless obstacles, and seeing him do this helped me believe in more possibilities in this world. It felt challenging. I usually had to make him his own lesson plan, because the lessons that other students (smart students at that) spent 1 hour working on only took him 10 minutes. I had to constantly research challenge problems, and design lessons that would enable him to build skills without being a waste of his time. I often had to give him problems that I couldn’t solve, but I still struggled through trying to understand his solutions, so that I could give him some kind of meaningful feedback. It felt frustrating. Because of his immigration status, limited opportunities were available to him both educationally and professionally. In order to attend college, he had to apply for dozens of scholarships, and even with a degree he knew that he wouldn’t have the legal right to work in this country. I have taught other exceptionally bright students who weren’t as intrinsically motivated, or who thought that they were so bright they didn’t have to work hard. This presents a whole different frustrating challenge. I spent an entire year trying to explain to another exceptionally gifted student that simply being the smartest in his high school didn’t really entitle him to anything in life, and in like 5 years nobody would really care that he was the smartest in his class. I have taught exceptionally gifted girls who regularly told me, “I’m not that smart, I just work hard.” So this was another challenge still—helping them believe in their abilities, not just their effort. In these cases, it was almost like they had too much of a growth mindset. One student who was exceptionally gifted told me, “I know I’m not as smart as _____ (boy) because I have to work really hard to find the answer and he doesn’t.” I spent a whole year explaining to her that this didn’t mean she was any less smart than whoever, just that she had a different learning process. In summary, it is very challenging to teach exceptionally bright students. Often much more-so than teaching a student of slightly above average intelligence. The whole time you are trying to figure out how to enable that student to achieve their full potential, you are also teaching 20+ other students. ",
            "date": "Updated December 31, 2016",
            "views": "203",
            "upvotes": " View 66 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Goosie Lai",
                    "user_href": "/profile/Goosie-Lai"
                },
                {
                    "user_id": "Lindsey Essington",
                    "user_href": "/profile/Lindsey-Essington-3"
                },
                {
                    "user_id": "Steven Hans",
                    "user_href": "/profile/Steven-Hans-6"
                },
                {
                    "user_id": "Pankhuri DAYAL",
                    "user_href": "/profile/Pankhuri-DAYAL"
                },
                {
                    "user_id": "Marie Sinha",
                    "user_href": "/profile/Marie-Sinha"
                },
                {
                    "user_id": "Hui Min",
                    "user_href": "/profile/Hui-Min-37"
                },
                {
                    "user_id": "Sara Khan",
                    "user_href": "/profile/Sara-Khan-674"
                },
                {
                    "user_id": "Sabrina Loffredi",
                    "user_href": "/profile/Sabrina-Loffredi"
                },
                {
                    "user_id": "Islaynn Peña",
                    "user_href": "/profile/Islaynn-Peña"
                },
                {
                    "user_id": "Svetlana Levitan",
                    "user_href": "/profile/Svetlana-Levitan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Farnham Blair",
                "href": "/profile/Farnham-Blair"
            },
            "answer_text": "I have had only three “incredibly bright students” in 30-some years of teaching in good private and public schools. If I follow your labeling exactly, these students are very rare. My teaching colleagues have had similar experiences, and all teachers in a school attended by a student of this calibre are aware of his or her presence, because typically every teacher will need to collaborate in an effort to provide such a student with the best possible experience. Working with these highly unusual students is exciting, because teachers know they will learn as much as the students do—and likely more. These kids see and make connections that may never have crossed the teacher’s mind until that monent. From my own experience and that of my colleagues, incredibly bright kids are not likely to be any kind of discipline problem. However, that can happen, if a student becomes frustrated by unimaginative teaching. These kids are most definitely at school to learn. Socially, these kids have seemed to be friendly. They tend not to look down on their classmates. In many ways, a 15-year-old is a 15-year-old. When it comes to the incredibly bright, do not assume outlier or spacey nerd! The biggest responsibility for the teachers of one of these delightful kids is to keep them challenged and, thereby, learning. The teacher will end up doing a lot of homework, but that’s only fair. If you have the good fortune to work with one of these kids, enjoy him or her to the full. It’s a wonderful buzz. ",
            "date": "Answered December 18, 2016",
            "views": "115",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Leah Bush",
                    "user_href": "/profile/Leah-Bush-1"
                },
                {
                    "user_id": "Gimingo Hagenscoff",
                    "user_href": "/profile/Gimingo-Hagenscoff"
                },
                {
                    "user_id": "Zorie Todorova",
                    "user_href": "/profile/Zorie-Todorova"
                },
                {
                    "user_id": "Ishita Tripathi",
                    "user_href": "/profile/Ishita-Tripathi-7"
                },
                {
                    "user_id": "Atomsky Jahid",
                    "user_href": "/profile/Atomsky-Jahid"
                },
                {
                    "user_id": "Mitch Sampson",
                    "user_href": "/profile/Mitch-Sampson"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/AnA-jackson-28"
                },
                {
                    "user_id": "Jonathan Poblete",
                    "user_href": "/profile/Jonathan-Poblete"
                },
                {
                    "user_id": "Sofina Le",
                    "user_href": "/profile/Sofina-Le"
                },
                {
                    "user_id": "Jonathan Daniel",
                    "user_href": "/profile/Jonathan-Daniel-23"
                }
            ]
        }
    ]
}