{
    "title": "What is the difference between imperative and interrogative sentences? - Quora",
    "tags": [
        "Imperative Sentences",
        "Interrogative Sentence",
        "Similarities and Differences"
    ],
    "response": [
        {
            "author_info": {
                "name": "Neha Swami",
                "href": "/profile/Neha-Swami-7"
            },
            "answer_text": "An imperative sentence is more commonly known as a command. The \"you\" subject is understood. This means that the command is given to someone, and he understands who the speaker is talking to without the speaker saying \"you.\" These sentences start with an action verb. They usually end with a period. But if it is a command given in an exciting situation, then an exclamation mark can be used. For example, commands may be given during a fire drill or a sporting event that would end in exclamation marks instead of periods. For example, Shut the door.Run!Interrogative sentences are also known as questions. When you use an interrogative sentence, you are expecting an answer to your question. These sentences end in question marks and usually start with a question word or an inverted subject-verb structure such as \"do you go. . .\". For example, How are you?Did you like this answer?",
            "date": "Updated March 18, 2020",
            "views": "37",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sanyukta Padhi",
                    "user_href": "/profile/Sanyukta-Padhi"
                },
                {
                    "user_id": "Rachael Lugbenwei",
                    "user_href": "/profile/Rachael-Lugbenwei"
                },
                {
                    "user_id": "CHANDRA SEKHARA RAO Srikantam",
                    "user_href": "/profile/CHANDRA-SEKHARA-RAO-Srikantam"
                },
                {
                    "user_id": "Meena Ramesh",
                    "user_href": "/profile/Meena-Ramesh-27"
                },
                {
                    "user_id": "Sarah Madden",
                    "user_href": "/profile/Sarah-Madden-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jordan Richards",
                "href": "/profile/Jordan-Richards-12"
            },
            "answer_text": "Imperitive means important. Interrogative comes from interrogate. “It was imperative to the station that the police officers got information. They sent their two best officers to interrogate their suspect.” Thus: Imperatives are commands (Go! Help! Run! Go ask your mother. Bake at 350 fahrenheit for thirty minutes.) Interrogatives are questions (When? How? What? Why? Who? Is it the red button?) ",
            "date": "Answered February 19, 2018",
            "views": "830",
            "upvotes": "0"
        }
    ]
}