{
    "title": "What are the steps I should take when writing a background of the study for a thesis? - Quora",
    "tags": [
        "Writing a Thesis",
        "Thesis Writing",
        "Writing Theses and Dissertations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Defne Aras",
                "href": "/profile/Defne-Aras"
            },
            "answer_text": "I think the last step should be to rewrite. After the first draft, think about your organization. You are trying to tell a story here. You are trying to convince the reader your thesis is worth the read. It’s like you are leading a drunk person through a maze. They might not want to go where you are leading them but you gotta be super smooth and convince them. Make them believe why there had to be thesis done on your topic. Moreover, convince them why your approach was the best one. I have never seen anyone write this effectively on a first draft. So after your first draft, think about your angle an the story you want to tell and rewrite. This second draft should be tight and smooth enough to lead the mot unruly drunk person. ",
            "date": "Answered July 20, 2018",
            "views": "265",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jason M Pittman",
                "href": "/profile/Jason-M-Pittman"
            },
            "answer_text": "ReadAnnotateWriteReading is a prerequisite more than a first step but the order stands to reason. You want to read everything related to your topic. Don’t filter based on what you think fits the background; just read. As you read, you annotate the research. What is the problem? The purpose? Their background? What’s good and bad? Results? Lastly, you write. Well, in some sense you’ve already written because you annotated. As well, annotation forces synthesis. Now, as you write the actual background you can filter. ",
            "date": "Answered March 19, 2018",
            "views": "403",
            "upvotes": "0"
        }
    ]
}