{
    "title": "What are the merits and demerits of online education? - Quora",
    "tags": [
        "E-learning in Higher Education",
        "Pros and Cons",
        "E-learning",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rosemary Ward Laberee",
                "href": "/profile/Rosemary-Ward-Laberee"
            },
            "answer_text": "Online education has become ubiquitous but it sure has its drawbacks. Some clarification on types: YouTube videos can be remarkably useful. Their “how-to” videos as well as the more organized videos on an entire topic, such as, Converting Elements of Mass to Moles, are hugely accessible. These have great value to those seeking general info/general understanding . Perfect for continuing education, refreshers, and real data without the didactic. A great deal of knowledge can be imparted here - the good ones are really quite good. And free.Online classes for K thru 12, community college, and some universities, is a different environment. The original consumers of these classes were home educators, but now more and more schools are adopting an online option for some classes. These are for-credit courses aimed at middle school, high school and college students and they replace conventional classroom learning.MOOCS: These are Massive Open Online Courses. They are free unless you want a certificate of completion ($35-$60) and they are taught via access to (sometimes) old classroom videos by professors from some of the world’s top universities. Some of these (e.g. Coursera) will offer a live portion. Here, the student reads and does the work on their own and then can login to discuss things with those currently enrolled.This response will focus on the typical K-12 online classes. First things first: I believe that most real learning takes place during very effortful reading - pencil in hand - making little sketches, crunching numbers, drawing diagrams to aid understanding, getting it wrong, and then trying again. This is the sweet spot where a student learns and actually remembers. The assessment is done by the student - and it is ongoing throughout the trial and error which is built into this effort. It happens when working in small groups, with a tutor, or when the student is given time to try to get it right on his own, while in a small group or with a tutor or alone. Most for-credit K-12 online classes do not and cannot facilitate this kind of learning because it is time consuming and time is the single thing which online classes seek to minimize. I have been a consumer of online learning of all types for the past 15 years, through home educating 4 kids. Online learning has come a long way but it has much work to do in order to be as good as small group learning or one-on-one tutoring. However, it does not matter in this day and age whether or not online K-12 education is any good or not. It is easy. It is cheap. It is here to stay. More and more schools will shove as much content online for their students - as much as the taxpayers will tolerate. So, the best thing taxpayers and parents of students can do is insist on better quality. Some of the drawbacks: Greater accountability is needed. MOST online classes are an exercise in box-checking. Quizzes may be taken as many as 3x (sometimes more), so that the student can just keep guessing until they get all questions right. I am not kidding. This ain’t learnin’. After a semester of box-checking/guessing, a student might have been better off just reading a book or going for long walks during the hours invested in this online class. Seriously.They can be boring. When you are in an asynchronous online class, you go to a website, collect the work, do what it tells you to do, upload your work, done. Ouch. That’s a drag. More effort on the part of the designers of these classes is needed to mix things up so the students don’t feel so alienated from the content. In a synchronous environment, a quick student might want to commit seppuku as the teacher is forced to go at the pace of the slowest student online. How many times can the host explain future imperfect tense until everyone understands? Turns out it can take a full hour, but there will always be the student who gets it in 3 minutes. They must sit idle for the other 57 minutes - just as hard to get around this problem online as it is in a classroom.Face to face time needed. Students need to be able to ask questions, real-time, of a person who has fluid knowledge in the discipline/topic and a gift for explaining things. That would be a teacher. Most online learning does not include this. Many will say that you can email the teacher with a question at any time. However, if a student has a very specific question on, say, the limits of a specific function as ‘x’ approaches a fixed constant …. and the teacher emails him back the following day…well, there is something lost in the delay. The student is no longer deep in the material and primed for receiving instruction. Online providers do not do a good job in delivering the instruction at the moment when it is most needed and best received.Labs. Taking an online class which includes a lab (biology, chemistry, physics) is a whole ‘nother challenge. Typically, the student is asked to buy a lab kit and do the experiments in their own kitchen. How does the teacher know if this has been done? They don’t. It is very easy to “pretend” you did it. Some will connect you to virtual labs on YouTube and then give the student one of those quizzes, where the student gets to guess as many times as they want, redoing the quiz again and again until they get 100.Not all K-12 online education is bad. If you have $4,500 to spend on just one classthere are some providers on online education for middle-school and high school students who do a superb job. You really do get what you pay for. All of the best online courses charge big, big dollars. My four students have done every type of online class. The cheap ones are a waste of time. The costly ones are, in fact, very worthwhile.Colleges and online education - Every year the Common Application asks more questions about a student’s online classes. They want to know, specifically, how many hours the student spent with a teacher, how many hours online, etc. They are not suspicious, but they KNOW the difference between the junk and the good stuff. They know. There are some providers of online education which colleges LIKE to see. Stanford University OHS, Johns Hopkins CTY, Duke TIPS, Davidson Gifted. They won’t ask many questions if they see these. These are very costly programs and some are hard to get into, too. They probably increase an applicant’s attractiveness to the competitive university, because doing well in these classes is harder. Period.  I have summarized the limits of online K-12 education and you might think that I believe it is worse than public education. I don’t. It must be improved, yes. But, because of the opportunitieswhich are made available to students who are not trapped in school buildings all day, I think that online education, overall, offers more. Based on standardized test results, most students are not learning inside our schools, anyway. While I don’t think our students can learn more from asynchronous, perfunctory learning, I do think that students who want to learn will have more time to do it, if they did not have to report to school. Mixed with weekly small group learning and some one-on-one tutoring, online education could be better than public education. Students would be better rested, could eat more healthfully, could mix real life experiences in (museums, talking to experts directly, etc), and could develop authentic interests in academic topics. If students did not have to report to school, it could encourage more involvement of parents and it could also get the students themselves more self-directed, self-motivated. It is the first step in helping young people grow a sense of personal agency, and I cannot think of anything more key to success in life than this. ",
            "date": "Answered January 20, 2019",
            "views": "18",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Patrick Crosset",
                    "user_href": "/profile/Patrick-Crosset"
                }
            ]
        },
        {
            "author_info": {
                "name": "Md .Nashat Takmil",
                "href": "/profile/Md-Nashat-Takmil"
            },
            "answer_text": "E-learning is the talk of the town, now that everyone has been stuck at home for months. The industry, professors, students have been seen e-learning in a new light. And in the limelight, with all the benefits, few weaklings in e-learning has also surfaced. And I will try my best to cover them here. Let's cover the bad parts first, Reputation: E-learning is still a greenhorn in the industry with a lot of polishing required. hence, As many people are in are for it, a lot more are full of critics because of its flaws and other stuff.Lack of Social Interaction: As I mentioned, the people who were not so much in favour of e-learning state this as an obvious fact, that students build their most of the social behaviour and community feeling in schools and colleges. And with the advent of E-learning, this tradition stands to be threatened.Fewer Courses: There is no so much and so many subjects that can be covered online. Subjects involving practical lessons or proper professional guidance while performing are a NO on the online platform. Either student might not be able to grab the learnings or might get hurt while work on them or may not even have the equipment to perform home. For Example, a kid trying to dissect a frog at home in the dining room with a knife(as a scalpel is a tool not so popular in regular households)But its okay, it is not all that bad… There are no travel costs or time spent commuting to and from classes.Students enjoy great flexibility and can schedule classes and assignments around work and family responsibilities.Students are no longer limited by geographical location when selecting a school and degree program.Students who are disabled or have other reasons why they cannot attend classes regularly can get the same benefit at home.Material is delivered via the Internet, ensuring information is updated regularly.Students can work at their own pace, rather than trying to keep up with a group.I agree when people say E-learning is flawed. Even the computer was as a big a granary back then, just to perform the task of a calculator. And look it has come a long way since then and I can't imagine a life with a laptop or PC or smartphone as if they have become a part of our lives. So let us give e-learning the chance to work, revise, redesign, modify and eventually come out as a better version for the future generations. Who knows, if few more years VR and AI might even create a virtual platform for people to full-dive into it and interact with each other, not just face-time or video call them. (Okay that's me contemplating too hard…) Getting back to reality, for E-learning to grow ,we need to embrace it and start using it. These difficult times of Covid-19 are a perfect time to experiment. So go to any online platform and take up a course. i would suggest taking courses at professional ones like Edu4Sure, Coursera, Unacademy, Edx, LinkedIn so that the learning experience is enriching. Peace Out :) ",
            "date": "Answered June 1, 2020",
            "views": "24",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bonjour Chelsi",
                    "user_href": "/profile/Bonjour-Chelsi"
                },
                {
                    "user_id": "Harshita Agrawal",
                    "user_href": "/profile/Harshita-Agrawal-170"
                }
            ]
        }
    ]
}