{
    "title": "What should I choose, career or girlfriend? - Quora",
    "tags": [
        "Interacting with Girlfriends",
        "Holistic Career Advice",
        "Career Choice Advice",
        "Career Choices",
        "Girlfriends",
        "Jobs and Careers",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amit Yadav",
                "href": "/profile/Amit-Yadav-370"
            },
            "answer_text": "You are in a very difficult situation. It is unlikely that if you go there, her parents will fix the marriage with you. So, focus on career & forget her. Let her begin a new life. It won't be easy for either of you but there is no other option left. Or You can take ‘RISK”. Risk your career & marry her. Pretty nice option. We probably marry only once in life & if she seems perfect “go for her”. बात रही Career की, it just takes 2 years of extreme hard work to build a career. She will remain with you for at least next “45 + years”. With a happy marriage life you will surely do good on career front as well. If I were on your place, I would have gone for her (*I don't know how intimate you both have been). You don't have any thing to lose wrt career. At max, your salary will decrease. But you can 3x or 10x your salary by just doing MBA from a good college (*yes it entails hard-work) or some in-demand course. P.S. Usually the things we like the most come with a sacrifice. In most cases, life is not so easy. We are always confronted with situations where we have to choose “one thing out of two”. Choose the thing that will last for long. ",
            "date": "Answered January 20, 2017",
            "views": "858",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raj Dholakia",
                    "user_href": "/profile/Raj-Dholakia-3"
                },
                {
                    "user_id": "Swathi BV",
                    "user_href": "/profile/Swathi-BV-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Angsuman Bhanjdeo",
                "href": "/profile/Angsuman-Bhanjdeo"
            },
            "answer_text": "This is a no-brainer. Hands down it has to be career . I would like to quote a famous sentence by Lady Gaga which I read sometime back and really liked. It goes something this :- “Some women choose to follow men, and some women choose to follow their dreams. If you're wondering which way to go, remember that your career will never wake up and tell you that it doesn't love you anymore”  Image Source:Google ",
            "date": "Answered January 20, 2017",
            "views": "534",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robin Patel",
                    "user_href": "/profile/Robin-Patel-14"
                },
                {
                    "user_id": "Annapurna Mangaraj",
                    "user_href": "/profile/Annapurna-Mangaraj"
                },
                {
                    "user_id": "Supragyan Pattanayak",
                    "user_href": "/profile/Supragyan-Pattanayak"
                },
                {
                    "user_id": "Sourav Behera",
                    "user_href": "/profile/Sourav-Behera"
                }
            ]
        }
    ]
}