{
    "title": "What are the website where we can learn free certified courses? - Quora",
    "tags": [
        "Coursera",
        "Certifications",
        "Tips and Hacks for Everyday Life",
        "Learning New Things",
        "Website Recommendations",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anoosha A Rao",
                "href": "/profile/Anoosha-A-Rao"
            },
            "answer_text": "Online free certificate !! Just google the course you want to do online. Let’s say you want to do some engineering related course in order to apply for a job. When you search it online, you will get lot many of websites who provide coaching for the course you want to do. All these will be free online coaching, which you can access while you are in your home without paying anything. ! They will ask you to register for the course as soon as you select the course and start taking lessons. Register there and continue to access lessons. Usually, courses will have a certain duration of coaching after which you will have to write an exam and thus get your certificate. Many government- aided and government non-aided or private organizations do exist in order to provide courses for free online, which you can take and thus get yourself a certificate. Some of the websites where you can do free online courses are : Free Online Courses with Certificate | AlisonThese Online Courses Let You Learn New Skills for Freehttps://onlinecourses.nptel.ac.in/ if you are interested in doing engineering related courses for free. It is certified and run by IITs of India.There are a lot more which you can search on the internet by googling your course of choice .! Hope it helped you! Thank you:) ",
            "date": "Answered January 20, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shrushti Naik",
                    "user_href": "/profile/Shrushti-Naik-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sumit Bhanushali",
                "href": "/profile/Sumit-Bhanushali"
            },
            "answer_text": "If you are looking for certification in web development,Learn to code and help nonprofits (freeCodeCamp) is the best choice. It has great tutorials on html5,css,javascript,jquery,reactjs,nodejs,mongodb,d3.js,git with challenges to test your knowledge and active forum to clear doubts. After completing all challenges,you get to work for non profit organizations which will expose you to real world web dev challenges. After completing this things you will get a legit certificate of Full stack Developer. Full stack development is most popular job right now and javascript is most used programming language. Also the creator of freeCodeCamp is on Quora Quincy Larson  ,so you can ask him any doubts you have. freeCodeCamp is trending project on github since couple of months with total of more than 90k stars.    ",
            "date": "Answered March 15, 2016",
            "views": "1",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ayush Arya",
                    "user_href": "/profile/Ayush-Arya-52"
                },
                {
                    "user_id": "Ankita Agnihotri",
                    "user_href": "/profile/Ankita-Agnihotri-7"
                },
                {
                    "user_id": "Trilok Reddy",
                    "user_href": "/profile/Trilok-Reddy"
                },
                {
                    "user_id": "Sujan TN",
                    "user_href": "/profile/Sujan-TN"
                },
                {
                    "user_id": "Akshay Kothari",
                    "user_href": "/profile/Akshay-Kothari-5"
                }
            ]
        }
    ]
}