{
    "title": "What is it like to get an MBA after a non-business related undergrad? - Quora",
    "tags": [
        "Master of Business Administration Degrees",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kent Aldershof",
                "href": "/profile/Kent-Aldershof"
            },
            "answer_text": "I don’t think it is like anything at all. If you are looking for a simile or a metaphor or an analogy, I don’t have any of those. Electrical Engineering undergrad, with an additional major in Technical Journalism. Never an intent to go to B School. Did night courses working toward a Master’s in EE, which eventually I achieved. Considered also, for a while, a Master’s in Journalism. B School came as a complete surprise. Unplanned and unexpected, and not even really wanted, but I suddenly found myself accepted into Harvard B School. Well, I wasn't going to abort that baby. And eternally glad i didn’t. Totally different world. People way different from the engineers I was used to — thought, talked, acted differently, had different interests and goals. Classes were way different than anything before — hundred-man discussions, Case Method, no pop quizzes, just one essay test at the end of the term. Grading was heavily on class participation and (even more) contribution. Took some getting adjusted to. First couple of terms I was scared to death. I had given up a great job, left my home, moved to another State, responsible for a wife and two kids, and no idea of whether I was doing the right things in class, or even by being there at all. By the end of the second term, I got a bit of reinforcement. Named a first-round Baker Scholar, top 2.5% of the class. After the third term (trimester system), got called into a faculty office, told I could take extra classes the next year if I wanted, because I had done so well first yer. (Yes, did it.) Toward the end of the second year, the Doctoral Program tried hard to recruit me, said I could do the Doctorate in a year less than the regular schedule. (No, did something else.) So what did I experience? Fear. Wonder. Confusion. Excitement. Rebirth of awareness. Opening of new worlds. Amazing people. Real people with incredible life stories. Mountains of new knowledge. Bewilderment, not really knowing how to use all that I apparently was learning. Damned if I know what it was like. Different. Way different. Required undreamed-of adaptation. In retrospect, seems like I did adapt. Now that I think of it, maybe I can say what it was like. First, becoming conscious inside the egg, and realizing that this was a fine world. Warm, quiet, plenty to eat all around me. Then, the egg broke open. I hatched. Found myself in a nest built atop a high, windy cliff. Thousands of feet, straight down, just beneath me. After I had a while to look around, and swallow a few worms, I was kicked out of that nest, and found myself in the middle of a do-or-die adaptation. I learned how to fly. ",
            "date": "Answered June 29, 2018",
            "views": "514",
            "upvotes": " Answer requested by Natalie LeRoy",
            "upvoters": [
                {
                    "user_id": "Basir Amin",
                    "user_href": "/profile/Basir-Amin"
                },
                {
                    "user_id": "Jeffrey Luciano",
                    "user_href": "/profile/Jeffrey-Luciano"
                },
                {
                    "user_id": "Emmanuel Gallé",
                    "user_href": "/profile/Emmanuel-Gallé"
                },
                {
                    "user_id": "Rajesh Menon",
                    "user_href": "/profile/Rajesh-Menon-23"
                },
                {
                    "user_id": "John Mark",
                    "user_href": "/profile/John-Mark-405"
                },
                {
                    "user_id": "Shrenik Jain",
                    "user_href": "/profile/Shrenik-Jain-32"
                },
                {
                    "user_id": "Gaurav Mokhasi",
                    "user_href": "/profile/Gaurav-Mokhasi"
                },
                {
                    "user_id": "Rampalli Sai Teja",
                    "user_href": "/profile/Rampalli-Sai-Teja"
                }
            ]
        },
        {
            "author_info": {
                "name": "John A. Byrne",
                "href": "/profile/John-A-Byrne"
            },
            "answer_text": "For many who have an interest in business, it’s like drinking from a fire hose. You will learn all the business basics and greatly enjoy the learning experience which tends to be far more engaging than a typical college classroom. Natalie, one way to get a better feel for what this is like is to peruse our profiles of the best and brightest MBAs of the year. Many of them went to business school after majoring in the humanities and many of them went to work in nontraditional fields. We ask 100 of the most promising MBA graduates to tell us who most influenced their decisions to pursue business and I think you’ll find the answers very helpful to you. Best & Brightest MBAs: Class Of 2018 Finally, we also do another major feature every year introducing people like yourself to the latest entering classes of all the best business schools in the world. We ask each of these incoming students to tell us what was the key factor that led them to choose a particular program and also what success would look like after their first year in the full-time MBA program. I think you’ll find this of great interest as well. In both cases, by the way, you can find people who are in or who have just graduated from all of your target schools so you’ll also gain a deeper sense of each program you might want to consider. The Entire Meet The Class Of 2019 Series ",
            "date": "Answered August 8, 2018",
            "views": "47",
            "upvotes": " View 8 Upvoters "
        }
    ]
}