{
    "title": "What should people in their 20s focus on? - Quora",
    "tags": [
        "Life Advice for People in Their 60's",
        "Young Adults",
        "Life Advice for People in Their 20s",
        "Focusing and Concentrating",
        "20s (age)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel DiPiazza",
                "href": "/profile/Daniel-DiPiazza-1"
            },
            "answer_text": "Being that I have officially pushed out two fully formed gray hairs on my beard at the ripe ol’ age of 29, I feel fully qualified to answer this question. I have a few thoughts, but wanted to add some context first. This is important. Most people in their 20’s don’t realize that they’ve wasted the entire decade until it’s too late to do anything about it because for roughly half of our second decade, we are usually still a part of some institution, university or corporate structure that’s telling us how to think, act and ultimately, how to feel about it all. Universities (yes, even the really expensive/prestigious ones) and corporate jobs teach us: What’s important: Here’s your curriculum. The more you can memorize, the more you will be rewarded. More degrees = more money, regardless of how much debt it takes to get there, it’ll be worth it.What’s not important: We don’t need you to think of a better way or a more creative solution to the problem. We’ve already figured it out. And we don’t need you to find any new problems to solve. We just need you to send the spreadsheet.How to think about time: Wake up at 7am. Work X days a week for Y hours. Don’t be late. Take your vacation when we see fit, and don’t get sick too often. We’re watching you.How to behave: There’s a managerial hierarchy for a reason. Don’t overstep. If you’re normal enough, you can move up the chain.How to interact with people outside of work: Is anybody going out to get drinks tonight?These ways of navigating the world used to work. They used to work really well, in fact. There was an invisible rule book, written sometime after World War II, and it implied very simply: “Follow these rules and everybody will get rich.” Go to school. Go to school again. Get a job and work until they tell you to stop. Do not complain. You’re lucky to have a job in this economy. For example: In Detroit during the 1960’s and 70’s, my family (even the black side, who just a few generations before had been most likely been sharecroppers and slaves) were completely middle class. Everybody worked at GM, Ford and Chrysler. A factory job was a gift that you cherished. More than livable wages, a house that didn’t get shot at and a new car in the driveway every season. On my mom’s side, nearly everybody went “pro” and got advanced degrees in law, medicine and engineering. When they got out, it was a guaranteed six-figures because they’d “put in the work.” Baby Boomers and their kids benefitted from the single biggest “level up” in standard of life since...ever! The rules were working and to be honest, I’d have followed them too. I mention these rules because much of the advice you may receive from older generations comes from a perspective that was correct for their 20’s. It’s not bad advice. It doesn’t make these people stupid. It’s simply outdated. We’ve changed the textbook and they didn’t get the new edition. In the New Economy, there are are so many things to focus on — and the biggest problem isn’t a lack of opportunity, but a misguided fear of wasting time on an opportunity that doesn’t pan out. This is FOMO: Fear of Missing Out. We want to be able to immediately identify which opportunity is the best for us and start reaping the rewards of our passion. Whatever that is. That’s why the first and most important thing someone in their twenties should focus on is The Long Game. Appreciate The Long Game Your twenties are literally just the beginning of your life, your career, your relationships and your journey to figuring out what the hell is going on. You’re going to have to lean in and just accept the fact that you’re still developing all the tools you’re going to use along the way. Just like in an RPG video game, you never start out with a fully developed character. You have to win some battles first. Because there is no longer a linear path that’s going to guarantee you get the corner office. Because there are no more gold watches being given out. The pensions are gone and the Employee of the Month party ended a decade ago. I found this out firsthand after writing my debut book. By all accounts, it was a massive success. But after the dust cleared, I didn’t feel like I’d accomplished anything tangible. I wasn’t really sure what I was supposed to feel, really. Then, I realized that the physical book itself wasn’t the accomplishment. The real accomplishment was having completed a big project from beginning to end. Now, I was off the sidelines and in the game. And it’s long game. You’re not guaranteed a certain result by a certain age, and holding an imaginary stopwatch up to yourself to measure your progress is only going to cause anxiety. Focus on the fact that you’ll most likely have at least eight more decades to figure out what’s going on and learn to move with a more controlled urgency. Execute as quickly as you can on ideas, but realize that sometimes there’s no amount of pushing you can do to make something happen. Seeing results slowly isn’t the same thing as failure. Oftentimes, you can be doing everything right and it still takes time to pan out. Stephen King mentions in his book On Writing that a plot reveals itself to him gradually, in pieces until it becomes visible — just like taking a fine brush to gradually reveal the outline of a fossil in the earth. Your life is the fossil. Run Towards Problems, Not Away From Them Part of the old rulebook required us to avoid problematic situations as a matter of cause. Stay under the radar. Submit the report. Do. Your. Job. All 1,250 workers in Lordstown, Ohio were doing their jobs when GM laid them off. Journalists, editors and reporters at dozens of newspapers around the US were doing their jobs when they were let go. Most of the time, the papers themselves were also let go. Even on-air talent isn’t safe. ESPN just laid off over 100 people, including star anchors and Super Bowl champion commentators. The problem is that we’re used to having somebody tell us what to do. What widget to make. What calls to take. What reports to compile. Now, there’s nobody left to tell us what we should be doing. We’re the ones we are waiting for. In the New Economy, it’s your responsibility to find new, interesting, inherently challenging problems to solve. There is no rubric. You don’t get any points for doing it the “right” way. But if you’re able to interesting the right challenges to solve, your rewards will be disproportionate. Solving meaningful problems is something that entrepreneurs relish. Like my friend Maneesh, who didn’t want to just build another wristband that tracked steps, but created a wearable device that actually changes your habits. Nobody is doing this. And when an entire category of products designed to change your behavior becomes the norm, who do you think is going to come out on top? But it’s not just about entrepreneurship. You have the opportunity to bring a fresh perspective, interesting idea or new take to any organization that you’re a part of. The assistant who streamlines an executive’s inbox in order of importance so that she never misses an important message is an innovator. She’ll never get replaced by an app or a widget. The store manager of the women’s clothing store who sets up a mini “man cave” with delicious coffee, a gigantic television and plush recliners in the corner of the store for bored husbands to wait in while their wives shop....she’s getting promoted. She’s not just a regular sales associate. It’s our job to look at the world as creatives. It’s no longer going to be enough to simply do your job. Following the rules is the fastest way to lose the game. Your job should be a “one-of-one.” A limited edition print. A unique key that only fits one lock. That's how you'll win. That's how you'll get ahead. Risk is the new safety. You’ll do this by finding meaningful problems and taking initiative to solve them before somebody asks you. This is how you make yourself indispensable, and it’s something that all twenty-somethings need to know in order to thrive in 20XX. But what do I know? I’m almost 30. ",
            "date": "Answered June 26, 2017",
            "views": "44",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Grant Miller",
                    "user_href": "/profile/Grant-Miller-45"
                },
                {
                    "user_id": "Christopher Wibmer",
                    "user_href": "/profile/Christopher-Wibmer-2"
                },
                {
                    "user_id": "Jalil Evangelista",
                    "user_href": "/profile/Jalil-Evangelista"
                },
                {
                    "user_id": "Bryant Douglas",
                    "user_href": "/profile/Bryant-Douglas-4"
                },
                {
                    "user_id": "Michael Zipperer",
                    "user_href": "/profile/Michael-Zipperer"
                },
                {
                    "user_id": "Jane Botten",
                    "user_href": "/profile/Jane-Botten"
                },
                {
                    "user_id": "Cameron Sadeghi",
                    "user_href": "/profile/Cameron-Sadeghi-2"
                },
                {
                    "user_id": "Meliá Widjaja",
                    "user_href": "/profile/Meliá-Widjaja"
                },
                {
                    "user_id": "Juhita Illa",
                    "user_href": "/profile/Juhita-Illa"
                },
                {
                    "user_id": "B Rose",
                    "user_href": "/profile/B-Rose-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashim Dhingra",
                "href": "/profile/Ashim-Dhingra-1"
            },
            "answer_text": "I am 27 and coming to 27 from 22 has been like a life full experience for me and thus i feel i can answer you on this . 1- Make a good career Everything will come and go but one think that u will always be judged upon is how well are u doing in your career ,now we live in a social world we can say we should not care of others but whatever we think we will always fail applying this logic when it comes to career , as a decent earning , a reputated jo is what at the end will be with you and will give you confidence personally and socially, so be it going for higher studies or whatever just focus on your goal and try to get it by 25–26 (basically finishing your studies or etc unless you want to be an entrepreneur) 2- do not chase girls That does not mean that you should not hve a gf , yes go ahead and have but do remeber you will never have control on them as in weather they will be with you or leave you and thus ultimately you might get hurt (this applies for a 22 year old girl too ). Just remeber any relationship more then 4–5 months will make you get serious for your prtner and you will end up troubling yourself only. Thus be aware of your strong feelings for opposite sex . 3- do party a lot Definetly this comes after you have accomplished your goal or got the dream job as before getting married you have time like 5–6 years (many guys get married at around 27–28 ) and after gettig married you will definetly miss the bachelor life (i am not married but this comes from noticing married couples ) 4- work on bucket list Be it sky diving , world tour etc , try to do it before 30 as once you get married many dreams are washed awaybas expense of two people comes into count(he he this just depends on your luck , you might get a financial indepent petner too ) Ps: get over with you higher education/ dream job etc and then enjy life and dnt get serious in relationships(that does not mean you hurt someone or lie to some one that you are serious but you are not , it just means people will come in life who will make promoses but nothing is certain) ",
            "date": "Answered September 1, 2017",
            "views": "361",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashim Dhingra",
                    "user_href": "/profile/Ashim-Dhingra"
                },
                {
                    "user_id": "Samadarshini Bharadwaj",
                    "user_href": "/profile/Samadarshini-Bharadwaj"
                }
            ]
        }
    ]
}