{
    "title": "What should I do to score 95+ in 9th class? - Quora",
    "tags": [
        "Class 12th in India",
        "Central Board of Secondary Education, India",
        "Studying",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Achal Munshi",
                "href": "/profile/Achal-Munshi"
            },
            "answer_text": "Follow the steps and I am sure you will get thru it, if followed religiously. Make your study plan. How you will complete your course in given time with ample time for revision etc.Strictly adhere to this time plan.You will have to be consistent with your study timing on daily basis.Be focused on what you do and make proper notes etc. Bring some good books, if at all required. You can consult with your teachers or elders regarding purchase of some good books.If you follow these above points then no one can stop you from getting what you desire.Wish all the best and get ready from the word ‘GO’ !!.",
            "date": "Answered September 25, 2018",
            "views": "430",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adrija Singh",
                    "user_href": "/profile/Adrija-Singh-6"
                },
                {
                    "user_id": "Prithvi Krishnavanshi",
                    "user_href": "/profile/Prithvi-Krishnavanshi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nandhini Saravanan",
                "href": "/profile/Nandhini-Saravanan-30"
            },
            "answer_text": "9th standard is all about learning the basics. So you should concentrate more. Try understanding the concept clearly. Ask doubts if you have and be clear with the concepts. Try answer the book back questions by yourself and try the questions in the supplements and the guides. Together with has a pool of questions in all subjects for CBSE students. Answer by yourself and cross check your answers. Try daily study so that you don't forget the concepts. In case of Maths and Chemistry (equations), try writing down the answers. It helps you remember more. Try answering the past year question papers and solve them yourself. Hope it helped :) ",
            "date": "Answered July 11, 2017",
            "views": "842",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Akanshu",
                    "user_href": "/profile/Akanshu-3"
                },
                {
                    "user_id": "Deepak Yadav",
                    "user_href": "/profile/Deepak-Yadav-1481"
                }
            ]
        }
    ]
}