{
    "title": "What is the difference between a polytechnic and universities? - Quora",
    "tags": [
        "Singapore Polytechnic",
        "Polytechnic",
        "National University of Singapore",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charles Ntabo",
                "href": "/profile/Charles-Ntabo"
            },
            "answer_text": "What's the difference between a polytechnic and a university?  A hot question if you want to make sure you, or Junior, get the best education and job outcomes available. First have some basic facts: - Polytechnics offer certificates, diplomas, and degrees and, and even post-graduate study. Aren’t polytechnics for dummies?  No way! This archaic perception is a hangover from an elitest era where the 'upper class' became doctors and the 'lower class' became tradesmen. These days’ modern polytechnics have diverse offerings catering to a wide range of professions. While the traditional courses like automotive and chef training is still there, so are the arts, engineering, science, business and degree level study. Everyone works in different ways and sometimes polytechnic environments with their smaller class sizes and hands-on learning style, suit learners better. Learning by doing One of the main differences between polytechnics and universities is the amount of practical vs theory. Because polytechnics used to be trades focused, they have a strong background on how to bring “learning by doing” into the classroom. That doesn’t mean you don’t have to learn your theory as well – it just means you get the best of both worlds so that when you go to apply for jobs you’ve got hands-on, practical knowledge of what the job involves. Who earns more – university graduates or polytechnic graduates? The answer in short is – it depends on what you study. Industry work placements give students real world experience while they study and it helps them build valuable networks. This also ensures graduate skills are closely aligned with what industry wants.Tutor to student ratio Polytechnics tend to have much smaller class sizes than universities. If you like the idea of a big lecture with possibly hundreds of students then university might be your thing. If you prefer the idea of smaller class sizes and more tutor contact then a polytechnic will suit you better. Working while you study - money Student debt is a hot topic with New Zealand learners more than $14 billion in the red. For most students, study comes first but they still have to work one, two or even three jobs to get by. These are traditionally low paid jobs in areas like fast-food or retail. It's a fact that a lot of students leave study with large student loans, despite working. Polytechnics offer a range of flexible learning options meaning some students are able to work full-time while up skilling. This is especially true for people wanting to enhance their management skills and knowledge. Other students are employed as apprentices (e.g. automotive, electrical, carpentry) and 'earn while they learn'. In short, do your homework before committing to any kind of study. Check the career outcomes, consider your learning style and never be afraid to ask questions. Ask people already in the profession how they got there. Take a tour somewhere you want to study. Call an employer and ask what sort of qualifications they like to see – you might find they are more interested in seeing you can commit to a qualification and complete it, rather than where you got it from. ~ The purpose of education is to replace an empty mind with an open one ~ Malcolm Forbes ",
            "date": "Answered September 21, 2019",
            "views": "125",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sanjay Nagarimadugu",
                    "user_href": "/profile/Sanjay-Nagarimadugu"
                },
                {
                    "user_id": "Kofi Chandler",
                    "user_href": "/profile/Kofi-Chandler"
                },
                {
                    "user_id": "Eli Crossfire",
                    "user_href": "/profile/Eli-Crossfire"
                },
                {
                    "user_id": "Parag Vadhiya",
                    "user_href": "/profile/Parag-Vadhiya"
                },
                {
                    "user_id": "Isaac Dolling",
                    "user_href": "/profile/Isaac-Dolling"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Lee",
                "href": "/profile/Ken-Lee-91"
            },
            "answer_text": "Difficulty. To succeed in polytechnics, you have to obtain a general understanding of the instructions given in class. However, to succeed in university, you will need to possess knowledge greater than what you will have learnt in class. Usually, one will come out from the exam hall learning more than when you entered it. Monetory Cost. University costs about 4 times [1][2] more than polytechnics per annum. Diversity. Universities have a far greater percentage of foreigners in a course. Thus, it is not surprising to have teammates who are not your fellow countrymen. Practical vs. Theoretical. Polytechnics modules are packed with projects which require the students to have hands on with the product. University are packed with questions which require the students to have a hands on with the concept. Roles. A diploma is a vocational qualification. Thus, a polytechnic will be far more hands on than a university. On the other hand an undergraduate degrees aims to provide knowledge for you to continue with furthering your studies; although many will move to the work force at this stage, instead of going for masters or PhD. [1] 2018 Cost Guide: Singapore Universities' Tuition Fee Comparison [2] Higher tuition fees for students joining polytechnics and ITE ",
            "date": "Updated December 22, 2018",
            "views": "146",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Victor Elijah Akpan (Eva)",
                    "user_href": "/profile/Victor-Elijah-Akpan-Eva"
                },
                {
                    "user_id": "Richard O'Daly",
                    "user_href": "/profile/Richard-ODaly"
                },
                {
                    "user_id": "Isaac Dolling",
                    "user_href": "/profile/Isaac-Dolling"
                },
                {
                    "user_id": "Prasad Malika",
                    "user_href": "/profile/Prasad-Malika"
                },
                {
                    "user_id": "God'spower Osaretin",
                    "user_href": "/profile/Godspower-Osaretin"
                },
                {
                    "user_id": "Mischievous Midnight",
                    "user_href": "/profile/Mischievous-Midnight"
                },
                {
                    "user_id": "Awofuye Oladimeji",
                    "user_href": "/profile/Awofuye-Oladimeji"
                },
                {
                    "user_id": "Hayford Quaye",
                    "user_href": "/profile/Hayford-Quaye"
                }
            ]
        }
    ]
}