{
    "title": "What are the disadvantages of public school? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Abi Baker",
                "href": "/profile/Abi-Baker-21"
            },
            "answer_text": "As a public school student, here is my answer the classes are too bigthe food usually sucks/is not really that healthyit’s super stressfulsome teachers can’t teach, like at all and end up giving the class a talking period and then get mad at us for talkingthe backpacks are too heavyteachers have to stop their lesson plans because of kids that don’t want to be therekids cause major interruptions in classsometimes you get sick and still have to go to school because make up work is very stressfulthe amount of time allotted to having make up work turned in(1–2 days) causes stressA lot of homeworkminimal free time(depending on how involved you are)I can’t think of any more right now, but thanks for reading to the end, hope you enjoyed it! ",
            "date": "Updated October 5, 2019",
            "views": "3",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Patrick Terry",
                    "user_href": "/profile/Patrick-Terry-35"
                },
                {
                    "user_id": "Skyler Birch",
                    "user_href": "/profile/Skyler-Birch-2"
                },
                {
                    "user_id": "Jimmy Dilks",
                    "user_href": "/profile/Jimmy-Dilks"
                },
                {
                    "user_id": "Karen Skilling",
                    "user_href": "/profile/Karen-Skilling"
                },
                {
                    "user_id": "Black Pink",
                    "user_href": "/profile/Black-Pink-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "James William",
                "href": "/profile/James-William-325"
            },
            "answer_text": "let’s not talk about the negatives of things! I’m saying this because there are pros and cons of everything in this world. Therefore, focus on the pros of things available to help us achieve our goals will be a better thing to do. Without a doubt, they charge high amount of fee in exchange of the quality of education they offer. Private schools offer some pros also. For example: Holy child school tuition.Better facility for sports.Offer better quality of facilities and advantageous of private school.COED K-6 School Program for kids.All girls’ 7-12 School Programs for girls.Some private schools in NJ offer financial aid to the qualified students. But one private school that I know about offers affordable tuition and transportation facility as well. I think you just need to figure out your educational needs and talk to the management of Oak. Therefore, I advise you to not to focus on only the disadvantageous private schools. ",
            "date": "Answered September 19, 2019",
            "views": "689",
            "upvotes": "0"
        }
    ]
}