{
    "title": "What is the best online MBA school? - Quora",
    "tags": [
        "Online MBA",
        "Online Schools",
        "E-learning in Higher Education",
        "Business School",
        "E-learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Madhu Jain",
                "href": "/profile/Madhu-Jain-13"
            },
            "answer_text": "InstituteCourse (Duration)Fees (Subject to change)Narsee Monji Institute of Management Studies (NMIMS), School for Continuing EducationPost Graduate Diploma in Business Management (2 Years); Retail Management Rs 68,000 Post Graduate Diploma in Marketing Management (2 Years)Rs 68,000Post Graduate Diploma in Financial Management (2 Years)Rs 68,000Post Graduate Diploma in Human Resource Management (2 Years)Rs 68,000Post Graduate Diploma in International Trade Management (2 Years)Rs 68,000Post Graduate Diploma in Banking And Finance (2 Years)Rs 68,000Post Graduate Diploma in Supply Chain Management (2 Years)Rs 68,000Post Graduate Diploma in Banking And Finance (2 Years)Rs 68,000Institute of Management Technology, Centre for Distance LearningPost Graduate Diploma in Management (2 Years)Rs 1,00,000Post Graduate Diploma (1 Year) in – Business Administration; Human Resource Management; Marketing Management; Financial Management; Material and Supply Chain ManagementRs 50,000Symbiosis Center for Distance Learning Post Graduate Diploma in Business Administration (2 Years), Specialisations – Finance; Marketing; Operations; HR; Customer Relationship Management; Management Accounting (Dual specialisation option available) Rs 30,000 – 35,000 Post Graduate Diploma in International Business (2 years)Rs 30,000 – 35,000Post Graduate Diploma in Banking and Finance (2 years)Rs 30,000 – 35,000Post Graduate Diploma in Human Resource Management (1 Year)Rs 18,000 – 21,000Post Graduate Diploma in Insurance Management (1 Year)Rs 18,000 – 21,000Post Graduate Diploma in Retail Management (1 Year)Rs 18,000 – 21,000Post Graduate Diploma in Customer Relationship Management (1 Year)Rs 18,000 – 21,000Post Graduate Diploma in Supply Chain Management (1 Year)Rs 18,000 – 21,000Post Graduate Diploma in Export and Import Management (1 Year)Rs 18,000 – 21,000Post Graduate Diploma in Information Technology (2 years)Rs 30,000 – 35,000Sikkim Manipal University Directorate of Distance EducationMasters of Business Administration (2 Years), Specialisations – Marketing; Retail Operations; Information Systems; Operations; Banking; Project; Total Quality Management; Human Resource; Healthcare Services; FinanceRs 49,600 – Rs 57,100Post Graduate Diploma in Business Administration (1 Year)Rs 27,600Post Graduate Diploma in MBA (Maximum duration: 2 years)Rs 25,500IGNOUMaster of Business Administration (MBA)(maximum duration is 8 years)Rs 1,500 per course– Rs 3,000Post-Graduate Diploma in Management (1 Year)Rs 1,500 per coursePost Graduate Diploma in Human Resource Management (1 Year)Rs 1,500 per coursePost-Graduate Diploma in Financial Management (1 Year)Rs 1,500 per coursePost-Graduate Diploma in Operations Management (1 Year)Rs 1,500 per coursePost-Graduate Diploma in Marketing Management (1 Year)Rs 1,500 per coursePost-Graduate Diploma in Financial Markets Practice(1 Year)Rs 1,500 per coursePrin LN Welingkar Institute of ManagementPost Graduate Diploma In Management (2 Years), Specialisation in Marketing Management; Finance Management; Human Resource Management; Retail Management Operations Management; Supply Chain Management; Business Administration; E-Business; International Business; Banking, Investment and Insurance (Dual specialisation option available)Rs 50,000 – Rs 53,600Amity University, (Distance Learning)Master of Business Administration (2 Years)Rs 36,000 – Rs 51,000(Books + VRC: Rs 16,000)Master of Financial Management (2 Years)Rs 66,000 – Rs 75,900PG Diploma in Business Management (1 Year)Rs 13,000 – Rs 18,000(Books + VRC: Rs 12,000)PG Diploma in Material Management(1 Year)Rs 13,000 – Rs 18,000(Books + VRC: Rs 12,000)PG Diploma in Marketing Management(1 Year)Rs 13,000 – Rs 18,000(Books + VRC: Rs 12,000)PG Diploma in Financial Management (1 Year)Rs 13,000 – Rs 18,000(Books + VRC: Rs 12,000)PG Diploma in Information Technology (1 Year)Rs 14,000 – Rs 19,000(Books + VRC: Rs 12,000)Diploma in Advertising & Brand Management (1 Year)Rs 12,000PG Diploma in Export Management (1 Year)Rs 13,000 – Rs 18,000(Books + VRC: Rs 12,000)PG Diploma in Production Operation Management (1 Year)Rs 13,000 – Rs 18,000(Books + VRC: Rs 12,000)PG Diploma in Insurance Management (1 Year)Rs 13,000 – Rs 18,000(Books + VRC: Rs 12,000)PG Diploma in NGO Management (1 Year)Rs 13,000 – Rs 18,000(Books + VRC: Rs 12,000)PG Diploma in Retail Management (1 Year)Rs 13,000 – Rs 18,000(Books + VRC: Rs 12,000)PG Diploma in Logistics & Supply Chain Management (1 Year)Rs 13,000 – Rs 18,000(Books + VRC: Rs 12,000)PG Diploma in Human Resource Management (1 Year)Rs 13,000 – Rs 18,000(Books + VRC: Rs 12,000)ICFAI University Master of Business Administration  (2 Years)(IU Sikkim)Rs 60,000MBA (2 Years), specialisation in Marketing; Human Resource Management; Finance (IU Tripura)Rs 75,000MBA (2 Years), specialisation in Hospital Administration; Pharma Management; Telecom Management (IU Sikkim)Rs 65, 000Executive MBA (2 Years)(IU Sikkim)Rs 1,50,000PG Diploma in Financial Analysis (2 Years) (IU Tripura)Rs 55,000Diploma in Investment Management (1 Year) (IU Tripura)Rs 18,500Diploma in Derivatives & Risk Management (1 Year) (IU Tripura)Rs 18,500Diploma in Global Financial Markets (1 Year) (IU Tripura)Rs 18,500Diploma in Talent Management (1 Year) (IU Tripura)Rs 18,500Diploma in Innovation Management (1 Year) (IU Tripura)Rs 18,500Diploma in Retail Management (1 Year)Rs 18,500Diploma in International Business (1 Year) (IU Tripura)Rs 18,500Annamalai UniversityMaster of Business Administration  (2 Years)Rs 38,650MBA (E-Business)Rs 38,650MBA (International Business)Rs 38,650MBA (Human Resource Management)Rs 38,650MBA (Marketing Management)Rs 38,650MBA (Financial ManagementRs 38,650MIT School of Distance EducationPost Graduate Diploma in Business Administration (2 Years)Rs 49,000 – Rs 42,000Post Graduate Diploma in Energy Management (1 Year)Rs 37,000 ",
            "date": "Answered October 6, 2015",
            "views": "717",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tolulope Abdulsalam",
                    "user_href": "/profile/Tolulope-Abdulsalam"
                },
                {
                    "user_id": "Deepesh",
                    "user_href": "/profile/Deepesh-53"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ajay Yadav",
                "href": "/profile/Ajay-Yadav-5419"
            },
            "answer_text": "Finding out the best Online MBA institute is not as simple as it might appear to be. The web world is full of many online schools offering various kind of course duration and other offers good enough to mystify us. But not all of them stick to what they promise. It is highly recommended to check and verify each and every aspect of an online institution before finally settling up with it. There is a huge impact of the internet over our lives. Online education has turned out to be a boon for all those looking for some higher education. Online MBA, of course is rated among the top online course which is pursued at present.  We all understand that an online MBA is a technology and internet based learning. Virtual classes are the main highlights of the best online business schools. Through these classes you can interact with the experts of the subject and also with the fellow students. Thus, this course not only appears to be interesting and interactive but also helps in building network. Online MBA is being popular as it is time and location independent course. Thus, it offers complete freedom.course contents can be provided as books by the online schools but they can also be downloaded on the machine. Virtual classes also give the opportunity for discussion, skills practice, lecture, or project discussions. This eliminates the chances of getting bored or demotivated.  This course definitely has its own merits. Therefore, most of the people looking for a kick in their career prefer joining Online MBA. The course is designed to train the students with in depth learning of the principles of Business management. Since the best courses have the quality and syllabus of any regular MBA, this online program is accepted worldwide. The wide scope of an online MBA course has a magnetic effect over most of us looking for a chance to make a bright future. I would like to reiterate to maintain the calm and not get lured by any average online school. There are many top rated MBA schools which are transparent with their information and provide the best online education programmes. For example MIBM Global is one among the best online institutions determined to offer the world class education.  MIBM Global sticks to its promise of imparting an online MBA which is at par with the quality of one given at a regular brick and mortar school. Faculty here includes experts of the subjects who have been extra careful while compiling the study material. MIBM Global is a perfect destination to experience the complete freedom of an online program. With its up to date syllabus it offers the best of the online MBA. Being one of the most prestigious institutes to offer online courses MIBM Global aims at sharpening the leadership skills. Apart from a good quality education the courses here are affordable and can be paid under different payment options available. The successful completion of the course from here also assures the good placements. There are many students of this online school who are enjoying the good profile and handsome salary. Thus, it is completely reliable and gives value for money. ",
            "date": "Answered May 8, 2018",
            "views": "412",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Afari",
                    "user_href": "/profile/Michael-Afari"
                }
            ]
        }
    ]
}