{
    "title": "What is the difference between a science teacher and a scientist? If you're a science teacher does that mean that you're a scientist? - Quora",
    "tags": [
        "Math/Science Teacher",
        "Scientists",
        "Teachers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter James Thomas",
                "href": "/profile/Peter-James-Thomas"
            },
            "answer_text": " A scientist (who will invariably have a PhD in their field) is actively engaged in scientific research or scientific theorising. The are aiming to extend the bounds of human knowledge.  A science teacher in secondary education (who will hopefully have a bachelors degree in a scientific subject and a teaching qualification) is engaged in imparting existing knowledge (or generally a limited subset of this) to others. A scientist might decide to become a secondary science teacher (and some actual scientists are required to teach undergraduate and postgraduate classes; tertiary or quaternary education), but a science teacher would most likely need to get additional qualifications to become a scientist. ",
            "date": "Answered October 3, 2017",
            "views": "17",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harikrishna.V. Holla",
                    "user_href": "/profile/Harikrishna-V-Holla"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/fungarian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Romeel Davé",
                "href": "/profile/Romeel-Davé"
            },
            "answer_text": "A scientist is someone working towards new scientific knowledge. Typically this involves doing research, which usually means they have a PhD — indeed the entire point of that degree is that you are certified as being able to create new knowledge. A science teacher disseminates existing knowledge. They are not working to create new knowledge, but rather spread the knowledge that’s been created. That is also an extremely important and valuable endeavor. But it is not the same as being a scientist. ",
            "date": "Answered October 3, 2017",
            "views": "836",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/fungarian"
                },
                {
                    "user_id": "Elijah Williams",
                    "user_href": "/profile/Elijah-Williams-23"
                },
                {
                    "user_id": "Zane Jakobs",
                    "user_href": "/profile/Zane-Jakobs"
                }
            ]
        }
    ]
}