{
    "title": "What happens if I don’t go to school? - Quora",
    "tags": [
        "Schools",
        "Higher Education",
        "Colleges and Universities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Natalie Holeman",
                "href": "/profile/Natalie-Holeman"
            },
            "answer_text": "I will answer assuming you live in the United States of America (USA). This answer may or may not have any validity if you live elsewhere. I will not discuss what can happen if you are below the minimum age to quit school where you live. Do you have a GED or plan on getting one? If so, future problems will be reduced. If you are in the USA, most jobs including the military will require at least a GED or high school diploma. I disagree with the necessity but that does not change the fact. The USA likes to think of itself as a merit based society. That is a lot of manure but it is how it views itself. People are viewed as more competent based on level of education. Competency is viewed in decreasing order: Doctoral degree > Masters degree > Baccalaureate degree > 2 year degree (vocational technical) > high school diploma > GED > no diploma and no GED. This view like the view of being a merit based society is giant pile of manure of the most reeking kind, but it is what exists. If you are really good at something that people want you will probably do okay. I was from that early age of computer programming before most schools taught it. I was according to multiple bosses in the highest of the elite both in quantity and quality. I never had any formal training in programming, I had a natural talent and read/used reference books for commands in the various languages. Many people excel without formal training. Let us assume you have all the skills and talent for your future desired career. By dropping out of school you will face discrimination. You violate the idea of the merit based society and therefore have no merit. You are a cheater and possibly a thief because you can do something others must train, sometimes for years, to be able to do. You will be viewed as someone to take advantage of or viewed undesirable. Let us assume you do not have the skills and talent for your future career, you can look forward to a miserable life of the lowest paying jobs. You will likely not be able to support a family and after a while probably unable to get a life partner as you offer nothing except yourself. Maybe you can become a full time house husband, washing and ironing the clothes, cleaning the house, preparing meals and doing dishes, and raising the children. Outside the home unless lucky to get a decent paying job you will probably be an economic drain (your income will have to exceed total of child care, transportation costs to/from work, additional insurance if you drive to work, higher cost meals compared to fixing something at home, increased tax liability, … or you actually will be costing household revenue to let you work). And these I have stated are the optimist futures, the probable ones include homelessness, prison, begging, … I do not agree with our societies emphasis on formal education. Among the smarter people I have know one may not have finished junior high (pregnant in early teens and forced to quit school by administration - common back then). She read. She read like a book a day. She watched the news. She watched things like Washington Report, Meet the Press, and Face the Nation. Unfortunately in our formal education attitude society she would be considered by many uneducated, politically unaware, and probably illiterate. You will face the same even if you continue your education through private study. I wish it were not so, but those are your prospects, those will be your handicaps. ",
            "date": "Answered January 28, 2020",
            "views": "54",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Owen Freeman",
                    "user_href": "/profile/Owen-Freeman-17"
                },
                {
                    "user_id": "Vik Murty",
                    "user_href": "/profile/Vik-Murty"
                },
                {
                    "user_id": "Sharene Algarin",
                    "user_href": "/profile/Sharene-Algarin-1"
                },
                {
                    "user_id": "Emily Gonzalez Nascimento",
                    "user_href": "/profile/Emily-Gonzalez-Nascimento"
                },
                {
                    "user_id": "Renee Bream",
                    "user_href": "/profile/Renee-Bream-1"
                },
                {
                    "user_id": "Sarah Lee",
                    "user_href": "/profile/Sarah-Lee-207"
                },
                {
                    "user_id": "David Blindt",
                    "user_href": "/profile/David-Blindt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joyce Fetteroll",
                "href": "/profile/Joyce-Fetteroll"
            },
            "answer_text": "There are already kids who don’t go to school. They’re called homeschoolers. Some homeschooling families recreate school at home. So that’s not exactly like not going to school. But some families, unschooling families, support their children exploring their interests. It looks nothing like school. Kids who love animals are supported in exploring animals. Kids who love to write, draw, do puzzles, play sports, read, help people, sell things, build things, are all supported. Additionally the parents expose them to more of the world so they can discover new interests. Those children go onto college if they want when they’re ready. The big advantage they have is they know what they love doing and have already been actively exploring it. College for them is a continuation of what they’ve been doing. But if school were just removed? What would happen would totally depend on what families replaced it with. The wealthy could send their kids to private schools. Or, if there were no schools at all, hire tutors. The middle class has an expectation of learning. Without school. many homeschooling communities band together to offer classes, even creating learning centers. They aren’t schools but more like drop in centers where kids can take a class or meet up with others who share an interest. If there never had been schools, society would be highly stratified. Families or segments of society that didn’t value learning, their kids would likely remain stuck without the skills to move beyond what their parents know. A society can function like that if it’s heavily dependent on unskilled labor. For an industrialized society, it means there are too many unskilled adults and not enough jobs for them. If, though, society in general does value learning, everything kids need in order to become functioning members of society is readily available on the internet and in most communities right now. Families can take advantage of it. All they need is to want to and to see how others successfully do it. ",
            "date": "Answered March 18, 2017",
            "views": "10",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Don Shiner",
                    "user_href": "/profile/Don-Shiner"
                },
                {
                    "user_id": "Sharon Marks",
                    "user_href": "/profile/Sharon-Marks-11"
                },
                {
                    "user_id": "Kyle Sheq",
                    "user_href": "/profile/Kyle-Sheq"
                },
                {
                    "user_id": "Jessica Lynne Belden",
                    "user_href": "/profile/Jessica-Lynne-Belden"
                },
                {
                    "user_id": "Holly Dean",
                    "user_href": "/profile/Holly-Dean-4"
                },
                {
                    "user_id": "Juanita White",
                    "user_href": "/profile/Juanita-White-3"
                },
                {
                    "user_id": "Jenny Chabot",
                    "user_href": "/profile/Jenny-Chabot-1"
                },
                {
                    "user_id": "Tiffany Thomas",
                    "user_href": "/profile/Tiffany-Thomas-106"
                },
                {
                    "user_id": "Rhonda Power",
                    "user_href": "/profile/Rhonda-Power-1"
                },
                {
                    "user_id": "Gabriel",
                    "user_href": "/profile/Gabriel-254"
                },
                {
                    "user_id": "Jin Hao",
                    "user_href": "/profile/Jin-Hao-27"
                },
                {
                    "user_id": "Gabriella Alesi",
                    "user_href": "/profile/Gabriella-Alesi"
                },
                {
                    "user_id": "Maryam Atif",
                    "user_href": "/profile/Maryam-Atif-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Brister",
                "href": "/profile/Mary-Brister"
            },
            "answer_text": "Okay. I’ve seen a lot of replies here saying that you will be dumb, although this is incorrect since dumb means “unable to speak.” No, what they mean is, you will be uneducated. Stupid is a characteristic you are either born with or you aren’t. But you don’t have to be completely uneducated. Now if you are talking about elementary and secondary education, are you having difficulties with it? Or do you just want to quit? You will be better off if you finish and graduate as employers prefer to see at least a high school education on your job applications. You would be amazed how much that diploma helps as you start out. It won’t matter much later as you get experience under your belt, but if you show up as a drop out, it could affect you a lot as it will affect the kinds of jobs you will be able to get. But if you don’t think you can get the diploma, get a GED as soon as you can. It isn’t as good but it could help you in the next step. Now, if you are talking about post-secondary, college, well, not everyone is suited for it. I taught high school. In Career and Technical Education classes, or what used to be know as Vocational Education. There is a valid reason for having those classes. Not everyone is suited for college. Not everyone is going to college, nor should everyone go. We have far too many jobs that need to be done by people who don’t wish to get a college degree. But there are trade schools where you could learn to be a plumber or an electrician or a welder (those make good money!), or any number of other careers that require two years or less in school. And those classes are not like college. Most of the classes involve hand’s-on learning. Not just sitting in a class learning from books. Think about it. Why limit yourself? I once spoke to a lawyer who said his most intelligent client was one who had worked offshore and been injured, ending that career. When he healed enough to do something else, he went to trade school and learned a new career and went back to work. Never stop learning. Never stop trying. Be the best YOU you can be. ",
            "date": "Answered December 27, 2017",
            "views": "79",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aysha Waseem",
                    "user_href": "/profile/Aysha-Waseem-3"
                },
                {
                    "user_id": "Sarah Lee",
                    "user_href": "/profile/Sarah-Lee-207"
                },
                {
                    "user_id": "Melissa Grhb",
                    "user_href": "/profile/Melissa-Grhb"
                },
                {
                    "user_id": "Loveleen Gupta",
                    "user_href": "/profile/Loveleen-Gupta-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Toyen Newing",
                "href": "/profile/Toyen-Newing"
            },
            "answer_text": "Do it to find out, act impulsively before you think. It means you’ll go somewhere else, dummy. Where, I am uncertain. Why do you not want to go to school? Are you getting name-called, you patootie? Actually, intermission. …. Ohhh, I think I like being called Patootie better, let’s swap names. You can be Tootsie. You like a chocolate. This does not mean I am calling you black or brown. Access the internet enough and eventually you should figure out everything I did. I was an idiot, and am still one. Any fool can do it. Are you getting thrown down a flight of stairs and hospitalized like Musk? If you are, yikes. I am going to suggest you school yourself. Try to get to America. If you are already in America, then what the Donald? Are your parents having arguments? Being abused by your siblings or other relatives? The police can’t really help you out there unless it escalated enough. It’s just a brotherly/sisterly quarrel! Talk it out with someone. You’ll feel ostracized further. I don’t think anyone should feel this way so I have placed the weight of the world on my shoulders to defeat the final boss. You should make a friend or two, maybe 5000 (FB friend limit—I did this and got spam calls and my account shut down because it was flagged as fake, which doesn’t make sense because I have dozens of email addresses and fake accounts). Play video games where you can interact with others online. Mobile MOBA games such as Arena of Valor. Of course, I know the history of DOTA and Steam. Learn the history of the science and the internet and watch anime. If you know that, you are pretty much set to take on everything. lul ye tht totally works, took me 1.5 years but that’s because I spent 4 years becoming the strongest swordsman in a video game and got used to hard/huge learning curves from that It is much rambling about myself. That’s what you can do. Write. Drawing portraits of me and submitting them to my Fanart (F-art) page works too. Look to Jaiden Animations for guidance on grinding exp for your artistic style. Probably (more like definitely) not the best, but I get to refer you to whoever I want to. ",
            "date": "Answered August 13, 2020",
            "views": "13",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Amy Le",
                    "user_href": "/profile/Amy-Le-224"
                },
                {
                    "user_id": "Sharon Marks",
                    "user_href": "/profile/Sharon-Marks-11"
                },
                {
                    "user_id": "Nova",
                    "user_href": "/profile/Nova-446"
                },
                {
                    "user_id": "Jessica Lynne Belden",
                    "user_href": "/profile/Jessica-Lynne-Belden"
                },
                {
                    "user_id": "Penelope Greenfield",
                    "user_href": "/profile/Penelope-Greenfield"
                },
                {
                    "user_id": "Graham Rowe",
                    "user_href": "/profile/Graham-Rowe-8"
                },
                {
                    "user_id": "Madoka Hitonaga",
                    "user_href": "/profile/Madoka-Hitonaga"
                },
                {
                    "user_id": "Janelle Hayes",
                    "user_href": "/profile/Janelle-Hayes-4"
                },
                {
                    "user_id": "Susan Nebraska",
                    "user_href": "/profile/Susan-Nebraska"
                },
                {
                    "user_id": "Sunita Negi",
                    "user_href": "/profile/Sunita-Negi-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rosemary Ward Laberee",
                "href": "/profile/Rosemary-Ward-Laberee"
            },
            "answer_text": "Many great things. I know. I did not send my 4 kids to school, until college. My results, which were superb, are not at all uncommon. I have two Ivy League graduates, a son at the US Naval Academy and a 15 year old still being educated without going to school. My thoughts on keeping your kids out of school: They learn how to think because they are not being told what to think by school systems. They grow to love learning because they are not tested to death from a very young age. They are able to get more sleep, eat a healthier diet, and grow to be more fit because they are not sitting in stuffy classrooms all day long. They are able to participate in many different sports (all club sports are open to them) and because they have more time during the day and the ability to recover properly with true rest they can truly excel. They have fewer friendships but the ones they have are more meaningful and more real and they know it. They are closer to their siblings. They have ample opportunities to travel and see the world because they are not bound to the 9-months-in-school mentality. Their transcripts are far more interesting to competitive universities. They have huge advantages over the boiler-plate transcripts, reflecting lock-step coursework, from their brick and mortar schooled peers. Colleges love to get home educated kids! Because they spend their weeks in mixed-age groups, they grow to become better conversationalists, able to talk to those younger and much older. Many young people who spend their days in same-age groups are only comfortable communicating in a certain way and usually only with their peers. They understand that many of society’s rules are false. No one ever HAS to go to school to become learned. Most of the world does not know this. Home educated kids do. And this sea-changing knowledge is transferred to other areas of life. It works. ",
            "date": "Answered July 21, 2018",
            "views": "65",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarah Lee",
                    "user_href": "/profile/Sarah-Lee-207"
                },
                {
                    "user_id": "Greg Beutler",
                    "user_href": "/profile/Greg-Beutler"
                },
                {
                    "user_id": "Lynn Sandweiss",
                    "user_href": "/profile/Lynn-Sandweiss"
                },
                {
                    "user_id": "Isabella Helena Rutan",
                    "user_href": "/profile/Isabella-Helena-Rutan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robin Kaminsky",
                "href": "/profile/Robin-Kaminsky"
            },
            "answer_text": "Are we talking HS or college? Legally in the US you must attend school. The age at which school remains a requirement differs by state but in most states you must attend until you are 16, in some states it’s 18 though there are exceptions, including passing a proficiency exam, once a minimum age is reached. School attendance is governed by compulsory education laws and the educational requirement can be met through public, private or home school options as long as the option is state accredited. Failure to attend school to the minimum age has punishment under each state’s truancy interventions and typically involves both parents and students though by HS many students fall through the cracks if they drop out. Post the minimum age/HS there is no requirement to attend school. So if you don’t that’s a personal choice. At that point the question becomes what do you intend to do instead? What kind of job will you get to support yourself or do you have the independent wealth not to require a job? For most people a college degree is required as a minimum to pursue work in many fields particularly white collar work. Without a degree, most white collar professions will be closed to you or severe limitations will be placed on your career path within the field. For example you may be able to secure an administrative position but never rise or move into a managerial one. A college degree increases earnings potential and actual lifetime wealth, For trades, like plumber, mason, mechanic, pipe fitter etc., there are trade schools and apprenticeships to train for these roles. Training for and obtaining a job in a trade can be quite lucrative and many trades have severe shortages of qualified tradesmen/women driving wages up higher as demand outstrips supply. Now there are very successful billionaires that never earned their traditional college degree. Bill Gates and Mark Zuckerberg would be two great examples alongside Steve Jobs and Steve Wozniak. These rare individuals founded multi billion dollar companies and dropped out to lead them. Ted Turner was kicked out of Brown, joined his father’s advertising agency and ultimately turned it into a cable TV empire. These examples are not the norm for the vast majority of the population. In the arts again there are examples of very successful individuals who never attended and or never completed college as well. Their talent is their calling card. Examples include Ellen DeGeneres, Russell Simmons, Oprah Winfrey, Tyler Perry, Steven Spielberg (completed his degree after attaining success as a director), Haim Saban, James Cameron, Rachel Ray, and Mark Burnett. So what happens if you don’t go to HS? If you are under the minimum state age required under the compulsory education laws you and your parents are subject to punishment under state truancy, and a lack of at least a HS degree is severely limiting to future earning potential. Without a HS degree, or it’s equivalent, you will be hard pressed to find work outside minimum wage. What happens if you don’t go to college or trade school? Legally nothing. From a earning potential and career standpoint you may find it difficult to find work in many white collar fields and or find your career path is very limited within the field. Unless of course you are the exception that founds a breakthrough company or has rare talent that makes you a star in the arts then a college degree is a non-issue. ",
            "date": "Answered June 19, 2019",
            "views": "7",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Islam Abdulkarim",
                    "user_href": "/profile/Islam-Abdulkarim"
                },
                {
                    "user_id": "Kieren Pior",
                    "user_href": "/profile/Kieren-Pior"
                },
                {
                    "user_id": "Chuck Matthews",
                    "user_href": "/profile/Chuck-Matthews"
                },
                {
                    "user_id": "Robert Levitt",
                    "user_href": "/profile/Robert-Levitt"
                },
                {
                    "user_id": "Donna Elaine",
                    "user_href": "/profile/Donna-Elaine-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allen M. Morris",
                "href": "/profile/Allen-M-Morris"
            },
            "answer_text": "You asked, “What happens if I don’t go to school?” The short answer is, “Nothing,” but a longer answer is, “Nothing much.” If we are talking about Public Education (school that others have paid for so that you can get an education at no cost to you) it is possible that you will be called into court and fined and then sent back to school. Or it is possible that you will just sort of melt into the background and meander from part-time low-wage job to part-time low-wage job. Or you could be full of ambitions and be one of those people who do not learn well in the classical school environment. It could be that you really do want to learn and that you will continue to put forth efforts, work hard and accomplish great things. If the latter is the case, you will come to understand that it would have been easier had you gotten some of the things that others paid for you to have at no cost to you. Beyond public high school, education comes at a cost to you in the forms of cash and time. Those who remain in public high school, only have the cost of time -get as much education as you can while you are young and someone else is paying for it. Education is designed for you to have a better quality of life and in almost all cases, it works out that way. Those who put forth no effort and who do not get an education while they are young, rarely have a good quality of life. On the other hand, those who do try and who do get an education normally have a much better quality of life. Work hard now and be a champion for the rest of your life! I am Allen Morris and I approve of this dashed off first draft complete with any errors that might have crept in… ",
            "date": "Answered November 13, 2019",
            "views": "25",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amy Le",
                    "user_href": "/profile/Amy-Le-224"
                },
                {
                    "user_id": "Jared Lupton",
                    "user_href": "/profile/Jared-Lupton-2"
                },
                {
                    "user_id": "Isabella Helena Rutan",
                    "user_href": "/profile/Isabella-Helena-Rutan"
                },
                {
                    "user_id": "Divya Chowdary",
                    "user_href": "/profile/Divya-Chowdary-78"
                },
                {
                    "user_id": "RYAN PETERSON",
                    "user_href": "/profile/RYAN-PETERSON-92"
                },
                {
                    "user_id": "GameOrDeath",
                    "user_href": "/profile/GameOrDeath"
                },
                {
                    "user_id": "Too Kawaii for You",
                    "user_href": "/profile/Too-Kawaii-for-You"
                },
                {
                    "user_id": "Philippe Geoffroy",
                    "user_href": "/profile/Philippe-Geoffroy"
                },
                {
                    "user_id": "Dawn A. Charron",
                    "user_href": "/profile/Dawn-A-Charron"
                },
                {
                    "user_id": "Philipp Truveller",
                    "user_href": "/profile/Philipp-Truveller"
                },
                {
                    "user_id": "Christina Matheny",
                    "user_href": "/profile/Christina-Matheny-1"
                },
                {
                    "user_id": "Pedro Henrique Barbosa de Carvalho",
                    "user_href": "/profile/Pedro-Henrique-Barbosa-de-Carvalho"
                },
                {
                    "user_id": "Jeff Ron",
                    "user_href": "/profile/Jeff-Ron-1"
                },
                {
                    "user_id": "Ccjsn DBn",
                    "user_href": "/profile/Ccjsn-DBn"
                },
                {
                    "user_id": "Dima Krist",
                    "user_href": "/profile/Dima-Krist"
                },
                {
                    "user_id": "Md.Lavlu Mia",
                    "user_href": "/profile/Md-Lavlu-Mia-1"
                },
                {
                    "user_id": "Parth Aggarwal",
                    "user_href": "/profile/Parth-Aggarwal-38"
                },
                {
                    "user_id": "Evelyn Lovan",
                    "user_href": "/profile/Evelyn-Lovan"
                },
                {
                    "user_id": "Abdul Ola",
                    "user_href": "/profile/Abdul-Ola-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brandon Na",
                "href": "/profile/Brandon-Na"
            },
            "answer_text": "You lose the opportunity to meet other kids your age and build your social skills. You lose the chance to become friends with kids who can relate with you. You lose the possibility of being taught by one of the best teachers in the world. At the same time, nothing happens really, if you’re talking about “learning” per se. Overall, many subjects, content and everything you learn in school is available online. You could easily read many quora answers and still probably have a better “education” than some of the less motivated students in this world. There are many famous dropouts and depending on when you think you’re “not going to school,” you might be at the same stage as them. However, one other thing you could lose the chance to do is be able to ask your peers and your teachers the many questions you might find answers here on Quora…online answers are not the same as asking someone live. You can’t follow up as easily. Sure, you can comment and you can continue to ask more questions, but again, it’s not the same. You can go to reddit. You can read wikipedia and you can take classes on coursera, but again, it might not be the same. There are many who are growing up, educating themselves and improving their lives through the Internet and the many websites that make up the world wide web. School may become less of a necessity. ",
            "date": "Updated May 5, 2019",
            "views": "126",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Daniel Frierson",
                    "user_href": "/profile/Daniel-Frierson"
                },
                {
                    "user_id": "Christina Matheny",
                    "user_href": "/profile/Christina-Matheny-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tori Spencer",
                "href": "/profile/Tori-Spencer-22"
            },
            "answer_text": "TLDR: Maybe you don’t want anything to school now but you might in the future. By that time it’ll be harder and you’ll have to invest more blood, sweat and tears into getting where you want to go. The short answer is that it really depends so I’ll speak from my experience as if I hadn’t gone back to school. I’d gotten an associate’s degree in communications that I didn’t end up using for work and I really wanted to study science, but hey, I’d graduated and at the time that was plenty of accomplishment for my age. I could always go back later right? My pay bracket didn’t increase much though so I spent a lot of time bouncing between entry-level positions trying to craft the job of my dreams (in the sciences). I did eventually find a job in healthcare with benefits but I wasn’t interested in nursing or the medical field. So there I stayed in my early 20s working 60 hours a week thinking that I was filthy rich. It’s a lot when you start off with a cell phone bill but then the car note comes in, and rent, and gas, and insurance, and the credit cards pile up, and water, and electric, and sewer, and trash, oh and did you want cable and internet too? What about food? See where this is going? Living expenses definitely impacted whether I though I could realistically afford to ever go back to school. The 60 hours I was working would never allow it because I wasn’t actually making much to begin with. I decided then, that if I was going to be making ends meet anyways, I might as well do something I like but when I finally went back to school for my B.S. in Biology, it was so much harder as a working student. I had 2–5 jobs at any given time; part time, overnights, PRN, you name it. I had to piece together a living wage while taking day classes full-time. Not to mention, I felt like I had a lot of ground to cover because I still hadn’t taken the basic bio classes yet like many of my peers. I did graduate and I’m currently working towards my PhD. My life is finally headed in the direction that I want it to go and the pay is much better (some may disagree but I am definitely comfortable) so I don’t regret going back no matter how hard it was. Still, it was a nightmare of a time and I really had to grind the second time around. I could not imagine having had children during this time though there are many who do. Imagine how much more dire such a situation can be with daycare and baby food, and clothes added to all the other expenses. I think back to the time when I first decided to go back. It was hard call to make at the time; all my friends and family lived close by and I had that 60 hour job that wasn’t going anywhere. I cringe now thinking that I could still be working 60 hours a week in my hometown with no lasting passion for my work towards a promotion that might take me 5 years to get. Go to school, graduate with something, whether it’s at a trade school certificate or at a community college degree. Then take some time off and live life. You will likely thank yourself later. ",
            "date": "Answered September 26, 2020",
            "views": "156",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Jemma Long",
                    "user_href": "/profile/Jemma-Long-7"
                },
                {
                    "user_id": "Nick Southern",
                    "user_href": "/profile/Nick-Southern-2"
                },
                {
                    "user_id": "Charlotte Avant",
                    "user_href": "/profile/Charlotte-Avant"
                },
                {
                    "user_id": "Robert Charles Lee",
                    "user_href": "/profile/Robert-Charles-Lee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pamela Miller",
                "href": "/profile/Pamela-Miller-206"
            },
            "answer_text": "Daniel, If you are talking finishing whatever grade you are in? I can only answer as to what happens in Summit County Ohio where I reside. Ohio law defines truancy as an absence from school without legitimate excuse. The truancy laws apply to students between ages 6 and 18 and recognizes two types of truancy: habitual and chronic. Habitual truancy is the absence from school without a legitimate excuse for 5 or more consecutive days, 7 or more school days in one school month, or 12 or more school days in a school year. Chronic truancy is the absence from school without a legitimate excuse for 7 or more consecutive school days, 10 or more school days in one school month, or 15 or more school days in a school year. Most school attendance policies cite the following excuses for absence as legitimate (supporting documentation may be required): emergencies, funerals, illnesses, medical appointments and religious holidays. Examples of illegitimate excuses include: didn’t feel like going today, had to babysit siblings, missed my ride, overslept, and parents forgot to wake me up. Schools Once a truant student is identified, school districts are required to provide a written notice, warning the student and the parents of the legal consequences and insisting that the student be compelled to attend school immediately. School officials may also request a meeting with student and parents to discuss the reasons behind the youth’s truancy and to find a solution to the problem. If all other measures fail to resolve the truancy problem, school officials are required by law to file a complaint on the youth at Summit County Juvenile Court. School officials may also file failure to send complaints on parents. Parents are legally responsible for enrolling their child in school and making sure their child attends school, unless lawfully excused. Legal Consequences If the Court finds a youth or parent to be in violation of a state truancy law, the following legal consequences may be court ordered:  Bonds, fees and fines (up to $500);  Community service (up to 70 hours);  Counseling;  Electronic monitoring and house arrest; and  Mandatory appearance in Court, mediation or parenting classes. https://co.summitoh.net/juvenilecourt/images/stories/pdfs/Brochures/a%20guide%20to%20understanding%20truancy.pdf ",
            "date": "Answered March 24, 2020",
            "views": "355",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Lynn Sandweiss",
                    "user_href": "/profile/Lynn-Sandweiss"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shawn Ingeberg",
                "href": "/profile/Shawn-Ingeberg"
            },
            "answer_text": "Short answer is dependent on your age. If you are below the age of signing yourself out of the school system, you can expect Child Services to intervene and that opens a really big can of worms. If you are of age, you can leave but you will be very limited in work. Almost everything requires a GED or equivalent. Lots of jobs won't even look at your resume without it. I'm now 48 with my GED, I am very limited in future prospects as I don't have any post secondary credits or certificates or even a degree. I have basically topped out my earnings because I don't have the education to make more money. Please stay in school. If you are being bullied, talk to your councilors, teachers, parents, anyone who can help you. If you think you can make more money now and don't need a full education, think again. I worked as a contractor and tradesman for 30 years until an accident disabled me. No more physical work now as my back can't do it. Look at all the Football and Hockey players in the Big Show and you can see if they are injured beyond limits of their profession, they are no longer collecting an income (barring endorsement deals). If you are having a problem with understanding the work, talk to your teachers and councilors to see if your schedule can be modified or extra tutoring. You can do it. You have the ability. All life takes is applying yourself and you can succeed. School is the same. If you think school is too hard, please remember that life outside school is even harder. Please stay in school, it can only help you. ",
            "date": "Answered September 25, 2020",
            "views": "86",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Emil Kirberg",
                    "user_href": "/profile/Emil-Kirberg"
                },
                {
                    "user_id": "Patricia Ross",
                    "user_href": "/profile/Patricia-Ross-43"
                },
                {
                    "user_id": "Zully Loreí",
                    "user_href": "/profile/Zully-Loreí"
                },
                {
                    "user_id": "Matthew Placido",
                    "user_href": "/profile/Matthew-Placido"
                },
                {
                    "user_id": "Bill Sanske",
                    "user_href": "/profile/Bill-Sanske"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sakis-Boyd"
                },
                {
                    "user_id": "Fio TG",
                    "user_href": "/profile/Fio-TG"
                },
                {
                    "user_id": "Lou Padula",
                    "user_href": "/profile/Lou-Padula"
                },
                {
                    "user_id": "Hugo Lane",
                    "user_href": "/profile/Hugo-Lane-3"
                },
                {
                    "user_id": "Rena Tate",
                    "user_href": "/profile/Rena-Tate-2"
                },
                {
                    "user_id": "David TW",
                    "user_href": "/profile/David-TW-2"
                },
                {
                    "user_id": "Marian Eby",
                    "user_href": "/profile/Marian-Eby"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/An-Old-School-Educator"
                },
                {
                    "user_id": "Nancy Henderson",
                    "user_href": "/profile/Nancy-Henderson-7"
                },
                {
                    "user_id": "Gabriel Tobing",
                    "user_href": "/profile/Gabriel-Tobing"
                },
                {
                    "user_id": "Robert Levitt",
                    "user_href": "/profile/Robert-Levitt"
                },
                {
                    "user_id": "Greg Beutler",
                    "user_href": "/profile/Greg-Beutler"
                },
                {
                    "user_id": "Mary Skinner",
                    "user_href": "/profile/Mary-Skinner-19"
                },
                {
                    "user_id": "Byron Connell",
                    "user_href": "/profile/Byron-Connell"
                },
                {
                    "user_id": "Catherine McClarey",
                    "user_href": "/profile/Catherine-McClarey"
                },
                {
                    "user_id": "Lally Styles",
                    "user_href": "/profile/Lally-Styles"
                },
                {
                    "user_id": "Lynn Sandweiss",
                    "user_href": "/profile/Lynn-Sandweiss"
                },
                {
                    "user_id": "John Brennan",
                    "user_href": "/profile/John-Brennan-246"
                },
                {
                    "user_id": "Adam Bomb the Admin",
                    "user_href": "/profile/Adam-Bomb-the-Admin"
                },
                {
                    "user_id": "Vivian Wilder",
                    "user_href": "/profile/Vivian-Wilder-1"
                },
                {
                    "user_id": "M A Smith",
                    "user_href": "/profile/M-A-Smith-2"
                },
                {
                    "user_id": "Fern Ward Buntyn",
                    "user_href": "/profile/Fern-Ward-Buntyn"
                },
                {
                    "user_id": "Roberta King",
                    "user_href": "/profile/Roberta-King-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Green",
                "href": "/profile/Mike-Green-12"
            },
            "answer_text": "There are many realities that have occurred over the last 30 years in public education. The one thing that is clear is that High School is not the “end” of one’s education. No matter what job that you do after high school, chances are you will need additional training. High School only guarantees that you, hopefully, can read, write, and understand enough to learn more. The opening line of the commencement speech I gave was, “Congratulations, you now have the required skills to get any job that requires you to wear a paper hat.” It is up to you to understand that and determine how you will determine your future. You no longer are accountable to your parents. You are accountable to you and the law. The next thing that I ask is “why do you not want to continue?” There are many reasons for this. I had friends that were so disillusioned by high school teachers that they saw graduation much like obtaining a release from prison. The one thing that you have to understand is that “COLLEGE IS NOT HIGH SCHOOL”. The structure is different and the social norms that you witnessed in high school are not present in college. It also means that you do not have teachers who will seek you out when homework is not turned in on time. While this means that you are the one that is responsible, you are not alone either. Any professor worth their degree, will help you if you ask them. As for the consequences for not going to school, there is not much good news. There are jobs out there for people who have not obtained a college education, but they are getting fewer and fewer. In addition, those jobs are not paid well. Many of my friends who did not go on to college, have had to work longer and at lower positions to get anywhere near a living wage. Despite what many have hoped, the manufacturing jobs that were promised are not coming back. I know that this sounds like a tale of woe. It is a true tale for all too many. The best advice my grandfather gave me was this. “if you want to be a Bum, be the best one there is. Don’t be one because that is all you can do.” There is nothing wrong with taking time away from school once you have graduated. You don’t have to start with a full semester at a college. However, there are some things that you can do to make a better and informed decision. I would go to a guidance counsellor at a community college and discuss with them honestly what you would like to do. They can then advise you as to what kinds of possibilities there are available. In addition, you can go to a community college and take just one course. Most community colleges are open enrollment and don’t require you to be admitted in a traditional manner. Take one course and see what happens. Take advantage of the resources at the college that can help guide your decisions and know that you are making an informed decision that is yours. Education is always an asset even if you don’t get a degree. ",
            "date": "Answered August 17, 2020",
            "views": "217",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Fthawi Tekle",
                    "user_href": "/profile/Fthawi-Tekle"
                },
                {
                    "user_id": "Cecil Whorton",
                    "user_href": "/profile/Cecil-Whorton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Solange",
                "href": "/profile/Tony-Solange"
            },
            "answer_text": "So if you play 2k on X Box (I do with my kids, daughters and son, father-kid bonding) — who doesn't right— there's a Drake song that I think answers your question, “Dropped out of school, now you're dumb rich.” There are few people prepared to support themselves in this ever competitive society. Note — the competition isn't just for a job, it's for just about everything. If you're a guy. Women want good looking men; however, if “good looks” is among a man's shortcomings, a woman would overlook it if he earns. Google: “Do Women Really Value Income Over Looks?”If you're a gal. No surprise — looks matter to men. Google: “What Men Desire In Women.” Believe it or not, men want an intelligent woman as well.If you're gay. It's complicated. Men and women appear to be very picky (sorry my gay dudes and gals). Google: “10 Reasons Why Gay Dating Is Really Hard.” Not having an education may not be a deal breaker, but it will likely be a deal breaker.I think it's better not to be dumb rich, but some folks pull it off. Very few, but some. I worked crappy jobs during undergrad and then business school — it was horrible. I was waking up to go to work then I'd blink and I was back at school. But, looking back, I would rather do the dirty (jobs) then and working for a better life than to be still doing the dirty right now. Believe me. Don't misunderstand me — honest work is honest work. But work is different for the educated (nothing against those who don't pursuit it). You don't give dumb rich a second thought. ",
            "date": "Updated December 25, 2017",
            "views": "62",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarah Lee",
                    "user_href": "/profile/Sarah-Lee-207"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stan Hayward",
                "href": "/profile/Stan-Hayward-1"
            },
            "answer_text": "The chances are that you will be successful in life There are millions of people who don’t go to school for various reasons ranging from being in war-torn places, poverty, illness, isolation, and sometimes gender Initially, they survive doing menial jobs that do not require much educationSome have talents and aptitudes that they develop on their own. This is common in sports, arts, and some technical pursuits such as Handymen and Carers. Some will accept dangerous work. unpleasant work, or jobs in unsocial hours You will live in strata of society where most of your companions are similar to yourself and live on a day-to-day basisYou will learn to live very simply and cheaplyYou will learn to seek opportunities in every situation You will work with two types of peopleThose like yourself, who you totally accept and understandand those who treat you as inferior due to your circumstances. You will not be affected by their attitudes to you Over time, you will realise that most jobs at the lower levels of society do not require much education or skill, on the other hand, you will pick up a range of abilities from different jobs, and learn to adapt yourself to working with different people You will not think in terms of a career path, and not waste time, money, or effort doing anything that doesn’t help your survival You will reach a point where you accept your current lifestyle and are comfortable with it, or you will decide to move out of it and change your lifestyle for what you feel is better An interesting subject to study is the background of famous actors, many of whom come from poor circumstances ",
            "date": "Answered August 14, 2020",
            "views": "433",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abuzer Faisal",
                    "user_href": "/profile/Abuzer-Faisal"
                },
                {
                    "user_id": "Jacob Sawyer",
                    "user_href": "/profile/Jacob-Sawyer-13"
                },
                {
                    "user_id": "Terry Smith",
                    "user_href": "/profile/Terry-Smith-279"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jennifer Willing",
                "href": "/profile/Jennifer-Willing"
            },
            "answer_text": "Well, Daniel, that depends upon your age. If you’re under 18 and still in high school, you won’t graduate. Why should you care? Well, unless you’re parents are good with you living with them until they die, you’re going to have a tough time supporting yourself. You most certainly won’t be getting married as most young ladies will not be impressed when you’re still living at home with you parents and don’t have a job because you never got a high school diploma. Now, if you’ve got a high school diploma, that is a good start. If you mean you don’t want to go to college, that’s fine. However, you’re probably going to need to either take classes for a specialized job/career such a truck driving, carpentry, plumbing, HVAC, etc. Believe it or not, all of these jobs require additional training beyond high school. I don’t know about truck drivers (they make decent money) but I’m pretty sure the other three will make more money than I do as a teacher. If none of these sound appealing, you’re probably going to want to graduate from college if you want a more lucrative, white-collar type of job. Or you could work retail the rest of your life- that’s not easy, either. Trust me- I’ve done it. ",
            "date": "Answered September 27, 2019",
            "views": "15",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Thomas Moses",
                    "user_href": "/profile/Thomas-Moses"
                }
            ]
        },
        {
            "author_info": {
                "name": "Monica Seggos",
                "href": "/profile/Monica-Seggos"
            },
            "answer_text": "You don’t have to go to college if you don’t want to. There are many people who quit good schools, because it was not for them. One of the most famous is Steve Jobs.  [1] It is important not to go to school if you don’t want to. You will just be unhappy, and it will be a waste of money. The thing is about college is that it will always be there. I went to college when I was younger, but I honestly can’t say that going ever impacted my life or my work in any way. I did, however, go back to school as an adult. What a difference! I was thrilled to be learning, worked really hard and the experience changed my life. I found it so valuable that I am actually going back to school again for an MFA. More and more, undergraduate degrees don’t seem to be enough anymore for certain types of jobs. Then again, more and more, degrees seem to be irrelevant. There are so many people creating their own work and way of life. For these people, college would have been a waste of time. One option you can consider is taking a gap year. You could take classes, travel, spend time in nature, start a business-whatever you want to do. At the years end, you can take another look at how you feel. If you decide school is for you, then you already have a great story to share for your application-you can talk all about your gap year. If you decide that you had made the right decision, you can move forward. Good luck! I wish you all the best I posted an article in the footnotes if you are interested. Footnotes[1] These 16 insanely successful college dropouts show you don't need a degree",
            "date": "Answered September 23, 2020",
            "views": "77",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "• Mars •",
                    "user_href": "/profile/Mars-472"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chuck Matthews",
                "href": "/profile/Chuck-Matthews"
            },
            "answer_text": "Question: What happens if I don’t go to school? First, it depends on what year you’re in and how old you are. If you are under 16, for example, an officer may come to your door eventually and compel you to go to school. There may be penalties for your parents and yourself. Otherwise, really, nothing happens. That’s right: Nothing. But then, the consequences are that nothing happens, too. There will come a time when you will need to find a job, earn a salary, pay for food and shelter, and so on. Your earlier choice will dictate the opportunities you can pursue for employment, and those opportunities are likely to be few in number. You will not be able to aspire to higher positions until you can show some educational achievements, such as a high school diploma (or GED), a trade school certificate, associate degree, bachelor’s degree, master’s degree… Your life path and career path are up to you. What do you want to do? What do you want to be? Your choice to attend school will influence what opportunities are available to you. ",
            "date": "Answered September 11, 2019",
            "views": "122",
            "upvotes": " View 28 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Isabella Helena Rutan",
                    "user_href": "/profile/Isabella-Helena-Rutan"
                },
                {
                    "user_id": "Noah Ntambo",
                    "user_href": "/profile/Noah-Ntambo"
                },
                {
                    "user_id": "Abdul Nasser",
                    "user_href": "/profile/Abdul-Nasser-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samiaji Judistira",
                "href": "/profile/Samiaji-Judistira"
            },
            "answer_text": "If the question is simply “What happens if I don’t go to school?” then the answer is “Nothing”. The world will still be going round and round, the sun will still rise in the east, and so on. But if you ask: “What happens to me if I don’t go to school?” Then the answer will be different: Recently (I currently happen to be residing in one of the developing countries) I acquired a piece of land up in the mountain. It is a beautiful place and the climate is very comfortable. I would go there for the weekend just to get away from the city. I hired a local young man to tend the land and to grow whatever without doing something serious. After several months, I thought of starting a hydroponic farm on that land, and so I talked to the young man about my plan. I told him that he would manage the operation, and he would have to keep meticulous records of the operation and everything, and that he would get a share of the profits in addition to his meager pay. I was surprised when he replied, “Sir, if you want me to do that, I am going to have to quit…” When I asked why, he proceeded to tell me that he only had a third grade education, and that he could not really read or write, and that it would be way over his capabilities. I felt sorry for him. He is a very industrious young man and I like how he works. But apparently he has risen to the level of his competence. ",
            "date": "Answered June 5, 2020",
            "views": "51",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Chuck Matthews",
                    "user_href": "/profile/Chuck-Matthews"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jennifer Kohos Kostiner",
                "href": "/profile/Jennifer-Kohos-Kostiner"
            },
            "answer_text": "I wish I knew how old your child was as it would help to answer this question more appropriately. If you have a young child, try sitting down with him or her and finding out why they don’t want to go to school. Have they already been to school and something happened that distressed them? Are they afraid of going because they’ve never been to school before? Is there an issue with a child or teacher? Explain to your child that it is your intention to help them – and in order to do that, you need to know what the problem is. Assuming there is no significant issue and your child is just trying to assert themselves and dig their heels in, I would tell them that going to school is actually not a choice. If your child is older, you can tell them that it is required by law to attend school. You can give your child a picture of you or a little keychain or small object of yours. Ask them to take care of it for you so that they can give it back to you when you come to pick them up. I’m sure your child that you ALWAYS come back. Be sure to be on time, or even a little bit early when picking your child up from school. You can try giving your child some incentive by telling them that when you pick them up from school, you can go and do something special on their first day. You can also ask your child if they would prefer to be brought to school by mommy or daddy. Sometimes, a child has an easier time separating from one parent over the other. Can you arrange for a play date with a child that you know is in your son’s / daughter’s class? Maybe, this could alleviate some fear or apprehension. I would suggest that you just keep talking to your child. If you ask a lot of specific questions, you may be able to get to the root of the problem. Then, it is much easier to proceed once you know what you were dealing with. ",
            "date": "Answered April 30, 2019",
            "views": "626",
            "upvotes": " Answer requested by Thao Dao",
            "upvoters": [
                {
                    "user_id": "Shane Karlsworth",
                    "user_href": "/profile/Shane-Karlsworth"
                },
                {
                    "user_id": "Hal Dellinger",
                    "user_href": "/profile/Hal-Dellinger-1"
                },
                {
                    "user_id": "Joanne Vicente",
                    "user_href": "/profile/Joanne-Vicente"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Sullivan",
                "href": "/profile/Mark-Sullivan-165"
            },
            "answer_text": "I think some of the comments here are comedic. If you don’t go to high school, then sure there would be a problem. Your chances of success will be severely limited. But, College or University, not so much. After secondary school, High School, you can make all kind of friends, and interact with others your age. You will still learn essential subject of life, but, you’ll learn them in a harsher environment. Why would this be a harsher environment? Because college is over-glorified secondary school except with ashtrays. There is less margin for error in the real world, college or university is not the real world. You will still learn life lessons, that many of your college or university peers will not learn until they leave school. The school of hard knocks is a tough teacher. You’ll be better prepared for life I assure you, and you won’t be indoctrinated by some college prof that has spent the majority of their life in academia hiding away from the real world. I have also seen others claim claim, you’ll be dumb. This is interesting statement, it is very elitist in its statement, because it takes those trades people, and denigrates them below that of a college grad. But, the funny thing is, those college grads wouldn’t have the infrastructure they take for granted to do their work if it wasn’t for the tradesmen. You can be a trades person and still be smarter than any college graduate. ",
            "date": "Answered May 17, 2019",
            "views": "31",
            "upvotes": " Answer requested by Ben A",
            "upvoters": [
                {
                    "user_id": "Darren Lane",
                    "user_href": "/profile/Darren-Lane-12"
                },
                {
                    "user_id": "Akshada Thite",
                    "user_href": "/profile/Akshada-Thite"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Larmer",
                "href": "/profile/Larry-Larmer"
            },
            "answer_text": "IT’s hard to believe that a person that was reasonably smart would be asking that question. but i’m curious person so I will give you some facts as I know it. First, just because someone doesn’t have an education doesn’t mean they are stupid and can’t learn anything. It just means there ability has never been tested or measure to the standards set in the country you live in, This measurement of education allows you get a good trade or to be a Doctor. These profession are a proven standard of education that started at grade one. It’s good thing our government is obligated to provide everyone with an education in public school system in Canada. If you go from grade one to grade twelve, the government pays for all your expenses of learning for one hundred and eighty days a year.And two thousand and sixty days from grade one to grade twelve.That’s a big government expense. So, why wouldn’t you want to go to school? In many countries their governments don’t provide any eduction for their people. In those country you would have lots of friends to play with, but in industrial countries you would have fewer friends. Without communications you will become very “lonely”. ",
            "date": "Answered September 26, 2020",
            "views": "16",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Gabriel Tobing",
                    "user_href": "/profile/Gabriel-Tobing"
                },
                {
                    "user_id": "Robert Levitt",
                    "user_href": "/profile/Robert-Levitt"
                },
                {
                    "user_id": "Mark Hamric",
                    "user_href": "/profile/Mark-Hamric"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Milling",
                "href": "/profile/Peter-Milling-1"
            },
            "answer_text": "If you’re younger than 16 then dropping out is illegal and could have immediate consequences. If you’re over 16, then it really depends on the person and circumstance. Generally, it’s widely accepted a high school degree is a good credential to have as an requirement for entry-level work in blue collar jobs. Assuming you will be independent, you will need income. To have a decent existence, you’d need employable skills or to start your own business. Coding/tech comes to mind. You could also learn a trade, some of which pay pretty well. Low wage work is also an obvious choice, though it’s not an ideal choice for longterm career prospects. Wages can remain low even after many years. Knowledge-wise, you could definitely still be well-informed. If you wanted, you could learn stuff on your own, topics that interested you. You might end up being more knowledgeable than most college-grads, who forget most of what they were taught. The big thing you would lack in all of this is a credential, either high school or more likely, college. I’m not huge fan of school but the credential is definitely important, to the point I still recommend people to get a 4 year degree, if it can be done cheaply, is in a good major, and they’ll be sure to finish it. Our society has a lot of hoop jumping that’s not always easy to avoid. Your call on how many hoops you wanna jump through before going off to live your own life. ",
            "date": "Answered March 9, 2020",
            "views": "1",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Manohar Bhati",
                    "user_href": "/profile/Manohar-Bhati-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susan Scott",
                "href": "/profile/Susan-Scott-24"
            },
            "answer_text": "Assuming you are legally old enough to drop out, nothing will happen if you don’t go to school. The reason people tell you to stay in school is because there is a myth that says only schools can educate you. Wrong. You are free to educate yourself in whatever topic you wish. While a diploma can absolutely help you get a job, there is nothing stopping you from starting your own business. There are also a lot of opportunities today in construction fields which often allows you to do an apprenticeship. Some places will even pay for your training at a trade school. You may well be one of the millions of young adults for whom traditional schooling just doesn’t work, or maybe school is just torture for you. Whatever the case, there are alternatives. You have inborn strengths and abilities that can be used in a job or in your own business. Even Bill Gates didn’t finish school! Most people with strong mechanical ability or an entrepreneurial spirit don’t do well in school. You are in very good company! Find someone doing what you think you might want to do and ask for their guidance. 10 ultra-successful millionaire and billionaire college dropouts ",
            "date": "Answered September 23, 2020",
            "views": "36",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Ramus Kerd",
                    "user_href": "/profile/Ramus-Kerd"
                },
                {
                    "user_id": "Dawn A. Charron",
                    "user_href": "/profile/Dawn-A-Charron"
                },
                {
                    "user_id": "Emma Seto",
                    "user_href": "/profile/Emma-Seto"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Shiner",
                "href": "/profile/Don-Shiner"
            },
            "answer_text": "What would happen if kids didn't go to school? The end of the indoctrination machine that now perpetuates the patently silly idea all are equal in every way, that condemning bright children to mediocrity while artificially boosting the slow and/or stupid is that route. You will find many of these teachers are Democrat/Liberal with insane ideas of their own or from textbooks they pass along to your children without question as babysitter by proxy. Not even good ones at that. Then there is the rapid spread of disease as children are packed 25–30 to a room in arm’s length proximity in essentially a heated/air-conditioned sealed box with one door and usually-closed windows, an ideal environment for pathogens infecting your child to eventually be brought home to infect you and your family. Just say no to this shit and make home your child’s school. Think of this as helping to save your children from being another brick in the wall.  Keeping your children safe from school prevents this. You’re welcome. ",
            "date": "Answered July 15, 2020",
            "views": "313",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Al Mayberry",
                    "user_href": "/profile/Al-Mayberry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Annabel Rantavan",
                "href": "/profile/Annabel-Rantavan"
            },
            "answer_text": "After eliminating and addressing any valid and fixable issues pertaining to the problem (health issues, bullying, recent bereavement, separation anxiety, lack of school readiness etc ) then you must continue to take the child to school, explaining that it is the law and non negotiable. I had a 5 year old pupil who obstinately refused to dress for school where there were no obvious other issues. After one week of refusal and in parent /school consultation he was brought up to school in his pac man pyjamas with a bag containing school clothes, parents leaving immediately . He dressed himself in the class storage room in 5 min flat and there were no more issues! Another 5 year old was so anxious when left at school that in consultation it was decided to try again next year at 6 years. She is a happy 8 year old now. At 5 she simply wasn't emotionally ready. A child who has recently been bereaved sometimes has understandable issues reentering school. This is often anxiety related to fear of losing the remaining carer or family members. On balance it is my experience that most kids are better to get back to school with appropriate support after an appropriate break otherwise it can be harder to return. A practical mix of school /home communication, sensitivity and a certain measured hard headedness is required. This is not the approach to use with adolescents, where professional assistance can be employed in addition to negotiation and addressing any issues that the school refusing student has. Principals and staff are familiar with school refusal and will have many good suggestions. Remember to team up with the school and work together, listening carefully to your child in an age appropriate fashion. ",
            "date": "Updated May 7, 2019",
            "views": "552",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cameron Willson",
                "href": "/profile/Cameron-Willson"
            },
            "answer_text": "School is an opportunity to discover yourself. By going to school, you choose to discover yourself, who you want to be, your role in society, and begin making connections that will support you later in life. I never quite realized that in high school; however, subconsciously, I moved forward with my persona and experiences to find my passion and a career that suits my strengths, mine being the Hospitality Industry. I have posted below a few resources which have prove, to be useful tools for my development as a leader and allowed me to reflect on what my strengths are, all thanks to school: 1. **Strengthsfinder 2.0 from Gallup and Tom Rath: Discover Your CliftonStrengths - **This book focuses on how people can focus on fine tuning their strengths, instead of their weaknesses. It gives you a top five potential strengths, by way of an online assessment. You take it, it gives you results, and many people would say it is amazing how accurate it describes them. 2. List of Careers and Occupations. Find Local Jobs in 40,000 Careers (List of Careers and Occupations. Find Local Jobs in 40,000 Careers) - This is a link to Recruiter | Recruiting Network Software Solution and Recruitment Training, it lists all types of careers and the skills required for them. The key to this is to focus on the particular, “Keywords,” and Knowledge, skills, and abilities. After having reflected on them, which career is interesting and strong for you? With these resources, it is wise to always remain open to change, know yourself, and advance in your studies. Do the best you can, and go from there. All thanks to school. :) ",
            "date": "Answered May 28, 2020",
            "views": "254",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gamerz Log",
                    "user_href": "/profile/Gamerz-Log"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marguerite Kopiec",
                "href": "/profile/Marguerite-Kopiec"
            },
            "answer_text": "Many things can happen. It depends on your reason for not going. If you are avoiding a particular situation either a difficulty with your peers or with a teacher, not going to school for a day may be a necessary respite, so you can deal with the problem better. If you don't go because you don't see a point in continuing, you probably need counselling to figure out your future. If you don't go because you lost motivation in life due to personal hardships, you need help to overcome them. Just dropping out of school without a plan takes you nowhere better. We need to have somewhere we are going to, not only to run away from. School should be a good place, one that helps you grow. If it's not this school, it can be another one. ",
            "date": "Answered August 11, 2020",
            "views": "106",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Asher Nevrekar",
                    "user_href": "/profile/Asher-Nevrekar"
                },
                {
                    "user_id": "Koushik Kumaran",
                    "user_href": "/profile/Koushik-Kumaran-1"
                },
                {
                    "user_id": "Beverly Anne Hills",
                    "user_href": "/profile/Beverly-Anne-Hills"
                },
                {
                    "user_id": "Oguz Ogrenci",
                    "user_href": "/profile/Oguz-Ogrenci"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amy Babineaux-Smith",
                "href": "/profile/Amy-Babineaux-Smith"
            },
            "answer_text": "In Texas, students have to go to school at least 90% of the time to be promoted to the next grade. That means with 180 school days, you can't miss more than 18 days, or 9 days per semester. I’ve seen parents go to court and pay $500 fines because their kids missed too much school. One one of my students (even though he lives 1/2 mile from the school) gets picked up on a “\"short bus” every day due to missing too much school. MOST importantly, if you skip too much school, you don't learn. And I mean more than academics. You don't learn how to get up on time, to go even though you don't want to go, to be responsible. PLUS, there are millions of kids world-wide that would LOVE to GET to go to school for free, to sit in a heated or cooled classroom instead of working in a factory or a field, to get to eat lunch and meet other kids. A lot of kids DREAM of learning how to read, and here in the US, it’s free. Skipping school would be unimaginable for a lot of less fortunate kids. ",
            "date": "Updated December 27, 2017",
            "views": "46",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Isabella Helena Rutan",
                    "user_href": "/profile/Isabella-Helena-Rutan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emma Mesadieu",
                "href": "/profile/Emma-Mesadieu"
            },
            "answer_text": "The real question is why wouldn’t you go to school? Education is very important. Yeah, yeah, I know I sounds like one of these countless people who Always say this. But let’s about why education/school is important. For one, let me state that education or the ability to attend school is a privilege, not a right. Many undeveloped countries lack this opportunity for many children and adults. We should be considering ourselves blessed that we have the chance to do so in this country. Second, education opens up the mind to new knowledge that can be used later down the road. With knowledge, it opens many doors for you to the enter. Many careers require knowledge in doing some tasks, depending what your degree is. With the access to education, you can do what passion is. If you live music and want to teach others, you can get a music degree and teach others. However, skipping school or education is like picking a piece of wood instead of a diamond. One might say, “School isn’t for everyone”. And this is true. But we must not take risky jabs at our future, when we don’t know what is ahead of us. It’s always good to have education as a fall back plan when all other plans don’t work out. Only smart people realize that and that include several celebrities like James Franco and Emma Watson. Choose wisely; sometime, we only get one chance ",
            "date": "Answered November 11, 2019",
            "views": "760",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Savra Ladies Fashion",
                    "user_href": "/profile/Savra-Ladies-Fashion"
                },
                {
                    "user_id": "MOHSIN KHAN",
                    "user_href": "/profile/MOHSIN-KHAN-3344"
                },
                {
                    "user_id": "King Khan",
                    "user_href": "/profile/King-Khan-1354"
                },
                {
                    "user_id": "FocDevs",
                    "user_href": "/profile/FocDevs"
                },
                {
                    "user_id": "Fahad",
                    "user_href": "/profile/Fahad-271"
                },
                {
                    "user_id": "Imran Khan",
                    "user_href": "/profile/Imran-Khan-15115"
                },
                {
                    "user_id": "Ash Kumar",
                    "user_href": "/profile/Ash-Kumar-61"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barbara Leary",
                "href": "/profile/Barbara-Leary"
            },
            "answer_text": "Most first world countries require you to go to school until a certain age. If you don’t your parents can be charged with child neglect. In the US your parents can declare you are being home schooled. There is usually some paperwork or requirements for that but generally people who want to do it are allowed. Then nothing will happen. Some states also have on-line schools so you never have to leave your house. Now the other issue is whether you actually learn anything. If you just stay at home and play computer games, or whatever, what happens when you get old enough to have to get a job? Reading, writing, speaking, and basic math are the very least you will need to be employable. If you decide that you want a better job than minimum wage then you will require college or technical training. You have to know stuff to get into those programs and usually have either a high school diploma or the GED. Good luck not going to school. ",
            "date": "Answered September 24, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gautam Khanna",
                    "user_href": "/profile/Gautam-Khanna-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Sweeten",
                "href": "/profile/Eric-Sweeten"
            },
            "answer_text": "Getting basic education as a minor is expected of every minor. It gives you much of the fundamental knowledge you need to make it in this world. Take learning the alphabet, vocabulary, and mathematics. That’s stuff you need to know to get by in society. In middle school and high school, and even in later elementary school, you take on more complex subjects. It’s all intended to equip you with knowledge and make you “educated”. If you don’t go to school, you are not taking this free service provided to you seriously. Your income and quality of life later on may be lower, because you have less of an education and may not be able to get a job that pays as well as your educated counterparts. If you don’t want to go to school for yourself, do it for your family, or perhaps your future family (spouse and kids), if that’s one of your goals in life. Also, skipping school can get you in trouble with the law in some places. So, there’s that. ",
            "date": "Answered February 19, 2018",
            "views": "2",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darren Lane",
                    "user_href": "/profile/Darren-Lane-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phil Quintana",
                "href": "/profile/Phil-Quintana-3"
            },
            "answer_text": "Without knowing your age and what level of school you're talking about, it's hard to answer. I can offer this much, if you're talking high school, your life is really going to suck. I'd say 95% of all employers require a high school diploma. You can't get into the military without one. Trade schools require them. Government agencies require them. If your talking about college, your life could still suck. As more college graduates flood the job market, the pickier employers can get. Employers used to think, “ Why should I hire a high school drop out when I can hire a high school graduate”? Now they think, “Why should I hire a high school graduate when I can hire a college graduate”? When I went to the Fire Academy, about 25% of us were college grads. I had a degree in business. Rangel had a degree in engineering. Jones had a teaching degree. Jongward had a degree in industrial engineering, etc. Ten of forty were college grads. It's up to you, do you want your life to really suck, suck a little or know your on your way? ",
            "date": "Answered August 22, 2020",
            "views": "41",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Darren Lane",
                    "user_href": "/profile/Darren-Lane-12"
                },
                {
                    "user_id": "Harry Sharp",
                    "user_href": "/profile/Harry-Sharp-1"
                },
                {
                    "user_id": "Robert Berger",
                    "user_href": "/profile/Robert-Berger-28"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Dalrymple",
                "href": "/profile/Nick-Dalrymple"
            },
            "answer_text": "What happens if you don’t go to school? I’m going to presume you are in high school and at least 16 years old. If you miss more than 10 unexcused days you probably will have to go another year to graduate. If you fail to graduate and don’t get a GED your job outlook is extremely limited. The military won’t even take you. If you want a family you better marry someone earning a living wage of at least $50,000 a year. This will cover the basics. Your lifetime income will be somewhere between a few hundred thousand dollars to millions of dollars less than a person with more education and degrees. I hope you inherit a large fortune or win millions in the lottery, get a good financial advisor and listen to the advisor. ",
            "date": "Answered January 30, 2020",
            "views": "383",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Vipin Kumar",
                    "user_href": "/profile/Vipin-Kumar-1852"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ho Wen Ling",
                "href": "/profile/Ho-Wen-Ling-1"
            },
            "answer_text": "Oh. Talking abt this, my sister have a friend which she didnt attend school. She was once a excellent student with good grade and dsa to go to good school. But she end up getting bullied and peer pressure and stuff bc of attiude problem and such. She didn’t attend school for 5 years she was 14 years old back then. She have some mental issues her mom didn’t send her to the hospital because of money issues and all about face. She spend most of the time watching k drama and housechores. I have seen her since she didn’t finished her secondary school she does not have the olevel cert. She have diffculty finding a job, she depend on her mom and sister for money. Idk why didn’t her mom kick her out and there is fincinal assistance. She should have been better if she receive help. It also embarrassing when people ask about her daughter. I found out ashamed bully is not a excuse not to go to school. She is not suitable for work as she can’t even handle peer pressure and bullying. ",
            "date": "Answered April 14, 2020",
            "views": "141",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Isabella Helena Rutan",
                    "user_href": "/profile/Isabella-Helena-Rutan"
                },
                {
                    "user_id": "Jorge Garcia",
                    "user_href": "/profile/Jorge-Garcia-246"
                },
                {
                    "user_id": "Nicholas K. Gerd",
                    "user_href": "/profile/Nicholas-K-Gerd"
                },
                {
                    "user_id": "Henry Scheible",
                    "user_href": "/profile/Henry-Scheible"
                },
                {
                    "user_id": "Shay Burnette",
                    "user_href": "/profile/Shay-Burnette"
                },
                {
                    "user_id": "Dawn A. Charron",
                    "user_href": "/profile/Dawn-A-Charron"
                },
                {
                    "user_id": "Christina Matheny",
                    "user_href": "/profile/Christina-Matheny-1"
                },
                {
                    "user_id": "Patrick Byus",
                    "user_href": "/profile/Patrick-Byus"
                },
                {
                    "user_id": "Sukhmeet Singh",
                    "user_href": "/profile/Sukhmeet-Singh-143"
                },
                {
                    "user_id": "Md.Lavlu Mia",
                    "user_href": "/profile/Md-Lavlu-Mia-1"
                },
                {
                    "user_id": "Vincent Llanas",
                    "user_href": "/profile/Vincent-Llanas-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kunal Kataria",
                "href": "/profile/Kunal-Kataria-49"
            },
            "answer_text": "Depends on how old you are, what kind of school you go to(elementary, middle, highschool, college, etc.), as well as what you want to do in life. If you want financial security and stability, school is your way to go. You can go to college for someone you enjoy and hopefully find a career you love out of it. For some people, it’s just not for them and they’d rather pursue something less conventional that doesn’t require a college degree. If you’re in secondary school(elementary, middle, and highschool) and you stop going or don’t go most of the time then you’ll likely fail the semester and this will stop you from continuing forward and you’ll likely get held back. However, if you mean what will happen if you miss a day or two, nothing will happen. You’ll be given make up work that you missed to do when you get back. ",
            "date": "Answered August 19, 2020",
            "views": "57",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Isabella Helena Rutan",
                    "user_href": "/profile/Isabella-Helena-Rutan"
                },
                {
                    "user_id": "Darren Lane",
                    "user_href": "/profile/Darren-Lane-12"
                },
                {
                    "user_id": "Avinash Bamane",
                    "user_href": "/profile/Avinash-Bamane-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Denise Davidson",
                "href": "/profile/Denise-Davidson-42"
            },
            "answer_text": "Your parents or caregivers can be prosecuted: schooling is a legal requirement, though the age range can differ between states or countries. But more importantly, you will fall behind with whatever work is done at your year level and that can be very hard to catch up if you have prolonged absences. Your friends will be talking about things you haven’t even heard of and worse, you can become socially isolated. That is bad for your mental health. Missing school can be bad for your future: if you don’t finish high school your work choices will be extremely limited and you may find it hard to get and keep work. If that happens, you can enter a cycle of poverty that is very difficult to escape from. So, do yourself a big favour ( even if you don’t feel like this is a positive choice) and go to school, because even if the best thing about it is the sport you play at lunch, your life will be better later than you can even realise right now. ",
            "date": "Answered June 19, 2020",
            "views": "91",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "David Cooper",
                    "user_href": "/profile/David-Cooper-613"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yara Habanbou",
                "href": "/profile/Yara-Habanbou"
            },
            "answer_text": "Children who don’t go to school often have and exhibit many problems. School doesn’t necessarily mean that a child will become successful. Research has shown time again that school helps children not only academically but with proper tuition and role models, schools teach children to become successful, responsible adults. Of course, this doesn’t mean that every child that goes to school will become so. It is dependent on many different aspects. However, giving the child the best start to life would be to give them the opportunity to socialise with children their age, learn to collaborate and play with others, learn to respect others etc. So, not only does school help children become academically successful and in turn open up opportunities for them in the future for a career they want, it also helps develop their character and survival skills in life. ",
            "date": "Answered January 18, 2020",
            "views": "235",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Raymond Crutcher",
                "href": "/profile/Raymond-Crutcher-2"
            },
            "answer_text": "You will likely have to work for those who did. Know anybody you really can’t stand at school? Imagine that person has the only job available at their business you’re qualified to do. You have few choices or avenues. You would need a pretty strong work ethic to make it on your own. You may have the raw foundation to do this, but every successful independent person has serious focus skills. Anecdotal: if life progresses for as it does for most, you will look back on the education period as some of the easiest of times in life. Following that will be “ … and why didn’t I do better, it would have been easy.” My grandfather HAD to quit school after 2nd grade — the family farm needed workers (6 of his siblings had died by the age of 10). He was bitter about that the rest of his life. Many other cousins went on to higher education (doctors, lawyers) but his particular branch had the roots in farming and the aftermath of the Civil War within an impoverished, defeated state. And they made choices to stay there. So choices made now can really influence the remainder of your life. So what will you choose? ",
            "date": "Answered October 16, 2019",
            "views": "489",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Antoine Amanieux",
                    "user_href": "/profile/Antoine-Amanieux"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clint Potts",
                "href": "/profile/Clint-Potts-1"
            },
            "answer_text": "To paraphrase Stephen Rock, my high school Geometry/Physics teacher…YOU DIE. If you don’t go to school, you can’t hear the material. If you don’t hear the material, you can’t do the homework. If you can’t do the homework, you get a poor grade and can’t study for the test. If you can’t study for the test, you can’t pass the test. If you can’t pass the test, you can’t pass the class. If you can’t pass the class, you can’t graduate. If you can’t graduate, you can’t get a job. If you can’t get a job, you can’t buy food. If you can’t buy food, you can’t eat. If you can’t eat. You die. Simple, huh? Just like “If you give a mouse a cookie”…with a death scene. Stay in school. ",
            "date": "Answered December 12, 2019",
            "views": "693",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Denis Ivanov",
                    "user_href": "/profile/Denis-Ivanov-70"
                },
                {
                    "user_id": "Marcus Mayo",
                    "user_href": "/profile/Marcus-Mayo-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Annie Marie Cook Millett",
                "href": "/profile/Annie-Marie-Cook-Millett"
            },
            "answer_text": "That really depends on the situation. This question can’t be answered correctly without more details. Some kids don’t go to public school because their parents choose to home school. They are still getting an education, just not in the government controlled public school setting. In some cases, they get a better education, and in some cases worse, depending on the parents. Kids all need to learn how to read and write, and do math, but more importantly they need to learn how to learn, and how to think for themselves, how to reason, and how to problem solve. They also need to learn how to find resources to answer their questions. Living life is an education in itself. To function in the world today you do need some basics, and most parents that love their children will see that they get them. ",
            "date": "Answered August 16, 2018",
            "views": "21",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cherry James",
                    "user_href": "/profile/Cherry-James-7"
                },
                {
                    "user_id": "Megan Ruffin",
                    "user_href": "/profile/Megan-Ruffin-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Williams",
                "href": "/profile/Chris-Williams-1091"
            },
            "answer_text": "If you don’t go to school for a day, nothing happens in the short term. But it’s the long-term consequences that are important. What does graduation from school say about you? You can deal with meaningless assignments, boring teachers, and crazy classmates. You know how to get things done in spite of it all.You don’t give up when it’s hard/boring/annoying/frustrating. You learn how to persevere, and that helps to mature your character.You find little joys in each day, simply by taking the time to look.You find out that the world does not revolve around your own needs only, and you develop acquaintances and even some friendships with people you never dreamed would be your friends.You develop a certain sense of appreciation for the country in which you live, having had a chance to compare it to other ways of living.You work towards training so that you can get a decent job after school.",
            "date": "Answered November 29, 2019",
            "views": "1",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Richard Bradford",
                    "user_href": "/profile/Richard-Bradford-51"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sohail Ahmed",
                "href": "/profile/Sohail-Ahmed-7"
            },
            "answer_text": "Thanks Daniel for A2A. If you do not go to school, it will be your loss. You will find yourself lacking than most. You may think your life is easier and you are in a relaxed frame of mind; that thinking will have some rankling in background. HUMAN BEINGS ARE BY NATURE INQUISITIVE AND ADVENTUROUS. You will be staying away from this, ruing bitterly. So the answer is ‘that there would be LESS HAPPENINGS when you stay away from educational institutions and also do not acquire education on private basis. IF YOU MEAN YOU MAY DO IT YOURSELF WITHOUT GOING TO SCHOOL, THEN THAT WOULD BE A DIFFERENT STORY. People are educated despite not attending schools/colleges, especially here in the subcontinent. We call them ‘private students’. But I do not think you meant that. Thanks for reading my answer. ",
            "date": "Answered July 4, 2020",
            "views": "66",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Bah M",
                    "user_href": "/profile/Bah-M"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anamika Teotia",
                "href": "/profile/Anamika-Teotia-3"
            },
            "answer_text": "Devastating future ; if you believe or listen judgemental people who has already created your fate in their assumptions. On the other hand if you have better plans of study as distance courses, e- learning or online courses, you are self sufficient to grow independently without school. The core aim of schools is to implement social learning and over all development through pre decided curriculum. If your parents or you yourself can be in to such environment without going school , can replace school for sure. Whereas, if you don't go school and not have study plans further , you won't have academic abilities. ",
            "date": "Answered November 15, 2019",
            "views": "464",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Darren Lane",
                    "user_href": "/profile/Darren-Lane-12"
                },
                {
                    "user_id": "Sabrina Miginnis",
                    "user_href": "/profile/Sabrina-Miginnis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colin Rand",
                "href": "/profile/Colin-Rand-6"
            },
            "answer_text": "None of my children went to school until college or trade school. What was the effect. Well, I haven’t asked them that question, so I don’t know what they would say. I can give you some observations from my perspective: I think most of them resented my teaching style; I made them work.All my children know how to work. Not all of them want to.None of my children think they are entitled to anything. If they want it, they work for it.All of my children who did work left home at about 18 years of age with tens of thousands and hundreds of thousands of dollars in their pocketses depending on their character. The spendthrift left home broke.All of my children read well, write cursive, and can balance a check book.All of my children know where babies come from, and are familiar with a multitude of life sciences such as butchering cows.All of my children have jobs, careers, businesses, and families.None of my children are felons, drunks, drug addicts, sex perverts, or socialists; except for the PhD, he’s a bit of a socialist democrat sockless hippie liberal; Prolly his mom’s fault.All of my children know which bath room to use.They all have friends.",
            "date": "Answered June 7, 2019",
            "views": "205",
            "upvotes": " Answer requested by Tarsidin",
            "upvoters": [
                {
                    "user_id": "Jim Greene",
                    "user_href": "/profile/Jim-Greene-12"
                },
                {
                    "user_id": "Marcus Mayo",
                    "user_href": "/profile/Marcus-Mayo-8"
                },
                {
                    "user_id": "Jacob Sawyer",
                    "user_href": "/profile/Jacob-Sawyer-13"
                },
                {
                    "user_id": "Vidhyut Sundararajan",
                    "user_href": "/profile/Vidhyut-Sundararajan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Md.Lavlu Mia",
                "href": "/profile/Md-Lavlu-Mia-1"
            },
            "answer_text": "Disadvantage of not go to school. I know Amherst has tried very hard to increase social, economic, and racial diversity of its student body, but my experience was that, at the end of the day, there are a lot of upper-middle-class students (I was one of them myself) who came from pretty privileged backgrounds. I'm not saying everyone did, but a highly visible chunk did (and probably still do). Face it, Amherst, like many small liberal arts schools in New England, is an expensive place to get an education. And, like many small liberal arts schools in New England, it attracts a lot of \"legacy\" students whose grandparents, parents, aunts and uncles and cousins and neighbors all attended Amherst. To give you an example, there was a young man in my freshman dorm who mailed his laundry home so the maid could do it. ",
            "date": "Answered November 24, 2017",
            "views": "26",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jin Hao",
                    "user_href": "/profile/Jin-Hao-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susan Copeland",
                "href": "/profile/Susan-Copeland-31"
            },
            "answer_text": "Well, you could be breaking the law. It is the law that students be in some type of school, usually by the age of six and stay in school until graduation requirements are earned. It is questionable if you will become an educated person. You can gain knowledge and educate yourself, if you engage in learning independently from reading and researching and talking with people who know about the subject matter. But if you do not, you will not. You will most likely limit your opportunities for employment and career choices. You will probably never get on the TV show Jeopardy and win. ",
            "date": "Answered February 20, 2020",
            "views": "45",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Pam Eastwood",
                    "user_href": "/profile/Pam-Eastwood"
                },
                {
                    "user_id": "Karen P. Anderson-Cance",
                    "user_href": "/profile/Karen-P-Anderson-Cance"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mandy Worrall",
                "href": "/profile/Mandy-Worrall"
            },
            "answer_text": "Imo: Haven’t got a Crystal Ball, but … What is it about education you don’t like? Or, is it the subjects you are learning? Or, is it the way you are being taught? If the school isn’t delivering your learning in a way you can process, perhaps you can get some help with that. Plenty of people aren’t going to school, but are being home schooled. Unless you have a way of learning what you need know, to go into your adult life/job, you may be making it tougher for yourself. However, there are plenty of entrepreneurs and sports people who didn’t complete their schooling. Spirts careers aren’t generally known for being that long. There is also the peer group issue. Who will your peer group be while they are getting an education, but you are not? What about earnings? You may be able to earn more than them while they are still in school, but what happens when they are in their careers? Will you be earning as much by then, or more? You could be. You might not. Remember that educational opportunities are more available than ever. You could return to learning. You could fit it around your job. It’s your choice. ",
            "date": "Answered April 7, 2020",
            "views": "230",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Isabella Helena Rutan",
                    "user_href": "/profile/Isabella-Helena-Rutan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Randy Almond",
                "href": "/profile/Randy-Almond-3"
            },
            "answer_text": "I understand that in many countries, education is COMPULSORY until the age of 16, so it is ILLEGAL and your legal guardians are responsible for adherence to the law … it would put them into the position of not only negligence, but they would be classified as criminals (the punishment for which I do not know.) Too many of life’s skills (once known as “The 3 R’s: 1) reading, 2) (w)riting and (a)rithmetic” might not be learned, rendering you unprepared and unqualified for SO MANY JOBS as well as unable to function acceptably in our society. Without having gone to school, you may well have been unable to have even WRITTEN your question, although VERBAL SKILLS can be acquired without any formal education or classroom time. I would have to look up the current definition of “illiterate” but I can tell you that no jobs have THAT CONDITION as a prerequisite for employment!!! ",
            "date": "Answered March 26, 2020",
            "views": "69",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Mark Hamric",
                    "user_href": "/profile/Mark-Hamric"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zen Shoumuki",
                "href": "/profile/Zen-Shoumuki"
            },
            "answer_text": "Nothing will happen. School is a physical building of education. You can get educated everywhere by everyone. But school is where professional teachers and professors gather so you'll benefit more from going to school. Besides, it also depends on you as an individual. Are u a person who commits to self development? Do you constantly learn new things? Or are u a lazy potato? If you commit to yourself, not going to school is okay because you believe yourself that you can do what you want to do (your goals). If you cannot commit to self development and are only being a couch potato, it'll be hard for you to survive, thus, going to school is advisable. Why? Because teacher, tutor, professor can motivate you to develop yourself. L ",
            "date": "Answered December 15, 2019",
            "views": "532",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Hunter Hendrick",
                    "user_href": "/profile/Hunter-Hendrick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Alapaki",
                "href": "/profile/Michael-Alapaki"
            },
            "answer_text": "If you mean, “Should I go to college?”, then I have two answers. (It’s a quadratic question!) If you are, say, 18–19 years old with a popular personality and don’t go to college, but you have a standard education with average grades so far, you will save yourself (or somebody) $100,000. If you can muster up, say, $20,000 over the next year, you can hook up with a sailboat owner and cruise around the world, seeing a different country every couple of days, braving storms, catching and eating marlin, working hard pulling up anchors, and playing hard on the beach. You can snorkel in Australia’s Great Barrier Reef and dive inside ancient wrecks off the coast of Turkey. If you are, say, 16-17 years old and don’t have a popular personality and don’t go to college, and didn’t do well when you quit high school, skipping college really is no big deal, because you probably would quit that, too. If you don’t have any real money already, but you want to live without getting hassled by your parents, you might spend your days trying to find work washing dishes at 6 AM, or trimming grass in the sun at noon on Saturdays, or giving massages to drunk hairy men at midnight. The decisions we make early in life have the greatest affect on the rest of our lives, and on others. But, either way, it’s your choice and you get to say you did it “your way.” ",
            "date": "Answered August 13, 2020",
            "views": "198",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vidhyut Sundararajan",
                    "user_href": "/profile/Vidhyut-Sundararajan"
                },
                {
                    "user_id": "Nakshatra RP",
                    "user_href": "/profile/Nakshatra-RP"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kimber Jenkins",
                "href": "/profile/Kimber-Jenkins"
            },
            "answer_text": "That depends on where you live and what type of schooling. In the U.S., students who are in K-12 (and under 18 years of age) and DON’T have a valid excuse for extended periods of absence (more than just a day or two, such as a valid doctor’s note for the flu, extended hospital stays due to a new or recurring illness/injury, etc.), you could go to juvie - where they WILL force you to do schoolwork - and/or your parents could go to jail. At the college level, you’ll just flunk out of school and won’t be allowed back…tuition wasted. ",
            "date": "Answered October 30, 2019",
            "views": "92",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Lynn Sandweiss",
                    "user_href": "/profile/Lynn-Sandweiss"
                },
                {
                    "user_id": "Isabella Helena Rutan",
                    "user_href": "/profile/Isabella-Helena-Rutan"
                },
                {
                    "user_id": "Dawn DuCoty",
                    "user_href": "/profile/Dawn-DuCoty"
                },
                {
                    "user_id": "Dawn A. Charron",
                    "user_href": "/profile/Dawn-A-Charron"
                }
            ]
        },
        {
            "author_info": {
                "name": "Morgan McCoy",
                "href": "/profile/Morgan-McCoy-39"
            },
            "answer_text": "If you don’t go to school you will probably drop out. Also, the police might come to your house to see way you are not going to school. If you are not going to school and the police might figure it out your parents might get in trouble for it. Your parents might even go yo jail for it. Also, the police might drive you to school ever day, so you do go to school and not skip or miss any more days. It might even need to take summer school which isn’t funny because you don’t want to be going to school during the summer. ",
            "date": "Answered October 10, 2019",
            "views": "52",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Christina Matheny",
                    "user_href": "/profile/Christina-Matheny-1"
                },
                {
                    "user_id": "Md.Lavlu Mia",
                    "user_href": "/profile/Md-Lavlu-Mia-1"
                },
                {
                    "user_id": "Adriano Adinho",
                    "user_href": "/profile/Adriano-Adinho-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Do",
                "href": "/profile/Daniel-Do-58"
            },
            "answer_text": "You can’t possibly not go to school if your in a average family even if your parents agree you CANNOT since they will be charged with a child truancy. However if your 18 or up you may be able to get out of school or drop out but its really a bad idea. Now let’s say theres nothing stopping you from not going to school what are the effects? Well we’ll start with the pros first, you could possibly make a business and be successful you could possibly work at Mcdonald's and still go up the ranks. Let’s look at the cons though 1. Is lack of important education Math is extremely important if you wanna good job and so is science but not limited to. The usually outwit the pros but you may possibly still get a job but overall its best to stay in school. ",
            "date": "Answered May 23, 2020",
            "views": "64",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Aloysius Pelly",
                    "user_href": "/profile/Aloysius-Pelly"
                },
                {
                    "user_id": "Eren Kaş",
                    "user_href": "/profile/Eren-Kaş"
                },
                {
                    "user_id": "Vidhyut Sundararajan",
                    "user_href": "/profile/Vidhyut-Sundararajan"
                },
                {
                    "user_id": "Paul Doyle",
                    "user_href": "/profile/Paul-Doyle-53"
                },
                {
                    "user_id": "Anushka Mukherjee",
                    "user_href": "/profile/Anushka-Mukherjee-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Elliott",
                "href": "/profile/Don-Elliott-9"
            },
            "answer_text": "In some cases after a certain number of days someone from Child Protective Services will try to visit the home to determine why the child isn’t in school. If it is determined that the parents are not allowing the child to go to school or are allowing the child to stay home, the child can be removed from the home and placed in foster care. Also, the parents could be charged with child neglect and be put in jail. There are cases where chronic truancy exists and the child is sixteen or older, the child will be withdrawn (kicked out) and not allowed to return to any school in that state. It must be remembered that the law on this will vary depending of where it is happening. ",
            "date": "Answered October 24, 2020",
            "views": "282",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Emotional Princess",
                "href": "/profile/Emotional-Princess-3"
            },
            "answer_text": "Well, depending on the school rules and the state laws in the area that you live in, as long as you officially drop out with your school you will be fine. I do highly suggest to finish your education though, if you're in high school (or middle school), to get your high school diploma at least or it will be very hard to get a decent job and live financially stable. But if you're a student and stop going without properly dropping out then it's a different story and a possible chance of CPS getting called on your parent(s)/guardian(s) or get taken to court. ",
            "date": "Answered September 27, 2020",
            "views": "14",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Iftikhar Shah",
                    "user_href": "/profile/Iftikhar-Shah-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Kostandarithes",
                "href": "/profile/Alexander-Kostandarithes"
            },
            "answer_text": "What type of schooling? Assuming you live in the United States, schooling is required until the age of 16. However, if you are referring to higher level education, then keep these points in mind… In some sense, more and more people are getting bachelor’s degrees, this makes them a requirement rather than something that makes you stand out. Without a college degree, opportunities may be limited. Of course, you could go to firefighter school, a police academy, vocational training, and you would receive useful skills and those jobs would have good pay. But for the high salaries, a college degree is needed. Some people say that you would be “dumb” if you didn’t go to college. Let me say that many college students themselves aren’t exactly bright bulbs; them supposed to be “intelligent”… Your ability to acquire knowledge isn’t directly tied to school. But it helps to go to school. ",
            "date": "Answered May 22, 2019",
            "views": "894",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Isabella Helena Rutan",
                    "user_href": "/profile/Isabella-Helena-Rutan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marilyn Redmond",
                "href": "/profile/Marilyn-Redmond"
            },
            "answer_text": "It depends on your actions. Lincoln taught himself to be a lawyer. Edgar Cayce found he could go into trance and find medical answers that doctors did not have. You can find classes, books, or tutors. There are lots of options. I found that my insatiable curiously has taught me more than I learned in school. School is a form of mind control. However, basics like math, English, and music have been valuable as basis to move beyond. So, explore your options and the sky is the limit, Some times classes train you which is necessary to accomplish your goal. I had to take classes to learn how to do past life therapy, hypnotism, and mediumship. Then I moved further than what I was taught. I found the truth about life by using that learning to move beyond the typical. You are limitless. ",
            "date": "Answered September 12, 2020",
            "views": "27",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Isabella Helena Rutan",
                    "user_href": "/profile/Isabella-Helena-Rutan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suzette Booth",
                "href": "/profile/Suzette-Booth"
            },
            "answer_text": "If you are in the UK your parents can go to prison. Elsewhere, including the UK, social service might take you into care unless you are receiving home schooling. In addition, if you don’t go to school you will be uneducated and unemployable. Your future will look very dim indeed. If you can’t attend school most employers would realise that you couldn’t be trusted to attend work and would rather give the job to someone who does not have good school grades but at least has tried and attended school. ",
            "date": "Answered October 17, 2019",
            "views": "135",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Annabel Rantavan",
                    "user_href": "/profile/Annabel-Rantavan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fayza Khan",
                "href": "/profile/Fayza-Khan-19"
            },
            "answer_text": "Everyone resists going to school once in a while, but school refusal behavior is an extreme pattern of avoiding school that causes real problems for a child. School refusal is distinguished from normal avoidance by a number of factors: AND IT IS LEGALIZED TO GO SCHOOL AND IF YOU REFUSE TO GO SCHOOL THEN IT WILL MAY HAPPEN WITH YOU Parents or legal guardians of a child under the age of 18 who does not attend school on a regular basis are subject to being charged with a misdemeanor. However, in states in which the law reads that children only attend school until the age of 16 or 17, a parent of an 18-year-old would not be subject to punishment. Most states have established a fine system for first- and second-time offenses, but some states can also impose short-term jail sentences for parents of a child who continually fails to attend school. The offending child is also required to return to school and maintain regular attendance. ",
            "date": "Answered January 21, 2020",
            "views": "247",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Greene",
                    "user_href": "/profile/Jim-Greene-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Ellis",
                "href": "/profile/Jack-Ellis-46"
            },
            "answer_text": "You can't read or write, calculate, work a computer. Nobody will give you a job, if you couldn't be bothered going to school you might not be bothered about going to work. There are plenty of places for people like you living rough on the streets. You itch with lice and fleas, and freeze in cold weather, drunk people piss on you and vomit, and kick you hard enough to break your bones. Nobody of the opposite sex will ever kiss cuddle or have sex with you. One day it may all end when somebody uses you for target practise, for their handgun or crossbow or rifle. ",
            "date": "Updated September 29, 2020",
            "views": "29",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Darren Lane",
                    "user_href": "/profile/Darren-Lane-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jodi Hendon",
                "href": "/profile/Jodi-Hendon"
            },
            "answer_text": "A friend of mine’s daughter announced to her when she was 6, after failing one of those bubble-in tests, that she really didn’t need to learn to read. My friend worked for the welfare department at the time. The teacher said her daughter had just started playing around, filling in the bubbles at random and not even reading the questions. She told her, okay, you don’t have to go to school. You can get a job. She took her to a field full of weeds, gave her a paper sack, and told her to start pulling. She said these are the jobs we give to people who can’t read. After about 5 minutes, she decided maybe she did need to learn to read. Of course, she would cry “She made me do it for HOURS.” I’m sure you’re older than that, but what kind of work do you want to do to support yourself? Do you want to work with your brain and your talent, or do you want to have to break your back doing manual labor? There’s nothing wrong with manual labor—it’s honest work, but it’s also hard to keep doing as you get older. ",
            "date": "Answered February 16, 2020",
            "views": "133",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Jared Wonnacott",
                "href": "/profile/Jared-Wonnacott"
            },
            "answer_text": "I'm assuming you mean for an extended period of time (several days, weeks, or even a whole school year). To that I say, if you aren't meeting the legal requirements for school attendance, the school to which you're currently assigned (your local public school) will most likely make various efforts to determine the reason for your missing school. They will most likely determine your parents are negligent, at which point the authorities will be notified and you parents could be arrested, you could be taken and placed in another home where you'll be required to participate in your education, etc. but basically, you'll be forced to attend school eventually. This question also could have meant just skip a day. To that, you'll have to look at your individual school's truancy policy. Each school is different, but there's usually some parent contact of some sort as well as some means of making up the missed day (detention, make up work, etc.). ",
            "date": "Answered May 30, 2020",
            "views": "53",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Hunter Wallace",
                "href": "/profile/Hunter-Wallace-8"
            },
            "answer_text": "I am unsure to which school you are referring. Since one can find success without a college education, I will answer this question from the high school perspective. In the United States, one can become what is known as an emancipated minor, or a child-turned-self-caregiver, before reaching eighteen, the traditional adult age. In my state, one can become an emancipated minor if he or she is over sixteen. Courts are involved, and certain stipulations exist (e.g., receiving a parent’s/guardian’s permission to become licensed drive). SourceEmancipation of Minors ",
            "date": "Answered June 2, 2020",
            "views": "42",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Nikhila",
                "href": "/profile/Nikhila-71"
            },
            "answer_text": "At schools one gets plenty of exposure to co-curricular and extra-curricular activities such as public speaking, elocution, recitations, sports, games, quizzes, etc.; taking part in these activities is so crucial in the all-round development of children. If children didn’t go to school they would spend time in useless and idle activities. They will either watch TV or play video games or watch videos on Youtube, etc. As a result no skills such as reading, writing, arithmetic, speaking, etc. will be learned by them. Hence, for proper growth and perfect development children must go to school. ",
            "date": "Answered October 27, 2020",
            "views": "15",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Ivy Bedworth",
                "href": "/profile/Ivy-Bedworth"
            },
            "answer_text": "When you say “school” do you mean school as in the place where your parents send you to prepare your for life, or do you mean “school” as in university, or college. They are two totally different things. You can’t avoid school as in the place where you learn how to read and write, and make friends. it’s compulsory in most western countries. As for tertiary education, it’s up to you, what you want to do with your life. I definitely think that tertiary education makes you more interesting, introduces you to knowledge beyond what you learnt in high school, and teaches you to think critically about the choices you will make as an adult. It also prepares you for the world of work, gives you time to think about what you want to do in the work you’ll choose, and to learn what you need to know to do it. However, it’s not necessary if you already have made up your mind about how you’re going to earn a living, unless you are living off your parents’ money, then you should definitely leave home and go to college to battle the experience of being with people outside the wealthy ambit of your parents’ circle. it’s not something other people can tell you to do, but I would encourage further education even if it is only to delay having to get up every morning to go to a job you hate. ",
            "date": "Answered October 19, 2020",
            "views": "23",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Contessa Petrini",
                "href": "/profile/Contessa-Petrini-2"
            },
            "answer_text": "It depends on if you are speaking about not going to college or high school. I would assume you are speaking about college. Many things can happen, you could start your own business and become successful or not. You could go to trade or technical school and become successful or not. You could work at McDonalds or some other service industry job and move up in the ranks and still become successful. Or you could sit home and play video games and stream them and become a successful online gamer. As you see, college is a great route depending on what you major in such as STEM subjects where there is a demand. There are opportunity costs for going to college such as accumulating debt and opportunity costs for not going to college such as perhaps limiting the amount of income you can make over your lifetime. Your life is yours and you don’t have to follow all of the societal norms. You will have to decide what defines your personal success and chose the path you feel will take you there. ",
            "date": "Answered January 19, 2020",
            "views": "298",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Christian Dean",
                "href": "/profile/Christian-Dean-5"
            },
            "answer_text": "Quite a few things. A lot of parents will have a hard time finding a sitter.The kids will be deprived of mental development.Kids will lose out on their favorite school activities i.e sports, band, theatre, etc.College tuition would probably skyrocket, to both capitalize on the situation and to weed out students they been undesirable. If tuition doesn't go up, at the very least, courses would probably become twice as long as they are now. Jobs that required an associate's would then require a bachelor's degree. Because if kids didn't go to school, there would be a lot of catching up to do.",
            "date": "Answered July 21, 2018",
            "views": "998",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Ida Schaeffer",
                "href": "/profile/Ida-Schaeffer"
            },
            "answer_text": "Just like the other commenter said, it really depends on if you are talking about high school or college. You have to go to some sort of high school. It doesn't have to be in person. Some people find traditional high school too overwhelming. If that's the case for you there is also homeschooling or online schooling. Now if you are talking about college you don't have to go. You could go to a trade school to learn a trade then jump into your trade. You could skip higher education all together and join the Peace Corps. You have options depending on your age and where you live. You could join the military if education isn't up your alley. I wish you well in whatever path you choose to follow. ",
            "date": "Answered February 29, 2020",
            "views": "56",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Robert Pattison",
                "href": "/profile/Robert-Pattison-13"
            },
            "answer_text": "There are a lot of children who don't have a chance of going to school. Having taught three, who hadn't formerly been to school, I found they were very “street smart.” They had learned how to lie, how to cheat and how to steal. They were pretty good at these things! One trick was to offer to “mind your car” when you parked it at a shop. If you gave them some money to do so then you came back and your car was OK. If not the wheel hubs might be missing, or worse. Exclude children from education and they learn how to survive in another world. It was a great part of my own education. ",
            "date": "Updated July 1, 2018",
            "views": "26",
            "upvotes": " View 3 Upvoters"
        },
        {
            "author_info": {
                "name": "W. Robin Wofford",
                "href": "/profile/W-Robin-Wofford"
            },
            "answer_text": "Then you will not learn. You will most likely have a difficult time finding a job, you won’t be able to buy stuff, and you will end up on the streets living in a cardboard box… unless you work in a family owned business which might be left to you when that family member retires… leading you to bankrupt the business because you didn’t go to school and learn math, communication skills, proper use of technology, etc… at which point you will… again… end up on the streets. Get out of bed and go to school. Your future self will thank you! ",
            "date": "Answered November 1, 2019",
            "views": "60",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "David Cooper",
                "href": "/profile/David-Cooper-613"
            },
            "answer_text": "The most common problem is isolation, and that can be a huge downside which can wipe out all the gains. It’s only normally ethical to home educate children if you can team up with other people in the same area so that your children have some friends of around the same age. It isn’t necessary to have many though: even in school, children spend most of their time with just a few close friends. There can be other major problems with children who don’t go to school though if they are being kept out of school in order to limit their education rather than to improve it: many of them are brought up by religious parents who don’t want them to know anything that isn’t in a holy text. There can also be problems if the parents have hopeless ideas about how to educate. Some of them replicate the same teaching methods as are used in schools and simply bore their children to death at home while also depriving them of friends, and that isn’t useful at all. ",
            "date": "Answered June 22, 2019",
            "views": "94",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ayleene Castill",
                "href": "/profile/Ayleene-Castill"
            },
            "answer_text": "Well it depends where you live. The place where I live in doesn't allow students to miss school for more than 3 days without parent permission. The school district will have a meeting with you parents telling them the importance of attendance, if this doesn't work then they'll send your parents to court( they can take away most benefits that your parents get for you) or send a cop to your house they'll accompany you to school. If you want to drop out talk to your parents about it and tell them how you feel about school, you'll still be successful even if you don't go to school, but make sure you follow the right path! ",
            "date": "Answered February 5, 2020",
            "views": "60",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Brynn Rissari",
                "href": "/profile/Brynn-Rissari"
            },
            "answer_text": "Most kids would probably just learn the trade that their parents had. In the middle ages, the Feudal system was a bit like this. Parents taught children. A little bit of knowledge is lost. Children grow up and teach their children what they know. A little bit of knowledge is lost. This went on for about 600 years, so basically, as my geography teacher said, “Everyone was stupid.” If that little bit of knowledge was lost each generation, the world would eventually revert to the Middle Ages. We wouldn’t have any electricity or good infrastructure because the knowledge was lost. Another thing to consider, in a world where children only know what their parents know, how would their be politicians to vote for? There are 2 options here. The pool of politicians gets smaller and smaller until they’re forced to do it by family.Democracy collapses and there’s just one person at the head of government who passes down the authority to their children.Either way, we still end up having a monarchy in the end. So basically, our society would return to the Feudal system. PS. Not sure if you’re talking in short or long term, so sorry if this answer isn’t what you were looking for! I just learned about this a few months ago and I was excited to put it to use! ",
            "date": "Answered June 15, 2019",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sandra Dahl",
                "href": "/profile/Sandra-Dahl-5"
            },
            "answer_text": "My son has a housemate who did not graduate from high school. It has severely limited the kinds of jobs that the young man has been able to obtain. While there is honor and necessity in performing service sector jobs, it is not known for paying much more than minimum wage, often with limited hours, and no benefits. If you want to eventually go into a technical trade such as HVAC or electrical, you will HAVE to get your GED. May I suggest that you stay in school while it is free, do what it takes to succeed, and then you’ll have far more options. Many times, a change of attitude is required on the part of the student, and not the fault of the school or teachers. Students are able to, and do, succeed despite challenges in the public school system. ",
            "date": "Answered April 4, 2020",
            "views": "121",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Stacey McGowen Hudson",
                "href": "/profile/Stacey-McGowen-Hudson"
            },
            "answer_text": "Since 66 percent of young people are currently enrolled in college in the U.S., you’ll be at a distinct disadvantage when it come to professional, white-collar jobs. But they’re not the only jobs out there. You’ll also lose out on the experience of learning new things and meeting people from all over the world. College is a fascinating time of growth. But you will still have options in life - apprenticeships, trade school, tech college, or job training programs all are viable choices. Besides, you may decide to go college later. And that’s okay, too. ",
            "date": "Answered October 20, 2020",
            "views": "14",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Michael LeBoeuf",
                "href": "/profile/Michael-LeBoeuf-4"
            },
            "answer_text": "If you quit school after 16, your future is bleak. If you want to be successful in today’s world your odds greatly increase if you go to college and graduate in a field that will increase your earning power. Getting an advanced professional degree i.e.: law, medicine, MBA, etc. increases the odds of success even more. We all have heard about Bill Gates dropping out of Harvard and others with little/no formal education becoming very rich. That’s true but the odds of it happening to any one person are about as good someone winning a multi-million dollar lottery. When I was a kid and people asked me, “How do you like school?” I replied, “Closed.” If my parents had let me quit school I would have done it in a heartbeat. Fortunately, they had other ideas. Bite the bullet, get a good education and someday you will be very, very glad you did. Drop out and you’ll kick yourself forever. ",
            "date": "Answered January 28, 2020",
            "views": "114",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Alexander Kagahastian",
                "href": "/profile/Alexander-Kagahastian"
            },
            "answer_text": "There's a strong relationship between education and quality of life and a huge individual differences between those who have gone to school and who weren’t. Without sufficient education, we wouldn’t be able to land a decent job. Potential employers always look for job applicants with educational and experience background. Without education we wouldn’t be able to effectively interact with the society and easily comprehend local and global news. Without education, we would be missing so much in life because it is the key to a productive and fruitful life. ",
            "date": "Answered June 11, 2020",
            "views": "196",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Elizabeth Keller",
                "href": "/profile/Elizabeth-Keller-12"
            },
            "answer_text": "Well, aside from being arrested for truancy, and possibly having your parents arrested as well, you’ll have a real hard time finding a job without a diploma, let alone one that pays a living wage. Maybe you should look into your options about what kind of school is better for you? Maybe straight up public school isn’t for you. Maybe try going to a school where you learn a skill, like being a mechanic or a farmer. There are lots of options. Find one that makes you happy. ",
            "date": "Answered July 2, 2020",
            "views": "31",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Rebecca Good",
                "href": "/profile/Rebecca-Good-24"
            },
            "answer_text": "That’s too broad of a question. Most US states require a child to be in school till a certain legal age. If a child drops out at the legal age without finishing high school, it’s harder to find a job paying a living wage. If the child is not a certain type of ambitious sort, will probably continue to live in his/her parent’s basement after dragging him/herself home from that low wage position for years. Statistically, those who go on to a vocational school, military service, or university on average will fare better than those who don’t. Aspiring to be a Bill Gates/Steve Jobs type is like aspiring to be an NFL start player. What are the odds…? ",
            "date": "Answered September 15, 2019",
            "views": "167",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Shawn Wiencek",
                "href": "/profile/Shawn-Wiencek-2"
            },
            "answer_text": "The school will notify a truancy officer. If you are under change your parents could be fined or worse yet sent to jail.  Education is compulsory.  Schools do there best to get you there when you choose not to. That includes attending Saturday school, your drivers license could be suspended depending on your state, there are significant penalties. Lastly, your chances of graduating are significantly reduced.  Attend school..   ",
            "date": "Answered March 13, 2016",
            "views": "71",
            "upvotes": " View 11 Upvoters "
        },
        {
            "author_info": {
                "name": "Mark Sanchez",
                "href": "/profile/Mark-Sanchez-179"
            },
            "answer_text": "Well, academically-speaking, you wouldn’t be as smart as you could be. I’m not saying you’d be dumb or stupid, but you’d be at a disadvantage when in a social gathering where there is intellectual conversation. I mean, unless you pass your time reading books or what-have-you, you wouldn’t be able to to keep up with everybody. Most people who don’t like school, usually, don’t like reading. Reading improves the vocabulary, it gives you knowledge of the things you don’t already know. Education may not be for everyone, but everyone can benefit from it. ",
            "date": "Answered September 23, 2020",
            "views": "14",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Marvin Last",
                "href": "/profile/Marvin-Last"
            },
            "answer_text": "You may struggle harder at some things, and people will cheat and beat you often with financial obligations. They will see you coming, employers will have days missing from your paycheck, utility companies will catch on, and you may pay someone that sends out your billing statements coke habit ….a teacher or professor can’t teach you anything but how to learn for yourself….That’s our job. As far as college or trade school, you will always have a BOSS, and sometimes they don’t have a life, so they will have fun making your life miserable, unfortunately MOST people let power go to their head. ",
            "date": "Answered December 14, 2019",
            "views": "65",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Frank Anderson",
                "href": "/profile/Frank-Anderson-213"
            },
            "answer_text": "There are many ways to earn a good living and enjoy your life in addition to spending many years in school. I have spent a total of 22 years in schools. Generally many people find that high school plus technical school leads to a very satisfactory balance of investment and profit. I earned more money after taxes and expenses in 6 months driving a long haul chemical tanker (and less than 3 months training) than I ever earned in any year practicing law. And I really enjoyed the driving. Too many opportunities are lost by not completing high school, (12 years). From there each step should be carefully evaluated for whether it is a waste or will be profitable. I have explained my suggested process in a number of answers here. If you have trouble and wish me to repeat my suggestion ask me. ",
            "date": "Answered October 2, 2020",
            "views": "12",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Janet Christian",
                "href": "/profile/Janet-Christian-9"
            },
            "answer_text": "What officially happens depends on your age and school district where you go. What’s more important is what happens to you. Do you really want a life of making minimum wage working jobs that include phrases like, “Would you like fries with that?” School can suck. I know. I hated school, but I hated it the right way — I made good enough grades to skip my junior year so I graduated a year early. Giving up on school is giving up on yourself. That’s the more important issue here. Do whatever you can to make school tolerable. Do your best so it benefits you later. Find your passion and take every elective you can to feed that passion. I know they don’t offer all the same electives they did when I was a kid, but take every one you can that you would enjoy. It helps make the unbearable classes less painful. ",
            "date": "Answered October 22, 2020",
            "views": "73",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Candia Tucker",
                "href": "/profile/Candia-Tucker"
            },
            "answer_text": "Your teachers cannot teach you if you aren’t there. So you won’t be learning the things you should be learning. Your school will fail you for those classes. If you drop out completely, you will have a difficult time getting a decent job. There will be minimum wage jobs you can get without a high school diploma, but you won’t be able to make much more than that. You will need several jobs to pay bills unless you want to live in your parents’ house the rest of your life. Your time in school may feel long, but it’s a small part of your life. You will be better off if you go, do the work, and graduate. ",
            "date": "Answered October 2, 2020",
            "views": "15",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Kyle Lussier",
                "href": "/profile/Kyle-Lussier"
            },
            "answer_text": "Increased education well correlates to increased earnings potential. So the most typical outcome is you will make less money throughout your life. While it isn’t always true (certain industries & professions scale very differently), in general, the more educated you are the more money you will make. As to the general utility of educatin, you will likely be less aware of a lot of things that would improve your decision-making and thus make poorer decisions relative to complex issues presented before you relative to your life choices. Chains of good decision making create new opportunities, particularly when someone has a strong view of where they want to take their life that is socioeconomically and legally acceptable. The less you know, the harder (impossible) it can be to make the key choices. School teaches a lot of things that help with this and universities are much better. I personally had a few influential K-12 teachers that really “kicked me in the butt” to get better at certain things. I also had a really great experience academically, workwise, and socially at the University of Florida which significantly improved my life and outlook on things making aware of many more options viable. Not all of these options are great relative to how the real world works, but I have definitely figured out how it all works really well in high detail and I could not have done that with my education. Education is a great experience that can really help to remove a lot of ambiguity from decision-making in life.  ",
            "date": "Answered August 21, 2020",
            "views": "41",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Balogun Idowu Ismaheel",
                "href": "/profile/Balogun-Idowu-Ismaheel"
            },
            "answer_text": "Perhaps this depends on either not going to school at all or missing part of school. I'll work with former, not going to school doesn't mean one won't succeed but going can increase the chance in geometric progression. One will be exposed and importantly get basic information that can make them succeed in their own. However you don't need to go to school before you learn anything nowadays too. You can do from the corner of your room but then the experience is different! ",
            "date": "Answered November 23, 2019",
            "views": "32",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Tony Martin",
                "href": "/profile/Tony-Martin-51"
            },
            "answer_text": "What happens if you don’t go to school? That VERY MUCH DEPENDS! on what you are doing when you are NOT in school. if you are learning coding and taking and passing the GED and getting on with life, by doing online tutorials and bootcamps, you might well do better than “normal” track of school. if you are staying in your mom’s basement playing games most of the time, not working, not growing, not learning, etc., then not much. ",
            "date": "Answered September 9, 2020",
            "views": "26",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Marc Mayerson",
                "href": "/profile/Marc-Mayerson-2"
            },
            "answer_text": "Chances are you’ll end up doing menial work. I don’t say that pejoratively; there are many fine and decent people with no education. The problem is that menial work that pays a living wage has all but disappeared, and what little of it that remains is largely done by foreign workers making near-slave wages, and increasingly by robots. Even trade schools require at least a high school education these days. ",
            "date": "Answered August 17, 2020",
            "views": "81",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Stacey Olivas",
                "href": "/profile/Stacey-Olivas-1"
            },
            "answer_text": "If you don't go to school you are going to have a harder time in life. You will be uneducated and getting a good job requires a high school diploma. You should look at graduating high school as there not being any other option but to graduate. You will be so proud of yourself when you graduate and hold your diploma. Trust me. There is no other option than to graduate. I wish you the best of luck with it and everything you do in your lifetime. Take care. ",
            "date": "Answered August 18, 2020",
            "views": "33",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Deirdre Bonnycastle",
                "href": "/profile/Deirdre-Bonnycastle"
            },
            "answer_text": "Rules are different depending on where you live. In most places truancy laws, require school attendance up to a certain age usually 16. If you don’t attend school or a registered home schooling plan, your parents or teenage you can be charged. Parents might lose custody or other plans would be enforced. Not attending school can cost you personally, most jobs require high school diplomas, so unless you are an entrepreneur, your future is seriously compromised. You might do a GED, if you do a lot of reading and pick up some math and science books. ",
            "date": "Answered November 1, 2019",
            "views": "67",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Gabriel Tobing",
                "href": "/profile/Gabriel-Tobing"
            },
            "answer_text": "You won’t be as educated as you would be as if you don’t have the will power to go to school you won’t have the will power to use the internet to educated yourself. It’ll be harder for you to get into university. You’ll probably get low paying jobs. You’ll go into an emotional period of depression, anxiety and potentially become suicidal as you realised that you missed out on such a great opportunity to have a good life because at least at school, even if you mess up, you can still fix it. Hard for you to get a job. *There may be some other stuff but I cannot think of them right now. ",
            "date": "Answered December 29, 2019",
            "views": "66",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Jill Krol",
                "href": "/profile/Jill-Krol"
            },
            "answer_text": "After 3 days of unexcused absence, the school will send a truancy officer. You are responsible for your child’s actions or inactions. Become the parent and enforce going to school. Find the child’s “currency” and that becomes what is taken away for nonperformance of duties (school and homework). It might be tv time, phone time, gaming time, whatever. Try to find out the root cause. Something might be going on that you don’t know about. ",
            "date": "Answered April 30, 2019",
            "views": "66",
            "upvotes": " Answer requested by Thao Dao"
        },
        {
            "author_info": {
                "name": "Ahmad Zubair",
                "href": "/profile/Ahmad-Zubair-74"
            },
            "answer_text": "If you don’t go to school, nothing will happen. A lot of super rich kinda billionaires didn’t go to the school or are high school drop outs. But they had a vision a mission to follow and achieve and now they have hired a lot of good grade achieving college graduates to be a part of their firms. To be like them you have to be a people’s person. You need to understand and learn about what people need and you need to have an influence on them. School guides you discipline and ethics and morals. Same can be learned in other forms but your struggle will be 10 times higher. ",
            "date": "Answered May 27, 2020",
            "views": "101",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Stephanie Monaghan",
                "href": "/profile/Stephanie-Monaghan-6"
            },
            "answer_text": "Depends on your age and where you live. The court system might get involved and your parents might be legally compelled to send you to school. Or you might just get withdrawn from school. Longer - term, it’s up to you. If you find a job and work hard and work smart then you *might * come out okay. But if you’re too lazy to go to school or have too low of a frustration tolerance for school then you won’t be a decent worker and the prospects are pretty bleak. Look, most people don’t love school but they are willing to do things to maximize their options. If you aren’t willing to do those things then you’ll have to accept the results. I’d go to school. ",
            "date": "Answered February 13, 2020",
            "views": "45",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Naomi Bartle",
                "href": "/profile/Naomi-Bartle-2"
            },
            "answer_text": "is the question asking if you don’t have any education if you don’t go to school? Or did you home school? I was home schooled and people saw me as “sheltered” which bugged me because I am very confident around people of many ages, back grounds and ethnics. If you don’t go to school and home school then it doesn’t mean you won’t learn things that will help you discover your interest but if you slack off then you will. Home schooling is harder than it looks. It’s very different fro everyone and some don’t learn very well in a home environment and that’s okay. I learnt a lot of essay writing skills at school but I still learnt about people and big life lessons while not at school. Life brings shit whether at school or not :D ",
            "date": "Answered March 25, 2020",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dorin Stanciu",
                "href": "/profile/Dorin-Stanciu"
            },
            "answer_text": "Life happens. Life is this amazing thing, very complex, demanding, and sometimes scary and even unforgiving in its trials, that no one escapes. It gets you into this strange game, and you only get to learn the rules by playing. Some of us cheat and find out about the rules before others. These appalling people are called students. And they go into this cult called school. Not all of them go willingly, some are forced by parents or even worse, the state. And, to be honest, some of them are not even that fortunate, since some schools are pretty lame in the way of teaching them the rules of life. However, for most of us, the schools do a good job teaching about life and how the world works. Which is enough for the cheaters to get a solid advantage over the others, the school-free ones. Life is not fair that way. Thank you for the A2A. ",
            "date": "Answered December 19, 2019",
            "views": "193",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Vintage Cheri",
                "href": "/profile/Vintage-Cheri"
            },
            "answer_text": "missed class?= low attendancein highschool and above, it’s hard to cover up even if one day is missedyou might miss surprize quizzes/tests which teachers don’t have a re-test for (usually)If you’re talking about it on a longer term, then you’ll basically be jobless. Usually a highschool degree isn’t enough to get even medium wages so, you know where you’ll end up. Even if you’re not/ were not a good student at school, you completing your studies will always be appreciated. At some point of your life, you’ll also live to regret this decision unless you have some sort of unbelievable skills (could be anything: singers, dancers, actors, etc- these people usually don’t need much education though we absolutely love an educated king/queen) ",
            "date": "Answered October 2, 2020",
            "views": "16",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Nenad Tashkovski",
                "href": "/profile/Nenad-Tashkovski"
            },
            "answer_text": "If you are asking me about when we will go as normal then in that time if you don’t go to school you won’t be able to pass the year. And yeah there are people that have droped out of school and made themselves into a success but those are just 1% of people that have made a success out of that and when they did that they made sure that they won’t be homeles. And so I would say to stick to school and when you will finish high school if you think that college is something that you don’t need or don’t want then ok. It’s your deccision but I would say to at least finish high school ",
            "date": "Answered June 17, 2020",
            "views": "35",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "James Smith",
                "href": "/profile/James-Smith-4741"
            },
            "answer_text": "If you don’t go today, or if you don’t go ever? If you don’t go today, you may have a lot of make-up work to do. However, I think students sometimes need mental health days as much as teachers. If you never go to school, you are not doomed to failure and poverty, but you may find the road to success a bit more difficult. A diploma is just a piece of paper. A drivers license is just a piece of paper, although laminated. Look at what having a drivers license allows you to do. Drive. Use as an official ID when registering to vote. Buy alcohol if of age. That laminated piece of paper comes in pretty handy. That goes the same for a diploma. ",
            "date": "Answered October 23, 2019",
            "views": "142",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Mindy Hays",
                "href": "/profile/Mindy-Hays-1"
            },
            "answer_text": "It varies by the state you live in. In addition, it can vary by the county you live in in Illinois. My experience in central Illinois is judges are not very strict when it comes to truancy. The larger communities have more resources that will send case managers to your home to investigate why you are not going to school but it is up to the judge to enforce the law. ",
            "date": "Answered May 9, 2019",
            "views": "146",
            "upvotes": " Answer requested by Will Tisdale"
        },
        {
            "author_info": {
                "name": "Michael Ross",
                "href": "/profile/Michael-Ross-248"
            },
            "answer_text": "Depends on the age of the child. If under sixteen, explain that the law requires them to attend school, and you could be arrested if they don’t. Explore different ways of doing school. Traditional brick and mortar public schools aren’t the only way to go. You might find out whether there’s a bullying problem at the root of school dislike. You can home school, there are online schools even for elementary, there are video schools like Abeka or Bob Jones, hybrid schools like classical conversations, etc. Look at your child’s interests, try and find a method of learning that works for them. In the end, if the problem isn’t the school, or it’s just plain defiance, then you need to implement age appropriate discipline. ",
            "date": "Answered April 29, 2019",
            "views": "213",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Doug Harrell",
                "href": "/profile/Doug-Harrell-1"
            },
            "answer_text": "Well, that all depends. If you’re like most who don’t, you’ll simply remain an ignoramus. On the other hand, some people learn and study on their own and do quite well. It’s less common than it used to be, but many famous people were almost entirely self-educated. Abraham Lincoln comes to mind. However, to do a good job of it, you will have to learn to vet your sources very well, as there is probably more false information than correct information on a great many topics. However, the basics you can get pretty well. But you must apply yourself. It’s probably easier to just go to school. ",
            "date": "Answered May 7, 2020",
            "views": "53",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Derrick Ford",
                "href": "/profile/Derrick-Ford-24"
            },
            "answer_text": "I agree with some of the previous comments where the answer to this largely depends on your age. I personally believe that if you’re under age 18 you simply should go to school. Under the impression that you’re older than 18 and this question is regarding college then my answer would be based upon the idea that everyone is different and everyone defines success differently. Not everyone should go to college and furthermore you don’t have to go to college to be successful. Ultimately if you don’t go to college then you’ll be limited to the options that don’t require what schooling provides which honestly are becoming less and less. Some options require schooling such as becoming a doctor or engineer but there are many upon many that don’t. ",
            "date": "Answered April 19, 2020",
            "views": "81",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Frank Acosta",
                "href": "/profile/Frank-Acosta-15"
            },
            "answer_text": "Unless you’re a genius and develop the invention of the century, you’ll be disrespected by most people as you’ll have very little credibility to offer advice on almost any topic. In addition, you’ll increase your odds of living in poverty. If you love women, forget tying the knot with the woman of your dreams. They will not waste their time with a loser, in their eyes. Need I keep going? Get your education. You won’t regret it.👍 ",
            "date": "Answered February 22, 2020",
            "views": "24",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Leah Olsson",
                "href": "/profile/Leah-Olsson"
            },
            "answer_text": "There are laws that stipulate between what ages children are required to attend school. In California it is between the ages of 6 and 18 unless you graduate from high school before 18. If your parents do not make sure you are attending school they are breaking the law and can be fined for every day you do not attend school. ",
            "date": "Answered September 22, 2019",
            "views": "22",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Esha Khan",
                "href": "/profile/Esha-Khan-218"
            },
            "answer_text": "Well for starters, you could end up with no decent job. But if you don't go to school and study at home, then that's not that bad. Infact, if you want to start your own business and simply want to learn something specific. Then you can do that simply by learning courses online or in person or privately and begin your career. So not going to school isn't necessarily bad. ",
            "date": "Answered August 21, 2020",
            "views": "13",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Áshràf Jàmíl",
                "href": "/profile/Áshràf-Jàmíl"
            },
            "answer_text": "If we don't go to school,we can not learn about essential subjects of our life. We gather knowledge from books,School is the first step of our life to achieve knowledge. We start learning knowledge in our early stage of our life from going to the school which helps us to make our future life better.Without going school & avoid achieve proper knowledge we will be fail to make life healthy,wealthy & successful. ",
            "date": "Answered August 15, 2017",
            "views": "72",
            "upvotes": " View 3 Upvoters "
        },
        {
            "author_info": {
                "name": "Callie Williams",
                "href": "/profile/Callie-Williams-59"
            },
            "answer_text": "I think the children would be much happier and better adjusted to adult life if school as it currently is was suddenly gone. I think the ideal model is the free school where kids can learn what they choose and they learn democratic justice when problems arise. Children naturally gravitate towards learning and with the right tools (books, people, computers, musical instruments, creatives supplies) can learn anything. Kids can teach themselves ",
            "date": "Answered August 8, 2019",
            "views": "174",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Jack Latshaw",
                "href": "/profile/Jack-Latshaw"
            },
            "answer_text": "I assume you mean college. If so, you will need to find a job to support yourself. There are many jobs that don’t require a college degree. You could go to a trade school and learn a skilled trade and make good money that way. But with no education beyond high school you job choices are more limited, and likely to pay a lot less. ",
            "date": "Answered October 16, 2019",
            "views": "27",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Susan Long",
                "href": "/profile/Susan-Long-34"
            },
            "answer_text": "I assume you mean if you don’t go to college. If i am correct, you will have extremely limited job opportunities. You earnings will be relatively low and you will be frustrated. Now, there is a solution to all this. You can start your own business and, if you are very good, you can make good money and enjoy your job. However, most people who have no higher education do not make a lot of money and are not highly successful in their own business. But, it can be done. ",
            "date": "Answered April 16, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Adrian Aziz Santoso",
                "href": "/profile/Adrian-Aziz-Santoso"
            },
            "answer_text": "If you don’t go to school, you can’t hear the material. If you don’t hear the material, you can’t do the homework. If you can’t do the homework, you can’t study for the test. If you can’t study for the test, you can’t pass the test. If you can’t pass the test, you can’t pass the class. If you can’t pass the class, you can’t graduate. If you can’t graduate, you can’t get a job. If you can’t get a job, you can’t get money. If you can’t get money, you can’t buy food. If you can’t buy food, you can’t eat. If you can’t eat. You die. ",
            "date": "Answered October 2, 2020",
            "views": "19",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Dwayne Pagnotto",
                "href": "/profile/Dwayne-Pagnotto"
            },
            "answer_text": "Yer parents could be charged with contributing to the delinquency of a minor. You could be expelled, or even placed in a school for troubled teens. There you will meet a lot of other bad students who may be much tougher than you, that will give you trouble and make you wish you had gone to school. Not only that, but you will miss out on some wonderful times. ",
            "date": "Answered August 22, 2020",
            "views": "20",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Elizabeth Morrow",
                "href": "/profile/Elizabeth-Morrow-17"
            },
            "answer_text": "You won't get a diploma or degree. Depending on your age, if you're in the USA, your parents may go to jail. Knowledge can be acquired anywhere, sometimes even better than in public schools, if the person is determined to do so. Today, there are programs/organizations that can test your knowledge and provide certification of such knowledge. In today's world, some type of degree is almost mandatory for high-paying positions. The choice of getting or not getting a formal education is yours, and will determine how your life will unfold. Power is a two-edged sword. Be careful how you handle it. ",
            "date": "Answered March 11, 2020",
            "views": "68",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "David Thomas",
                "href": "/profile/David-Thomas-805"
            },
            "answer_text": "If you are under the age of 16 (in most states) and do not attend school, including alternative schools, night schools, and online schools, you will be considered truant. In Utah, the state where I live, you would be referred to juvenile court and might end up incarcerated, where you will be required to attend class or be placed in isolation. If you are over 16 (in most states), you can just drop out and take your chances with the job market. Good luck. ",
            "date": "Answered October 4, 2019",
            "views": "68",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Reetika Dawer",
                "href": "/profile/Reetika-Dawer-1"
            },
            "answer_text": "Actually nothing serious. If you don't go to school but continue developing your skills, studying, gaining knowledge, travelling and particularly work on your talents, you might end up giving a new scientific theory, become an athlete, an entrepreneur, a political leader, a writer, a religious guru, a motivator, a traveller and lot more. But you know.. being at school is priceless experience. It gives you memories and friends for life. ",
            "date": "Answered July 5, 2018",
            "views": "16",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Sara Tembo",
                "href": "/profile/Sara-Tembo-2"
            },
            "answer_text": "You will regret in future. Going to school improves your thinking capacity and shapes your future. Remember you are a potential future leader who would bring proper development to society if you acquire added knowledge from going to school . Being learned brings joy to your self and your loved ones and the society at large. Infact you can gain more things as you interact with friends and teachers. You will find employment of your choice and sustain yourself in future. Choose school. If you won't go to school you might end up unemployed. Think wisely. ",
            "date": "Answered February 16, 2020",
            "views": "44",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Sherry Millis",
                "href": "/profile/Sherry-Millis"
            },
            "answer_text": "If you are between the ages of 6 and 16, you are under the compulsory attendance laws and you could end up in Juvenile detention where they can be sure you attend classes. That won’t be the first thing that happens, but it could be the final result. You also could end up in foster care with parents who will be sure that you go to school. Just go to school and learn something! ",
            "date": "Answered December 18, 2019",
            "views": "132",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Alyssa Marie",
                "href": "/profile/Alyssa-Marie-912"
            },
            "answer_text": "If you don't go to school, you will fall behind academically. You will not have the same tools that the other students learned by attending class. It will make the real world a bit harder and more complicated, so I recommend that you continue to attend classes even if you don't really feel up to it. ",
            "date": "Answered October 14, 2019",
            "views": "24",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Marcus Lester",
                "href": "/profile/Marcus-Lester-2"
            },
            "answer_text": "That’s hard to say. Some people have done well, even when they were self-taught. Abraham Lincoln comes to mind. On the other hand, school is a place for learning how to get along with others of your age, a place to practice social skills, and it is a way to learn a lot of stuff. Like most things in life, you will get out of it about as much as you put into it. And to be fair, I’m a guy who flunked out of high school and college. It took me 24 years to get my BA degree. Then I needed only one year to earn an MA. When I learned how to put something into it, I got a hell of a lot more out of it. ",
            "date": "Answered April 7, 2020",
            "views": "145",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Victoria Elder",
                "href": "/profile/Victoria-Elder-1"
            },
            "answer_text": "What happens if a child just won’t go to school? If a child refuses to go to school, ask questions. If there is a legitimate reason, do something to fix it. Otherwise, you’re the parent and the child is going to go to school because you said so. That’s how this parenting thing works. They are children. Few children actually enjoy going to school, but it is a legal requirement. Guess who gets in trouble if you allow them to make this decision… because it isn’t the child. ",
            "date": "Answered May 1, 2019",
            "views": "208",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Gaurav Kumar",
                "href": "/profile/Gaurav-Kumar-3166"
            },
            "answer_text": "Then there arise 2 possibilities Either u will become school dropout millionaire or billionaire ‘but only if u are intelligent’ Or u will suffer your life with alot of economic and mental problems. Coz there is very less possibility of getting any job or work. But there is one case also,if ur dad have large business then u can expand it but for this also u need knowledge otherwise it will vanish soon. ",
            "date": "Answered April 24, 2018",
            "views": "26",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Ann Fitz",
                "href": "/profile/Ann-Fitz"
            },
            "answer_text": "Not much. You lose that opportunity to make friends. You become boring. You are left out. You have less to offer in conversation or activities. You are alone a lot. Fewer opportunities come your way. You become depressed and more likely to do drugs or violence out of sheer boredom. ",
            "date": "Answered May 19, 2020",
            "views": "34",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "John Blaylock",
                "href": "/profile/John-Blaylock-6"
            },
            "answer_text": "High School or College. For one you won’t graduate. If High School it is damn difficult now-a-days to get a good job without a High School Diploma or a GED. Most factories will not hire you. College, There are good jobs out there if you don’t have a college degree, skilled trades etc. Military, with the right MOS you can walk right into some great paying jobs. ",
            "date": "Answered November 19, 2019",
            "views": "43",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Alpha Jalloh",
                "href": "/profile/Alpha-Jalloh-12"
            },
            "answer_text": "First of all school is not everything, and it’s not force to go to school if you don’t have the means to go. There are lots of people out there who didn’t go to school but are well established. U can become successful even without going to school. You can become a successful Carpenter, a successful mechanic ect. All u need to do is love what you do n trust me u going to be successful. All you need is the courage. ",
            "date": "Answered August 13, 2019",
            "views": "252",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Suzanne Jacobsen",
                "href": "/profile/Suzanne-Jacobsen-1"
            },
            "answer_text": "It depends on your age. Most jurisdictions require children to attend to a certain age. Authorities can pick you up and your parents can be charged for not ensuring you are educated. In addition, if you never attend you may remain illiterate and unable to understand mathematics. You will not have social experiences with peers. You may not be employable. So, best to simply go to school and make the best of it. ",
            "date": "Answered November 29, 2019",
            "views": "31",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Josie Lie",
                "href": "/profile/Josie-Lie"
            },
            "answer_text": "If you don’t go to school, your parents can get arrested. It is the law for people age five to eighteen to go to school. After you graduate high school, you can choose whether or not you go to college or university. But going to elementary, middle, and high school is a requirement. ",
            "date": "Answered May 25, 2017",
            "views": "437",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stacey Essex",
                "href": "/profile/Stacey-Essex"
            },
            "answer_text": "I think parents can be arrested in the USA if children do not attend school or are properly home schooled. It would be considered neglect. Children can’t advocate for themselves and it is the parents responsibility to make sure the child is brought up healthy and educated until 18. ",
            "date": "Answered August 16, 2018",
            "views": "294",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "James Harmon",
                "href": "/profile/James-Harmon-122"
            },
            "answer_text": "Your question is extremely vague and missing essential information. The most accurate answer I can provide given this lack is: You will be more ignorant than you would have been had you gone to school (“school” in this sense includes even trade schools). Any consequences of this ignorance will depend on the missing information. ",
            "date": "Answered August 5, 2020",
            "views": "34",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Lester Wright",
                "href": "/profile/Lester-Wright-11"
            },
            "answer_text": "Ever seen the movie where a completely average guy gets cryogenically frozen for hundreds of years only to wake up with our country being absolutely stupid and now he's the smartest person alive? Yea, well, that's pretty much what would happen. However, I highly doubt this would ever happen. Our species thrives on knowledge. It drives us crazy that there are things that we still have absolutely no knowledge on. Such as space and our oceans. We constantly strive to learn more and more to cure this craving for knowledge. My grandfather once told me, \"there are still things I'm learning everyday. Just remember, the day you stop learning is the day you start dying.\" ",
            "date": "Answered May 26, 2017",
            "views": "18",
            "upvotes": " View 4 Upvoters"
        },
        {
            "author_info": {
                "name": "Brett Ozga",
                "href": "/profile/Brett-Ozga"
            },
            "answer_text": "Assuming you are old enough to drop out, nothing immediately. But you will be killing your long term earning potential on average. Unless you want to learn on your own, get accepted to uni and go on to a professional degree or PhD, but I assume you mean no more school, so I will stick the my answer above. Please continue to send me your questions and do stay in school. Till your next question. ",
            "date": "Answered June 24, 2020",
            "views": "31",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Fulgence Ningaba",
                "href": "/profile/Fulgence-Ningaba"
            },
            "answer_text": "if you don't go to school you will meet a lot of problems. you are not able to go anywhere. you will not get job ,you won't do your business, you know nothing in life so you can’t even read, and it is so difficult for you to communicate with your neighbours. You got bad languages .because the school teach many thinks . You can't even stay in a new society. ",
            "date": "Answered October 16, 2019",
            "views": "32",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Janna Nunn",
                "href": "/profile/Janna-Nunn"
            },
            "answer_text": "why ? don't you want to go to school. is there are reason for you not wanting to go. life can be difficult as an adult without some education , I wish that I had be able to swap school when I got older but I wasn't allowed to change from where I was. I was bullied by teachers not my peers and that was worse. ",
            "date": "Answered May 24, 2020",
            "views": "48",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Thomas Storin",
                "href": "/profile/Thomas-Storin"
            },
            "answer_text": "Well several things will happen. One if underage your truant and can be arrested. Two your dog will have a higher IQ than you. Three, you'll be taking a bus or walking to your job at McDonalds. Actually FORTH. You won't be alone. You'll have the company of other losers. Oppps, FIFTH. What DECENT girl would want to live in a cardboard box or father allow it. Thinks thats enough, don't you? You asked. Just an old mans respinse. ",
            "date": "Answered March 7, 2020",
            "views": "19",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Clayton Smith",
                "href": "/profile/Clayton-Smith-237"
            },
            "answer_text": "1-You will have a hard time getting a good paying job [think of working at a Wendy's for 45yrs] 2nd-your parents can be fined and in some incidents they can be arrested. So the smart thing to do is stay in school,and don't do what I did and that was to leave school 1/2 way through my Dr year. ",
            "date": "Answered February 5, 2020",
            "views": "21",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Ken Haar",
                "href": "/profile/Ken-Haar"
            },
            "answer_text": "Legally you would be considered truant. What happens to truants depends on where you are. In some states virtually nothing will happen and you’ll be allowed to grow up ignorant. In some states truancy would get the state social service agencies involved with your case, and pending their evaluation, you could be put in environments (foster care, group homes, etc. ) where your behavior and pursuit of your education could be monitored. ",
            "date": "Answered October 13, 2019",
            "views": "91",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Frank Saunders",
                "href": "/profile/Frank-Saunders-2"
            },
            "answer_text": "It's hard to say.even most menial jobs want you to have high school.if you can read ,write and do simple arith matic you can probably get by with most Labour jobs.get in and apprentice yourself to a mechanic or something and you can learn a skill.I was a painter and worked around people with just high school mostl y.I worked in a lumber yard with a guy who could neither read not write.I guess he could count,had to tell how many boards in a pile. ",
            "date": "Answered September 11, 2019",
            "views": "38",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Jessica Turner",
                "href": "/profile/Jessica-Turner-490"
            },
            "answer_text": "Every kid’s dream right there: never going to school and just staying at home all day. If you don’t go to school, first of all the government will have something to say about that: it is a legal requirement to receive education. In the long term, you won’t be able to get into college. If you don’t study hard and get good exam results, you probably wont be let into college. This means that the chances of getting a good, well paid job are much slimmer. Even if you really don’t want to, going to school is much better, in the short and long term, than if you don’t. ",
            "date": "Answered October 28, 2019",
            "views": "70",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Zelda Cummings",
                "href": "/profile/Zelda-Cummings"
            },
            "answer_text": "Short answer: 1) nothing 2) regret (but later when you realize employers won’t hire those without a HS diploma). I currently tutor immigrants who have never had the opportunity to go “beyond” in school, some had to stop by 3rd grade. Their effort to learn and overcome what they missed is remarkable. Don’t pass your own opportunities because it’s hard now. Tough it out and hang in there. Find a teacher who can help you stay motivated and advocate for you. Otherwise, someday you’ll regret it. ",
            "date": "Answered January 23, 2020",
            "views": "32",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Lana Newport",
                "href": "/profile/Lana-Newport-1"
            },
            "answer_text": "Depends on how old you are and how smart you are. If you drop out of high school, then you need to be able to pass a GED test in order to go to college, or get technical training. There are some people who dropped out of school and are millionaires. But most aren't! If you want to be successful in life financially, you need to be highly motivated. Assess yourself and decide if it's a good idea for you. ",
            "date": "Answered March 24, 2020",
            "views": "40",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Gabriella Alesi",
                "href": "/profile/Gabriella-Alesi"
            },
            "answer_text": "It depends on what they did in place of school. If they would do nothing, then the kid would be very uncomfortable anywhere and not able to fit in. It depends if the child has any siblings or peers. Would the child be taken out of school, or never enrolled? ",
            "date": "Answered March 20, 2017",
            "views": "12",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "James Juris",
                "href": "/profile/James-Juris-2"
            },
            "answer_text": "It will likely be very difficult to get a job because employers don’t want someone who does not have the desire to finish school (high school) as an employee. If you are even able to get hired, you will be working dead end jobs for the rest of your life. ",
            "date": "Answered October 1, 2020",
            "views": "7",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Muhammad Imran",
                "href": "/profile/Muhammad-Imran-1352"
            },
            "answer_text": "An anecdotal answer by me:- (Thank you for Ask to Answer) He always asks me to operate his debit card at ATM machines, I know his pin code🤦 . He does never look at expiry date on medicine at the time of purchase and consumption 🤦🏻‍♀️ . Food items are far beyond it. He does always accompany me for any issues for which he has to rush to the concerned office. He is my one of the best acquaintances, helpful to me, interesting ?! Yet he's 4 grades passed at his school. Moreover your perspective, approach, pov would be different than the one who attended the school to certain grades. Every government emphasizes on elementary education, at least. God bless you :) ",
            "date": "Answered August 14, 2020",
            "views": "83",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Tim Dibble",
                "href": "/profile/Tim-Dibble"
            },
            "answer_text": "It will depend on you. If you use modern technology, libraries, mentors and other means of gaining the state of being educated, you may find a profitable future in self employment. Unfortunately, there are truancy laws which will, absent homeschooling or other religious alternative to schooling result in forced participation-destroying your creativity and lust for learning. as for secondary education, as long as you learn enough at the high enough levels you can continue to succeed. ",
            "date": "Answered October 23, 2019",
            "views": "128",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Kim Baumgart",
                "href": "/profile/Kim-Baumgart"
            },
            "answer_text": "In most states school is legally required at a certain age (beginning varies) until they turn 18. The parent is responsible to get them to school and can suffer legal consequences for not doing so. That being said, some states also allow a waiver if home schooling is in place, and provide home-bound services if a child is too ill to attend. If they just aren’t going because they don’t want to and you don’t have the parenting skills to get them there - seek help with that. ",
            "date": "Answered May 1, 2019",
            "views": "68",
            "upvotes": " Answer requested by Thao Dao"
        },
        {
            "author_info": {
                "name": "Wesley Teo",
                "href": "/profile/Wesley-Teo-1"
            },
            "answer_text": "You will become an ignoramus, condemning yourself to a low life from which you can never escape, even with later regret after regret. Worst of all, you’ll condemn your children to the same fate, passing the toxicity from generation to generation. The cost to ignorant and uneducated person is extremely high to you as individual and to society and it is long lasting from which there is no remedy by the time you realize your mistake. ",
            "date": "Answered May 23, 2020",
            "views": "82",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Georgia Baba",
                "href": "/profile/Georgia-Baba"
            },
            "answer_text": "Nothing but unless you are very motivated and creative you won’t have gained the skills needed to support yourself. There are people who are “ successful“ and self sufficient despite lack of formal education but this is becoming more rare. ",
            "date": "Answered May 30, 2020",
            "views": "71",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Erick Kagesi",
                "href": "/profile/Erick-Kagesi"
            },
            "answer_text": "If you mean: what should you do, as a parent, if your child refuses to go to school,my answer is let the brat know its options: school or juvie. Spanking has been known to set one or two stupid children straight. If they are old enough, school or out on their arse. Let them try supporting themselves for a day or two and then maybe they’ll see the light. Or 2. what happens (including government intervention), well, that varies from country to country. In some countries, elementary education is mandatory. ",
            "date": "Answered April 18, 2020",
            "views": "79",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "T. Craig Hilton",
                "href": "/profile/T-Craig-Hilton"
            },
            "answer_text": "If you refer to finishing high school, then just do it. Your high school diploma is worth more than $1 million dollars in life-time earnings. It's a “must do\". School (college) isn't for everyone. However, education is for everyone. Have you considered apprenticeships, certification programs and the like (available at very low-cost through your local community/technical college). These can be worth another million dollars (and way more) in lifetime earnings. In the end, you will find yourself doing something 10 years from now. Your decisions today will have a direct bearing on where you'll be in a decade. Follow your passion, and remember education is always a good idea. ",
            "date": "Answered December 8, 2019",
            "views": "85",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Kathryn Plantan",
                "href": "/profile/Kathryn-Plantan"
            },
            "answer_text": "First, it depends on what year you’re in and how old you are. If you are under 16, for example, an officer may come to your door eventually and compel you to go to school. There may be penalties for your parents and yourself. Parent can face jail time. ",
            "date": "Answered October 11, 2019",
            "views": "21",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Scottie Davis",
                "href": "/profile/Scottie-Davis-5"
            },
            "answer_text": "If you don’t go to school, who knows what will happen? If you don’t like school, then don’t go. If you do not want a chance for a decent job, then don’t go. Now mind you, there are some very successful people who never went to college, or dropped out. But they do not represent the majority. We all need some type of training and education. Whether it is traditional “school” or “trade school” or other “schooling”. ",
            "date": "Answered June 15, 2020",
            "views": "42",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Allin Blakes",
                "href": "/profile/Allin-Blakes"
            },
            "answer_text": "You’ll be confused a lot socially awkward And you have an inability to find direction never truly knowing what you could have If you have a passion so much so that you only want to study the one subject Representing all To conform to one infinitely expanding curriculum With to infinitely expad them all. Have Trust in school so you can represent the people as a whole ",
            "date": "Answered December 22, 2017",
            "views": "738",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Michael Ballai",
                "href": "/profile/Michael-Ballai"
            },
            "answer_text": "In all likelihood, not what you want. Imagine having a very hard life where you get nothing you want for decades on end. Miserable and painful. School is not a magic passport to a wonderful life and there’s a whole lot of junk that school pushes on students that they really should not. But it’s still necessary for things that matter. ",
            "date": "Answered March 2, 2020",
            "views": "16",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Jenny Doughty",
                "href": "/profile/Jenny-Doughty"
            },
            "answer_text": "It depends on the laws where you are. You don’t have to go to school but you do have to be educated and you do have to demonstrate to the education authorities how that is happening. You also have to consider if you want to go to university at some point, and how you will demonstrate it to them. ",
            "date": "Answered May 23, 2020",
            "views": "83",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Deinse Jarman",
                "href": "/profile/Deinse-Jarman"
            },
            "answer_text": "You do not go to this physical location and you don’t interact there. This is not the end of learning nor the end of socialization for you. You can definitely learn what you need to learn and you can definitely socialize, although it would be different. I think that hard part is sport but this will be temporary. ",
            "date": "Answered August 6, 2020",
            "views": "41",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Shelby Rene",
                "href": "/profile/Shelby-Rene-1"
            },
            "answer_text": "Possibly a truancy court hearing in which you’ll pay up to $500 and will not be allowed to be absent from school for up to six months or a year. If you are absent during this period you will have to go back to court. ",
            "date": "Answered December 20, 2019",
            "views": "20",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Joy Austin",
                "href": "/profile/Joy-Austin-3"
            },
            "answer_text": "You need an education from somewhere!!! I doubt you have the discipline to educate yourself. So easy to pick up you phone and play games for hours trying to beat your personal best!! Ask yourself a few questions. How will I support myself in the future? What are my bankable skills? If you are having trouble with these questions you need an education. Please don’t end up living in your parents basement. Do yourself a favor and get a plan for your success. Good luck. ",
            "date": "Answered February 1, 2020",
            "views": "23",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Renee Lago",
                "href": "/profile/Renee-Lago-1"
            },
            "answer_text": "School or college…Let me tell ya, I told my son years ago….You either work hard now and get a job you love, so you can afford a family and retire at a reasonably early age, or take the chance of working at a job that you don't like. With little or no benefits and work hard the rest of your life. You journey your choice! ",
            "date": "Answered October 20, 2020",
            "views": "31",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Tricia Lockhart",
                "href": "/profile/Tricia-Lockhart"
            },
            "answer_text": "In the UK, unless the parents have opted to homeschool, failing to send your child to school can cause the parents to be fined. Sometimes parents don’t act in a child’s best interest and if a child has no education it does damage their future. The government has a duty of care to the child. ",
            "date": "Answered January 15, 2020",
            "views": "72",
            "upvotes": " Answer requested by Pinky Araujo"
        },
        {
            "author_info": {
                "name": "Ron Scott",
                "href": "/profile/Ron-Scott-124"
            },
            "answer_text": "School is compulsory by law if you are talking about primary through secondary. You may as a minor be able to arrange a leave with the authorities in your life and the school administraton. If you meant college, you will be in good company as these days so many are holding off. College will be there should you change your mind. ",
            "date": "Answered September 11, 2019",
            "views": "48",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "John Sohocki",
                "href": "/profile/John-Sohocki"
            },
            "answer_text": "You will eventually end up worrying whether your life would have been easier or happier if you had. Undoubtedly you will have to work harder than your peers who did attend a school. You may still be a success but it is highly unlikely! Good luck! ",
            "date": "Answered June 16, 2020",
            "views": "88",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Fern Ward Buntyn",
                "href": "/profile/Fern-Ward-Buntyn"
            },
            "answer_text": "To answer succinctly, we need more information. You do not indicate your age, which is the decisive factor in the consequence determination. It varies by state. In most cases, your parents will suffer the consequences of your truancy. After a certain age, it is a moot point. You will be self-educated and world-educated. ",
            "date": "Answered September 27, 2019",
            "views": "65",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "A.I. Marvin",
                "href": "/profile/A-I-Marvin-1"
            },
            "answer_text": "Where do you have? I basically did not send my kids to school until they were old enough to go to community college. Many homeschoolers are skipping high school and going to community college at 14 or 15. Then they just begin with 1 class, next semester 2 classes….. After a couple years they transfer to a 4 year college. ",
            "date": "Answered February 5, 2020",
            "views": "16",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Murali Krishna",
                "href": "/profile/Murali-Krishna-4896"
            },
            "answer_text": "He will be bored The mind will be come inactive and becomes dull Inattentive poor communication skills Isolated Fear complex to see the people antacids Mostly temper tantrums Curious nature of the child shall be protected Give him toys games dolls many children play and if he dislikes see what he do Through it out Reshaping Parents can understand child's burn out in his moments with toys Play is the gate way for communication of the child Give electronic items which makes sounds observe how YOUR CHILD behaves Give him rhymes STORY books with pictures Give him white board and writing materials wait what your child will be doing sribbling DRAWING lines putting Xerox shouting exciting Please send him to school mix with friends play enjoy learning through ACTIVITIES Man is the mirror of the child hood ",
            "date": "Answered April 22, 2020",
            "views": "89",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thomas Ewing",
                "href": "/profile/Thomas-Ewing-14"
            },
            "answer_text": "You will be useless to yourself and society and not be well-liked. If you choose to be self-educated it takes a lot of discipline that people who don’t go to school aren’t likely to have. ",
            "date": "Answered October 15, 2020",
            "views": "28",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Iqra",
                "href": "/profile/Iqra-109"
            },
            "answer_text": "Going to school doesn't only mean to get knowledge or to study, but we also get the ability to face different kinds of people.A relative of mine didn't go to school but studied at home by his father even though he was admitted in school,he used to go to school to take exams. So,that's what I'm saying that you can study at home but you won't be able to stand in front of two people properly,you won't have that confidence. So, it's important. ",
            "date": "Answered March 27, 2020",
            "views": "17",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Wei Shen",
                "href": "/profile/Wei-Shen-5"
            },
            "answer_text": "The truancy officer comes and fines you and in some cases the truancy officer takes the kid to school with or without you. You as a parent have a job and that is to get your child to go to school. IF they won't go then it is your job to find out why. If you can’t do this then notify the school and they will bring in a child psychologist. If it’s a bullying case the school needs to know and you need to work with the school and the board of ed programs that deal with bullying. ",
            "date": "Answered May 1, 2019",
            "views": "62",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "E. J. Fitzgerald",
                "href": "/profile/E-J-Fitzgerald"
            },
            "answer_text": "Life is about choices and consequences. I suspect dropping out of school is a poor choice. ",
            "date": "Answered December 22, 2017",
            "views": "28",
            "upvotes": " View 4 Upvoters "
        },
        {
            "author_info": {
                "name": "Joel Dykstra",
                "href": "/profile/Joel-Dykstra-1"
            },
            "answer_text": "you will miss out on a chance to be educated and all of the benefits that go with it. It’s not impossible to gain an education outside of school, but it is very difficult. Why pass on a golden opportunity to get an education? ",
            "date": "Answered February 19, 2018",
            "views": "760",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charles Guilford",
                "href": "/profile/Charles-Guilford"
            },
            "answer_text": "The lack of specificity of your question suggests that this should NOT be an option! With that said, technically a person who does not attend school during k-12 (up to age 16) in the US is subject to truancy law enforcement. Home school counts as school. If you are referring to higher education, then generally it limits your workforce options. Hope this helps. ",
            "date": "Answered May 17, 2019",
            "views": "104",
            "upvotes": " Answer requested by Ben A"
        },
        {
            "author_info": {
                "name": "Mary",
                "href": "/profile/Mary-938"
            },
            "answer_text": "This is what my teacher says.., If you don’t go to school you don’t learn If you don’t learn you don’t get a job If you have no job you have no money If you have no money you have no food If you have no food you starve Need I say more… ",
            "date": "Answered December 22, 2017",
            "views": "294",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Allen Nunley",
                "href": "/profile/Allen-Nunley"
            },
            "answer_text": "If you are currently enrolled, and you don’t attend, you will flunk your courses. If you are in University, this will be a colossal waste of money. if you are not enrolled, it simply means that you will not get a university education. It will also mean that the choices left to you to earn a living are less and statistically speaking, you will have less earning power than those who attended university. ",
            "date": "Answered October 23, 2019",
            "views": "58",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Faheem Khaskheli",
                "href": "/profile/Faheem-Khaskheli-1"
            },
            "answer_text": "Then you have to chose different career path or way to earn money, if your parents are rich then you can buy stock and invest in market. or you could be a professional sport person, to earn money. Thats the only problem that you will face in future. which is how to earn money. Also Physics, Chemistry, Biology, and Reading, writing skill are also important to survive in modern world so you need it too, also with economic skills more you know more advantage you will have in real world. ",
            "date": "Answered February 18, 2018",
            "views": "882",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Josephine Mathair",
                "href": "/profile/Josephine-Mathair"
            },
            "answer_text": "As long as you have parents who provide you with shelter, food, water, and clothes, you can still survive. But that’s not guaranteed after you turn 18. After that, you must find your own job and afford a shelter. Although most decent jobs require academic degrees, you can probably start your own business or do something that doesn’t require a degree. ",
            "date": "Answered January 29, 2020",
            "views": "14",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Jean Martin",
                "href": "/profile/Jean-Martin-114"
            },
            "answer_text": "How old are you? How long are you planning on not going to school? If you’re ten years old, and you don’t plan on going to school again, not a lot is going to happen, because you’re not going to be able to make it happen. ",
            "date": "Answered May 23, 2020",
            "views": "80",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Nancy T Trader",
                "href": "/profile/Nancy-T-Trader"
            },
            "answer_text": "Nothing will happen. As usual everything will goes. But if you are ready to study you will get many things. Education has an important role in life. Education is the wealth which is not taken by others from us. Never waste your time for study. Start it in your life and experience it. ",
            "date": "Answered February 17, 2016",
            "views": "27",
            "upvotes": " View 3 Upvoters"
        },
        {
            "author_info": {
                "name": "Tim Cahill",
                "href": "/profile/Tim-Cahill-8"
            },
            "answer_text": "It's very simple. No school, no job. No money. Join the military? No way! Why should they teach you how to read and write? You are asked to leave. Unless you have a very high IQ and have mastered something useful to an employer. You go no where. ",
            "date": "Answered January 14, 2020",
            "views": "13",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Karthik Gudikati",
                "href": "/profile/Karthik-Gudikati"
            },
            "answer_text": "Earth will stop rotating Sun stops burning Trees fall down without a reason Volcanoes errupt Lightning thunders storms everywhere People fall sick Animals start crying Finally the universe starts contracting till it becomes null ",
            "date": "Answered May 24, 2017",
            "views": "17",
            "upvotes": " View 5 Upvoters"
        },
        {
            "author_info": {
                "name": "Teresa Fronek",
                "href": "/profile/Teresa-Fronek"
            },
            "answer_text": "You fail. If it's high school, then your parents can even be arrested and lose custody of you and your siblings. If it's college; then you lose out on a wonderful experience and chances for better careers throughout your life. ",
            "date": "Answered May 20, 2019",
            "views": "83",
            "upvotes": " Answer requested by Lynn McDonald"
        },
        {
            "author_info": {
                "name": "Roy Lee Wright",
                "href": "/profile/Roy-Lee-Wright"
            },
            "answer_text": "That all depends on you. If you are a motivated self-starter, you might do better without public school. However, for most people, this is simply not the case. But some are certainly going to be more affected than others. ",
            "date": "Answered August 21, 2020",
            "views": "18",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Ione Theresa Labrie",
                "href": "/profile/Ione-Theresa-Labrie"
            },
            "answer_text": "You might be homeless in a few years You might get lucky and find some body to take care of you. Do you want to take that chance? Maybe you are a trust fund baby? ",
            "date": "Answered October 16, 2019",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tracey Vacek",
                "href": "/profile/Tracey-Vacek"
            },
            "answer_text": "It depends on a couple things. Your age and state laws. In Texas at 16 you can drop out. Before that you can face court and fines for not attending. It also may limit options in your future. ",
            "date": "Answered October 16, 2019",
            "views": "17",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Patrick Mcgovern",
                "href": "/profile/Patrick-Mcgovern-14"
            },
            "answer_text": "Didn’t you watch the Little Rascals as a kid? the truant officer will look for and find you. Even if you are illegal , the truant officer will find your and drag you to school. ",
            "date": "Answered September 25, 2020",
            "views": "5",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Michael Richards",
                "href": "/profile/Michael-Richards-137"
            },
            "answer_text": "You will need further education to get a good job—not necessarily college—there are many good trade schools and many employers will pay for your education. Find something you enjoy doing that will pay you a living wage and then go for it. Good Luck. ",
            "date": "Answered October 16, 2019",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Greg Kozicki",
                "href": "/profile/Greg-Kozicki"
            },
            "answer_text": "I don't know. You have to ask Yourself that question. Perhaps a lot will happen or nothing at all. I learn at home and school. School is a means of getting formal education and a piece of costly paper that opens some doors. Others I open on my own. ",
            "date": "Answered March 13, 2020",
            "views": "48",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Paul Clark",
                "href": "/profile/Paul-Clark-356"
            },
            "answer_text": "You limit where you can go, what you can do and who you can know. The main thing you learn in school is how to communicate, and different ways to communicate, with people in different areas of society. It’s a continual process of learning language, culture and subculture. The more you learn, the more flexibility you will have to associate with anyone you want and go wherever you want. To put it more simply, learning is freedom. The more you learn, the more freedom you have. Example: I have one buddy who has his PhD in English Literature and is working on his second. He is also a musician and can get along in a few languages. He has such a wide network of friends and acquaintances that he regularly travels the world and never has to pay for a room anywhere. He’s such a cool guy and so good at passing on his knowledge that he is welcomed everywhere. ",
            "date": "Answered May 23, 2020",
            "views": "56",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Sara Matthews",
                "href": "/profile/Sara-Matthews-5"
            },
            "answer_text": "In a modern society they would have little if any structure to their day and likely be illiterate - unless their family was committed to home education ",
            "date": "Answered April 6, 2017",
            "views": "934",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Joshua Jones",
                "href": "/profile/Joshua-Jones-1036"
            },
            "answer_text": "Who knows what can happen. Noone can predict your future. You might end up in a terrible place or you might end up in a great place. Make sure that you are making decisions based on the right things and about things you are confident about. ",
            "date": "Answered March 11, 2020",
            "views": "7",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Rahul Aryan",
                "href": "/profile/Rahul-Aryan-182"
            },
            "answer_text": "“Nothing,” but a longer answer is you gonna miss out a lot of things, you wont be able to learn about essential subjects of your life nor you would have any kind of knowledge , going to school is the 1st step in gathering knowledge and what you learn may help you in your future , going to the school which helps us to make our future life better. ",
            "date": "Answered June 14, 2020",
            "views": "65",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Hafiz Amjad",
                "href": "/profile/Hafiz-Amjad-6"
            },
            "answer_text": "Children grow up and set off for college. Such is the standard. What's more, yes—you could. Maybe should. Think about the current monetary atmosphere, which everything except requires individuals entering the workforce to show up at prospective employee meet-ups wielding their college transcript; think about the social advantages, the expanding of scholarly skylines, the marvel of relaxed investigating each subject under the sun; the (inevitable) money related adjustments. ",
            "date": "Answered April 9, 2020",
            "views": "30",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Melissa Pope",
                "href": "/profile/Melissa-Pope-7"
            },
            "answer_text": "You won't earn the required credits to graduate and receive a diploma if you miss an excessive amount of time. You may have to appear before a family court judge for truancy depending on how strictly attendance is enforced where you live. Make your life easier and go to school. ",
            "date": "Answered December 22, 2017",
            "views": "208",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Stowell",
                "href": "/profile/John-Stowell-3"
            },
            "answer_text": "Well unless you are a terrific seller or have a good business idea you are stuck in the low end of jobs. Education seems to be the only measurement people use which is why this world is run so poorly. ",
            "date": "Answered May 31, 2020",
            "views": "154",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Zemina Sifontes",
                "href": "/profile/Zemina-Sifontes"
            },
            "answer_text": "They will be loss and so would the rest of us. In this life we all shall pass on to the next life. But with out education there is no room for advancement of positive process. Think about it and stay in school. ",
            "date": "Answered May 31, 2020",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Leader",
                "href": "/profile/Stephen-Leader-4"
            },
            "answer_text": "You grow up to be stupid. You can't get a job and will have a very miserable life. Please accept this bit if advice I learned the hard way: The harder you work now, the easier life gets when you are 7, also: If you work hard now, you get to make the choices later. If you take the easy way out then others make the choices for you. YOUR choice. Good luck. ",
            "date": "Answered November 13, 2019",
            "views": "46",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Olivia Silver",
                "href": "/profile/Olivia-Silver-17"
            },
            "answer_text": "I’m not sure what you mean. If you mean high school, I would recommend getting your diploma if you want to work at some time in the future. If you mean college, it really depends on your focus. If you want to do something academic, definitely important to go to college, but if you want to do something like music or art, you should get an internship at a gallery or music studio or find a mentor. ",
            "date": "Answered October 17, 2020",
            "views": "29",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Jim Hastings",
                "href": "/profile/Jim-Hastings-12"
            },
            "answer_text": "Such an open question. You don’t graduate, would be my first response. You don’t usually acquire the basic skills needed in your country to obtain work beyond maybe cleaning up bathrooms for some janitorial company. ",
            "date": "Answered August 16, 2020",
            "views": "50",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "John Brown",
                "href": "/profile/John-Brown-2633"
            },
            "answer_text": "After attending my first day of school, I announced at dinner that one day would be last day. I rather stay at home, watch cartoons, play with my dog and my soldiers, and read what I wanted to read. The next morning my brother told me to get dressed and get on the school bus. I hid under my bed and stayed home. When my father came home he was told of what I did and made it clear in no uncertain terms, that I would be attending school for the next 12 years. ",
            "date": "Updated May 10, 2020",
            "views": "292",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Catherine Taylor",
                "href": "/profile/Catherine-Taylor-134"
            },
            "answer_text": "Learning is a lifelong journey , it is not restricted to the confines of four walls.The world is our classroom, however the tools needed to navigate through this world are gathered in lessons learned along the way. My grandmother always said “Surround yourself with those you respect and aspire to be like”, very wise words. ",
            "date": "Answered February 1, 2020",
            "views": "10",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Natasha Turpin",
                "href": "/profile/Natasha-Turpin-1"
            },
            "answer_text": "where I teach parents are notified if you’re absent and they haven’t called ahead to let the school know. If you have any unexplained absences a letter goes home as well asking the parent to explain. ",
            "date": "Answered October 18, 2020",
            "views": "21",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Marge Stelly",
                "href": "/profile/Marge-Stelly"
            },
            "answer_text": "As in you choose to be homeschooled or you don’t go to college? I’m going to go with the second. More and more tradesmen are needed, so you could look for a job in that department. Carpentry, plumbing, jewelry-making, etc. You can go to trade schools and learn all manner of things. I’m going to see about book binding. ",
            "date": "Answered February 4, 2020",
            "views": "18",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Violet Lee",
                "href": "/profile/Violet-Lee-87"
            },
            "answer_text": "Well this could happen: You miss everything. Like the best things happen and then BOOM. You didn’t go to school so you missed itNothingYou turn stupid and have to catch up on everything later. (Which SUCKS) And that’s it. Well. technically",
            "date": "Answered December 18, 2019",
            "views": "20",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Beheruz N Sethna",
                "href": "/profile/Beheruz-N-Sethna"
            },
            "answer_text": "If you are super intelligent, not just in one subject but in all subjects, you could understand the material directly from a book. But, even if that is true you still don’t get the benefit of the additional perspectives that the teacher or professor brings to the classroom, and you definitely don’t get the benefit of the interaction with other students in class. Attend school, be in class, and be attentive. ",
            "date": "Answered June 10, 2019",
            "views": "406",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "V N Rajini Kanth",
                "href": "/profile/V-N-Rajini-Kanth"
            },
            "answer_text": "your wisdom will be genuine(your own only), unadulterated. you will be more humane! you will be very close to mother nature! you will be considerate, you will respect elders; you will have ethics. ",
            "date": "Answered December 22, 2017",
            "views": "294",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Unish Thapa",
                "href": "/profile/Unish-Thapa"
            },
            "answer_text": "if you dont go to school you can get the theory knowledge and due to the lack of thoery knowledge you willnot able to apply your knowledge into the practical k owledge…. ",
            "date": "Answered December 22, 2017",
            "views": "555",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Shelly Provines",
                "href": "/profile/Shelly-Provines"
            },
            "answer_text": "Depending on how old you are and where in the world you are, various things could happen. Your parents may get a call, truancy officers may get involved, various things could happen. A2A ",
            "date": "Answered September 7, 2020",
            "views": "26",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Thomas Buzzi",
                "href": "/profile/Thomas-Buzzi-1"
            },
            "answer_text": "As you grow you experience other things in life than those inside a classroom. As your life progresses you witness many different things. You may or may not be comfortable at various times but much can always be done with what you have about you. It takes a lot of nerve to step off the beaten track and bang up against life on its own terms. Many say it was the making of them. I haven’t heard from those with the other type of experience. ",
            "date": "Answered March 19, 2020",
            "views": "18",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Charlotte Rahn",
                "href": "/profile/Charlotte-Rahn"
            },
            "answer_text": "You find out why they won’t go to school. Then you work on solving the issue whether that’s finding a different teacher or switching to a different type of learning. Ex. online school/homeschooling ",
            "date": "Answered May 2, 2019",
            "views": "27",
            "upvotes": " Answer requested by Thao Dao"
        },
        {
            "author_info": {
                "name": "Robert McAuley",
                "href": "/profile/Robert-McAuley-7"
            },
            "answer_text": "After grade 8 Nada…if you have parental or guardian approval. Before that they will send the cops or a truancy officer to take ya. Keep running and new school. ",
            "date": "Answered May 20, 2020",
            "views": "21",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Deb Waterhouse",
                "href": "/profile/Deb-Waterhouse-1"
            },
            "answer_text": "You do not specify whether its college or elementary/high school. Many get along just fine w/out college but your basics are important for socialization, reading writting, figuring things out. You miss your basic early education you stay ignorant and illiterate ",
            "date": "Answered November 23, 2019",
            "views": "25",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Bruce McQuillan",
                "href": "/profile/Bruce-McQuillan-1"
            },
            "answer_text": "If your poor they become heroin addicts and die. If you are rich they could become president of the United States so that people get to vote for rich men who are as stupid as they are. ",
            "date": "Answered April 23, 2020",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robelen Sayson",
                "href": "/profile/Robelen-Sayson"
            },
            "answer_text": "You'll not be more educated. Some companies will not accept our application if we have no degree. Going to school is needed in order to learn and get a job we want. ",
            "date": "Answered February 29, 2020",
            "views": "12",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Leon De Vynck",
                "href": "/profile/Leon-De-Vynck"
            },
            "answer_text": "In this day and age, not much. Even if you just learn something as a hobby from home you can still be successful. The school does help but it won’t do a lot for you in your future if you go to a conventional school. ",
            "date": "Answered February 13, 2020",
            "views": "9",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Teresa Montgomery-Shafer",
                "href": "/profile/Teresa-Montgomery-Shafer"
            },
            "answer_text": "Who is the parent? You have to find out why and fix it, but the kid doesn't get to decide that. In my state, if kids don't go, the parent is arrested. ",
            "date": "Answered April 18, 2020",
            "views": "80",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tamalia Alisjahbana",
                "href": "/profile/Tamalia-Alisjahbana"
            },
            "answer_text": "You are the adult. You make the decisions, not the child. It does not have the experience or the educational background to make that decision. You simply continue to take the child to school every day until it gets used to the idea and accepts it. ",
            "date": "Answered April 29, 2019",
            "views": "58",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Vernon Huffman",
                "href": "/profile/Vernon-Huffman-2"
            },
            "answer_text": "Well…if you spent the same amount of time assiduously studying in the public library and you somehow maintained a healthy peer network, you’d probably be better off. If, on the other hand, you spent the time smoking and drinking with juvenile delinquents, your life might take a turn for the worse. ",
            "date": "Answered November 29, 2019",
            "views": "24",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Guy C Kaldis",
                "href": "/profile/Guy-C-Kaldis"
            },
            "answer_text": "Do you have any creative talents? If not you had best go to school as the world economy is in crisis now and will continue to favor those with a good education. ",
            "date": "Answered April 7, 2020",
            "views": "17",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Barbara Bess",
                "href": "/profile/Barbara-Bess"
            },
            "answer_text": "That is entirely up to you! If you are talking about high school, that is one thing. You are truant. If you elect not to go to college, then your life is your own. ",
            "date": "Answered August 17, 2020",
            "views": "72",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Niharika Sharma",
                "href": "/profile/Niharika-Sharma-623"
            },
            "answer_text": "You tell me. Well if you are a minor it is a bit different, you kind of have to do waht your parents say. Whereas if you are an adult you can choose your own path. You get to decide your future and what you want to do regardless of what your parents say. ",
            "date": "Answered July 2, 2020",
            "views": "18",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Devona Dockery",
                "href": "/profile/Devona-Dockery"
            },
            "answer_text": "In most cases, in the US, you have to be at least 16 to quit school. So if you are under 16, your parents will take the blame and go to court to answer the charges. ",
            "date": "Answered October 2, 2020",
            "views": "9",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Katy Morgan",
                "href": "/profile/Katy-Morgan-46"
            },
            "answer_text": "You become a better person because you are forced to think for yourself and develop your own opinions. ",
            "date": "Answered October 14, 2019",
            "views": "10",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Jayna Kuklin",
                "href": "/profile/Jayna-Kuklin-1"
            },
            "answer_text": "If you don’t go to school you’ll be marked absent. If you miss more than one day of school purposely then you will be marked as truant. ",
            "date": "Answered October 13, 2019",
            "views": "24",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Shafiq Ur Rehman",
                "href": "/profile/Shafiq-Ur-Rehman-120"
            },
            "answer_text": "Early school leaving represents a loss of potential that has effects on both social and economic scale (reduced social cohesion, lower financial incomes, increase of social allocations) ",
            "date": "Answered August 13, 2020",
            "views": "15",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Vamshi",
                "href": "/profile/Vamshi-50"
            },
            "answer_text": "1.You become uneducated. 2.You can’t get money without education. 3.Ask them who don’t have education they will say the importance and value of education ",
            "date": "Answered May 24, 2017",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jill Thompson Edwards",
                "href": "/profile/Jill-Thompson-Edwards"
            },
            "answer_text": "Back when I was a principal, one of my duties was Truant Officer. Talk about a time consuming assignment!! However, it didn't take long to have all that paper work fine tuned. It always was disheartening to hear parents and students lie, cry, and beg the judge. Of course, I had a thick file with copies of EVERY thing I had sent to them. Yes, there were their signatures on these papers. One parent made ever excuse imaginable for little Johnny; I have been told Johnny is now incarcerated. ",
            "date": "Answered March 15, 2019",
            "views": "233",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roddy Heading",
                "href": "/profile/Roddy-Heading"
            },
            "answer_text": "Legally, it varies according to where you live and how old you are. To your own life, If you don't self direct and keep learning on your own you’ll likely drift into sloth and slip into vice,, even as a kid ",
            "date": "Answered October 5, 2020",
            "views": "9",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "John Cox",
                "href": "/profile/John-Cox-417"
            },
            "answer_text": "If you don’t go to school, you won’t learn anything. However, life IS a school! We learn everyday even if we don’t want to. . . . ",
            "date": "Answered March 9, 2020",
            "views": "8",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Lejie Zheng",
                "href": "/profile/Lejie-Zheng"
            },
            "answer_text": "there should be someone contact you or your parents,ask about the reasons for absenteeism, and ask about when u could be back to school on a regular basis. ",
            "date": "Answered August 10, 2020",
            "views": "28",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Abeiku Larry",
                "href": "/profile/Abeiku-Larry"
            },
            "answer_text": "Wayward children all over ",
            "date": "Answered March 15, 2018",
            "views": "315",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Gamini De Silva",
                "href": "/profile/Gamini-De-Silva-2"
            },
            "answer_text": "Nothing will happen physically or mentally but you will have no basic qualification to apply for a job unless you study at home and be qualified. ",
            "date": "Answered October 2, 2020",
            "views": "4",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Tiya Mahor",
                "href": "/profile/Tiya-Mahor"
            },
            "answer_text": "You will lose ur impratant time and notes.. Because teacher always teach u and they always try that u will learn more and more if u will not go to school u will lose ur success.... ",
            "date": "Answered December 22, 2017",
            "views": "126",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Donnelly",
                "href": "/profile/Robert-Donnelly-71"
            },
            "answer_text": "Then you probably will know less than if you went to school, and it will be much harder for you to get a job. ",
            "date": "Answered August 13, 2020",
            "views": "6",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Logan Casey",
                "href": "/profile/Logan-Casey-4"
            },
            "answer_text": "Given the current state of our public “education” system, you might end up smarter than those who do go and are being indoctrinated. ",
            "date": "Answered August 25, 2020",
            "views": "17",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Simon Tse",
                "href": "/profile/Simon-Tse-9"
            },
            "answer_text": "That depends on the laws of our country but it’s really not that important If u don’t go to school when u r loaded. 🙄 ",
            "date": "Answered August 13, 2020",
            "views": "21",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "NATHAN BURNS-SPRUNG",
                "href": "/profile/NATHAN-BURNS-SPRUNG"
            },
            "answer_text": "If we don’t go to school, we have all day to be awesome! We can beat all our video games, clean our room, and get in fights and stuff. ",
            "date": "Answered May 24, 2017",
            "views": "77",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Susan joe",
                "href": "/profile/Susan-joe-12"
            },
            "answer_text": "What level? If you are talking about grade school if you are turned in to the authorities you must be home schooling. But, if you flat dont do any school then charges can result. ",
            "date": "Answered May 7, 2020",
            "views": "160",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Michael Craven",
                "href": "/profile/Michael-Craven-14"
            },
            "answer_text": "you don’t get educated you don’t make all the friends that you could potentially make you limit your future employment opportunities you limit your future social possibilities ",
            "date": "Answered October 3, 2020",
            "views": "7",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Catherine Miller",
                "href": "/profile/Catherine-Miller-165"
            },
            "answer_text": "It depends! For how long are you not going to school for? What are you doing instead? What are your goals? ",
            "date": "Answered August 18, 2020",
            "views": "6",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Narinderpal Sood",
                "href": "/profile/Narinderpal-Sood"
            },
            "answer_text": "A lot of possibilities. You could join the ranks of famous entrepreneurs, you could be a famous scientist, or you could be living under a bridge. ",
            "date": "Answered August 11, 2020",
            "views": "5",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Tyler Zimmerman",
                "href": "/profile/Tyler-Zimmerman-12"
            },
            "answer_text": "In the US you would probably be eventually detained and made to go to a juvenile prison for truancy. ",
            "date": "Answered August 13, 2020",
            "views": "8",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Ruth Watin",
                "href": "/profile/Ruth-Watin"
            },
            "answer_text": "Well, you can still live. Just be crafty. Anyway, you need no A’s in fishing. But, if you want to go a long long way you must at least learn how to read and write, and count your money. Be contented and be satisfied with what you have. ",
            "date": "Answered January 28, 2020",
            "views": "9",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Lillian Taylor",
                "href": "/profile/Lillian-Taylor-4"
            },
            "answer_text": "They would most likely be very poorly prepared to go out to make a good living I society as it is today. Also, he would not have developed many social skills to work and play with others. Many talents that he has will most likely not be developed. Nor in any way would he be capable to communicate or work in this age of technology. ",
            "date": "Answered July 15, 2018",
            "views": "499",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Elizabeth Cavenagh",
                "href": "/profile/Elizabeth-Cavenagh"
            },
            "answer_text": "You will become less educated and you may or may not lose out on the opportunities for better paying jobs. ",
            "date": "Answered December 6, 2019",
            "views": "23",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Jacky Ibrahim",
                "href": "/profile/Jacky-Ibrahim"
            },
            "answer_text": "If you don’t attend school due to the pandemic then you will have to continue with online learning. ",
            "date": "Answered August 15, 2020",
            "views": "17",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Donna Passman",
                "href": "/profile/Donna-Passman"
            },
            "answer_text": "Ever? It will be difficult to get a job without a HS diploma or GED certificate. You do not have to go to college to succeed. Your success depends on many more variables than a degree. ",
            "date": "Answered May 7, 2020",
            "views": "77",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Unready Drake",
                "href": "/profile/Unready-Drake"
            },
            "answer_text": "low wages - dead end jobs and no real guidance to become a leader - however - if you are one of the lucky drop outs this may be your calling - wouldnt suggest it ",
            "date": "Answered December 24, 2017",
            "views": "297",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steven Ussery",
                "href": "/profile/Steven-Ussery"
            },
            "answer_text": "See the following chart from the U.S. Bureau of Labor Statistics for a good reason for why you should go to school — and the more the better:  ",
            "date": "Answered March 2, 2020",
            "views": "31",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Michael Stewart",
                "href": "/profile/Michael-Stewart-285"
            },
            "answer_text": "You will grow up to be a great big dummy. Everyone who went to school would be able to take advantage of you Good luck and God bless - MS ",
            "date": "Answered September 25, 2019",
            "views": "17",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Patricia Ross",
                "href": "/profile/Patricia-Ross-43"
            },
            "answer_text": "I recommend a High School diploma at the minimum. Higher education will open more doors for you, but most jobs require a HS diploma at the very minimum. What path you choose beyond that is totally up to you. ",
            "date": "Answered May 25, 2020",
            "views": "91",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "John Hudson",
                "href": "/profile/John-Hudson-217"
            },
            "answer_text": "You remain stupid, non or under employable, exist at the bottom of life’s ladder and achieve nothing. Daniel, “EDUCATION” is this life’s key to success in every direction. ",
            "date": "Answered November 16, 2019",
            "views": "24",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Liliana Harnett",
                "href": "/profile/Liliana-Harnett"
            },
            "answer_text": "If your under age then I think you’re kinda forced to go to school. But I don't know once your older 18 ",
            "date": "Answered July 4, 2020",
            "views": "7",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Vedina Runghen",
                "href": "/profile/Vedina-Runghen"
            },
            "answer_text": "You may lack skill and education , or you can home school and do subjects that you are interested in . ",
            "date": "Answered December 22, 2017",
            "views": "309",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carl McKissack",
                "href": "/profile/Carl-McKissack"
            },
            "answer_text": "Depends on the level - colleges don’t believe in truant officers. If you mean what happens to you . . . well, I think you can figure that one out. ",
            "date": "Answered December 9, 2019",
            "views": "16",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Royanne Boyer",
                "href": "/profile/Royanne-Boyer"
            },
            "answer_text": "The School Sheriff finds you and takes you handcuffed to the Principal’s office, where he/she gets out her big paddle! OMG! ",
            "date": "Answered March 2, 2020",
            "views": "12",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Mark McKee",
                "href": "/profile/Mark-McKee-40"
            },
            "answer_text": "You will forever remain the ill informed joker that you are right now…and no one will really care. ",
            "date": "Answered December 7, 2019",
            "views": "22",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Ankita Kadkol",
                "href": "/profile/Ankita-Kadkol"
            },
            "answer_text": "Then there might not be interaction with people and no enjoyment n no exam fear n teachers love n scoldings and much more ",
            "date": "Answered July 11, 2018",
            "views": "68",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Noelle Franklyn",
                "href": "/profile/Noelle-Franklyn"
            },
            "answer_text": "As compared to what? Homeschooling, unschooling? Working? Fending for yourself on the streets or in a refugee camp? Being raised by apes or wolves? I need more information. ",
            "date": "Answered October 23, 2019",
            "views": "25",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Supriya Ch",
                "href": "/profile/Supriya-Ch-6"
            },
            "answer_text": "I don't go to school I will be left as a illiterate ",
            "date": "Answered December 22, 2017",
            "views": "120",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Diaa Elsayed",
                "href": "/profile/Diaa-Elsayed"
            },
            "answer_text": "Unless you have a 1 million dollar idea then you will end at a low paid job. ",
            "date": "Answered December 21, 2019",
            "views": "14",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Calvin Welch",
                "href": "/profile/Calvin-Welch-1"
            },
            "answer_text": "You bmay have to work alot of hours idk DNT quit on yourself ever ",
            "date": "Answered October 16, 2019",
            "views": "9",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Lauren Bellafiore",
                "href": "/profile/Lauren-Bellafiore"
            },
            "answer_text": "They would benefit from one-on-one Tutoring. Check out website http://msbelementaytutoring.com Call Or text 1.631.258.7134.  ",
            "date": "Answered January 21, 2018",
            "views": "390",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Levitt",
                "href": "/profile/Robert-Levitt"
            },
            "answer_text": "You fail to develop further and become a poster child for failure. ",
            "date": "Answered December 17, 2019",
            "views": "20",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Sol A. Koppel",
                "href": "/profile/Sol-A-Koppel"
            },
            "answer_text": "YOU EXTREMELY REDUCE YOUR LIFES OPPORTUNITIES FOR GAINING ANY POSSIBLE BENEFITS THAT MAY BE OFFERED FOR A SUCCESSFUL, REWARDING AND HAPPY LIVING EXPERIENCE. ",
            "date": "Answered November 19, 2019",
            "views": "22",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Bonnie Sinclair",
                "href": "/profile/Bonnie-Sinclair-3"
            },
            "answer_text": "This is a pretty good bet.  ",
            "date": "Answered September 11, 2019",
            "views": "81",
            "upvotes": " Answer requested by Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Ken Heskin",
                "href": "/profile/Ken-Heskin"
            },
            "answer_text": "What is the question? Why does Quora allow nonsense like this and invite people to respond? ",
            "date": "Answered July 11, 2018",
            "views": "79",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Edwin Radcliffe",
                "href": "/profile/David-Edwin-Radcliffe"
            },
            "answer_text": "In the U.K. the parents will be prosecuted. ",
            "date": "Answered April 19, 2020",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "RJ Pavan",
                "href": "/profile/RJ-Pavan"
            },
            "answer_text": "Well, you won't know what 5+5 is. ",
            "date": "Answered December 22, 2017",
            "views": "221",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christine Tafoya",
                "href": "/profile/Christine-Tafoya"
            },
            "answer_text": "Possibly a million good things without all the debt. ",
            "date": "Answered December 22, 2017",
            "views": "247",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gopinath V",
                "href": "/profile/Gopinath-V-80"
            },
            "answer_text": "find out the reason..and make them go to school with joy ",
            "date": "Answered July 11, 2018",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Spencer",
                "href": "/profile/Chris-Spencer-120"
            },
            "answer_text": "They would only ever learn what their parents already knew. ",
            "date": "Answered July 11, 2018",
            "views": "98",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kaelyn Gwen",
                "href": "/profile/Kaelyn-Gwen"
            },
            "answer_text": "You work at McDonalds ",
            "date": "Answered December 22, 2017",
            "views": "111",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Greene",
                "href": "/profile/Jim-Greene-12"
            },
            "answer_text": "You die. ",
            "date": "Answered October 27, 2019",
            "views": "13",
            "upvotes": " Answer requested by Daniel Spencer"
        }
    ]
}