{
    "title": "What will be the year of passing after receiving CBSE improvement? - Quora",
    "tags": [
        "Higher Education in India",
        "Central Board of Secondary Education, India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mainak Banerjee",
                "href": "/profile/Mainak-Banerjee-13"
            },
            "answer_text": "CBSE improvement exam is conducted every year exactly a year after passing the board exams when the regular board exams are conducted, though you are allowed to appear for improvement exam two consecutive years after appearing for the first board exams. You can opt for one or more papers you appeared for the first time but you cannot add papers to the subjects you opted for the first time. Passing in all the subjects opted is compulsory to be eligible for improvement exam. It is applicable for both 10th and 12th. Students of other boards cannot apply for this improvement exam. A fresh marks sheet, with the revised marks, will be issued on clearing the exam. The words ‘APPEARED FOR IMPROVEMENT’ are mentioned on the fresh mark sheet. This is a case with two probable outcomes: You get more marks in improvement exam than the previous year.You score lesser marks in improvement exam than the previous year.Case 1: If the marks obtained is more in the improvement exam then you’ll always have to carry two admit cards and two mark sheet to show the same. As of the marks, you can showcase the marks of the subjects which is better of the two. If obtained marks in all subjects have improved in the improvement exam then the candidate need not combine the marks sheet. If you are using the marks of the improvement exam then the year of passing will the year you appeared for in the improvement exam. If you are appearing in improvement exam for JEE purpose, then it is compulsory to appear in all the subjects opted for the first time. Moreover, you can use only one mark sheet not the best of two scheme. Case 2: For you life is simple, you need not use or showcase any of the documents related to the improvement exam, think as if you never appeared for it. Your year of passing will be up to you if you show the marks sheet of improvement exam then that will be the year of passing else previous year. (How cool is this!) Here’s the link for the official CBSE site for further details Central Board of Secondary Education Hope it was helpful. ",
            "date": "Answered September 27, 2018",
            "views": "69",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sayak Gupta",
                    "user_href": "/profile/Sayak-Gupta-10"
                },
                {
                    "user_id": "Jayant Kumar Rautray",
                    "user_href": "/profile/Jayant-Kumar-Rautray"
                },
                {
                    "user_id": "Prem Kumar",
                    "user_href": "/profile/Prem-Kumar-13029"
                },
                {
                    "user_id": "Rishabh Bhatnagar",
                    "user_href": "/profile/Rishabh-Bhatnagar-30"
                },
                {
                    "user_id": "Aswin Thomas",
                    "user_href": "/profile/Aswin-Thomas-38"
                },
                {
                    "user_id": "Prem Nath Chaturvedi",
                    "user_href": "/profile/Prem-Nath-Chaturvedi"
                },
                {
                    "user_id": "Zen Fer",
                    "user_href": "/profile/Zen-Fer"
                },
                {
                    "user_id": "Tina Nongthombam",
                    "user_href": "/profile/Tina-Nongthombam"
                },
                {
                    "user_id": "Shubham Garhewal",
                    "user_href": "/profile/शुभम-गढ़ेवाल-Shubham-Garhewal"
                },
                {
                    "user_id": "Anand Srivastava",
                    "user_href": "/profile/Anand-Srivastava-207"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prithviraj Kashyap",
                "href": "/profile/Prithviraj-Kashyap"
            },
            "answer_text": "after improvement, you need to give the year where you gave your improvement exam. but in iit, you get option for applying with either your improvement marks OR original marks depending in the year of passing and roll no. you give. i.e. if you chose previous year, and add previous year roll no, it will be valid, same with improvement... however previous year and current year roll no isnt valid.......... now for the percentage criteria after improvement: > you will get a fresh mark sheet with your current marks in improvement.> if all your marks are more than your previous year marks, you will only need your improvement mark sheet.> but if even one of your marks previous year is more than your improvement marks, you will have to hang around with both your marks sheets all your life.> the percentage is made after rearranging the marks of each subject of your previous year and improvement year, whichever is better...... NOTE: this thing doesnt work during job placements. they only consider one of the two mark sheets (same as jee), though improvement marksheet is as valid as the original. hope this helped ",
            "date": "Answered April 2, 2015",
            "views": "214",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manjeet Kumar",
                    "user_href": "/profile/Manjeet-Kumar-1691"
                },
                {
                    "user_id": "Prakhar Srivastava",
                    "user_href": "/profile/Prakhar-Srivastava-220"
                },
                {
                    "user_id": "Prem Nath Chaturvedi",
                    "user_href": "/profile/Prem-Nath-Chaturvedi"
                },
                {
                    "user_id": "Atharva Tiwari",
                    "user_href": "/profile/Atharva-Tiwari-3"
                },
                {
                    "user_id": "Tina Nongthombam",
                    "user_href": "/profile/Tina-Nongthombam"
                },
                {
                    "user_id": "Sonam Kumari",
                    "user_href": "/profile/Sonam-Kumari-508"
                },
                {
                    "user_id": "Utkarsh Kumar",
                    "user_href": "/profile/Utkarsh-Kumar-128"
                },
                {
                    "user_id": "Silent Spring",
                    "user_href": "/profile/Silent-Spring"
                },
                {
                    "user_id": "Ayushi",
                    "user_href": "/profile/Ayushi-385"
                },
                {
                    "user_id": "Siddhant Kesharwani",
                    "user_href": "/profile/Siddhant-Kesharwani-1"
                }
            ]
        }
    ]
}