{
    "title": "What’s the top ten university in England that a local recommended? - Quora",
    "tags": [
        "Colleges and Universities in the United Kingdom",
        "England"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Makin",
                "href": "/profile/Peter-Makin-7"
            },
            "answer_text": "It completely depends on which subject you wish to pursue and whether you are looking at an undergraduate degree, a postgraduate degree, a research position, a teaching position, or an admin position. In general the universities that score best in QS rankings are those with the greatest research power. For an undergraduate degree, you’ll (generally) get less one on one time with academics. As a researcher, though, these are the places you want to be. Furthermore, if the subject you want to pursue (as an undergraduate) is more vocational, the best courses are not at the “best” universities, but instead the old polytechnics which became universities. If you’re looking to become an undergraduate, look at the NSS (National Student Survey) results for universities, and also their QS rating, and find a trade-off between the prestige of the university and the quality of its teaching. ",
            "date": "Answered January 10, 2020",
            "views": "91",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Gordon",
                    "user_href": "/profile/John-Gordon-43"
                },
                {
                    "user_id": "Tery Kenny",
                    "user_href": "/profile/Tery-Kenny"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Harrison",
                "href": "/profile/Paul-Harrison-69"
            },
            "answer_text": "Look at Russell Group and subtract the Scots. Now someone asked this before and Quora collapsed me, so I’m going to risk and repeat without names. I joked last time that I———l C——e was asked along to take the minutes only , as I went to what they aspire to have as their rivals UCL. ",
            "date": "Answered January 14, 2020",
            "views": "55",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Steph Waite",
                    "user_href": "/profile/Steph-Waite-3"
                }
            ]
        }
    ]
}