{
    "title": "What does the UK teach about the US in school? - Quora",
    "tags": [
        "Education in the United Kingdom",
        "Teaching in Schools",
        "Colleges and Universities in the United Kingdom",
        "United States-United Kingdom Relations",
        "Teaching",
        "Schools",
        "The United Kingdom",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Birch",
                "href": "/profile/John-Birch-33"
            },
            "answer_text": "I did some supply teaching in a range of primary and secondary schools about 5 years ago and the main things that where the USA is taught about in English schools are: Slavery - the slave trade is covered, though from a British point of viewCivil Rights - “Black History Month” in the UK covered in most schools and that is almost entirely about civil rights in the USA, up to the 1960s (roughly). So children learn how horrible the south was, and about bus boycotts and lynchings and so on.Geomorphology - studies of volcanoes often include Mount St Helens, and plate tectonics will include mention of the Hawaiian Islands and west coast earthquakes.History - almost nothing apart from the USA taking part in WW2. They get a mention in WW1 as well. Its possible that the Space Race will be covered, and for a minority of children the Cold War.And that is it. So what little is taught about the USA in schools stops in about 1960 and portrays the USA as a land of racial unrest and earthquakes. ",
            "date": "Answered August 26, 2020",
            "views": "72",
            "upvotes": " Answer requested by Joshua Bumpus",
            "upvoters": [
                {
                    "user_id": "Gill Bullen",
                    "user_href": "/profile/Gill-Bullen"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Gordon",
                "href": "/profile/John-Gordon-43"
            },
            "answer_text": "What does the UK teach about the US in school? Usually not very much. It so happened that for History O level (taken at age 15–16) we did British History, 1688–1920 (and also European History from 1648–1920). In the British History part we learned about the American Revolution in some detail. (As far as I know, the (high) school could have chosen an earlier period, in which case we would probably have learned less about American history). Apart from that we were expected to ‘pick up’ information on the U.S. (Do not underrate the extent to which schoolkids of my generation were expected to ‘pick up’ information). I ought to add that I was at school from 1950–63, and there have been all kinds of changes since then. ",
            "date": "Answered April 19, 2020",
            "views": "397",
            "upvotes": " View 1 Upvoter "
        }
    ]
}