{
    "title": "What is the best thing to do before bed? - Quora",
    "tags": [
        "Sleep Habits",
        "Sleep",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shannon Dingman",
                "href": "/profile/Shannon-Dingman"
            },
            "answer_text": "1. Brush Your Teeth AND FLOSS Flossing maybe adds like 1 extra minute onto this and makes you instantly feel accomplished and like you went above and beyond.2.Drink at least 8 oz of waterThis is supposedly really good for our body and health. Plus you won't wake up thirsty in the night stumbling to the bathroom for water.3. StretchTake a few minutes, even a few seconds if nothing else to get some nice stretches in before laying stiff all night. I've heard stretching before bed may be the most productive for flexibility since then your muscles are at rest (post stretch)4. Change into clothes designated for sleepingI don't mean go buy a pajama set at the store. I just mean have a few clothes that are clearly your wind-down clothes or bedtime clothes... that you will then change out of when you wake up too. It helps the transition and can add a refresh to your body. Plus then you won't be dragging unwanted dirt and grime into the sheets with you.5. Pray.. or ReflectI once read this idea of how to teach kids to pray, but its stuck with me....For every finger on your hand, it symbolizes someone/group to pray for, instead of staying to stuck on yourself and your life. This was the breakdown:-The thumb is the closest finger to you. Pray for those who are close to you. Our parents, siblings, extended family and friends.-The pointer finger is next. Pray for those who teach you, instruct you and heal you. They need our prayers to help them help others.-The following finger is the tallest. Pray for our leaders and others in authority. Pray that God grant them guidance. For children, this may be their parents, too!-The fourth finger is the ring finger. It is the weakest finger. Pray for the weakest among you. The hurt, the lonely, the sick. Remember what Jesus said about “the least of these”? This is where you honor Him by praying for them.-And finally we have our smallest finger, the smallest of all. Your pinkie should remind you to pray for yourself. We gain perspective about our own needs when we put others first. That’s why we should pray for ourselves last.*Taken from :http://motheringfromscratch.com/2013/09/11/teaching-children-to-pray-the-five-finger-prayer/ ",
            "date": "Updated January 22, 2015",
            "views": "28",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erik Allen",
                    "user_href": "/profile/Erik-Allen-5"
                },
                {
                    "user_id": "Rupert",
                    "user_href": "/profile/Rupert-22"
                },
                {
                    "user_id": "Kelly Antinori",
                    "user_href": "/profile/Kelly-Antinori"
                },
                {
                    "user_id": "Matt Harrison",
                    "user_href": "/profile/Matt-Harrison-62"
                },
                {
                    "user_id": "Satyam Goyal",
                    "user_href": "/profile/Satyam-Goyal-13"
                },
                {
                    "user_id": "Vivekh",
                    "user_href": "/profile/Vivekh-2"
                },
                {
                    "user_id": "Ricardo Aranda",
                    "user_href": "/profile/Ricardo-Aranda-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Dnfh"
                },
                {
                    "user_id": "Nishant Nikhil",
                    "user_href": "/profile/Nishant-Nikhil"
                },
                {
                    "user_id": "Anatoliy Mas",
                    "user_href": "/profile/Anatoliy-Mas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pushyamithra Panakanti",
                "href": "/profile/Pushyamithra-Panakanti"
            },
            "answer_text": "Before sleeping just  recall how you felt today , if you are true to yourself you will find there  could be some moment in the day where you  did not feel  right or happy . It could be a small feeling that  you did not recognize in the busy flow of day . Revisit it and ask yourself why did  you feel the way you did and how you could change the situation or a better thing to do in the same situation.  This does  few things:Improves your memory because you are trying to recollect your day secondly , it is important to recollect how you felt ..which will bring you closer to yourself in understanding Thirdly , You are thinking about proactively how to react next time you are in the same situation before hand  that means adding happiness to life  Overtime this adds up making you feel much better about yourself and life. Also call your parents or loved ones if away  and talk to them before going to sleep. you will be happy you did it ",
            "date": "Updated July 21, 2015",
            "views": "14",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nicholas DeJong",
                    "user_href": "/profile/Nicholas-DeJong-2"
                },
                {
                    "user_id": "Emran Habib",
                    "user_href": "/profile/Emran-Habib"
                },
                {
                    "user_id": "Olivia Nelson",
                    "user_href": "/profile/Olivia-Nelson-33"
                },
                {
                    "user_id": "Sandeep",
                    "user_href": "/profile/Sandeep-561"
                },
                {
                    "user_id": "Yuki Fan",
                    "user_href": "/profile/Yuki-Fan"
                },
                {
                    "user_id": "Ankush Saxena",
                    "user_href": "/profile/Ankush-Saxena-38"
                }
            ]
        }
    ]
}