{
    "title": "What is the difference between ethnography and social anthropology? - Quora",
    "tags": [
        "Social Antropology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ola Gunhildrud Berta",
                "href": "/profile/Ola-Gunhildrud-Berta"
            },
            "answer_text": "As Wikipedia will have it, ethnography is ‘the systematic study of peoples and cultures’. The word derives from the Greek ethnos (folk, people, nation) and grapho (I write). Commonly, then, ethnography is a written account of cultural life, but one can also present ethnography in other media (e.g. an ethnographic film). Anthropologists commonly distinguish between two different kinds of meanings of the word: 1) an ethnographic account (text, film, sound), and 2) an ethnographic approach (a method that aims at documenting lived life). With this in mind, it’s difficult to imagine a discipline like social anthropology without ethnography. In many ways, ethnography is the baseline for both an anthropological text (or other presentations) and the anthropological fieldwork method. However, social anthropology is much more than mere ethnography. While practitioners disagree and quarrel over where ethnography stops and social anthropology starts, I’d say that ethnography is mainly descriptive, while social (and cultural) anthropology also entails specific analytical tools and theoretical perspectives. To my mind, that is the major difference between the ethnographic accounts of missionaries, travelers, and colonial administrators and an anthropological monograph written by a trained social anthropologist. Whereas the latter contains sociological analyses, reflexivity, comparison, holism, (methodological!) cultural relativism, and interpretation, the former seldom does. ‘Interpretation’ is a key term here, because it allows the anthropologist to go beyond mere words and verbal statements about behaviour. Instead, the anthropologist will keep a keen attention to how such statements conflict, exaggerate, or overlap with actual behaviour, as well as placing that interplay in a wider, cultural context. In sum, I’d say that ethnography is a descriptive account of lived life, while social anthropology is an analysed account of lived life. There’s much more to be said about the difference and interplay between ethnography and social anthropology, but I think this captures the gist of it. ",
            "date": "Answered September 9, 2017",
            "views": "935",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gaia Tan",
                    "user_href": "/profile/Gaia-Tan-1"
                },
                {
                    "user_id": "Odd Eivind",
                    "user_href": "/profile/Odd-Eivind"
                },
                {
                    "user_id": "Annisa Rahmadani",
                    "user_href": "/profile/Annisa-Rahmadani"
                },
                {
                    "user_id": "Audun Bie",
                    "user_href": "/profile/Audun-Bie"
                },
                {
                    "user_id": "Patch Hart",
                    "user_href": "/profile/Patch-Hart"
                }
            ]
        }
    ]
}