{
    "title": "What can make me know my fate? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Sabri Shahin",
                "href": "/profile/Sabri-Shahin"
            },
            "answer_text": "God has empowered each of us to be happy and blessed. God has enabled people to choose their own destinations. God does not predetermine plans for us. God has delegated that task to us, it is up to us to be blessed or to be cursed. The message that God has revealed to all prophets is: ‘Blessings for obedience and curses for disobedience’ All prophets taught that we can earn salvation by obedience, repentance, and good deeds to help others. “In obedience and repentance is your salvation” Isaiah 30:15 Based on the above, the obedient believer should be blessed in this life and should be saved in the afterlife. That is the truth which should set you free. Prophets did not teach predestination. Jesus did not teach predestination or predetermination. The only exceptions are the teachings of Paul who was not educated by Jesus and who taught the distorted teachings of predestination, original sin, atonement, and salvation by grace without obedience to God’s law. The teachings of predestination were taught by Paul in Romans 8 , Ephesians 1, and 1 Corinthians 2:7 The distorted teachings of predestination and election of Augustine and Calvin are not based on the teachings of Jesus but are based on the wrong teachings of Paul. Jesus did not teach that a man is justified according to God’s plan or by faith without the deeds of the law; In Matthew 16:27 and John 5:29, Jesus has confirmed that God will reward each person according to his deeds; those are the basic teachings of the old testimony like the verses taught in Psalm 62:12, Ecclesiastes 12:14, and many other old testimony verses. Bad scholars do not teach the true teachings like Matthew 10:8 ‘Freely you have received; freely give’; they teach that it is o.k. to reap the financial gifts in exchange of the spiritual gifts and teach the attractive ones ‘And those he predestined, he also called; those he called, he also justified; those he justified, he also glorified’ Romans 8:30 They try to make people feel happy by such attractive teachings in order to receive more donations. “If we have sown spiritual seed among you, is it too much if we reap a material harvest from you?” 1 Corinthians 9:11. Most Christians do not follow the strict teachings like If your eye causes you to stumble, pluck it out and throw it away which is taught by Jesus in Matthew 18:9, Matthew 5:29 and Mark 9:47, but they prefer the attractive teachings of Paul like: ‘God has chosen us before the foundations of the world’ - Ephesians 1:4 ‘God hath from the beginning chosen you to salvation’ - 2 Thessalonians 2:13 ‘For God hath not appointed us to wrath, but to obtain salvation’ - 1 Thessalonians 5:9 ‘But let me reveal to you a wonderful secret. We will not all die, but we will all be transformed!’ 1 Corinthians 15:51 ‘God has saved us and called us’ - 2 Timothy 1:9 ‘we have been justified through faith’ - Romans 5:1, Romans 5:9 Most Christians do not follow the strict teachings which urge us to obey God as taught by Jesus in Matthew 22:35-40, Luke 10:25-28, Mark 12:28-34, but they prefer the attractive teachings of Paul like: ‘We are saved by grace through faith apart from works’ - Ephesians 2:8-9 ‘Even when we were dead in sins, we are saved by grace’ - Ephesians 2:5 ‘A man is justified by faith apart from the deeds of the law’ - Romans 3:28 ‘A man is not justified by the works of the law, but by faith’ - Galatians 2:16 ‘For all who rely on the works of the law are under a curse’ - Galatians 3:10 Most Christians believe that Jesus death was necessary for the forgiveness of sins. But Jesus, like all other prophets, taught that we can earn salvation by obedience, repentance, and good deeds to help others. No sacrifice is necessary for salvation. No bloodshed is necessary for salvation. No savior should die for the salvation of others; everyone is responsible for his own salvation. Jesus has confirmed the same in Matthew 18:21-35, 6:14-15, Mark 11:25-26, Matthew 25:31-45, Luke 15:11-32 , and Luke 6:36-37 https://www.quora.com/What-can-you-say-and-feel-about-Jesus-Christ-and-his-atonement/answer/Sabri-Shahin The wrong teachings about predestination, original sin, atonement, and salvation by grace without obedience to God’s law were taught by Paul who was not educated by Jesus. ",
            "date": "Answered February 6, 2019",
            "views": "584",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Heidi Paul",
                "href": "/profile/Heidi-Paul-3"
            },
            "answer_text": "No no .. dont get involved with that stuff and nonsense. Anyway, WHY would you want to know that?? I certainly wouldnt want to know that kind of information…especially if i was ill prepared to deal with the truth. (Its a bit like the man who looks through a keyhole. He may see something horrendous!) And … Hearing such things dosnt necessarily come with umderstanding! (There is no context) Just always remember that seeking out such things is definately not a “game”. It is serious and very dangerous. To show you what I mean; I know of a certain lady from the United States who was touring one of the West African countries and in the tour they were taken to see a voodoo practitioner . It was innocent as far as the tourists were concerned and she tells that they thought nothing further when the person had finished with them. However, when they returned to the USA everything in her life turned topsy-turvey and she had success at nothing and victory in nothing and she had nothing but bad luck. Eventually she found out that actually that “person” had put a curse on her life!! She eventually had to go all the way back to Africa and have the curse removed!! The thing is that, firstly , according to the Bible, it is forbidden to consult spiritual mediums .. so that door is closed to you. The reason one shouldnt go into this kind of thing through such chanels is because those spirits are NOT from God. They are famliar spirits claiming to act and speak in the Name of and with the authority of God. They are “busy-body” spirits who make it their business to find out things about your present so that they can take you captive by “prophesying” lies over you which will entrap you. Let me tell you .. its FAR more important that you come into a true relationship with God through repenting of your sins (all men need to repent because all men are sinners by nature) because without being in Jesus Christ no man will see God! In fact, Jesus Himself told us “I am the way the truth and the life. No man cometh to the Father except through me!” When you have done this i can assure you that you will no longer need to know your “fate” because one who dies having repented of their sins and received Christ as their Lord and Saviour will be going to the Kingdom of God. So i beg you! Walk away from what isnt from God God LOVES you too much to lose you to a lie. (John 3:16-17/ROMANS 10:9-10/John :3-8) ",
            "date": "Answered February 19, 2018",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hyun Kim",
                    "user_href": "/profile/Hyun-Kim-230"
                },
                {
                    "user_id": "Monicah Makena",
                    "user_href": "/profile/Monicah-Makena"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dean Bell",
                "href": "/profile/Dean-Bell-16"
            },
            "answer_text": "Nobody knows the future, not even God. God can only have a calculated guess based on the fact that He/She has seen everything since time began. Nobody is destined to be rich or poor, a king or beggar, die young or old. Nothing is written. Everything that happens in the universe is a reaction to an action and each reaction is a precise mathematical formula and a universal law created by God in the beginning of time that never changes and God will never interfere with. You go out in the rain without an umbrella; you get wet. You put your hand in the fire; you get burned etc, etc, etc. For every masochist in the world there is a sadist ready to oblige, why would we need light if there was no darkness. In the beginning there was nothing and that nothing was an energy which called itself God who decided to experience something other than just being a single energy so reasoned that He/She had to be in more than one place at a time and thus decided to split Himself/Herself into an infinite number of pieces and each piece was a soul with the free will to be, think, say and do anything without the fear of being punished or the expectation of being rewarded. And so God was able to be everywhere at the same time and experience whatever each soul experienced anywhere, as some souls chose to be minerals, some chose to be vegetables and some chose to be animals. God did not want to miss anything; so He/She created creatures to cover every nook and cranny of the universe, air, land and sea as by giving us eyes to see what we see, noses to smell what we smell, tongues to taste what we taste, mouths to speak what we speak, ears to hear what we hear, hands to touch what we touch, feet to walk where we walk and feelings to feel what we feel to distinguish between hot and cold, love and fear. ",
            "date": "Answered February 6, 2019",
            "views": "568",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sivanantham Sivakolunthu",
                "href": "/profile/Sivanantham-Sivakolunthu"
            },
            "answer_text": "Hahaha….How can you check your fate?That is beyond your control and knowledge. You live your life what your fate directions. How you are born and why you are born ,you have no clear idea of it.Your destiny decides your life, You may be a positive thhinker,you may believe you can do every thing you like.But you fail in most things.Why.That is called fate or destiny. Your fate prevents your opportunities by chance. Most people face failures over failures. Why? Some people succeed in every thing very easily by chance.That is called destiny. So you can’t judge anyone who succceeded is a wise or brillient and who failed are fools. For an example of your fate, Take your life partner.Your destiny only decides your life partner is your gift or punishment. According to my knowledge, your whole life is your destiny. You brought every thing with you when you born is the truth. ",
            "date": "Answered October 24, 2020",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Macready",
                "href": "/profile/Stephen-Macready-1"
            },
            "answer_text": "The Bible says to use your own free will to choose between living forever in paradise on earth or death. Read John 3:16 —- 2 choices 2 consequences. Learning what the bible really teaches makes the choice a lot easier. Humans have a free will and a conscience. God wants humans to listen to him and obey him only if they really want to, and will do everything He can to help you choose the best life and future. Fate is not something that is unavoidable, it does not control your life. Actually fate is only the past, no one knows “fate” until it happens, but nothing was ever meant to be or supposed to happen. Your life is not predetermined or predestined by God or anyone else. The things you do, places you go and people you meet are your choice, fate is not real. Children are always taught to decide what they want to be when they grow up, but they have no idea other than their dreams or fantasies. Even when entering high school, college or at graduation people still don’t know because you may have an idea of the work you want to do but who you work for can not be planned with certainty. So the Bible holds the promise of the best future, want to know more? ",
            "date": "Answered February 10, 2019",
            "views": "394",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lee D Mugleston",
                "href": "/profile/Lee-D-Mugleston"
            },
            "answer_text": "When you decide on your life contact prior to incarnating your objectives for the coming life time are put into place along with the myriad of individual choices which produce parallel lives in other dimensions. Your fate or fates are determined at that stage before you are born into the linear physical material world. There is no chance or coincidence. All scenarios have been played out in the mind of God where past, present and future are all one in one eternal moment of time. ",
            "date": "Answered April 4, 2019",
            "views": "154",
            "upvotes": " Answer requested by Michelle Christian Jones",
            "upvoters": [
                {
                    "user_id": "Peninnah Muthoki",
                    "user_href": "/profile/Peninnah-Muthoki"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Pierce",
                "href": "/profile/Richard-Pierce-25"
            },
            "answer_text": "Haven't you ever heard of Oedipus? What about Voldemort? You are better off not knowing your fate. Whenever someone learns that their fate is bad, their attempts to avoid it actually cause it to come true. The other problem is how do you tell a real seer from a charlatan? If you are meant to know your fate, it will happen. If you have to seek out someone to tell you your fate, they are probably a fraud and will only steal your money. ",
            "date": "Answered February 19, 2018",
            "views": "149",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carl McKissack",
                "href": "/profile/Carl-McKissack"
            },
            "answer_text": "Time. It’s that simple and that complicated. Try living in the moment. Your fate will find you at the proper time. Just as it will with all of us. Me, I don’t want to know what the future will bring. Free will, and all that . . . . ",
            "date": "Answered July 9, 2020",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pat Trainor",
                "href": "/profile/Pat-Trainor"
            },
            "answer_text": "Fate is not your death. Fate is just your future, which will surely be as complex as your past has been. Besides, your fate is not yours to observe anyway, as it exists solely in the eyes of others, just like the legacy you will leave. You want to know your fate? Make it. ",
            "date": "Updated February 25, 2018",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Heinrich Richard",
                "href": "/profile/Heinrich-Richard-2"
            },
            "answer_text": "We determine out fate through the decisions we take in matters. Fate is what puts opportunities in front of us but our Destiny is ultimately determined by our decisions. For instance, if you go to a party and meet the perfect guy that was fate. But what you do about it is your destiny . ... We can either let fate lead us through life or we can shape our own destiny. ",
            "date": "Answered February 5, 2019",
            "views": "122",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hemendra Yadav",
                    "user_href": "/profile/Hemendra-Yadav-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chandra Mani Pokharel",
                "href": "/profile/Chandra-Mani-Pokharel"
            },
            "answer_text": "Dear Sir, its better if we ignore this question and only know the present , the moment that is happening now is more precious. If you even get it known but then also it cannot be controlled.(Ramayana) Thanks ",
            "date": "Answered July 20, 2019",
            "views": "60",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Lynne Miller",
                "href": "/profile/Lynne-Miller"
            },
            "answer_text": "I believe that there is no fate. We make our own future, by deciding what we want in life and working toward it. Thanks for asking! ",
            "date": "Answered February 27, 2018",
            "views": "102",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dan Ganaway",
                "href": "/profile/Dan-Ganaway"
            },
            "answer_text": "Believing in fate kills motivation in life. There is no fate. Only momentum. ",
            "date": "Answered February 19, 2018",
            "views": "85",
            "upvotes": "0"
        }
    ]
}