{
    "title": "What do teachers think about great students? - Quora",
    "tags": [
        "Teachers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Heyentah Holzman",
                "href": "/profile/Heyentah-Holzman-1"
            },
            "answer_text": "I suspect you have a definition of a “great” student. I will also bet it differs from mine. I have the highest respect for that kid who has poor grades, but keeps coming to school and keeps trying. Especially the ones who have dreams of doing great things in spite of the adversity. The kid who is disciplined and motivated and goes above and beyond because they enjoy learning and are anxious to peer-teach are also kids I respect. That mouthy little disruption who annoys everyone and seldom does work (but when the work is done, it is gold—well, maybe only gold colored, but still…)? Yep, I think that’s a great student too, because I know what fear is behind that big show, and still, when able to get work done, it’s clear learning is happening. The “great” students who learn easily, dash off beautiful work effortlessly, is a great teacher pleaser. Oh yeah, I love to have them in class, they are fun. But I have to work harder to make them struggle and sweat like the others, or I am doing them a serious disservice. Those kids who sail through school without a problem and do everything perfectly are the ones who have the hardest time in the real world and in college. Sure, some continue to sail, some do great things, but honestly, it’s the ones who fought for every grade who know how to persevere. So, my response is, in a nutshell, nearly every kid is a great student once you understand who that kid is. Those gifted breezers make me work the hardest to appropriately challenge them and give them the skills they need to scrap and fight and sweat. But I am grateful for the things all my great students teach me. ",
            "date": "Answered October 24, 2017",
            "views": "271",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arissarakorn Sritheerawichai",
                    "user_href": "/profile/Arissarakorn-Sritheerawichai"
                },
                {
                    "user_id": "Brindha Raj",
                    "user_href": "/profile/Brindha-Raj-6"
                },
                {
                    "user_id": "Mike Hennessy",
                    "user_href": "/profile/Mike-Hennessy-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "David de Alba",
                "href": "/profile/David-de-Alba"
            },
            "answer_text": "As a teacher, it is not all that uncommon to come across extraordinary students excelling in various fields. Since classes are usually set and paced for students with average skills and capabilities, I usually share more advanced teaching contents with gifted students, so that they do not get bored and some interesting things I’ve learned over the years can be spread to a younger generation. In summary, I get very excited to have great students in my classes for they refresh my love for teaching and usually make great contributions to their classmates. ",
            "date": "Answered October 24, 2017",
            "views": "66",
            "upvotes": "0"
        }
    ]
}