{
    "title": "When did schools ban religion? - Quora",
    "tags": [
        "Bans and Banning",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jim Wasserman",
                "href": "/profile/Jim-Wasserman"
            },
            "answer_text": "Assuming you mean public schools, religion is NOT banned. Students may quietly observe their religious practices, and most schools make reasonable accommodations. What IS prohibited in American public schools: religious demonstrations that cause inordinate disruption to other students or the administration of the school.religious practices that threaten the health, safety, or welfare of students.promotion of any particular religious view over another religion by any employee of the school.Of course, there is a lot of fuzzy gray area around the edges of each of these, so often litigation is involved. Usually the litigation involves the dominant religion of the school population imposing its religious views/practices on members of the minority religion. In my experience, I’ve also found that the fight usually becomes between screaming adults, while the students tend to display more of a “live and let live” attitude. Be well. ",
            "date": "Answered February 5, 2020",
            "views": "59",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gregory Dill",
                    "user_href": "/profile/Gregory-Dill-3"
                },
                {
                    "user_id": "Andrew Brown",
                    "user_href": "/profile/Andrew-Brown-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lee Duer",
                "href": "/profile/Lee-Duer-3"
            },
            "answer_text": "On June 25, 1962, the United States Supreme Court decided in Engel v. Vitale that a prayer approved by the New York Board of Regents for use in schools violated the First Amendment by constituting an establishment of religion. The following year, June 27, 1963 in Abington School District v. Schempp, the Court disallowed Bible readings in public schools for similar reasons. These two landmark Supreme Court decisions based on “separation of church and state\" made it illegal for public schools to have any school sanctioned religious ceremonies or readings etc. But, students are still allowed to practice their specific religion as long as it is not disruptive. Students are still allowed to have religious clubs. They just can't be part of “school” activities. Of course, this does not apply to private schools, only public schools. ",
            "date": "Answered February 10, 2020",
            "views": "30",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gregory Dill",
                    "user_href": "/profile/Gregory-Dill-3"
                },
                {
                    "user_id": "Shelli King",
                    "user_href": "/profile/Shelli-King"
                },
                {
                    "user_id": "Carrie Noll",
                    "user_href": "/profile/Carrie-Noll"
                },
                {
                    "user_id": "Phil Tevlin",
                    "user_href": "/profile/Phil-Tevlin"
                }
            ]
        }
    ]
}