{
    "title": "When are the CBSE school's reopening? What are precautions taken by schools to reopen after the lockdown? - Quora",
    "tags": [
        "Precautions",
        "Central Board of Secondary Education, India",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saurav A.K",
                "href": "/profile/Saurav-A-K"
            },
            "answer_text": "Schools will open defiantly (in 3–4 months) but in different scenario and timing is also unpredictable The following measures should be taken for the schools to reopen and conduct daily classes safely: Control and planning classes for all age group of students Social distancing management step should be taken Sanitation service to be modified Cleaning of premises should be more Effectively maintained Planning should be done like that less contact of children should be done Food and safety should be modified regarding this current scenario transportation should be modified according to distancing norms Playgrounds should also cleaned and regularly managed. Watch this video to know more about the tentative reopening fates and also the safety measures that should be taken.  ",
            "date": "Answered June 8, 2020",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Umesh Nagar",
                "href": "/profile/Umesh-Nagar-32"
            },
            "answer_text": "Schools will open defiantly (in 3–4 months) but in different scenario and timing is also unpredictable The following measures should be taken for the schools to reopen and conduct daily classes safely: Control and planning classes for all age group of students Social distancing management step should be taken Sanitation service to be modified Cleaning of premises should be more Effectively maintained Planning should be done like that less contact of children should be done Food and safety should be modified regarding this current scenario transportation should be modified according to distancing norms Playgrounds should also cleaned and regularly managed. Save your child from Corona in social distancing and proper precaution by joining “Toppr : The Better Learning App”. ",
            "date": "Answered July 9, 2020",
            "views": "125",
            "upvotes": "0"
        }
    ]
}