{
    "title": "When learning languages, which is the easiest way for you and why? - Quora",
    "tags": [
        "What Is the Easiest Way to X?",
        "Learning Languages",
        "Learning New Things",
        "Studying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Normann Aaboe Nielsen",
                "href": "/profile/Normann-Aaboe-Nielsen"
            },
            "answer_text": "If you only want to do simple stuff then by all means, use Python. I would not recommend JavaScript as it require understanding of OO which is not a simple concept for a beginner and certainly not needed when coding simple problems. But if you want to start a career: Start with C++. It has the concept of object, pointers, recursion, functions and multiple other stuff. You can easily learn to do some simple stuff with it and you can grow with it. Many other languages can solve your problems but they do not let you get your fingers dirty. Java and C# does not have pointers, meaning that you cannot really learn how to code efficient routines on a machine-near level. Some languages does not encourage recursion, which is an important technique to master for search-algortithms. And so on … So I recommend C++ - also because it is fun and have job opportunities in it still… ",
            "date": "Answered May 13, 2017",
            "views": "217",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Catarina Santos",
                "href": "/profile/Catarina-Santos-15"
            },
            "answer_text": "It always comes to your native language! If your first language is Germanic (English, German, Dutch, Norwegian, etc.) you will have an easier time learning languages from the same group (ex: Norwegian and English have pretty close roots). On the other hand if you speak Portuguese (like me) you will have an easier time learning Spanish, Italian, French or Romanian. If you are from a Dlavic country you’ll probably find it easier to learn Russian. Anyway, regardless of your native language, you should learn the language you appreciate the most. Hope it was helpful! ",
            "date": "Answered September 24, 2017",
            "views": "165",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "刘 云龙",
                    "user_href": "/profile/刘-云龙-1"
                },
                {
                    "user_id": "Karol Emil Thornton-Remiszewski",
                    "user_href": "/profile/Karol-Emil-Thornton-Remiszewski"
                }
            ]
        }
    ]
}