{
    "title": "Where can I find case study solutions? - Quora",
    "tags": [
        "Case Studies"
    ],
    "response": [
        {
            "author_info": {
                "name": "LuQman AbdulRahman",
                "href": "/profile/LuQman-AbdulRahman"
            },
            "answer_text": "Great People have always studied Great People. This means 99 percent of everything we do is Attitude and the other 1 percent is Motivation. So who are you willing to study for a solution? What kind of Business are you interested in for sale or service? Going to a different Library is like going to a different State; that is, information in a College Library verses information in a Public Library the cause is R.E.I (Research, Evaluation, Investigation). The final question is what kind of manager or owner are you trying to be for the sake of Business to determine who in Business you are willing to follow or study with love and admiration for a long time? The importance is deciding how to be a problem solver to serve people. ",
            "date": "Answered November 26, 2016",
            "views": "34",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shaheen Mohammed",
                "href": "/profile/Shaheen-Mohammed-27"
            },
            "answer_text": "For getting best and most reliable case study solutions assignment consultancy is known as one of the most demand able and trustworthy service portal as compare to other service portal who are providing services in this field and all the hired professionals are highly proficient and super active and provide 24*7 assistance to students. ",
            "date": "Answered September 27, 2018",
            "views": "753",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ngawang Thinley",
                    "user_href": "/profile/Ngawang-Thinley-9"
                }
            ]
        }
    ]
}