{
    "title": "Where can I download educational kids’ apps? - Quora",
    "tags": [
        "Apps for Kids",
        "Educational Apps",
        "Educational Technology",
        "iOS Application Development",
        "Android Applications",
        "Games",
        "Children",
        "Parenting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lori Kingshott",
                "href": "/profile/Lori-Kingshott-1"
            },
            "answer_text": "Disclaimer: Ok so I this is going to be a biased answer as my children are the creators of the app. The app is called Divino - Classical Edition. It is a free app available from Apple “App Store”, with optional in-app purchases for hints. With potential changes to the education system in America, there is a need to augment educational opportunities. To help bridge the divide between the circumstances of birth of the rich and poor, this free Classical Education App was developed. As Splinter said in Teenage Mutant Ninja Turtles, “do not confuse the specter of your origin with your present worth”. Agreed. The goal of the Divino - Classical Edition app is not to repeat or reinforce the rote basic materials covered in the classrooms. The goal is to provide the type of information that private school students learn on their jaunts to Europe. The development of the Divino Classical Edition app was inspired by a variety of after dinner conversations. Topics of discussion in one evening included the Sword of Damocles, Special Relativity, Las Meninas, Hedy Lamarr, Botticelli’s Venus, Ithaca and Fibonacci Numbers. The next evening the topics flipped to the Higgs Boson, the Odyssey, the Samothrace Temple, Jack Kerouac, Macbeth, Minkowski Space and Schrödinger's Cat. If you have been on the periphery of one of these conversations, wouldn’t you just love to join in the conversation.  Students playing this app could become motivated to visit art museums, read beloved classic books, add mythological references to conversations or retake the SAT with new-found vocabulary knowledge. The App includes Easter Eggs - interesting stories to pepper into conversation or to entertain kids of any age. The six free categories are Greek Mythology, Literature, Latin, Science, Geography and Art. It is the educational alternative to hours of mindless matching games. Students will start to correctly reference the Greek king Sisyphus by name when mentioning that a task is like rolling a boulder up a hill for eternity? Or mention that Ceasar said his famous words, “Veni, vidi, vici” after defeating King Pharnaces II and then immediately returned to Cleopatra’s side? Or share that the citizens of Monaco are not allowed to enter the Monte Carlo casino? Or that the movie “She’s the Man”, starring Amanda Bynes and Channing Tatum, is actually an adaptation of Skakespeare’s \"Twelfth Night”? Or that Hedy Lamarr, the actress, has a 1942 patent that is used for Wi-Fi and Bluetooth technology? Or that the model for Botticelli’s “Birth of Venus” painting was likely a cousin-in-law of Amerigo Vespucci, the explorer for whom America was named? To wrap up, here is another Teenage Mutant Ninja Turtles quote: “ultimate mastery comes not from the body, but from the mind.” Splinter’s quotes match the vision of this App and interestingly all of the Ninja Turtles names are included in the Art section of the App: Leonardo, Donatello, Michelangelo and Raphael. Here’s to you Teenage Mutant Ninja Turtles! ",
            "date": "Answered May 23, 2017",
            "views": "252",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tina Singh",
                "href": "/profile/Tina-Singh-126"
            },
            "answer_text": "You can download good educational kids apps on both Play store and App Store as there are quite a few of them these days. Some of my favourites are Kids Vocab, mGuru and GetLitt for different reasons. Kids Vocab is great for Vocabulary, mGuru is for Math problems and GetLitt for reading. All these apps are great, but GetLitt is my personal fav as it has so many new interesting books for kids that I also enjoy reading with them. ",
            "date": "Answered September 17, 2018",
            "views": "32",
            "upvotes": "0"
        }
    ]
}