{
    "title": "Where can I get the IB MYP eAssessments past paper of 2017? - Quora",
    "tags": [
        "MYP e-Assessments",
        "IB Middle Years Programme",
        "Middle Years Programme (MYP)",
        "International Baccalaureate (IB)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lauren DeSousa",
                "href": "/profile/Lauren-DeSousa-2"
            },
            "answer_text": "Not going to happen - sorry to say. The MYP eAssessments program is only just becoming a thing and the IB is very protective and secretive of them especially as they are still trying to figure out the system. I took the May 2017 eAssessments and all the past papers I had to practice with (given to my school and me legally and appropriately by the IB) have been discontinued on my computer. Check with your school, but if they don’t have them, you’re not getting them. ",
            "date": "Answered June 12, 2018",
            "views": "33",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prathamesh Advilkar",
                    "user_href": "/profile/Prathamesh-Advilkar"
                },
                {
                    "user_id": "YC Tsueck",
                    "user_href": "/profile/YC-Tsueck"
                },
                {
                    "user_id": "Marcy Buono",
                    "user_href": "/profile/Marcy-Buono"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prathamesh Advilkar",
                "href": "/profile/Prathamesh-Advilkar"
            },
            "answer_text": "Agree with Lauren. IB is very protective about MYP assessments. DP assessments are available to buy but MYP e-Assessments are not. IB even doesn’t keep those assessments for longer time on “MY IB”- which is usually accessed by all IB teachers for getting assessments. In my school, we use to make assessments on ‘assess-prep’ which consist questions from previous IB MYP e-Assessments, so that students get first-hand experience. So, the best way to get idea of MYP e-Assessment questions is to approach your subject teacher. ",
            "date": "Answered March 21, 2020",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Neethu Nath",
                    "user_href": "/profile/Neethu-Nath"
                }
            ]
        }
    ]
}