{
    "title": "Where can I get free case studies with solutions on the internet? - Quora",
    "tags": [
        "Business Case Studies",
        "Case Studies",
        "E-learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amit Das",
                "href": "/profile/Amit-Das-3"
            },
            "answer_text": "Thanks for the A2A.  1. There is this nice simple website called Google which typically has answers to the question you've just asked. Not exactly a quora question seeking the expertise of the crowd :-) 2. I am assuming that you're looking for either a) case studies related to consulting case interviews, OR b) case studies administered as part of class assignments (typically, business schools). a - Michigan, Harvard, Duke, and many b-schools have consulting clubs, who have painfully compiled case studies booklets which usually have a section of frameworks, and a larger section of caselets (smaller cases used in interview settings) and indicative solutions. Just to caution you, these solutions are not necessarily correct, because case interviews are focused on your approach to the case. You can again search for these online very easily. If you are still not able to, post a comment here, and I will try to. You may try to find some friends with connections to these colleges.  b- Usually, you'll need to search on a case by case basis :-). Most case studies have some solution or the other on sites like slideshare, 4shared, and what nots. Again, google is a great place to start. Some university sites are not very secure, and in those cases, you may find instructor notes/ solutions hosted on the faculty pages with open access. In fact, you can use the keyword inurl:.edu to narrow down the search to academic institutions, for instance.  Last two comments. If you're thinking case studies, they usually do not have just \"one correct solution\". So, invest time in learning how to approach cases, rather than fixed answers. They are not mathematics problem sets at the end of a chapter in a book. Second, invest time in learning how to search stuff effectively on Google. That might just become the most handy skill ever in the years to come. Because most questions that we ask have already been answered somewhere else :-) All the best. ",
            "date": "Answered October 29, 2015",
            "views": "642",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nghaka Deoxyz Fanai",
                    "user_href": "/profile/Nghaka-Deoxyz-Fanai"
                },
                {
                    "user_id": "Tesfaye Gemechu",
                    "user_href": "/profile/Tesfaye-Gemechu-5"
                },
                {
                    "user_id": "Jayasree B",
                    "user_href": "/profile/Jayasree-B-25"
                },
                {
                    "user_id": "Akib Reza",
                    "user_href": "/profile/Akib-Reza-5"
                },
                {
                    "user_id": "Jasmeet Kaur",
                    "user_href": "/profile/Jasmeet-Kaur-1053"
                },
                {
                    "user_id": "Alec Pokrandt",
                    "user_href": "/profile/Alec-Pokrandt"
                },
                {
                    "user_id": "Lam Mim",
                    "user_href": "/profile/Lam-Mim-2"
                },
                {
                    "user_id": "Vaidehi Shukla",
                    "user_href": "/profile/Vaidehi-Shukla"
                },
                {
                    "user_id": "Nairik Dutta",
                    "user_href": "/profile/Nairik-Dutta"
                },
                {
                    "user_id": "Savyasachi Bhat",
                    "user_href": "/profile/Savyasachi-Bhat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jawad Saleem",
                "href": "/profile/Jawad-Saleem-35"
            },
            "answer_text": "If you’re looking for online sources for case studies solutions there are various ways to do that. Thousands of tutoring websites allow you to ask some questions no matter where they come from as far as they are related to academics. You can do this every minute and every hour. How these websites work is, students post questions and experts answer them, or students can schedule tutoring sessions with the tutors and the website get a commission or its cut from the whole transaction. The process varies from website to website. The top academic help web sites will be more expensive and will take a greater chunk from the transactions. Whereas, other web sites or relatively new platforms will be cheap and inexpensive for the students. Take SolutionInn. I will explain the great benefit this web site has in it’s newly launched feature. When you are at college the speakers give you diverse assignments and papers to compose. Exclusively everyone is normally conceivable to do. Notwithstanding, when you have three or four all due around the same time then you are confronted with an issue. A standout amongst the most difficult is composing a case study in Back and understudies think that it's troublesome notwithstanding when they have time. Take the example of finance case studies. A budgetary case study requires a great deal of exertion since they require legitimate arranging, time administration, and social event of data, research, examination and afterward composing, altering, and editing. When you are up against your due date this can be difficult to do well and after that you lose grades. On the off chance that you compose your Finance Case Study help examination, you should guarantee it is short and particularly to the point’ and this takes composing aptitudes. With this factor in mind, a newly launched feature might be available for visitors for free case study solutions. Here comes the free feature of SolutionInn. It is an online tutoring portal that has a lot of study resources online. It has recently launched a new feature using which members, trial users or even visitors can post about one hundred free questions free of cost and that is not it, you will get your answer within a few minutes totally free. Now you can go to its web site and click on the “Ask a question” button. Then click on “Experts Q&A”. Here you can post your questions in detail and select the subject that your case study comes under. You can post questions of any length and of any description. You can even upload your full case study there and guess what you will get a full answers from more than one experts for free. So I think that is what you are looking for as a lot of questions are posted here everyday on SolutionInn and you might get your case study solutions there. INACCESSIBLE CASE STUDIES About case studies like Harvard Business School Case studies. They won’t be available anywhere. And forget about if you are going to get it for Free? With legal rights? Without copyright infringement? Not possible (except for a couple of free ones that HBS might have allowed here and there). Let me explain the legality of this matter. All top tier business schools anywhere have a bunch of these case studies in their curriculum. Legally licensed for use. As students, we get access to them. Some might also be available through the various subscriptions that your institute library may have. Except - it's not quite free. You’ve paid for it already in your tuition fee, etc. Now looking at the illegal ways. The dark-web and the deep-web and the world of piracy - I am sure there are quite a few that would have made their way online. Except, I won’t expect any of us formally answering people to know where they are. So, use your google skills (that’s the first skill you should acquire these days) to go down that path. But even chegg has only a few of them. You might get lucky if some one has uploaded the whole case study there as if some one really did so, you will never find answers to it. Also you can use the free cases that are available on any of the homework help web site. ",
            "date": "Answered November 1, 2019",
            "views": "71",
            "upvotes": "0"
        }
    ]
}