{
    "title": "Which animal in the animal kingdom is endlessly fascinating? - Quora",
    "tags": [
        "Animal Kingdom",
        "Zoology",
        "Animal Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Cooper",
                "href": "/profile/Alex-Cooper-81"
            },
            "answer_text": "This animal could certainly stun a person:  But he looks quite apologetic about it. Yes, it is, of course, the Electric Eel. A fun fact about the electric eel, is that it is not actually an eel at all, but a knifefish. (I’m not going to take a stab at explaining what a knifefish is, though; it would be dull and I’d rather get to the point of the answer.) The electric eel has three pairs of specialised organs that produce electricity. And it can produce up to 600 volts; certainly enough to trouble a human. Stunning, indeed. Shocking, even. Despite their intensity, these shocks are not blunt instruments. Kenneth Catania, from Vanderbilt University has shown that the eel's high-voltage discharges are immensely subtle weapons with at least three distinct functions. They force prey to twitch and so reveal their presence. They then paralyze the victims by causing all their muscles to contract. And they monitor the movements of these stiffened, floating mouthfuls. The electric eel is a battery, Taser, remote control, and tracking device, all in one.[1] Sure, they’re probably not “stunning” if we’re talking about looks, but I think their facial expressions are quite endearing. It looks like he’s just humming along to himself.  It’s cute. There; I said it. So, actually, I think the electric eel is a stunner, whatever your interpretation of the word. Footnotes[1] A Scientist's Shocking Discovery About Electric Eels",
            "date": "Answered November 29, 2019",
            "views": "356",
            "upvotes": " View 2K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maria Oorial",
                    "user_href": "/profile/Maria-Oorial"
                },
                {
                    "user_id": "Jose Aparicio",
                    "user_href": "/profile/Jose-Aparicio-15"
                },
                {
                    "user_id": "Patrick Minor",
                    "user_href": "/profile/Patrick-Minor-9"
                },
                {
                    "user_id": "Ronald Estrada",
                    "user_href": "/profile/Ronald-Estrada-9"
                },
                {
                    "user_id": "Mark Olesen",
                    "user_href": "/profile/Mark-Olesen-2"
                },
                {
                    "user_id": "Thomas Belstler",
                    "user_href": "/profile/Thomas-Belstler"
                },
                {
                    "user_id": "Charlie Elkins",
                    "user_href": "/profile/Charlie-Elkins"
                },
                {
                    "user_id": "Shriram",
                    "user_href": "/profile/Shriram-27"
                },
                {
                    "user_id": "Abhishek Verma",
                    "user_href": "/profile/Abhishek-Verma-975"
                },
                {
                    "user_id": "Athul S",
                    "user_href": "/profile/Athul-S-94"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leila Zai",
                "href": "/profile/Leila-Zai"
            },
            "answer_text": "The most stunning are the very colorful--which, to my way of thinking, means mostly tropical birds and vividly patterned fish. There are insects that also grab our attention every time, and some snakes and lizards that are awesome. Even our tiny California tree frogs are beautiful. Macaws, lorikeets, peacocks, birds of paradise, hummingbirds: flying the colors, indeed. Sea dragons, clownfish, lionfish, discus fish, bettas--and you can't dismiss the amazing color-changing abilities of octopi and cuttlefish. But if you had never seen an elephant before, or a whale breaching, imagine your awe at encountering one. Earth is home to odd and astounding creatures and unbelievable plants. We have to treat our home planet as something precious--because it is. ",
            "date": "Answered January 6, 2020",
            "views": "54",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Javier Mandry",
                    "user_href": "/profile/Javier-Mandry"
                }
            ]
        }
    ]
}