{
    "title": "Which is the best course after an MCom? I got 48% in MCom and 74% on graduation. - Quora",
    "tags": [
        "Master of Commerce",
        "Educational Courses"
    ],
    "response": [
        {
            "author_info": {
                "name": "Puneet Malhotra",
                "href": "/profile/Puneet-Malhotra-16"
            },
            "answer_text": "I would vote for Risk Management. Risk Management is hot and niche hence can be well paying. The demand for risk professionals in Just India is about 10,000 people every year and is expected to go upto 1 lakhs in next 3 to 5 years. Do look at specialisations like the one offered by Global Risk Management Institute. They offer, 1 year programme – which includes Guaranteed 6 weeks internship and Guaranteed placements upwards of Rs. 6 lakhs (0-4 yrs work experience and case to case with 4+ years of work ex). The course will include 3 papers on general management topics and 13 technical papers on various facets of Risk Management, such as Enterprise Risk Management (‘ERM’), Internal Audit (‘IA’), Sarbanes Oxley and Internal Financial Controls, Regulatory Compliance, Financial Risk Management, Applied Audit Analytics, Information Technology General Controls (‘ITGC’), etc. Developmental work for all the Risk Management papers have been led by professionals with a collective experience of 100+ years in the Risk consulting space. These papers have been co-developed and vetted by Global Risk Advisory leaders and industry experts, while working closely with tenured faculty of internationally reputed Universities. 1 year Post Graduate Certificate in Risk Management (‘PGDRM’) Frequency of class: 6 days a week (for 1 year)Program hours: 640 Hours (40 Hours / paper)Focus of Program: Understanding different facets of Risk ManagementIdeal for: Candidates possessing a Bachelors’ degree or equivalent with or without work experience and having interest in Risk Management domainPGDRM at GRMI is endorsed from a UK Accreditation body which is accepted Globally. OTHM is a UK Awarding Body regulated by Ofqual (Office of the Qualifications and Examinations Regulations) and recognised by Qualifications Wales Placements and Internship Update for PGDRM 2017-18 in PwC, EY, Grant Thornton, TPG Capital, Startup-O, PepsiCo, Eicher Motors, Karur Vyaysa Bank, HT Media, Make My Trip etc. Internships & Pre-Placement opportunities (click for details on placements). You can write to admissions@grm.institute for more details and look at internships here. ",
            "date": "Answered May 24, 2019",
            "views": "438",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hun Nie",
                    "user_href": "/profile/Hun-Nie-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ramendra Chandra",
                "href": "/profile/Ramendra-Chandra"
            },
            "answer_text": "Learn Digital Marketing. Being a digital marketer and blogger I can assure that your career, growth and the opportunity will be in safe hands. After working for some years, also get an MBA from a good institute. Experience+MBA can take your career to a new high. Digital Marketing is not only about new things but it is also about strengthening your marketing ideas to a new level. To get a glimpse of digital marketing ,visit http://digitalnmarketing.com. Thank you. ",
            "date": "Answered May 24, 2019",
            "views": "77",
            "upvotes": "0"
        }
    ]
}