{
    "title": "Which is better for the JEE, Vedantu or Unacademy? - Quora",
    "tags": [
        "Vedantu",
        "Unacademy",
        "Joint Entrance Examination Advanced",
        "Joint Entrance Examination Main",
        "JEE Preparation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Suhas Adiga",
                "href": "/profile/Suhas-Adiga-2"
            },
            "answer_text": "I would suggest that both platforms are almost similar.But it depends on teachers. Comparison: 1.Teachers: Vedantu has lots of teachers, once you purchase some course they will allocate you in some batch, in which teachers are selected by Vedantu Team.Whereas in Unacademy there are so many batches and you can enroll in an number. (For Eg: If Namo Sir teaches Physics in Batch ‘A’ and Sameer sir teaches Maths in Batch ‘’B and not for A,Then you can enroll in both and see accordingly).Unacademy also has a separate batch which has teacher’s from Kota teaching you, which makes you feel more confident about your preparation. So,Unacademy gets a point here. 2.Price: Vedantu Prices are far more costlier than Unacademy , Hence Unacademy gets a point here. EDIT 1: Here Both Vedantu and Unacademy gets a point as of 4/9/2020, as Unacademy is going with Price Hike, and Vedantu with its new Subscription Model (Vedantu Pro), has similar Pricing. 3.Free Courses: Unacademy provides complete courses for free on Youtube and is taught in detail by the greatest teachers, whereas Vedantu doesn’t have dedication in giving complete content regularly.Hence again Unacademy gets a point here But, eventhough teaching is good, I faced a problem in both Platform,For a student teaching doesn’t feel that mind touching because teachers don’t teach on board, they write it on a Tablet/Laptop and Webcam Video of Teacher is seen on their Premium courses and I felt Unacademy JEE LIVE was better than Plus, hence I left plus and started using Unacademy JEE Live Daily EDIT 2: Due to this Coronavirus Pandemic worldwide, all teachings have shifted online, so I dont think it makes more sense now. So now offline and online coaching seems the same. 4. APP User Interface: Unacademy’s app has less crashes than Vedantu, Unacademy’s Plus App is more better organised than Vedantu. Eg: 1. In doubt section of Vedantu’s App, after each doubt is solved it asks about “Whether teacher was able to solve doubt”. When you go to ask the doubt again, it asks the same again, after two- three times doing same it will allow you to ask the doubt. 2.Even Schedule part (Interface) of Unacademy looks more good than Vedantu. Both Unacademy and Vedantu has good teachers, but Unacademy has creative way of teaching. The way they teach by making you realise about the concepts through Killer Visualisation is really awesome. I don’t remember any formulas now, but derive all by visualizing.(In my college they always used to say to mug-up formulas, and the examples given on board was very difficult to understand, but was made easy through graphical representation on Unacademy JEE Live Daily) Trust me UNACADEMY is comparitively better than Vedantu for both JEE and NEET. Thanks for 300+Upvotes. Thanks for 50K+ Views ",
            "date": "Updated September 5, 2020",
            "views": "635",
            "upvotes": " View 420 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sayan Mahapatra",
                    "user_href": "/profile/Sayan-Mahapatra-14"
                },
                {
                    "user_id": "Devisri Vamsi",
                    "user_href": "/profile/Devisri-Vamsi"
                },
                {
                    "user_id": "Tabinda Falak",
                    "user_href": "/profile/Tabinda-Falak"
                },
                {
                    "user_id": "Shiw Sahu",
                    "user_href": "/profile/Shiw-Sahu"
                },
                {
                    "user_id": "Shrisha Kamath",
                    "user_href": "/profile/Shrisha-Kamath"
                },
                {
                    "user_id": "Kush Lalwani",
                    "user_href": "/profile/Kush-Lalwani-4"
                },
                {
                    "user_id": "Abhijeet Sahu",
                    "user_href": "/profile/Abhijeet-Sahu-12"
                },
                {
                    "user_id": "Varad Gupta",
                    "user_href": "/profile/Varad-Gupta-5"
                },
                {
                    "user_id": "Aditya Singh",
                    "user_href": "/profile/Aditya-Singh-3786"
                },
                {
                    "user_id": "Sujit Laware",
                    "user_href": "/profile/Sujit-Laware"
                }
            ]
        },
        {
            "author_info": {
                "name": "Riyansh Meena",
                "href": "/profile/Riyansh-Meena-1"
            },
            "answer_text": "For a JEE learner Vedantu is good ..than unacademy . If you get bored after studying for a long time than Vedantu is good But if you just like study study study with gets you horribly tired. …………I am not saying that unacademy is bad …. But Vedantu have good …. Free live classes also during the corona outbreak …………. There are a lot of good teachers in it .. they teaches you with fun ……. I myself use Vedantu ………. All the teachers in it make my subject fun ……….. even when i faced difficulty in maths …. I get tired but the teachers make it fun for me But I am not forcing you ……. Choose as your wish BECAUSE NO ONE CAN STOP YOU FROM YOUR AIM , YOUR LEARNING and I guarantee that you will be succeed if you don’t waste your time …………….. you have everything with you ……… so what are you waiting for ………………. Just pick up your book and get into study ……………….. No one can stop you to achieve your goal Go… Good luck !!!!!!!!!!! ",
            "date": "Answered June 9, 2020",
            "views": "128",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "K Balakrishna Prasad",
                    "user_href": "/profile/K-Balakrishna-Prasad"
                },
                {
                    "user_id": "Shiw Sahu",
                    "user_href": "/profile/Shiw-Sahu"
                },
                {
                    "user_id": "Shrisha Kamath",
                    "user_href": "/profile/Shrisha-Kamath"
                },
                {
                    "user_id": "Arnav Prajapati",
                    "user_href": "/profile/Arnav-Prajapati-5"
                },
                {
                    "user_id": "Suhani Afreen",
                    "user_href": "/profile/Suhani-Afreen"
                },
                {
                    "user_id": "Vishnu Sriram",
                    "user_href": "/profile/Vishnu-Sriram-2"
                },
                {
                    "user_id": "Uttam Tiwary",
                    "user_href": "/profile/Uttam-Tiwary-9"
                },
                {
                    "user_id": "Parth Gupta",
                    "user_href": "/profile/Parth-Gupta-347"
                },
                {
                    "user_id": "Mayank Jha",
                    "user_href": "/profile/Mayank-Jha-320"
                },
                {
                    "user_id": "Shreya Negi",
                    "user_href": "/profile/Shreya-Negi-23"
                }
            ]
        }
    ]
}