{
    "title": "Which college is better, GMC Patiala or CMC Ludhiana? - Quora",
    "tags": [
        "Christian Medical College, Ludhiana",
        "Dayanand Medical College & Hospital, Ludhiana",
        "Government Medical College, Patiala",
        "Ludhiana, Punjab, India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rickson Chelliah",
                "href": "/profile/Rickson-Chelliah"
            },
            "answer_text": "Im a CMC Ludhiana student, I won't comment about GMC Patiala. The boys hostel in CMC Ludhiana is really awesome. You get a single room from your first year. Girls hostel is a bit congested than boys. In CMC Ludhiana, we donot have a college campus. The college setting is bad. You have to walk through a main road from Hostel to reach the hospital. Teachers are excellent here. Teaching techniques are awesome! Hospital is good. You'll get to learn many things than other colleges since the crowd (we are 75 students per batch) is less. Yep. That's it. Nothing else to complain, nothing else to appreciate. Good luck! \\U0001f60a ",
            "date": "Answered June 13, 2017",
            "views": "16",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Josiah Abraham John",
                    "user_href": "/profile/Josiah-Abraham-John"
                },
                {
                    "user_id": "Sahil Chahal",
                    "user_href": "/profile/Sahil-Chahal-12"
                },
                {
                    "user_id": "Naomi J Kurian",
                    "user_href": "/profile/Naomi-J-Kurian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mridul Makkar",
                "href": "/profile/Mridul-Makkar-1"
            },
            "answer_text": "Thanks for A2A Lets talk in terms of different aspects : Fee : Definitely GMC Patiala (Goverment College lesser fee) CMC Ludhiana has bombardingly high fee structure. Academics : More or less the same. Clinical exposure : I guess its better in CMC Ludhiana because its a multispeciality hospital and many times cases are referred from government hospitals here as well. However, it doesn't mean that GMC has lesser exposure but I guess more variety of cases and a broad spectrum of diseases are covered in CMC. P.S. I am speaking relatively. Hostels : Well I guess since CMC is a private institute it has better hostel facilities and infrastructure. I guess that suffices your requirements I wish you good luck! :) ",
            "date": "Updated July 30, 2017",
            "views": "12",
            "upvotes": " Answer requested by Jasleen Kaur"
        }
    ]
}