{
    "title": "Which university graduates are the most employable? - Quora",
    "tags": [
        "College Graduates",
        "Employability",
        "Recent Graduates",
        "The College and University Experience",
        "Higher Education",
        "Colleges and Universities",
        "Education",
        "College Advice",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brent Eads",
                "href": "/profile/Brent-Eads-1"
            },
            "answer_text": "Understand as you come out of college with limited experience your more looking to check off boxes as “skills” much like passing a test or exam but that line of thinking doesn’t transfer well in the working world. Yes, you need to have some demonstrable technology skills or at least be familiar. To go farther, to make yourself truly employable not just pass the interview process but to thrive is to learn how to master the technologies your working. You need to learn how to dive deeply into the subject matter, to master it, troubleshoot and apply those skills in the real world - consistently. Your ability to learn quickly and adapt will determine your career trajectory over time. Its fine to be an inch deep and a mile wide with technology or processes but also have the ability to deeply dive into specific skills. Its not the skill of the day but learning how to master the subject presented. Make that the habit beyond just “being in the same room with technology xyz or business process abc” but have the ability to take those skills and master them, relentlessly. This is the skill most needed in any career field. Don’t look at individual skills like a test or exam but as part of your daily learning process. ",
            "date": "Answered April 21, 2020",
            "views": "121",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Danielle Fraser",
                "href": "/profile/Danielle-Fraser-35"
            },
            "answer_text": "Ones in most STEM fields. But not all STEM fields are created equal. Look up the outlook in various fields in the USA at U.S. Bureau of Labor Statistics ",
            "date": "Answered April 19, 2020",
            "views": "147",
            "upvotes": "0"
        }
    ]
}