{
    "title": "Which college is the best for engineering, CMRK or IARE? - Quora",
    "tags": [
        "Institute of Aeronautical Engineering (IARE) , DUNDIGAL",
        "IARE",
        "Engineering"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rohith Gopishetty",
                "href": "/profile/Rohith-Gopishetty"
            },
            "answer_text": "As per my perspective vision towards various engineering colleges in Hyderabad I have observed different colleges where I have divided into 3 sections Colleges like OU JNTU VASAVI CBIT till CVR come under top class Here comes 2nd category here all the colleges more or less have same value for example IARE,MREC,CMR 1ST & 2ND CAMPUSES,MRCET 3 rd section comprises of worst colleges where discussion is waste of time.. Coming to your question both colleges belong to the same section I.e., 2nd section where both colleges more or less equal After all introspection I suggest you to opt IARE 1st and than CMRK ",
            "date": "Answered June 8, 2018",
            "views": "24",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ramesh Gandrathi",
                    "user_href": "/profile/Ramesh-Gandrathi"
                },
                {
                    "user_id": "Kriahna Koushik",
                    "user_href": "/profile/Kriahna-Koushik"
                },
                {
                    "user_id": "Mudumala Vinitha",
                    "user_href": "/profile/Mudumala-Vinitha"
                },
                {
                    "user_id": "Pranay Sunny",
                    "user_href": "/profile/Pranay-Sunny-3"
                },
                {
                    "user_id": "Ganesh Tandra",
                    "user_href": "/profile/Ganesh-Tandra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Tibbs",
                "href": "/profile/Paul-Tibbs"
            },
            "answer_text": " If your career will take place in areas which expect English communication, choose whichever one will improve your use of English. “Best” is used for three or more choices. “Better” is used for a choice between two. Communication will always be one of the most highly valued skills in your toolbox. My father, also an engineer, went to those doing hiring for his employer, a very large firm. He asked,”From which school would you choose to hire if you knew NOTHING else of the prospect?” They recommended the school which I eventually attended. The Learn By Doing philosophy seems to be a very good basis for course and curriculum design, so look for a school that gives you hands-on work rather than endless theoretical study. ",
            "date": "Updated August 28, 2018",
            "views": "16",
            "upvotes": "0"
        }
    ]
}