{
    "title": "Which is better for IIT JEE Byju classes or Etoos? - Quora",
    "tags": [
        "BYJU'S (company)",
        "Indian Institutes of Technology Student Experience",
        "JEE Preparation",
        "Indian Institutes of Technology",
        "Joint Entrance Examination"
    ],
    "response": [
        {
            "author_info": {
                "name": "Muskan Kumari",
                "href": "/profile/Muskan-Kumari-184"
            },
            "answer_text": "Hello JEE Aspirant!!! If you use video lectures as a supplement in your preparation of JEE then it act as activater of your rankings. And if we talk about JEE preparation then a question comes in mind that it needs unstoppable study with honesty. Because we need high efficiency and competition in JEE examination is well known to everyone……. . Video lectures help to improve your concept and develop our skills. For you have to choose best and high recommended online course for your study support. Byju's:  If talk about Byju's ,I will explain their products and faculties. Generally byju's recruiting there faculties students of IIT's and NIT's it is right that their qualifications is upto the mark but they have not experience and teaching and tutoring need enough experience that's experience matters. ETOOS:  If talk about Etoos then their products are not up to the mark ,I personally go through it, video lectures are recorded from classroom lectures which has many interruption . Quality of products is not enough for JEE. Because of that their video lectures are recorded from class which causes lack of animation and illustration in 2D and 3D. When I was preparing in kota my roommates purchased videos lecture of Etoos but she was not satisfied with it and she told me that ,she wasted her Rs. 80,000. After that I purchased videos lecture of KAYSONS EDUCATION,( only in Rs. 20,000) we both used it and it feels that kaysons is better than etoos ,here we cleared our doubt easily . You can also join it and if wish than you may trail of it .   Best of luck:) Priyanshu Tiwari's answer to Which video lectures are the best for IIT JEE? Gautam Kuwar's answer to Which websites provide free video lectures for IIT JEE mains chemistry and maths? ",
            "date": "Updated August 27, 2018",
            "views": "71",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Umang Gupta",
                    "user_href": "/profile/Umang-Gupta-309"
                },
                {
                    "user_id": "Praveen Shukla",
                    "user_href": "/profile/Praveen-Shukla-63"
                },
                {
                    "user_id": "Vijay Kumar Yadav",
                    "user_href": "/profile/Vijay-Kumar-Yadav-102"
                },
                {
                    "user_id": "Arvind Singh",
                    "user_href": "/profile/Arvind-Singh-1996"
                },
                {
                    "user_id": "Nand Kishor",
                    "user_href": "/profile/Nand-Kishor-147"
                },
                {
                    "user_id": "Rajon",
                    "user_href": "/profile/Rajon-6"
                },
                {
                    "user_id": "Chandan Mishra",
                    "user_href": "/profile/Chandan-Mishra-463"
                },
                {
                    "user_id": "Raha",
                    "user_href": "/profile/Raha-10"
                },
                {
                    "user_id": "Sankarshan Kulkarni",
                    "user_href": "/profile/Sankarshan-Kulkarni-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rakesh Shukla",
                "href": "/profile/Rakesh-Shukla-190"
            },
            "answer_text": "Thanks for ATA!! Well,as far as I have personally felt both Byju’s and Etoos are equally good in terms of course content but Byju’s gets an edge over Etoos because it has a specially designed course content for JEE shaped in a way to be suitable for learning from home. And , you may find many coaching institutes like etoos having a large infrastructure and hell lot of publicity but still they lack one of the most important thing:students individuality ,to be elaborate: They dont focus on the progress of every student individually( though they assess them through Test marks which is insufficient and inappropriate) but there are emerging online Learning Platforms: which are Introducing A modern Way Of Learning and revolutionizing the Teaching Methodology by its Highly interactive Courses For IIT-JEE. Yeah,They offer more than what you need and meet your requirements to mentor you swiftly to the doors of IIT. Apart from Byju’s there are several other Platforms as well : Kaysons Education PLancess askIITians Embibe Of all I have heard mostly about Kaysons Education from many of my school Juniors who have taken up their course and also from one of my cousins who has recently enrolled into it. She is very much satisfied by the course content and the sustained guidance provided.She has taken up this course along with her regular coaching(Resonance) and right now she always secures an ARR(All Resonance Rank) of less than 50 and well it’s quite obvious to conclude that she will probably clear JEE as well.She affirms that the Video Lectures are so comprehensive that she could easily clear her concepts and due to that she scores Well Even In Topics like Rotational Dynamics and ORM. Suggestion:Both your time and Money are very important,so I suggest you to do ample research before choosing any Platform.Don’t get persuaded by anyone’s advise and make an effort to get a deep Insight into it. Good-Luck!!! ",
            "date": "Answered September 2, 2018",
            "views": "2",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sashawat Agarwal",
                    "user_href": "/profile/Sashawat-Agarwal"
                },
                {
                    "user_id": "Muskan Kumari",
                    "user_href": "/profile/Muskan-Kumari-184"
                }
            ]
        }
    ]
}