{
    "title": "Which class is the most important, 8th, 9th or 10th? - Quora",
    "tags": [
        "Teachers Pay Teachers",
        "10th Class in India",
        "Teachers",
        "Studying",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Debdatta Baidya",
                "href": "/profile/Debdatta-Baidya"
            },
            "answer_text": "…8,9,10,11,12 all of these classes are important for one’s growth as a student and character building. Please remember one thing, there are board(s) in India who actually actually have two streams from class 9 onwards, which basically means when you pass class 8 and come to 9 you have to chooe between science and commerce, where if you choose commerce maths is not compulsory to pass in class 10. This was the case few years back but now i don’t think so it is there anymore but if this practice exists, then class 9 has become very important. Also when you go to apply to some college, they will look at your class 10 marks and 12 marks…so unless you do well in your class 10 and 12, you won’t be getting into good colleges for higher education or rather the college that you want to study in! …and also in the case of getting jobs, in certain jobs,they look at your class 10 and 12 marks along with your college degrees and professional degrees… Best of luck! ",
            "date": "Answered March 25, 2018",
            "views": "498",
            "upvotes": " Answer requested by Michu Sunny",
            "upvoters": [
                {
                    "user_id": "Mohammad Salman",
                    "user_href": "/profile/Mohammad-Salman-516"
                },
                {
                    "user_id": "Arun Dutta",
                    "user_href": "/profile/Arun-Dutta-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shekhar Hardikar",
                "href": "/profile/Shekhar-Hardikar-1"
            },
            "answer_text": "This is very challenging and interesting as these are levels and NOT destinations… one tends to look at them as milestones for success! In reality learning starts, when one is able to apply and make use of the same. Do remember that this world is creation of so called uneducated people who never went to school! There are people who are into Home Schooling and take 10/12th exams externally, there are people who are passionate about their interests and build their career differently, Art/ Music/ Sports is one such area … So it depends upon model that one wants to follow, be persistent with the same and achieve what one aims with available resources… Having said this, grades 8/9/10 in formal school set up help individuals plan their learning outcome. If one intends to take these challenges externally than learning outcome is very different… ",
            "date": "Answered March 26, 2018",
            "views": "376",
            "upvotes": " View 2 Upvoters "
        }
    ]
}