{
    "title": "Which is the best child plan to invest in? - Quora",
    "tags": [
        "Investment Advice",
        "Personal Finance",
        "Children"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sachin Sharma",
                "href": "/profile/Sachin-Sharma-3396"
            },
            "answer_text": "The best way to pick the best child investment plans is by considering the dreams and future plans of your child. Next, add inflation and calculate the total amount. To know how much to invest every year, spread the entire amount calculated across the years left for your child to go to college. Most of you might think of all the high-risk investment options to get the best returns. However, if you are a risk-averse person, then insurance plans are the best way to save for your child future plan. For my daughter, a friend recommended opting for Exide insurance for my investment. After a lot of research, I shortlisted a few plans that served my purpose and I have listed down the same to help you come up with a decision as well. Exide Life New Creating Life Insurance Plans – This child investment plan is a life insurance policy that will secure your child’s dreams even when you are not around. There are two subcategories under this plan. Exide Life New Creating Life Plus – In this plan, you can pay a limited number of premiums and get an additional 10% when your child needs the funds for his/her education. In case of any unforeseen event, your family receives the entire sum assured without having to pay the left-over premiums.Exide Life New Creating Life Regular Pay – This is the same as the above policy with only difference in premium payments. This policy allows you to invest until the policy expires.Exide Life Mera Ashirwad – This policy just like the previous one assures you a life cover to fulfill your child’s dreams even when you are not around. Some of the signature benefits of this policy are no tax liability for maturity amount, flexibility to get periodic payouts, and waiver on premiums. Take a look at Exide Life Insurance plans that are specifically designed to save for your child’s future. ",
            "date": "Answered July 1, 2019",
            "views": "160",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Riya Sehgal",
                "href": "/profile/Riya-Sehgal-31"
            },
            "answer_text": "In my opinion, Aegon Life is quite good when it comes to plans around children. If you are looking for the best child insurance plan there are a few things or factors that you would need to focus on. You need to select a plan that would suit your needs completely for sure. These days, there is perhaps no parent out there who is not worried sick about the future needs of her or his child. This is especially true when it comes to education. The costs of education are always rising and this is why it is natural that parents would be worried about the same. After all, they want to make sure that the future of their kids is as secure as possible. This is where the child plans of companies such as Aegon Life could prove to be so very effective for you. It is common knowledge that raising a child is never easy. There are so many needs and requirements that you have to take care of. You need to understand that the needs of your child are unique. They are completely different from what others may have in this regard. At the same time, they are changing at all times as well. You also need to keep this in mind when you are choosing an insurance plan for your child. ",
            "date": "Updated December 6, 2019",
            "views": "117",
            "upvotes": "0"
        }
    ]
}