{
    "title": "Which district are you from in Bihar? - Quora",
    "tags": [
        "Districts of Bihar",
        "Government of Bihar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shambhavi Choudhary",
                "href": "/profile/Shambhavi-Choudhary-2"
            },
            "answer_text": "I belong to a city that is historically very very important and based on southern banks of the holy river The Ganges. I would talk about my city primarily on historical and Geographical aspects which is very interesting and a few might know. Historical Importance: The city got its name from the ancient word ‘Bhagdadpuram’ meaning city of good luck A very important city during the Anga Kingdom The city is also mentioned in Hindu Mythology. . Bhagdatpuram, as per Hindu mythological texts, was the place where the gods (devtas) and demons (asuras) churned the ocean to procure elixir (amrit).Mandar Parvat is the proof. It is believed that Panchjanya, the conch shell used in the Mahabharata was discovered here in the \"Shankh Kund\". The Burhanath temple, located in the heart of the city,Baba Budhanath can be found in Shiva Purana as Baba Bal Vridheshwarnath The city is home to Champapur which is the place where all the five Kalyanaks i.e., Garbha, Janam, Tapa, KevalGyan and Moksha Kalyanak of Bhagwan Vasupujya, the 12th Jain Teerthankar, have taken place. A holy place for the Jains. The Puranas also refer to Mandar hill. It is said that Vishnu covered the demon Madhu under the hill after defeating him to death. Kumarasambhava by Kalidasa refers to the foot marks of Vishnu on the slopes of Mount Mandar. References can also be found in Ramayana and Mahabharat, where my city is the capital of Anga.This kingdom was ruled by Karna. . Ancient cave structures from Emperor Asoka’s reign can be found in my district At that time the city had a large harbour at Champanagar, now known as Champanala on the Ganges which flows through the western boundary of the present city near Nathnagar The tomb of Suja, brother of Moghul emperor Aurangzeb, in the heart of the town is reminiscent of the town's association with the Mughal period. The city was referred to as one of the largest trading centres in India by the 7th century Chinese travellers Xuanzang and Faxian. The city was passed to the East India Company by the grant of the emperor Shah Alam II in 1765. Rabindranath Tagore wrote the first words of Gitanjali, that got him Nobel prize while his time away from his busy life in Shantiniketan, in my city. His home is still preserved and converted into Department of Ancient History. His home is next to my house. Vikramshila, another great center for learning after Nalanda during Pala empire is an 8th century university and has a tibetan significance. Clearly one of the largest Buddhist universities. The main stupa is still one of the most visited places. Geographical importance: The land is home to Gangetic Dolphins, now a rare species. Also, the land is very fertile for cultivation. It also has Vikramsheila Gangetic Dolphin Santuary. Note only 1500 gangetic dolphins are left today. World's Second Largest Rescue and Rehabilitation Area for Garuda, also the ‘vahana’ of Lord Vishnu. Around 500/1300 reside in my city. The climate is very apt for settlement because of its geograhical aspects Other aspects: Industry:Famous for over hundred of years for Tussar Silk Education:Best education available after Patna in terms of both schools and colleges Notable people associated with the city: Anand Mohan Sahay, general secretary of the INA with Bose TilkaManjhi, first Santhal freedom fighter Kadambini Ganguly, first of the two female medicine graduates from India,also first South Asian female physician Saratchand Chattopadhyay, eminent Bengali and Hindi writer Neha Sharma Well, the city is called the silk city, Bhagalpur. I love my city! ",
            "date": "Updated March 2, 2018",
            "views": "15",
            "upvotes": " View 39 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dileep Jha",
                    "user_href": "/profile/Dileep-Jha-2"
                },
                {
                    "user_id": "Dinesh Roy (दिनेश रॉय)",
                    "user_href": "/profile/Dinesh-Roy-दिनेश-रॉय"
                },
                {
                    "user_id": "Rahul Srivastava",
                    "user_href": "/profile/Rahul-Srivastava-66"
                },
                {
                    "user_id": "Achal Gautam",
                    "user_href": "/profile/अचल-गौतम-Achal-Gautam"
                },
                {
                    "user_id": "Rahul Verma",
                    "user_href": "/profile/Rahul-Verma-1829"
                },
                {
                    "user_id": "Rishi (ऋषि)",
                    "user_href": "/profile/Rishi-ऋषि"
                },
                {
                    "user_id": "Vijayshanker Tiwari",
                    "user_href": "/profile/Vijayshanker-Tiwari"
                },
                {
                    "user_id": "Dev Kumar",
                    "user_href": "/profile/Dev-Kumar-482"
                },
                {
                    "user_id": "Ankur Shukla",
                    "user_href": "/profile/Ankur-Shukla-25"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ASHISH-SHARMA-3737"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gaurav Chaudhary",
                "href": "/profile/Gaurav-Chaudhary-237"
            },
            "answer_text": "I am from Vaishali district in Bihar. Vaishali, was the first republic of the world that too in the 6th century. Image - 6 Facts You Didn't Know About Vaishali, The World's Oldest Republic! In 599 BCE the 24th Jain Tirthankara, Bhagwan Mahavira was born and brought up in Kundalagrama in Vaiśālī republic, which makes it a pious and auspicious pilgrimage to Jains. Image - https://redscarabtravelandmedia.wordpress.com/tag/gomateshwara-statue/ Gautama Buddha preached his last sermon before his death in c. 483 BCE. Image - https://upload.wikimedia.org/wikipedia/commons/1/18/Buddha%27s_ashes_Stupa%2C_Vaishali%2C_Bihar.jpg It contains one of the best-preserved of the Pillars of Ashoka, topped by a single Asiatic lion. Vaishali (ancient city) - Wikipedia Vaishali derives its name from King Vishal of the Mahabharata age. Ruins of Raja Vishal Ka Garh, Parliament House of Vaishali (Vaishali – World's First Republic | Mystery of India) Vaishali is also renowned as the land of Ambapali (also spelled as Amrapali), the great Indian courtesan, who appears in many folktales, as well as in Buddhist literature. Ambapali became a disciple of Buddha.Abhishek Pushkarini, the coronation tank - The sacred waters of the tank anointed the elected representatives of Vaishali. Image - Abhiskek Pushkarni Chaumukhi Mahadev Temple - One of the rarest Shivlinga with four god faces, Brahma, Vishnu, Mahesh and Surya. Image - https://in.pinterest.com/pin/330873903854792178/ ",
            "date": "Answered March 23, 2018",
            "views": "16",
            "upvotes": " View 29 Upvoters",
            "upvoters": [
                {
                    "user_id": "Scott Martinez",
                    "user_href": "/profile/Scott-Martinez-42"
                },
                {
                    "user_id": "Abhineet",
                    "user_href": "/profile/Abhineet-27"
                },
                {
                    "user_id": "Miwa Kale",
                    "user_href": "/profile/Miwa-Kale"
                },
                {
                    "user_id": "Pradeep Jha",
                    "user_href": "/profile/Pradeep-Jha-74"
                },
                {
                    "user_id": "Vijayshanker Tiwari",
                    "user_href": "/profile/Vijayshanker-Tiwari"
                },
                {
                    "user_id": "Rahul Kumar",
                    "user_href": "/profile/Rahul-Kumar-3100"
                },
                {
                    "user_id": "Rupesh",
                    "user_href": "/profile/Rupesh-178"
                },
                {
                    "user_id": "Kumar Himanshu",
                    "user_href": "/profile/Kumar-Himanshu-23"
                },
                {
                    "user_id": "Mrityunjay Singh",
                    "user_href": "/profile/Mrityunjay-Singh-20"
                },
                {
                    "user_id": "Ahir Riteish Yadhav",
                    "user_href": "/profile/Ahir-Riteish-Yadhav"
                }
            ]
        }
    ]
}