{
    "title": "Which is better, Brilliant or Udemy for learning computer science? - Quora",
    "tags": [
        "Udemy (company)",
        "Career Advice in Computer Science",
        "Computer Science Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhishek Sagar",
                "href": "/profile/Abhishek-Sagar-1"
            },
            "answer_text": "Well, the two biggest platform today for computer science online education is Coursera and Udemy - rest all are crap. Now to choose between Coursera and Udemy - You need to know what is your Goal. Coursera is more inclined towards offering University level courses, Whereas Udemy is more inclined towards delivering Job oriented courses. But Udemy is catching up fast in almost all realms of courses. Udemy is growing exponentially. Low quality courses dont survive on Udemy, and what you get is the top quality content in almost any niche - you name it, and you will get it. So, for a given course, make Udemy as your first priority, and then search for the course on coursera. Professionals/Instructors from all over the world are joining Udemy and sharing their tonnes of quality experience, and most important thing - On Udemy you can get the course at 1/10 of the price of what you get on Coursera. So, Search on Udemy for the courses you want to do - No harm in trying it out. NPTEL is good if you want to do academic courses being taught in top universities of the world. For courses which needs conceptual clarity at the academic level - NPTEL & coursera should be first choice. But then again, always search on Udemy first. Udemy is an open platform - you never know which angel (instructor) had delivered the course which meets your needs in few bucks. ",
            "date": "Updated August 24, 2018",
            "views": "21",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Estuardo Mendez",
                    "user_href": "/profile/Estuardo-Mendez-1"
                },
                {
                    "user_id": "Jessica Wada",
                    "user_href": "/profile/Jessica-Wada-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rakesh Kumar",
                "href": "/profile/Rakesh-Kumar-4191"
            },
            "answer_text": "Neither of the two. Rather try these: Computer Science | CourseraNPTELComputer Science | EDX",
            "date": "Answered July 10, 2018",
            "views": "774",
            "upvotes": "0"
        }
    ]
}