{
    "title": "Which college is better, AIIMS Nagpur or GMC Nagpur? - Quora",
    "tags": [
        "Government Medical College, Nagpur",
        "Nagpur, Maharashtra, India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sudhakar chandra",
                "href": "/profile/Sudhakar-chandra-2"
            },
            "answer_text": "The first thing that you should know is ,u either choose GMC Nagpur or AIIMS Nagpur,you have to stay in the same campus. Aiims still has it's hospitals and the campus under construction, in Mihan . Now,as per your question of, \"Which college you should prefer \"is that the ultimate choice lies with you but i can help you out by just comparing both of them on similar grounds. Pros of GMC Nagpur : •Gmc Nagpur is excelling at academics with a fine quality of practical laboratories that are well quipped with the required instruments. • It has a huge campus, which makes it the largest medical college in Asia. The campus is pleasant and full of green lush! • The hospital building is huge with seperate opds and wards for most of the departments. •The patient inflow is large which is supported by a good number of resident doctors,adequate sanitation facilities and all the other required facilities which are well appreciated. • Gmc Nagur has it's own Trauma centre and Superspeciality hospital along with separate wards for TB and infectious diseases. • Telling of the hostel facilities,there are separate hostels for both boys and girls with all the general facilities. To the advantage the rooms and the bathrooms are newly rennovated. • Ragging is not an issue here however the seniors may take a few interactive sessions which will be beneficial in future. So you need not worry about that. Also the seniors are very helpful in acadamical as well as non-acadamical grounds. • The college has its own ground for recreational activities like football, cricket etc. It has badminton hall ,table tennis hall , gymnasium for fitness and a swimming pool also . So to sum it up all, it is a very good college for studying Mbbs,MS,MD etc . So for all the fair reasons it is considered as the top college of Vidarbha region. Pros of Aiims nagpur: To begin with the fact of you being an Aiimsonian is a great feeling in itself and has its own importance. • Aiims basically focuses on clinical aspects than theoriotical part that is quite an advantage for a doctor in making but currently AIIMS doesn't have it's own hospital so they are dependent on the hospital of Gmc nagpur itself . They will definitely have their well equipped hospital in coming 2-3 years. Building a hospital is comparatively an easier task than establishing it among the patients that requires lot of hardwork and some time for sure. • AIIMS Nagpur has started last year so the students have not got enough opportunity to attend any clinical posting this year . • As of now the plans for building it's campus seems very promising in near future. • Good hostel facilities are available for both boys and girls. In all of these things an important point that cannot be ignored is that currently AIIMS Nagpur is dependent on GMC Nagpur for a lot of things including the campus facilities. To conclude, in my opinion, I will anyday prefer GMC Nagpur. So, hands up for Gmc Nagpur for all the fair reasons like providing almost all the facilities better than Aiims Nagpur. To end up it will always be personal preference over any comparisons that I give! Choose wisely ! All the best ! Keep asking ,keep appreciating :) ",
            "date": "Answered May 9, 2019",
            "views": "6",
            "upvotes": " View 35 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Muskan A",
                    "user_href": "/profile/Muskan-A-7"
                },
                {
                    "user_id": "Shambhavi Pathak",
                    "user_href": "/profile/Shambhavi-Pathak-18"
                },
                {
                    "user_id": "Vinay Rautiya",
                    "user_href": "/profile/Vinay-Rautiya"
                },
                {
                    "user_id": "Syamantak Bhuniya",
                    "user_href": "/profile/Syamantak-Bhuniya-1"
                },
                {
                    "user_id": "Minakshi Lanjewar",
                    "user_href": "/profile/Minakshi-Lanjewar"
                },
                {
                    "user_id": "Prince Sharma",
                    "user_href": "/profile/Prince-Sharma-72"
                },
                {
                    "user_id": "Preet Singh",
                    "user_href": "/profile/Preet-Singh-768"
                },
                {
                    "user_id": "Lata Janbandhu",
                    "user_href": "/profile/Lata-Janbandhu"
                },
                {
                    "user_id": "Anubhav Pohekar",
                    "user_href": "/profile/Anubhav-Pohekar"
                },
                {
                    "user_id": "Prabhakar Chandra",
                    "user_href": "/profile/Prabhakar-Chandra-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pratik Girase",
                "href": "/profile/Pratik-Girase-2"
            },
            "answer_text": "Seen many old answers on these and thought that I could update some of you people about AIIMS Nagpur AIIMS Nagpur has started functioning in its own campus in MIHAN since August 2019. Now coming back to the question, AIIMS is an institute of national importance, it doesn't mean that other GMCs are unimportant but the name AIIMS is enough to make your 1st impression good on someone if you study in AIIMS Now coming back to the question, the faculty and students at AIIMS Nagpur have achieved many feats within a short period and the growth of AIIMS Nagpur is very rapid. Sharing some of the achievements of AIIMS Nagpur during this lockdown    On the other hand GMC Nagpur is known for its large area, good study facilities and also a decent faculty. In the coming years, AIIMS Nagpur is going to be the best healthcare facility in central India, so if you study from AIIMS Nagpur you will be considered a great doctor. GMC Nagpur was established way back but its facilities can't compete those of AIIMS. Lastly about ragging, ragging is strictly prohibited in AIIMS Nagpur and our seniors are very friendly which means AIIMS Nagpur is completely free of ragging Though ragging is also prohibited in GMC Nagpur but the anti-ragging guidelines are not followed by the students and GMC Nagpur is well-known in Vidarbha for its ragging. So its upto you to choose which college do you prefer. ",
            "date": "Updated August 23, 2020",
            "views": "15",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anshul Chaurasia",
                    "user_href": "/profile/Anshul-Chaurasia-13"
                },
                {
                    "user_id": "Arul Agarwal",
                    "user_href": "/profile/Arul-Agarwal-1"
                },
                {
                    "user_id": "Abhishek Aryan",
                    "user_href": "/profile/Abhishek-Aryan-160"
                },
                {
                    "user_id": "Rushikesh Naik",
                    "user_href": "/profile/Rushikesh-Naik-13"
                },
                {
                    "user_id": "Ashish Kadam",
                    "user_href": "/profile/Ashish-Kadam-210"
                },
                {
                    "user_id": "Pandu Gorijavolu",
                    "user_href": "/profile/Pandu-Gorijavolu"
                },
                {
                    "user_id": "Kuldeep Das",
                    "user_href": "/profile/Kuldeep-Das-25"
                },
                {
                    "user_id": "Yogesh Maheshwari",
                    "user_href": "/profile/Yogesh-Maheshwari-33"
                },
                {
                    "user_id": "Gamers",
                    "user_href": "/profile/Gamers-40"
                },
                {
                    "user_id": "Shubham Sharma",
                    "user_href": "/profile/Shubham-Sharma-4431"
                }
            ]
        }
    ]
}