{
    "title": "Which are the scholarships for studying  abroad? - Quora",
    "tags": [
        "College Studying Advice",
        "Studying Abroad",
        "The College and University Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saurav Anand",
                "href": "/profile/Saurav-Anand-84"
            },
            "answer_text": "University Scholarships: University Scholarships have two types:i. Entrance scholarships: Most universities have entrance scholarships for which you will be considered as soon as you apply to the university. If your profile will be good enough, they will offer you the scholarship. ii. Application based scholarships: Now, many universities have application based scholarships as well. You will have to fill up a separate application to get the scholarship. These scholarships can be very specific like scholarships for girls who are studying computer science. 2. External scholarships: There are many external scholarships as well provided by external organisation to students studying abroad. Like Microsoft provides scholarships to international student studying computer science in USA or Canada. Some scholarships in Canada USA and Germany: USA NAFSA : U.S. Study Abroad Scholarships and Grants List FAFSA: FAFSA - Free Application for Federal Student Aid CANADA: Student Financial Assistance - Student Financial Assistance Welcome to ScholarshipsCanada.com! - scholarship search engine Scholarships for Canadian university for international students: 1. Vanier Canada Graduate Scholarship : Vanier Canada Graduate Scholarships 2. University of Waterloo International Master’s and Doctoral Awards : International student funding | Graduate Studies 3. Ontario Trillium Scholarship : Ontario Trillium Scholarship (OTS) | Graduate Studies 4. University of Manitoba Graduate Fellowships : University of Manitoba - Graduate Studies - 5. Trudeau Foundation Scholarships : Doctoral scholarships 6. Banting Postdoctoral Fellowships : Fellowship overview 7. Canada Graduate Scholarships – Master’s Program - Canada Graduate Scholarships-Master\u0092s Program 8. NSERC Postgraduate scholarships: NSERC - Prizes 9. Fairleigh Dickinson Scholarships for International Students: Fairleigh Dickinson University (FDU) 10. Government of Canada International Scholarships Program: International Scholarships 11. International Council for Canadian Studies: International Council for Canadian Studies 12. Canadian Scholarship Information for International Students: International Council for Canadian Studies 13. British Council – IELTS Award, 2018 – Canada Scholarships - 14. Ontario Trillium Scholarships (OTS), 2018 – Canada Scholarships 15. 3M National Student Fellowship, 2018 – Canada Scholarships 16. The Commonwealth Scientific and Industrial Research Organisation (CSIRO)- CSIRO Alumni Scholarship In Physics – Canada Scholarships 17. Daughters For Life Full Scholarship Program, 2018 – Canada Scholarships 350+ Canada scholarships for International students [2018-19] 18. Canadian Francophonie Fully Funded Scholarship Program in Canada, 2018 - Canadian Francophonie Scholarship Program Note: I also have a YouTube channel. If you are planning to come to Canada, you can check out my channel. I upload many important videos for international students which will help you ease the process of studying abroad. Please check out my channel once. Here is the link: https://www.youtube.com/channel/UCjYFA8kCC2HATu9U25ySBcw ",
            "date": "Answered September 6, 2018",
            "views": "35",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Emmanuel Ori",
                    "user_href": "/profile/Emmanuel-Ori"
                },
                {
                    "user_id": "Manasi Goswami",
                    "user_href": "/profile/Manasi-Goswami-2"
                },
                {
                    "user_id": "V Sachin",
                    "user_href": "/profile/V-Sachin"
                },
                {
                    "user_id": "Krishn Veer Singh",
                    "user_href": "/profile/Krishn-Veer-Singh-1"
                },
                {
                    "user_id": "Shraddha Harihar",
                    "user_href": "/profile/Shraddha-Harihar"
                },
                {
                    "user_id": "Kayode Benjamin",
                    "user_href": "/profile/Kayode-Benjamin-1"
                },
                {
                    "user_id": "Riti Shukla",
                    "user_href": "/profile/Riti-Shukla"
                },
                {
                    "user_id": "Mayank",
                    "user_href": "/profile/Mayank-617"
                },
                {
                    "user_id": "Harish K Advani",
                    "user_href": "/profile/Harish-K-Advani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Parth Singh Chauhan",
                "href": "/profile/Parth-Singh-Chauhan-5"
            },
            "answer_text": "Hey there! When we talk about scholarships to study abroad we need to keep a lot of things in mind, however, the following are the things to keep an eye for: Scholarships are of two kinds: Merit-based ScholarshipsNeed-Based ScholarshipsThere aren’t any specific tests that one needs to appear for scholarships. All merit-based scholarships are available for the students based on their application. Some of them can have separate essays depending on colleges. Most of the universities assess the applicants and share the scholarships along with the offer letters. Need-based scholarships have separate applications. They are mostly provided by external organizations based on your essays and admits. Similar to the college applications, these scholarships follow a process where you must create an application along with your documents including your acceptance letter from the university. They also have separate essay questions that one must answer. Having said that, the questions are quite similar to the college application questions that the students have written in the past. To get scholarships, a profile must be holistically developed. Thus, an ideal profile must be a combination of strong academia, good work experience, active participation in extracurricular activities, some volunteer work, to name a few. Additionally, you can also pursue multiple online courses that showcase your skills that have developed over a period of time If you need any help with how to apply to scholarships and identify the best ones for your courses, then please reach out to Leverage Edu. ",
            "date": "Answered September 10, 2020",
            "views": "64",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samriddhi",
                    "user_href": "/profile/Samriddhi-27"
                },
                {
                    "user_id": "Akshay Chaturvedi",
                    "user_href": "/profile/Akshay-Chaturvedi-5"
                },
                {
                    "user_id": "Pranika Dua",
                    "user_href": "/profile/Pranika-Dua-1"
                },
                {
                    "user_id": "Mehak Anand",
                    "user_href": "/profile/Mehak-Anand-6"
                },
                {
                    "user_id": "Aditi Gautam",
                    "user_href": "/profile/Aditi-Gautam-114"
                }
            ]
        }
    ]
}