{
    "title": "Which combination of IB courses should I take? - Quora",
    "tags": [
        "International Baccalaureate (IB)",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alvin Fujito",
                "href": "/profile/Alvin-Fujito"
            },
            "answer_text": "HL Biology vs Chemistry If you are a Mathematical person (like me), I think you would enjoy HL Chemistry course better. Biology needs a whole lot of memorization whereas Chemistry can be understood with less remembering. Prior to doing the IB, I was taking all 3 sciences (I really don’t know why). I was doing really well in Physics, quite okay in Biology, and a bit poor in Chemistry. For the final exam, I was struggling to memorize all the things for Biology (chapter tests are easy since it’s just a bunch of terms and diagrams). I also started to understand the logic behind Chemistry (we didn’t have a good teacher at the start). At the end, I was able to jump around 30% from my mock exam score in Chemistry whereas I fell a bit in Biology. If you are taking both, then I would suggest HL Chem and SL Bio. But if you just want to take one of the two (I’ll explain which possible subject you can take), then I suggest taking HL Chem. If you really like Mathematics that much: Further Mathematics HL or Computer Science HL/SL? If Math is your thing, maybe you can try taking more Mathematical subject such as the two above. A whooping 20.4% got 7 in Further Mathematics HL in the May 2016 session (compared to the 8.8% in Mathematics HL). I am currently taking both Mathematics HL and Further Mathematics HL and I think that is my best decision ever to do that. You can learn things that you never thought existed (Graph Theory, Number Theory, Group Theory, etc) and imagine spending 10 hours per week just to learn Math. That would be amazing. Computer Science HL/SL is also suitable for people who are good in Math, I wish I could have taken that but my school never offered it. It is in the Group 4 subject so one possible solution is to take Chemistry HL and Computer Science HL. HL Economy vs History Again, if Mathematics is your thing, I would suggest Economy since it has more logic. But if you want to have an escape in Math and would like to enjoy something else, then History is a perfect ground (since it’s so different). Conclusion Some subjects combinations that you can take from the discussion: Chemistry HL, Mathematics HL, Economy HL, 2 Language SL, Biology/Computer Science/History SLChemistry HL, Mathematics HL, F. Math HL, 2 Language SL, Econ/History SLChemistry HL, Mathematics HL, Computer Science HL, 2 Language SL, Econ/History SLChemistry HL, Mathematics HL, History HL, 2 Language SL, Biology/Computer Science/Econ SLCheers! If you want to ask anything, just comment bellow and I will try to answer :) ",
            "date": "Answered February 20, 2017",
            "views": "2",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "The Albinoman",
                    "user_href": "/profile/The-Albinoman"
                },
                {
                    "user_id": "Antony Abadir",
                    "user_href": "/profile/Antony-Abadir"
                },
                {
                    "user_id": "Kate Rose",
                    "user_href": "/profile/Kate-Rose-43"
                }
            ]
        },
        {
            "author_info": {
                "name": "Taha Dharamsi",
                "href": "/profile/Taha-Dharamsi"
            },
            "answer_text": "Hi there, First and most importantly I suggest you go visit a Career Counselor immediately. I was in the same situation but I hated Math. Long story short I changed my Major more than once. I suggest go for HL Chemistry as most Engineering Majors would require HL Chemistry. While most Science Majors (Bio Incl) will allow you to register with Chemistry instead of Biology. Go for HL Econ as it is easier to get a 7 and most Colleges will grant Micro and Macro Economics Credits for IB Econ. Also History is one of the toughest HL Subjects I think the last exam 7% got a 7 (fact check). Hands down SL Bio is easier but I would suggest you go for SL Physics as you can then apply for Engineering Majors. Cheers and Good Luck. ",
            "date": "Answered February 23, 2017",
            "views": "978",
            "upvotes": "0"
        }
    ]
}