{
    "title": "Which is the best python course on Udemy from scratch to professional? - Quora",
    "tags": [
        "Udemy (company)",
        "E-learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ambika Narang",
                "href": "/profile/Ambika-Narang-3"
            },
            "answer_text": "Well, frankly, up until a few months ago I was in a similar situation myself where I was on a lookout for quality sources that would have helped me master Python Programming language. Multiple challenges pervaded my journey of learning Python. But, now, after having been successful in my venture of bagging a high paying software development job (INR 9.1 LPA CTC ~ $12,000), fresh out of college at Ericsson, I believe, I should put an answer to this question so as to make your learning process less troublesome than mine. To become an expert in Python, it is essential to learn from an effective resource - the one that does no glide over topics, the one that considers that students are new to the domain and are not well adept with the Python Programming environment, the one that explains why the program is executing the way it is executing. Now, to master Python Programming language, I had left no stone unturned. I had purchased plethora of courses, books, PDF material, etc., but I always used to hit a wall after a few days into the learning. In majority of the cases, I felt that the author/tutor was in a hurry to get to the end of the course and was not educating the rationale behind writing those pieces of code and assuming that one is well versed with the Python Programming environment. However, that is not the case with someone who is a beginner in this domain.  I dropped the idea of learning from those resources, and instead resorted to YouTube. However, soon I realized two major issues associated with learning from YouTube:- One cannot prove of one’s grasp on the subject to potential employers, due to no provision of obtaining certification for the courses completed on YouTube. This may hinder one’s career, especially in cases where employer has set a criteria of choosing candidates with relevant degree/certificate.YouTube being a ‘free and open for all’ community attracts lots of creators who are considering to make a quick buck. Content quality of such tutorials is questionable.Now, the resource that finally helped me master Python Programming language was Jose Portilla’s Python Programming Course. I found some of the other courses on some of the similar websites designed from a professional perspective, for someone who already has his all the concepts on point and requires just some finishing touches. However, a beginner, who has little grasp on the field would not find himself at ease by taking courses from those platforms. Whereas, with this website, one can find courses specific to one’s skill set and level of understanding of the subject. From very basic to ultra advanced, there is a course for all genres, hence I opted for the course. If you wish to read more about my journey of how I, a complete amateur in Python Programming, mastered the subject, and eventually bagged a high-paying job in one of the software giants, you may consider reading my answer - Ambika Narang's answer to How should I start learning Python? I hope my journey through pits and falls and multiple roadblocks to eventually bagging a dream job, would save you time, money and would make your learning experience better and less troublesome than mine. Best wishes. Take care. ",
            "date": "Answered June 2, 2020",
            "views": "75",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rajat Jain",
                    "user_href": "/profile/Rajat-Jain-291"
                },
                {
                    "user_id": "Abdus Samad",
                    "user_href": "/profile/Abdus-Samad-668"
                },
                {
                    "user_id": "Dharaneshwar Gowd",
                    "user_href": "/profile/Dharaneshwar-Gowd"
                },
                {
                    "user_id": "Vamsi Kiran",
                    "user_href": "/profile/Vamsi-Kiran-48"
                },
                {
                    "user_id": "Rushad LAMBE",
                    "user_href": "/profile/Rushad-LAMBE"
                },
                {
                    "user_id": "Nasreen Parween",
                    "user_href": "/profile/Nasreen-Parween-3"
                },
                {
                    "user_id": "Harsh Khatwani",
                    "user_href": "/profile/Harsh-Khatwani-3"
                },
                {
                    "user_id": "Aniruudh Kannan",
                    "user_href": "/profile/Aniruudh-Kannan"
                },
                {
                    "user_id": "Suyog Nimbre",
                    "user_href": "/profile/Suyog-Nimbre-1"
                },
                {
                    "user_id": "Sonu Bhuva",
                    "user_href": "/profile/Sonu-Bhuva-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Flavian Mwasi",
                "href": "/profile/Flavian-Mwasi"
            },
            "answer_text": "Python is a great programming language that is taking the world by storm and increasingly becoming ubiquitous. These days, you don’t need to look twice at various popularity indexes and surveys such as TIOBE, PYPL and Stack Overflow, to notice that industrial forces and academia are using sheer brute force to drive this 28-year old programming language into uncharted territory. I think the turning point for Python came when Django was released in 2005 alongside other popular Python web frameworks such as Pylons, Pyramid, TurboGears, web2py, Tornado, Flask, Bottle and Zope. That being said, learning Python now, is a major investment, considering the estimated growth curve of the language between now and 2025 in popular surveys. Learning Python from popular MOOCs like Udemy is becoming a popular trend among programmers and professionals of every discipline. To answer the question, I think you should look out for courses that are marked “Bestseller” at Udemy, although that doesn’t mean the other courses are not good. Udemy has hundreds of programming courses. I listed a few that I think are relevant, but you can also explore the Udemy website for other suitable courses. Complete Python Bootcamp: Go From Zero To Hero In Python 3 (Bestseller) Complete Python Masterclass [Popular] The Complete Python 3 Course: Go From Beginner To Advanced! [Popular] Python and Django Full Stack Web Developer Bootcamp (Bestseller) Learning Python for Data Analysis and Visualization (Bestseller) More Resources: Savvy Python Developer ",
            "date": "Answered September 14, 2018",
            "views": "17",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Siddhant Sinha",
                    "user_href": "/profile/Siddhant-Sinha-27"
                },
                {
                    "user_id": "Nihad Rahim",
                    "user_href": "/profile/Nihad-Rahim"
                },
                {
                    "user_id": "Arnav Deshmukh",
                    "user_href": "/profile/Arnav-Deshmukh-14"
                },
                {
                    "user_id": "Vinita Raikwar",
                    "user_href": "/profile/Vinita-Raikwar-2"
                },
                {
                    "user_id": "Anupam Kumar Anand",
                    "user_href": "/profile/Anupam-Kumar-Anand"
                },
                {
                    "user_id": "Chettiar Murugalakshmi",
                    "user_href": "/profile/Chettiar-Murugalakshmi"
                },
                {
                    "user_id": "Swarna Herle",
                    "user_href": "/profile/Swarna-Herle"
                },
                {
                    "user_id": "Prasanna Herle",
                    "user_href": "/profile/Prasanna-Herle"
                }
            ]
        }
    ]
}