{
    "title": "Which would be better between AIIMS Bhopal & AIIMS Raipur as of 2016? - Quora",
    "tags": [
        "College Advice in Bhopal, Madhya Pradesh, India",
        "College Advice in Raipur, Chhattisgarh, India",
        "All India Institute of Medical Sciences, Raipur",
        "All India Institute of Medical Sciences, Bhopal",
        "Raipur, Chhattisgarh, India",
        "Bhopal, Madhya Pradesh, India",
        "All India Institute of Medical Sciences (AIIMS)",
        "University Exams and Tests",
        "Education",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ijya Pandey",
                "href": "/profile/Ijya-Pandey"
            },
            "answer_text": "AIIMS Bhopal. Hands down. As of now, we share a director. Hostel- AIIMS B has better hostel facilities. We have LAN and good wifi. Boys hostel especially is lax with rules, so no hostel timings to be followed. Girls aren't so lucky, but our hostel timings is till 10 PM (you can stretch it to 10:30 :D). Single rooms, very spacious. As I have written in another answer, good furniture too. 1st years have to share rooms, 2 in a room.2. Life- I'm loosely calling this section ‘life’. Bhopal is quite developed as compared to Raipur and anyway, Raipur campus is not near the main city. Raipur students (please correct me if I'm wrong) have to take the college bus to go to college. Imagine missing a bus because you snoozed for 5 more minutes. College in A-B is really close, you can hang around and use wifi and download to your hearts content. Raipur has centrally air conditioned college and they have a proper library building We have a room full of books and a couple of reading rooms. You'll attend a lot more concerts being in Bhopal, there are many restaurants and multiplexes, beautiful gardens, Upper Lake, Shahpura lake, Van Vihar national park, Manav sanghralaya etc to go hang out with your friends. Further, you can go to Pachmarhi, Sanchi, Bhimbhetka etc which are famous tourist places all over the country. So you have a ton of places to go with your friends. 3. Faculty and studies- awesome faculty(mostly) and standard of question papers in exams is far higher. There is strict marking scheme. Scoring in A-B is not easy. Some faculty (especially clinical) is erudite. I'm not kidding, they will blow your mind with their conceptual clarity. ECG- a topic unclear to most undergrads is something which was taught with such beauty that it became easy for us to interpret them! We use the best textbooks here. Mostly foreign autgors. So everyone studies from ganong, guyton, gray’s anatomy, Robbins, Harrison etc. 4. Guest lectures- many guest lectures are frequently being conducted nowadays. We had ENT conference, international winter school of oncology’s first edition organised by our pathology department. 5. Clinical postings- 7th sem clinical postings are simply the best. I have been posted in ICU, including night shifts, I was posted in ECHO for 2 days, I performed ECG on 20 patients, I had an amazing CFM/PSM posting- a perfect blend of work and play. I helped investigating a malaria outbreak, I have used a fetoscope thrice in the field…the list goes on. Basically A-B is a place with rather limited facilities but good teachers (again, mostly). The hospital construction has been delayed multiple times, huge question mark on faculty recruitment (there is no consultant psychiatrist as of now, only 1 clinical psychologist. No consultant ophthalmologist.) Despite its shortcomings, Bhopal should be your top choice. Hope I covered everything. ",
            "date": "Answered September 2, 2016",
            "views": "51",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Namrata Panda",
                    "user_href": "/profile/Namrata-Panda-18"
                },
                {
                    "user_id": "Adarsh",
                    "user_href": "/profile/Adarsh-534"
                },
                {
                    "user_id": "Shubham Sharma",
                    "user_href": "/profile/Shubham-Sharma-4431"
                },
                {
                    "user_id": "Rashmi Rekha Dash",
                    "user_href": "/profile/Rashmi-Rekha-Dash-3"
                },
                {
                    "user_id": "Jeril Jose",
                    "user_href": "/profile/Jeril-Jose-30"
                },
                {
                    "user_id": "Md Faizan Memon",
                    "user_href": "/profile/Md-Faizan-Memon"
                },
                {
                    "user_id": "Sumanth JKHS",
                    "user_href": "/profile/Sumanth-JKHS"
                },
                {
                    "user_id": "Suvrodeep Mukherjee",
                    "user_href": "/profile/Suvrodeep-Mukherjee-1"
                },
                {
                    "user_id": "Usha Jena",
                    "user_href": "/profile/Usha-Jena-1"
                },
                {
                    "user_id": "Pratyush G Parikh",
                    "user_href": "/profile/Pratyush-G-Parikh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Himank Gupta",
                "href": "/profile/Himank-Gupta-11"
            },
            "answer_text": "I would say stick with Raipur if you dont mind the city. Bhopal is a much better city but infrastructure wise Raipur is a bit better. Also, Bhopal has better hostels. That I can assure you. ",
            "date": "Answered July 21, 2016",
            "views": "19",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Piyush Bharti",
                    "user_href": "/profile/Piyush-Bharti-11"
                },
                {
                    "user_id": "Sanjay Gangurde",
                    "user_href": "/profile/Sanjay-Gangurde-9"
                },
                {
                    "user_id": "Abhijeet Kumar",
                    "user_href": "/profile/Abhijeet-Kumar-843"
                },
                {
                    "user_id": "Pulkit Patidar",
                    "user_href": "/profile/Pulkit-Patidar"
                },
                {
                    "user_id": "Yashpriya Nayak",
                    "user_href": "/profile/Yashpriya-Nayak"
                },
                {
                    "user_id": "Deepak Mskt",
                    "user_href": "/profile/Deepak-Mskt-1"
                }
            ]
        }
    ]
}