{
    "title": "Which chapters are important in biology for the NEET? - Quora",
    "tags": [
        "National Eligibility cum Entrance Test (NEET)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Piyush Jaju",
                "href": "/profile/Piyush-Jaju-1"
            },
            "answer_text": "Actually, for getting a good rank in NEET, you need to focus on each and every sentence of NCERT rather than going for important chapters. Many times questions are asked from not so important concepts. However such questions decide your rank as a single mistake can lower your rank by thousands. Firstly you should read each and every sentence from NCERT. However the important topics are Cell division: The topic is very conceptual and requires deep understanding as well as reading from reference books to get a better grip on it. Some of the concepts would also help you in Genetics chapter.Biomolecules: It is an important chapter especially the enzymes part which is very prone for questioning. Also you need to properly study the Nucleic acid part as it would help you in understanding Genetics topic well.Plant Physiology: Again it is an important unit but not many extra NCERT questions are asked from this unit.Human Physiology: It's the most important unit from 11th standard as well as much scoring unit. Many extra NCERT questions have been asked from this unit. You need to be very perfect in the concepts for this topic. And most importantly, the nervous system and hormones units are very very prone for extra NCERT questions.Plant Morphology and Anatomy: Actually these topics are scoring as well as easy. But they are very volatile and you require to revise them again and again. Also for morphology, you need to read from reference books as many extra NCERT questions asked from the topic. But the topic is easy to understand, difficult to remember.Human Reproduction and Reproductive health: These topics are very important to get a good score. You must read from reference books as at least one extra NCERT question is asked from these topics every year and the question proves to be the rank decider. Also many conceptual concepts are asked from these topics. So you need to be very clear with concepts.Genetics (CBI and MBI) : These are the most complicated and conceptual topics for neet syllabus. You need to be very clear with the concepts as many of the level 3 questions are asked from these topics. These topics also consume much of your preparation time. Sometimes numerical based questions can also be asked. You should read from reference books to get a better grip on the concepts.Biotechnology: The topic is very difficult to understand and is very conceptual. But actually not many questions are asked from this unit. Also, the questions from this unit are straight forward and directly from NCERT. So you don't need to read too many references for this unit. In short, the topic is difficult to understand but the questions on the topic are much easier.Ecology: The topic is highly scoring unit and much prone for extra NCERT questions. You need to read from different reference books. The first two chapters are somewhat difficult to understand but the last two topics require much of by hearting the points. You also need to by heart the names of national parks and the animal associated with it as well as its location, the dates of important national and international days like ozone day, Earth day, etc., recent information related to pollution laws, etc. In a nutshell, one needs to read from many references as well as NCERT to get a good rank.",
            "date": "Answered October 15, 2018",
            "views": "147",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Deepthi A",
                    "user_href": "/profile/Deepthi-A-42"
                },
                {
                    "user_id": "Ashish K Shah",
                    "user_href": "/profile/Ashish-K-Shah-3"
                },
                {
                    "user_id": "Farhan Zahoor",
                    "user_href": "/profile/Farhan-Zahoor-7"
                },
                {
                    "user_id": "Paarth Bajaj",
                    "user_href": "/profile/Paarth-Bajaj-2"
                },
                {
                    "user_id": "VEDI BALAN",
                    "user_href": "/profile/VEDI-BALAN"
                },
                {
                    "user_id": "Bedabratt Kashyap",
                    "user_href": "/profile/Bedabratt-Kashyap"
                },
                {
                    "user_id": "Rucha Salunke",
                    "user_href": "/profile/Rucha-Salunke-1"
                },
                {
                    "user_id": "Sunshine",
                    "user_href": "/profile/Sunshine-965"
                },
                {
                    "user_id": "Bhagyashree Sahoo",
                    "user_href": "/profile/Bhagyashree-Sahoo-39"
                },
                {
                    "user_id": "Lalita Kalura",
                    "user_href": "/profile/Lalita-Kalura"
                }
            ]
        },
        {
            "author_info": {
                "name": "Viswanathan V",
                "href": "/profile/Viswanathan-V-32"
            },
            "answer_text": "Rather than chapters I suggest Unit wise prep would be more easier and effective. NEET is not difficult, so strictly NCERT for biology and chem must be followed.If portions are done well before the exam then I would suggest MTG Champ/Fingertips. Now coming to units with high weightage Human physiology(11th) : As the sole purpose of NEET is to get through to medical courses this chapter will be given the highest weightage in the exam. First learn the text line by line or at least make a point to remember everything in text including the supplementary material at the end of the text book.I personally would suggest to know a bit more than what is given in the text as around 10–15 questions come up every year and around 1–3 are asked in a detailed way which is not clearly given in text.If you’re going for coaching classes read the text and their material for this chapter.Genetics (12th) : This is another vast unit conceptually and is not easy. Get to know the concepts in detail and learn everything from the text thoroughly.It’s weightage is equivalent to human physio(including evolution) so learn well.If you want extra details and points refer MTG. Just in case know the types and ratios for epistasis.Plant physiology(11th) : The purpose of botany/Physics in NEET is solely to filter the students. So must read unit.Learn all 5 chapters thoroughly and conceptually.You can expect at least 7 questions from here. Learn all these three chapters as slow as possible. Take your time to master the concepts.Biotechnology (12th): Easy unit,only two chapters.Don’t take lightly . Master the concepts (nothing much still do it).Relatively question to chapter(number) ratio is better.Here I feel two units clash like Reproduction/Ecology (12th).Repro has a lot of concept and data unlike eco which has only data and nothing much to read from eco. Still it clashes because there is a possibility of asking practical questions(recent affairs) from eco. So it’s your call on the chapter.Plus learn structural organisation in animals and ONLY cockroach anatomy.The other two(frog and earthworm are not for neet)After this you’ll have one unit from 12th.Fully data and go for it first. Now 12th done 11th has the first three units.I kept classification last because the volume does not match the number of questions and sometimes extra portions can also be asked.You could follow cells, plants,classification based on your choice. No 1–5 will have the major chunk of questions and around 200–250+ can be scored if done properly.12th is easier than 11th in both volume and concepts so learn 12th first if you are a dropper.If you are currently in 12th learn thoroughly now and after boards revise important chapters in 11th(dont start classification start human and plant physio and tissues).If you are in 11th learn everything from beginning and just dont lose the flow and stop. Best of luck and any doubts ask me at viswa999b@gmail.com. ",
            "date": "Answered June 29, 2018",
            "views": "298",
            "upvotes": " View 46 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Himank Yadav",
                    "user_href": "/profile/Himank-Yadav-5"
                },
                {
                    "user_id": "Nancy Angom",
                    "user_href": "/profile/Nancy-Angom-1"
                },
                {
                    "user_id": "Joe Nisha",
                    "user_href": "/profile/Joe-Nisha-2"
                },
                {
                    "user_id": "Rose Das",
                    "user_href": "/profile/Rose-Das-12"
                },
                {
                    "user_id": "Rishabh Jain",
                    "user_href": "/profile/Rishabh-Jain-1725"
                },
                {
                    "user_id": "PRINTS SHOP",
                    "user_href": "/profile/PRINTS-SHOP"
                },
                {
                    "user_id": "Anupam Kar",
                    "user_href": "/profile/Anupam-Kar-7"
                },
                {
                    "user_id": "Samuel Panmei",
                    "user_href": "/profile/Samuel-Panmei-4"
                },
                {
                    "user_id": "Radha Bhandarkar",
                    "user_href": "/profile/Radha-Bhandarkar"
                },
                {
                    "user_id": "Yashas S",
                    "user_href": "/profile/Yashas-S-35"
                }
            ]
        }
    ]
}