{
    "title": "Which country is best to study MBBS in English at low cost? - Quora",
    "tags": [
        "Studying Abroad",
        "Bachelor of Medicine and Bachelor of Surgery Degrees",
        "Medical School"
    ],
    "response": [
        {
            "author_info": {
                "name": "Basiruddin Shaikh",
                "href": "/profile/Basiruddin-Shaikh"
            },
            "answer_text": "Which country is best to study MBBS in English at low cost? Thank you very much in advanced to be here and read Quora answers. Well, You are searching for the best country to study MBBS in english at very low cost.  As I am an education counselor, in my experience I can say Bangladesh, Nepal, Philippines, China are the best countries for you to study MBBS. Because these are the neighbor countries to India and the culture, atmosphere, education system& all others things are same as in India. That is why you can feel home away from home India. There are many students are going to these countries to complete their MBBS study each and every year. You can study your MBBS in english also. Total cost of studying MBBS in these countries around 30K USD to 55K USD which is very reasonable cost compare to any other countries. Hope it helps you to understand better. Thanks & Best Regards, Basiruddin Shaikh ",
            "date": "Answered April 12, 2019",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Preethi Selvaraj",
                "href": "/profile/Preethi-Selvaraj-30"
            },
            "answer_text": "Russia is the best country to study MBBS in English at low cost. Making MBBS in Russia is a good option for Indian medical students. In Russia, some of the best medical universities have a fee that is one-fifth of an average Indian medical institution. Most of the medical universities in Russia are recognized by WHO and MCI and other major medical councils in the world. Affordable fee for MBBS program also attracts students to pursue MBBS in Russia. Indian students who pass MBBS from Russia Medical University are eligible for MCI screening test in India. Want to study MBBS in Russia at top Universities!! enroll now: skolarrssolutions ",
            "date": "Answered August 5, 2019",
            "views": "727",
            "upvotes": "0"
        }
    ]
}