{
    "title": "Which course is best to learn online to work from home if I am interested in computers? - Quora",
    "tags": [
        "Online Training",
        "E-learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Muhammad Imad Khan",
                "href": "/profile/Muhammad-Imad-Khan"
            },
            "answer_text": "Alright, just like others it seems you are also obsessed with online earnings. But your question is quite a generic one. You are interested in computers but don’t have any idea from where and how to start in. First, you need to define what field you are interested in. What kind of skills do you want to have mastery in? You have to find the niche you have the passion for. I know you know there are tens of hundreds of ways to make money online. And you might be trapped by shiny object syndrome. That’s why I am insisting on defining your niche so you can enjoy working even for the rest of your life in that specific area. Remember first thing first! Once you are done with your mission “Define your Niche, then you are good to go. Now its time to start learning, getting expertise and to simply excel. Let me make it a bit more easy for you. These are the skills you can start with. Graphics DesigningWeb DevelopmentDigital MarketingBlogging and writingAffiliate MarketingVloggingSEOVirtual AssistantshipYouTubeWhiteboard Animationsand so on… This is just an exhaustive list. You will find thousands of ways to make money online. Moreover, you can even try sub-niches, for instance, logo designing, in case you opt for graphics designing. Now you will probably be wondering where you can sell your services. so here is a list you can check into: Fiverr - Freelance Services Marketplace for The Lean EntrepreneurUpwork, the world's largest online workplaceHire Freelancers Online & Find Freelance WorkGuru - Hire Quality Freelancers and Find Freelance JobsThere are tens of hundreds of ways besides the ones I mentioned. Once you are clear in your interests, you can find thousands of videos and courses (of course Free and Paid both) for that particular field on the sites like… YouTubeOnline Courses - Learn Anything, On Your Schedule | UdemyLynda: Online Courses, Classes, Training, TutorialsOnline Classes by Skillshare | Start for Free TodayI hope it clears everything. ",
            "date": "Answered October 11, 2017",
            "views": "761",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "R Apostle",
                    "user_href": "/profile/R-Apostle"
                },
                {
                    "user_id": "Nirmal Borah",
                    "user_href": "/profile/Nirmal-Borah"
                },
                {
                    "user_id": "Ravi Gupta",
                    "user_href": "/profile/Ravi-Gupta-188"
                },
                {
                    "user_id": "Prashaant Jain",
                    "user_href": "/profile/Prashaant-Jain-1"
                }
            ]
        }
    ]
}