{
    "title": "Which would be the best school in Kottayam? I completed class 10. - Quora",
    "tags": [
        "Kottayam, Kerala, India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Mathew",
                "href": "/profile/Andrew-Mathew-4"
            },
            "answer_text": "Good Shepherd Public School. Its in Thengana , Changanacherry. Its the ideal place to have the high school life we all want. The teaching is amazing. All the teachers are always well prepared and well versed in their fields. The Mathematics department in particular is why many students come to GSPS. In the beginning I had a hard time adjusting to the school. But I assure you no one ever leaving that school said they meant anything they had said when they joined. All the best for your future! ",
            "date": "Answered April 10, 2018",
            "views": "890",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pramod Kumar",
                    "user_href": "/profile/Pramod-Kumar-7299"
                }
            ]
        },
        {
            "author_info": {
                "name": "Theresa",
                "href": "/profile/Theresa-220"
            },
            "answer_text": "First of all the best school above will only focus on topper..so what ever school you wish to go it I should who need to study..if you want to prepare for entrance exam Placid Vidya vihar Good Shepard SAPS KE mannanam ….etc will do .. But once you enter the school you will understand the level of competition you need to face …students are much more focused on studies…believe me..I scored 300 rank in neet and went to one of the school in Kottayam not so famous… But whatever it is donot sacrifice your mental and physical health on it … If you want to score good marks in plus two study well follow what taught in class .. nothing else. ",
            "date": "Answered March 23, 2019",
            "views": "15",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jyothir Adithya Narayan",
                    "user_href": "/profile/Jyothir-Adithya-Narayan"
                },
                {
                    "user_id": "Haripriya Pramod",
                    "user_href": "/profile/Haripriya-Pramod-1"
                },
                {
                    "user_id": "Pramod Kumar",
                    "user_href": "/profile/Pramod-Kumar-7299"
                },
                {
                    "user_id": "Amika John",
                    "user_href": "/profile/Amika-John"
                },
                {
                    "user_id": "Vijayakumar Sukumaran",
                    "user_href": "/profile/Vijayakumar-Sukumaran"
                }
            ]
        }
    ]
}