{
    "title": "Who gave the name to chemistry? - Quora",
    "tags": [
        "Etymology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dark Chakra",
                "href": "/profile/Dark-Chakra"
            },
            "answer_text": "Chemistry wasn’t “discovered” as such. However, its beginnings lie very deep in history, in around perhaps -585 (585 BCE, my way of writing ), to name some sort of Thales of Miletus. Now Thales was a philosopher. And like many core sciences, back then they were all known as Philosophy. They were no experiments they would conduct to validate their truths as we would today. Rather, philosophers like Plato would think that “if enough clever men argued for long enough, truth eventually would result.” Right now we’re in Greece. Ancient Greece. Thales thought—apparently looking at water becoming solid, liquid to eventually vapour—all matter, yourself included, is composed of water. Only in their different forms. Not bad, in his days. Around 150 years later, came Empedocles, musing that in fact, all matter is made Four Elements: Fire, Wind, Earth, and Water. And everything you see around us is either one of those or an indirect combination of those. Surprisingly enough, little was refined of his theory until the 17th Century, by the French Antoine Lavoisier (/Aa-Twann La-Vwah-Zier/). Meanwhile, there had been massive jumps in the way we do Chemistry, in the way we think Chemistry is, and our purpose in Chemistry. In around the late 8th Century, during the expansion of Islam, the Abbasid Caliphate was established in Baghdad, marking the beginning of the Golden Age of Islamic Civilisation, lasting for about 5 centuries. They built a House of Wisdom, apparently guided by the Quranic slogan “the ink of the scholar is more Holy than the blood of a martyr”. During this Era, there had been massive development in a plethora of sciences, Chemistry included. Then called by the name of Alchemy (al-Kimiya). One of the scientists, Alhazen (Ibn Haytham in Arabic), decided that it wasn’t enough to just think about things and draw conclusions about them. He wanted more proof. And later devised what scientists now call “the Scientific Method”. It was a rough draft, at the time. Certainly not as complete as today’s standard. But this was what helped him invent what approximates today’s “Pinhole Cameras”. And later revolutionalise the methods of Chemistry. Meanwhile, Arab alchemists had begun to develop tools and techniques to further their understanding while trying to reach the end goal of the science itself: being able to transform ordinary (“impure”) metals into Gold, the “purest” matter on Earth. On the way, these scientists had discovered and coined in many new terms that are now conserved, to name the “alambic”, “alkali”, “alcohol” and “elixir” (“al-Ikthir”). “Al-” meaning “the” in Arabic. As time passed, their knowledge was passed into Europe where it reached it apogee, in the 12th Century. Long story short (I’m stretching a bit of my knowledge around here ), scientists had started to abandon their quest for the Philosopher’s Stone, and at this stage a lot of Christianity had gotten into the show. In 1661 German Werner Rolfink disproves the concept of “Transmutation”, in other words rendering Alchemy a vain cause, while Nicholas Lemery writes diatribes against alchemists. Later Antoine Lavoisier proves that fire is actually made of different elements and isn’t one of its own. He devises a certain nomenclature (convention of naming things) based on these “elements”, tearing down the Four Elements Theory—“the Four Humours” by then. Chemistry is born. What a journey! ",
            "date": "Answered June 12, 2019",
            "views": "168",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vir Gupta",
                "href": "/profile/Vir-Gupta-1"
            },
            "answer_text": "ORIGIN OF THE NAME \"CHEMISTRY\"\nThe Greek word \"chemeia\" first appears in about the fourth century and was used to designate the art of metal-working, especially the possible change of base metals into gold and silver. The Arabs later prefixed the article \"al\" and \"alchemy\" came finally to signify the arts of chemistry in general. \"Chemeia\" was probably derived from the Greek word chemi which means \"black\". There are three possible reasons for the use of this word: The black soil of the Nile Valley gave the Greeks the name Chemi for Egypt where the chemical arts presumably originated.A certain \"blackening\" process was frequently mentioned as a preliminary to whitening or yellowing of silver or gold.In the sense of \"dark\" or \"hidden\", since the Dark, Hidden or Divine Art was the only name by which this science was known to the ancients.Some hold that the word chemistry had a Chinese origin. It may have been derived from the Hakka term KIM-MI or the Cantonese term KEM-MAI, which signifies \"gone astray in search of gold\" or \"secret of gold\". They are suggested to be the origin of the Greek \"chemeia\", the French \"chimie\", the German \"Chemie\", and the Arabian \"alchemy\". ",
            "date": "Answered January 29, 2020",
            "views": "138",
            "upvotes": "0"
        }
    ]
}