{
    "title": "Who gets to name the animals of the animal kingdom? - Quora",
    "tags": [
        "Animal Kingdom"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Pierce",
                "href": "/profile/Richard-Pierce-25"
            },
            "answer_text": "The first person to scientifically describe and publish the description of the animal gets to name it in accordance with the rules established by the International Code of Zoological Nomenclature (ICZN). The scientific process of describing an animal is more than just writing a description. You also need to explain how the new animal is different from similar animals, which usually means you have to be an expert in that particular group of animals. You need to pick an individual specimen and designate as the Holotype. The holotype is the name bearer. If there is any question regarding the identity of the species, the holotype is the specimen to examine. It is Important to deposit the specimen in a legitimate museum where it will be properly preserved and made available to other scientists to study. The description must be published, usually in a scientific journal. Publication can be online if certain criteria are met. The purpose is so people have a reasonable likelihood of seeing the description if they go looking for it. You can’t just run off a few copies of the description and hand them out to your friends. Scientific names have 4 parts. The genus name is first. This is somewhat equivalent to a person’s surname. It tells which other species are most closely related. Most likely, the new species will fit into an existing genus, so you don’t get to make up that part. Sometimes an animal is different enough to merit its own genus, in which case the describer gets to select or create a genus name. The genus name is always a latinized word. When written it is always capitalized and either italicized or underlined. The genus name cannot already be used by another group of animals. The second part is the species epithet. This is what all original describers get to choose. It is also always latinized, and must match the case and gender of the genus name. It can be almost anything other than a word that is vulgar or insulting. It is considered very bad form to name an animal after one’s self. Most often it describes some character of the organism or is named in honor of a person. The combination of genus and species must be unique, but the species epithet can be used by a member of another genus. For example there is a nematode worm named Caenorhabditis elegans and a fish named Aphyosemion elegans. The species epithet is never capitalized, but is also italicized or underlined when written. The 3rd and 4th parts of the scientific name are the names of the author or authors who wrote the description and the year that the description was published. If the species has been moved from the original genus in which it was placed, the author and date will be placed in parentheses. In publication, the full name including author and date are usually only given once at the beginning of the document. After that only genus and species are typically used. In some cases it is also common to abbreviate the genus name with just the first letter, as long as it doesn’t lead to confusion. Since I have previously used the full names, I can refer to C. elegans and A. elegans. Notice how the abbreviation is still capitalized and italicized. There are similar rules for naming plants, bacteria and other organisms. Nowadays it is typical to include some genetic information on the new species. Common names can be suggested by the describers, but often an animal already has several common names, often in different languages or in different areas of its distribution. There are no rules for common names, which is why scientific names exist. The bird name “robin” is used for two different birds in North America and Europe. Common names may also change over time. Some North American Freshwater Mussels were given common names that used words now considered to be racially insulting. In the United States, birds are given “official” common names by the American Ornithological Society (which has ironically changed its name from the American Ornithologist’s Union). In the United States fish are also given “official” names by the American Fisheries Society. These names are less “official” than scientific names. Animals not commonly known to the public may also have no common name, just a scientific name. For example the nematode C. elegans has no common name. Scientists working with it just say C. elegans. Adding a common name would actually just confuse things. ",
            "date": "Answered February 14, 2020",
            "views": "105",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amber Luck",
                    "user_href": "/profile/Amber-Luck-2"
                },
                {
                    "user_id": "Carmal Hill",
                    "user_href": "/profile/Carmal-Hill"
                },
                {
                    "user_id": "Eric Alfred",
                    "user_href": "/profile/Eric-Alfred-7"
                }
            ]
        }
    ]
}