{
    "title": "Who is a better president, Obama or Trump? - Quora",
    "tags": [
        "Barack Obama (politician)",
        "Donald Trump (politician, business person)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Claire Callahan Goodman",
                "href": "/profile/Claire-Callahan-Goodman"
            },
            "answer_text": "Another Quora “statement formatted as a question”. This is not a question. You are stating your (very rare) opinion that somehow a buffoon with a head completely empty of any relevant information needed to do the job of President of the US (Trump) is more “presidential” than a black man who will go down in history as a very superior POTUS. Tweeting, quoting far-right websites and bloggers, repeatedly going back to revel in his extremely close win in the election, hiring his completely inexperienced relatives to do jobs in which they have no experience, hiring wealthy CEOs for jobs which require the education and experience of people in government, PRAISING REPEAT SEXUAL HARRASSER BILL O’REILLY…I could go on and on. Obama, by contrast, understood the role of President of the US and took it very seriously. I cannot even imagine Obama commenting on Bill O’Reilly or on any matter not concerning directly his duties as POTUS. IMHO, Trump is a bumbling idiot who barely has the vocabulary of a 4th grader. If he can possibly tweet something stupid and embarassing, he will do that. He gets his information from Fox “news” and right wing blogs and websites. He blatantly lies to the public, on video, about things which matter a lot, and things which don’t matter at all - like how many people attended his inauguration. He consistently puts blame on anyone but himself. He apparently does not understand the role of the State department and has hired a completely inappropriate person as Secretary of State. Yesterday, someone got Facist war-monger Bannon out of the National Security Council. Today, Nunes recused himself from the committee he chaired. Gorsuch has been accused of Plagiarism. Trump’s son-in-law may nbe an intelligent person, but once again he has no experience or training for the multiple jobs he has been given. If Jared Kushner is smart enough to hire the right people to plan, execute and manage these task areas, he may be somewhat successful. Perhaps it is Kushner who advised Trump to remove Bannon and advised Nunes to step down. Trump lies automatically about everything, and he then persists in maintaining the lies are true despite ample evidence that they are not. This is not “presidential”. This man also vilified his opponent (Clinton) using propaganda made up from whole cloth by Bannon and others. What remains to be seen is whether or not Trump ends up in an orange jumpsuit, or whether his “helpers” will take the fall. ",
            "date": "Answered April 6, 2017",
            "views": "56",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hasan Khan",
                    "user_href": "/profile/Hasan-Khan-236"
                },
                {
                    "user_id": "Michael T. Koralewski",
                    "user_href": "/profile/Michael-T-Koralewski"
                },
                {
                    "user_id": "Jessica Turnman",
                    "user_href": "/profile/Jessica-Turnman"
                },
                {
                    "user_id": "Palak Porwal",
                    "user_href": "/profile/Palak-Porwal-6"
                },
                {
                    "user_id": "Rick Kryston",
                    "user_href": "/profile/Rick-Kryston"
                },
                {
                    "user_id": "LaTashua Joseph",
                    "user_href": "/profile/LaTashua-Joseph-1"
                },
                {
                    "user_id": "Michelle Huntington Wells",
                    "user_href": "/profile/Michelle-Huntington-Wells"
                },
                {
                    "user_id": "Barney Buckley",
                    "user_href": "/profile/Barney-Buckley-4"
                },
                {
                    "user_id": "Catherine Doran",
                    "user_href": "/profile/Catherine-Doran-15"
                },
                {
                    "user_id": "Akif Ul Islam",
                    "user_href": "/profile/Akif-Ul-Islam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ross Cohen",
                "href": "/profile/Ross-Cohen-1"
            },
            "answer_text": " As Mac Booker's answer noted, it is too soon to say for sure, since President Obama is still in office. However, that answer was written 2.5 years ago. Now that President Obama has completed his first term, we have enough information for a preliminary judgment, reserving the right to revise it later. At this point, I would say: Yes, Barack Obama is a better President than George W. Bush. There are many areas on which to judge so I will try to be as concise as possible. Some areas do not have enough contrast to draw distinctions and judge one as clearly better than the other, so I've excluded those. The following categories are clear enough that we can make a brief assessment. Disaster Response:Bush was widely criticized for his response to Hurricane Katrina;Obama was widely praised for his response to Hurricane Sandy.  President Bush flying over the devastation caused by Hurricane Katrina Terrorism: Major attack under Bush; none under Obama.Bin Laden remained at large under Bush; killed under Obama.  Iraq War:Bush started and incompetently prosecuted an unnecessary war; Obama concluded the war as quickly as possible.  In 2003, President Bush announced that the U.S. and its allies \"have prevailed\" in Iraq; more than 4,000 additional Americans were killed in Iraq in the ensuing years. Afghanistan War:Bush's response was slow, under-resourced, and unfocused; Obama renewed the focus and is in the process of ending it. Economy:Bush left office with the economy in free-fall; Obama entered office at that time and turned it around. First by slowing the job losses from a peak of ~800,000 per month, then by adding new private sector jobs month after month for years. At the time Bush left office, the auto industry was on the verge of collapse. Obama orchestrated its rescue, returning it to profitability. It is now thriving.[9] The stock market has also fared much better under Obama [1]: G.W. Bush - negative 3.5 percent annuallyObama - positive 20.1 percent annuallyIn Bush's first term, the S&P 500 went down 18%. In his 2nd term, it went down 31%. In Obama's first term up until 5 months ago when the source article was printed, the S&P is up 62%. [2] At the time of this post, the market is not just in good shape -- it's booming.[8] (Update: The S&P 500 is up \"120 percent since March 2009\") [11] In case anyone wants to point out that the stock market does not always reflect the real economy, corporate profits are \"the highest on record\" under Obama. [10] Deficit:Bush inherited a surplus and left a giant deficit.Obama inherited a giant deficit and is shrinking it, though very slowly. Health Care:Bush signed a Prescription Drug Plan for Medicare, though it left a large gap in coverage and it greatly increased the deficit. Obama closed that gap in coverage and did so while decreasing the deficit. Bush allowed a popular children's health insurance program to expire, Obama got it reinstated, covering 4 million children that were without health insurance. Bush did little else to address the health care problem. For example, he did not address pre-existing condition discrimination. Obama passed major reforms through landmark legislation (the Affordable Care Act) which includes the following major achievements: banned pre-existing condition discriminationextended the life of medicareexpanded medicaid accessended insurance recision (retroactively canceling your insurance after you get sick)limited what insurance companies can waste on non-healthcare expensesended lifetime coverage capsreduced the deficit in the process Financial Reform:Bush signed legislation that made if more difficult for people to get bankruptcy protection. He also signed Sarbanes-Oxley after the Enron/Worldcom/Tyco debacles. Obama signed Dodd-Frank, which includes stricter capital requirements for large banks, requires large banks provide “living wills” to avoid chaotic bankruptcies, and most importantly limits their ability to trade with customers’ money for their own profit. It also created the extremely popular Consumer Financial Protection Bureau. The reform is far from perfect but a big step in the right direction. Obama also passed a significant credit card reform and a significant student loan reform. The former prohibits credit card companies from raising rates without advance notification, mandates a grace period on interest rate increases, and strictly limits overdraft and other fees. The latter cut bank subsidies and redirected them directly toward the students, cutting the unnecessary middle-men and saving tens of billions of dollars. Any one of these three Obama reforms is arguably as good or better than Bush's actions, but all three together easily support Obama being the better president in this area. Nuclear Proliferation:Bush presided over Libya's WMD disarmament, but he did not really address nuclear proliferation in any other way, unless you count the Iraq misadventure. Obama hosted a major world conference that produced an agreement. He also secured loose nuclear material in several countries and signed a major treaty with Russia that reduces nuclear weapons.  President Obama and Russian President Medvedev signing a major nuclear arms reduction treaty. Also, North Korea did not have any nuclear weapons when Bush took office but did when he left. No new countries or rogue states are known to have nuclear weapons since Obama took office. Overthrowing Dictators / LibyaObama successfully aided in the overthrow of a dictator (Khaddafi) without using ground forces or losing a single American life during their revolution. Bush did not have this opportunity in Libya, though thousands of American lives were lost as a result of his overthrowing of the dictator in Iraq (Hussein). Stature in the World:According to Pew world opinion polls, the rest of the world holds President Obama and America in much greater esteem than they did under President Bush [3&4]. From 2008 to 2011, favorable opinion toward the United States rose in ten of fifteen countries surveyed by the Pew Global Attitudes Project, with an average increase of 26 percent. [3&4]  Immigration:Neither has passed any comprehensive measures to address the problem, though Obama still has four years to do so and has called it a priority for his second term. After Obama won strong majorities of Hispanic voters in the 2012 election, the GOP is finally back at the table to consider comprehensive reform. One of the obstacles typically raised by reform opponents is that the border must be better enforced before anything else can be done. There's a strong case to be made that Obama has achieved that. On the enforcement side, Obama has more \"boots on the ground\" protecting the border than ever before.  Obama has also deported more illegal immigrants than Bush, a record number. The NY Times reports that \"for the first time in at least two decades, the population of illegal immigrants from Mexico living in this country significantly decreased,\" according a report by Pew Hispanic Center. [12] Mexican Immigration to U.S. Slowed Significantly, Report Says  In fact, President Obama has accomplished nearly all of the additional enforcement measures that were proposed but not carried out before he took office: The 2007 bill proposed to erect 300 miles of vehicle barriers, 370 miles of fencing, 105 radar and camera towers, and four drones; by 2012, we completed 651 miles of vehicle fencing—including 352 miles of pedestrian fencing and 299 vehicle barriers—300 towers, and nine drones, according to Customs and Border Patrol. The 2007 bill asked for the resources for Immigration and Customs Enforcement to detain up to 31,500 people per day; ICE now has funding to detain up to 34,000 individuals at any time, per FY 2012 appropriations.[13] Progress is being made on a comprehensive solution, but in the meantime, President Obama has taken some executive actions to partially implement the DREAM Act, actions that were not taken under Bush. Therefore, while there seems to be a stronger possibility of comprehensive reform than we've had in decades, even if that were to fail, Obama has accomplished more on the immigration issue than Bush. Civil Rights / Gay and Women's Issues:Bush did not address don't ask-don't tell; Obama ended it. Bush did not address discrimination against women in the workplace, Obama passed the Lily Ledbetter Fair Pay Act as the first bill he signed. Bush appointed two white, male, extremely conservative Supreme Court Justices who have limited civil rights on several occasions. Obama appointed two female Justices, including the first hispanic justice.  Bush Supreme Court appointees, Justice Alito and Chief Justice Roberts  Obama Supreme Court appointees, Justices Kagan and Sotomayor Almost half of Obama's judicial appointments have been women, twice as many as Bush's. 19% of Obama's judicial appointments have been black, versus Bush's 7%. [6] This is less measurable, but Obama is in favor marriage equality rights for gays and Bush supported a constitutional amendment banning those rights. Judicial ImpactThis will be much more subjective but Bush's nominees to the Federal Bench have produced some very extreme decisions. While the disastrous Citizens United decision and the torrent of unaccountable, unlimited special interest money it unleashed into our campaigns is now well known, there are many other lesser known consequences of his appointments: The Supreme Court’s five conservatives trashed consumers’ ability to stand up to rapacious corporations. They greenlighted laws intended primarily to suppress minority, low-income, and student voters. They thumbed their nose at women’s right to equal pay for equal work. [5] Bush's justices have also voted to: enable businesses to force their workers and consumers into a privatized arbitration system that overwhelmingly favors corporate parties, or similar decisions eviscerating consumers’ ability to join together and fight powerful corporations via class actions. [5] President Obama's judicial legacy is incomplete but his appointments have generally taken opposing positions to the above decisions when they were in a position to do so. Whether you consider Bush or Obama better in this area of course depends on your position on the above. I would say Obama has made much better choices, though he has not nominated enough or fought hard enough to overcome the other side's obstruction [5, 6] Scandals:The importance of these scandals is certainly a matter of opinion, but I would argue that the Bush administration had many, many, major scandals (really too many to list) and that the Obama administration has not had any. The other side may argue that Solyndra, Benghazi or \"Fast and Furious\" qualify, and these are highly debatable, but they hardly compare to the sheer number of lives lost, lies, cover-ups, crony chicanery, and other ethical lapses that were a regular occurrence in the Bush years. WMD is one everyone remembers, but there were so many more. No one in the Obama administration has ever fired U.S. Attorneys for political reasons, exposed covert CIA operatives for political reasons, bribed journalists, traded drugs and sex with lobbyists, or misplaced billions upon billions of dollars, but all this and many more happened under Bush. The other side can try to point to minor and/or manufactured ones of the last few years, but it's just not on the same level. You can fill volumes with Bush scandals without ever mentioning them hiring a former male escort to lob softball questions in the pressroom or even his VP shooting someone in the face. Only the most serious, truly shameful, unquestionably legitimate Bush scandals need be mentioned and there are still orders of magnitude more than anything Obama's detractors could come up with. There were so many that 4 years into Bush's term and still with some of the biggest scandals yet to come, it was said that the public had “scandal fatigue.” Bush administration scandals20 Forgotten Bush ScandalsThe scandal sheetCategory:George W. Bush administration controversiesMany Questions Left in Bush Scandals ConclusionThere are many ways you can take issue with the above, it is not meant to be comprehensive and certainly includes some subjective judgments. In every category above, President Obama's performance easily outshines that of President Bush. For these reasons and others, I would argue President Obama is already a better President than G.W. Bush, and it isn't close. It would take a pretty radical shift for this assessment to change, such as allowing a major terrorist attack, starting and incompetently prosecuting an unnecessary war, abandoning a major American city in distress, and crashing the economy. Obama is only halfway through with his time in office and already his legislative achievements rival those of virtually any president, as does his foreign policy effectiveness. To compare him side-by-side with George W. Bush, who is presently ranked by scholars as among the worst presidents [7], is not really a contest. Obama is the better president.  Footnotes[1] CBS Moneywatch article, Sept 21, 2011 http://www.cbsnews.com/8301-505123_162-37744468/stocks---bush-vs-obama/ [2] Charting Presidential Stock Performance from Carter to Obama Another source: Stock Market up 68% under Obama [3] Global Public Opinion in the Bush Years (2001-2008) [4] http://pewresearch.org/world-opinion-map/ [5] The Judicial Bush Doctrine [6] http://www.newyorker.com/online/blogs/comment/2012/07/why-judges-matter.html [7] Historical rankings of Presidents of the United States\"A 2010 Siena College poll of 238 Presidential scholars found that Bush was ranked 39th out of 43\" [8] Yes, the stock market is booming. No, it isn’t a bubble. [9] GM Earns Its Highest Profit Ever at $7.6 Billion; Will it Help Obama’s Re-election Prospects? [10] U.S. Corporate Profits Hit Record in Third Quarterhttp://www.nytimes.com/2010/11/24/business/economy/24econ.html [11] Stocks Near New Heights as Small Investors Regain Faith [12] Mexican Immigration to U.S. Slowed Significantly, Report Says [13] Want tighter border security? You’re already getting it. ",
            "date": "Updated November 22, 2017",
            "views": "106",
            "upvotes": " View 55 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shmuel Newmark",
                    "user_href": "/profile/Shmuel-Newmark"
                },
                {
                    "user_id": "Kathleen Dobbs",
                    "user_href": "/profile/Kathleen-Dobbs"
                },
                {
                    "user_id": "Susan Fuller",
                    "user_href": "/profile/Susan-Fuller-1"
                },
                {
                    "user_id": "Rajaram Rajamani",
                    "user_href": "/profile/Rajaram-Rajamani-1"
                },
                {
                    "user_id": "Roland Hechtenberg",
                    "user_href": "/profile/Roland-Hechtenberg"
                },
                {
                    "user_id": "Neel Kumar",
                    "user_href": "/profile/Neel-Kumar-27"
                },
                {
                    "user_id": "Christian Hallford",
                    "user_href": "/profile/Christian-Hallford"
                },
                {
                    "user_id": "Shawn Jibben",
                    "user_href": "/profile/Shawn-Jibben"
                },
                {
                    "user_id": "Mark Sheldon",
                    "user_href": "/profile/Mark-Sheldon-15"
                },
                {
                    "user_id": "Brett Pasternack",
                    "user_href": "/profile/Brett-Pasternack"
                }
            ]
        }
    ]
}