{
    "title": "Why do you watch Pakistan reaction videos about India on YouTube? - Quora",
    "tags": [
        "India–Pakistan Rivalry",
        "International Relations of Pakistan",
        "India–Pakistan Relations",
        "Online Video",
        "Pakistan",
        "Videos",
        "YouTube Videos",
        "YouTube",
        "Indian Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Procheto Das Gupta",
                "href": "/profile/Procheto-Das-Gupta"
            },
            "answer_text": "The Pakistani YouTubers are reacting on Indian video's just to gain views and some Indian fools are watching those videos and commenting good things . Their country is facing so many problems but they won't react to the videos of their own countries because they won't earn money by that . Just see the views they earned by reacting to other countries video's . They didn't gain much views because people of other countries are smart and they know that it's better not to waste time by watching the videos of these piece of shits . Some foolish Indians who are praising should remember that they are the same people who spread propaganda , lies and hatred about india in social media and other platforms . Did you see any of them reacting to video's which states why the population of Hindu's , Sikhs and other minorities are decreasing in Pakistan day by day ? . There are only 17000 Sikhs left in Pakistan but they won't react to it and why would they because they will not gain views and will not be able to earn 💰. The population percentage of Hindus in Pakistan was 23% in 1947 and now it's 1% currently and they would not react to it . If my fellow indians do really want to watch videos then we should watch video's of hardworking Indian YouTubers who are struggling to gain views . Some people may say that I am spreading hatred but they must go and check that their 90% content is Indian and they are the same people who spread lies and propaganda about my country . ",
            "date": "Answered August 4, 2020",
            "views": "166",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shivansh Garg",
                    "user_href": "/profile/शिवांश-Shivansh-Garg"
                },
                {
                    "user_id": "Rawender Guron",
                    "user_href": "/profile/Rawender-Guron"
                },
                {
                    "user_id": "Vinay",
                    "user_href": "/profile/Vinay-767"
                },
                {
                    "user_id": "Neha Singh",
                    "user_href": "/profile/Neha-Singh-2593"
                },
                {
                    "user_id": "Sayed Mohamed",
                    "user_href": "/profile/Sayed-Mohamed-126"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prakhar Ankit",
                "href": "/profile/Prakhar-Ankit"
            },
            "answer_text": "Youtube has become an open dump of interesting content for everyone. Even I go there daily when I want some good stuff. Since November last year (2018), I came across these channels of Pakistani youtubers making videos (good ones) on village food (just like our daddy from South) and most importantly, ‘reaction videos’. I watched them because I felt good what the citizenry of Pakistan thinks about India & Indians. All was well and then Balakot happened. I was angry just like any other Indian. I felt bad and betrayed. Things were bad between India- Pak (or say worst in a non- war condition). Then once I went onto youtube and got these videos of Pakistanis in my suggested content. I simply unsubscribed each and every youtuber. Why? Because I don’t want to be a party to their earnings. It is open to all that terrorism in Pakistan is a state funded affair! Apart from aids that Pakistan gets from outside powers, they also partly fund these terrorists by way of tax collected. I don’t want to be a party to anything like that. That’s the least I can do. Until Pakistan gets on a right track, I won’t see their videos, we have some super fun content providers from India as well.  I won’t ask you to do the same, but think once. I don’t hate Pakistani citizens, it’s just that your money gets into the wrong hands who bleed us this side of the border. Thanks. Jai hind! ",
            "date": "Answered June 8, 2019",
            "views": "37",
            "upvotes": " View 49 Upvoters",
            "upvoters": [
                {
                    "user_id": "F Majeed",
                    "user_href": "/profile/F-Majeed"
                },
                {
                    "user_id": "Neha Singh",
                    "user_href": "/profile/Neha-Singh-2593"
                },
                {
                    "user_id": "Vinay",
                    "user_href": "/profile/Vinay-767"
                },
                {
                    "user_id": "Rahul Arora",
                    "user_href": "/profile/Rahul-Arora-60"
                },
                {
                    "user_id": "Sreeja Ashok",
                    "user_href": "/profile/Sreeja-Ashok"
                },
                {
                    "user_id": "Aishwarya Kashyap",
                    "user_href": "/profile/Aishwarya-Kashyap-5"
                },
                {
                    "user_id": "Sankalp Kandi",
                    "user_href": "/profile/Sankalp-Kandi"
                },
                {
                    "user_id": "Vivek Sharma",
                    "user_href": "/profile/Vivek-Sharma-6386"
                },
                {
                    "user_id": "Nimisha Asthana",
                    "user_href": "/profile/Nimisha-Asthana-3"
                },
                {
                    "user_id": "Himanshu Maurya",
                    "user_href": "/profile/Himanshu-Maurya-1"
                }
            ]
        }
    ]
}