{
    "title": "Why can’t we ever seem to make any advancements on protections for the environment? - Quora",
    "tags": [
        "Environment Protection",
        "Protection",
        "Environmentalism",
        "The Environment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Knight",
                "href": "/profile/Jeff-Knight-29"
            },
            "answer_text": "Because that isn’t news. I’m old. I remember when pollution was completely ignored. There were no “scrubbers” or filters on coal fired power plants. That type of thing was addressed in the early 70’s and while we don’t have zero pollution, it’s considerably less. The U.S. still gets somewhere near 30% of it’s electricity from coal-fired power. This is decreasing but it’s not a quick fix. Oil and other toxic chemicals were casually dumped wherever. The Great Lakes were so polluted that no one was supposed to eat fish caught out of them. I remember lead in gasoline. The lead was part of the engine’s lubrication, now you can’t buy it anymore in the U.S. There is no leaded gasoline for sale here. Lubrication and engine design have improved well pass the point that lead was needed. PCP’s are chemicals that were used for a variety of things and they have been steadily phased out as it was realized how environmentally unfriendly they were. What is still used is heavily regulated, if it’s used at all. DDT was a cheap effective pesticide mainly used to kill mosquitos. Unfortunately, it caused raptor egg shells to soften so it was banned worldwide. This had some rather severe unintended consequences. Supposedly many children in Africa died of malaria because DDT was no longer available. Perhaps a ban in certain areas or countries would have been a better solution, rather than a worldwide ban. So what is the current situation? The problems that have been addressed are now ignored. New problems have come along. We have a faction of environmentalists that believe any pollution is too much and eradication of humans would probably fix that. That’s not really an ideal situation from my point of view. Because there is always competition for funding, people tend to conflate what they perceive as a possible problem, they have to. The ones that scream the loudest and longest tend to get the money they need for research. My cynical point of view is that at this point people feel compelled to ‘make-up’ or conflate problems since so many serious ones have been addressed. When you’ve been hearing that the world is going to experience some sort of world-ending catastrophe that is imminent for the past 40 years you tend to take predictions with a large grain of salt. At this point in my life the world was supposed to have ended at least 10 or 12 times. “So it goes.” ",
            "date": "Answered April 1, 2020",
            "views": "126",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matt Yabsley",
                "href": "/profile/Matt-Yabsley"
            },
            "answer_text": "This question presumes that we haven't made advanced protections for the environment. This is not true. Many western countries have extremely strict environment protections as well as extensive regeneration programs for wildlife and habitats, both locally and globally. If you would have been alive in those countries a couple of hundred years ago you'd have been living in smog filled lands, rivers that were polluted by faeces and waste beyond anything you see today. We've advanced enough that some countries have managed to meet their daytime energy needs by up to 30% from renewables as opposed to fossil fuels. They are also trending to be away from fossil fuels entirely in about 35 years. Fossil fuel cars are to be made illegal in Europe by 2040 I believe. This is a trend that will follow through to emerging economies over time. What you will find is the trend is squarely towards a cleaner future, you'll always be able to point towards single issues along the way but to say there are no advancements is false ",
            "date": "Answered April 2, 2020",
            "views": "161",
            "upvotes": "0"
        }
    ]
}