{
    "title": "Why do teachers push students so hard? - Quora",
    "tags": [
        "Teachers",
        "Teaching"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jade Arnold",
                "href": "/profile/Jade-Arnold-3"
            },
            "answer_text": "The answer to this question depends on a lot of variables, namely: What you, or anyone answering this question, defines as “pushing a student”The educational system the teacher works in and the value that teachers/education have in that particular part of societyThe individual teacher.Obviously, my answer is going to be framed by my own interpretations and experiences, and your experiences may differ dramatically. I work in Sydney, Australia, and started my career in a low socio-economic area at a public high school with a very poor community reputation. The students in my classroom were often living below the poverty line, homeless, exposed directly or indirectly to drug abuse, emotional abuse, physical abuse, and to many of these students, school was the only constant in a world of chaos and instability. However, education and being ‘intelligent’ were not valued by many parents, thus this same attitude was perpetuated by many of the students. This was heartbreaking for many of the staff, because we would see students who were very capable and had great potential squander their talents and drop out before year 10 (aged 15–16), reducing their chances of entering a career where they could break the cycle of poverty. So, for me, I pushed my students to be the best that they could be, because often there was no one else in their lives that would value their education. My motto and mantra to my students was “personal best”. If a student could look me in the eye and tell me they tried their very best on a task, I would be happy with their progress, even if they didn’t pass. Yes, I would still give them feedback on how to improve, and encourage them to seek my assistance before the next task, but I would also consider altering or scaffolding the next task to ensure I was assessing what they had learned and what they could do, rather than assessing all the things they didn’t know. If I could paint a picture of ‘pushing’ a student, it would be a male student I taught for English in Year 8 (12–13y/o). He had been suspended numerous times, and had very low literacy skills. Acting out was his way of masking that he couldn’t understand the activity he was being asked to do. Generally this involved defiance: refusing to unpack, refusing to open his book, refusing to pick up the pen I gave him, refusing to write his name on the worksheet he’d been given, pushing any materials given to him on the floor. So I pushed him. It started out with me bargaining with him - I wouldn’t make him write his answers down, I would write them for him, but he would have to narrate them to me. Then he had to start spelling some of the words I’d write. Then he’d have to tell me where to put the punctuation marks. Then it got to the point were he said he would do it, because it was faster if he wrote it himself. Then he started writing. I established regular contact with his mother, who asked for me to send home simple tasks they could work on together to help him out. When he ‘forgot’ the work and left it in the classroom, I called his mother to organise dropping it off at his house One lesson (78 mins duration), he was able to write four, fully formed compound sentences. We both cheered, high-fived and fist-bumped. It seems like very little, considering his age, but from where he was at in terms of both attitude and ability at the start of the year, he had progressed massively. I don’t have the cheesy I-ran-into-him-5-years-later-and-he’s-made-something-of-his-life story to go with this tale, but I feel that my pushing him has hopefully given him a better chance at making something of his life. I know that if I had just given up and let him slip through the cracks that year, he would have had a much smaller chance at doing that. I do know that there are teachers out there who push students too much, and not in a positive way, and in some countries or systems it’s because their performance and even school funding is heavily tied to student performance, because very few systems that hold teachers accountable in that way consider the small but fundamental improvements like the one I have described. There are bad practitioners in every profession, and teaching is no exception. There are teachers who are not suited to the profession, who may value only perfection and not growth or personal best. And then there are those who push because they see the true potential in a student, and they want their students to make the most of their abilities to give them the greatest leg up that they can in a world that can be confusing, complex, and unfair. I’d like to think there are more of the latter, but again, my perception is limited to the experiences I’ve had in my country, state, and system. ",
            "date": "Answered March 17, 2017",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Polina’s Guidebook",
                    "user_href": "/profile/Polina-s-Guidebook"
                },
                {
                    "user_id": "Ayesha",
                    "user_href": "/profile/Ayesha-90"
                }
            ]
        },
        {
            "author_info": {
                "name": "Youssef Fares",
                "href": "/profile/Youssef-Fares-2"
            },
            "answer_text": "Well, a variety of reasons. Sometimes teachers forget about their students and start viewing them and their performances as measure of how good they are at teaching. If someone is under-performing they sometimes push that someone to work harder and then they can just tell themselves: “I’m okay, it’s just someone who isn’t working enough.”.It's very common for teachers to forget about the average student and to want everyone to be at the level of that one guy who has a background or just is better at grasping new information, when it’s actually a teacher’s job to give the others an equal chance at learning the new information. Sometimes the student is really under-performing and teachers usually see the potential. Many intelligent people become at some point guilty of living off their talent or previous hard work; they become too lax and dependent on these, at which point, they need to be told so they can start turning things around.If a student feels he’s being pushed too hard, probably the teacher is bad at contextualizing work or bad at motivating. Students or anyone for that matter, will feel the most worked when they don’t see a clear purpose or motivation for what they’re doing.There are examples out there of this old-school way succeeding. I believe it doesn’t work for everyone but for some others, seen in the biography of some figures like Andre Agassi, it does actually work.I focused more on pushing in terms of work-load, etc. I don’t know if this answers your question. ",
            "date": "Answered March 16, 2017",
            "views": "26",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Heba Kamal",
                    "user_href": "/profile/Heba-Kamal-4"
                },
                {
                    "user_id": "Carla Attenborough",
                    "user_href": "/profile/Carla-Attenborough"
                },
                {
                    "user_id": "Karim Elawaad",
                    "user_href": "/profile/Karim-Elawaad"
                },
                {
                    "user_id": "Emily Milroy",
                    "user_href": "/profile/Emily-Milroy"
                }
            ]
        }
    ]
}