{
    "title": "Why can people be so stupid to do what they do? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Danielle German",
                "href": "/profile/Danielle-German-5"
            },
            "answer_text": "For some, it’s how they were raised. Either they didn’t have a proper education, or they genuinely believe that it’s how the world works. I’m no psychologist, but I could also see that perhaps there’s something going on with the parts of the brain that control our common sense. Some people just might not have one and that could be determined again by their environment. ",
            "date": "Answered March 27, 2018",
            "views": "101",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Erin MacLeod",
                    "user_href": "/profile/Erin-MacLeod"
                }
            ]
        },
        {
            "author_info": {
                "name": "Giulio Moro",
                "href": "/profile/Giulio-Moro"
            },
            "answer_text": "I believe you're mistaking stupidity for ignorance. Stupidity is doing something without knowing that it's unsafe or wrong. Ignorance is deliberately doing stupid things and refusing to correct the behavior. People either do stupid things because they don't realise what they're doing, no thought processes here, our they're ignorant and do what they want knowing they're stupid things and choosing to do it regardless. Personally, I see most people are ignorant, leaving only a small percentage actually stupid. A stupid person uses a highway onramp lane to bypass the traffic in his lane in front of him. An ignorant person will illegally drive along the side of a highway for a long distance because they refuse to wait for traffic to start moving. ",
            "date": "Answered February 7, 2018",
            "views": "263",
            "upvotes": "0"
        }
    ]
}