{
    "title": "Why do liberal arts majors complain when they can't get a job? - Quora",
    "tags": [
        "Liberal Arts Colleges",
        "Liberal Arts"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Kervin",
                "href": "/profile/Steve-Kervin"
            },
            "answer_text": "As a liberal arts major myself (Political Science - East Asian Politics) the complaining usually occurs in the first years after college, when the propaganda liberal arts majors have been fed (“Follow your heart and the money will come later,”) meets the reality of the job market. There is a fundamental mismatch of skills one graduates with and those in-demand by employers, and for some this can mean years of misery. There are three basic problems. The myth that everyone should go to college. In the US some high schools are ranked by the number of students who go on to attend college, with the assumption that those that have a higher percentage of their graduates attending university are better than those which have them go into the military or vocational school. Germany serves as an interesting counterpoint. Less than a third of high school graduates attend university, with the others tracked towards vocational schools. These schools work closely with industry to match the skills learned by their students to those needed by companies. Students graduate quickly with needed skillsets that are in-demand, guaranteeing good salaries. Forcing vast numbers of people into college also leads to degree inflation. Jobs that once required a high school diploma now require a college degree even while the job salary and working conditions remain static. See How Degree Inflation Weakens The EconomyThe bureaucratization of higher education. Below is a graph that compares administrative and teaching positions in American colleges. Source This growth in administrative, non-teaching positions has been cited for the primary cause of rising college costs. See Bureaucrats And Buildings: The Case For Why College Is So Expensive Higher costs have led to increasing student debt burden. With the benefits of college life up-front, students are unaware of the true costs of their education, and are unprepared to handle a massive debt burden - one that cannot be discharged through bankruptcy. 3. The failure for parents to manage their children’s education. American parents have become incredibly lazy in regards to their children’s education, effectively outsourcing the task to private and public school administrations. Instead of shuttling their children off to college after high school, they should have spent years forcing their kids to think through their future, asking questions like “Ok, so you want to be a famous writer, what’s your plan B?” or “You want to be an actress. What’s your plan B?” Not only did I study East Asian history, politics and culture, I lived there, spending 5 years teaching in Japan. In my job I personally dealt with Tiger Moms - mothers who micro-managed the education of their children, setting high goals (and expectations). They are not unique to East Asia - there are plenty of them here in the USA, which is why Asian-Americans continue to excel in education compared to all other ethnic groups. Past generations of American immigrants also kept a keen eye on their children’s education, but overall the tendency has been for Americans to focus more on work and leave education to the teachers and school administrators. Not only is this a critical mistake in the long-term development of the student, but it is creating an entire generation of unemployable people. To a certain degree these are problems of affluence. Children and parents from poor families often have a keener eye on the value of a degree and the cost of education than those from wealthier backgrounds. In the end this means the problem will correct itself, with the unemployables failing to match the living standards of their parents, who will then pay closer attention to the education of their offspring instead of whining. Or at least that’s the hope.  Source: Why Your Barista Probably Has a College Degree ",
            "date": "Answered October 19, 2020",
            "views": "104",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Craig Nakanishi",
                    "user_href": "/profile/Craig-Nakanishi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Derek Sathre",
                "href": "/profile/Derek-Sathre"
            },
            "answer_text": "I’m a liberal arts graduate at the two-year level (AA degree). What I can tell you is there are jobs that you use these skills in (basically ALL of them). At that point, it’s how hard you work and use your skills. As weird as it sounds, I work at a job that requires high school or maybe none at all, but using communication, writing, and math skills are essential for my crew to achieve quota. Tonight I figured out that all we literally have to do is can 1 extra can every minute to achieve 5,000 which is either quota or close. And 2 extra cans a minute for sure for quota. I have to figure out how to communicate it in a way that wont disturb the balance of complacency… It’s nice because the one who adds the cans already cares about how much we make a night. All they’d have to do between loads is throw a few cans into the labeler. Also, to mitigate some of the time it takes, I’ll have to learn to quickly switch out my shrink wraps while keeping everything else the same. No need for a Harvard education or an engineering degree… problem solved. They might have to pick cans up every minute but 1–2 cans… hell every 5 minutes 5–10 cans. I know it is possible because they have SOME downtime. ",
            "date": "Answered October 27, 2020",
            "views": "13",
            "upvotes": " Answer requested by Alexander Wilde"
        }
    ]
}