{
    "title": "why can't I learn from lectures? I can't learn through listening because I need to see written words and to read the textbook. - Quora",
    "tags": [
        "Learning New Things"
    ],
    "response": [
        {
            "author_info": {
                "name": "Leon Hulett",
                "href": "/profile/Leon-Hulett"
            },
            "answer_text": "Q: “Why can't I learn from lectures?” One becomes unable to learn when they have gone past a word they do not understand. This includes the inability to learn from lectures. When such words are located and clarified properly with a good dictionary your ability to learn returns. You can recover your own ability to learn from listening to lectures. If you can not read out loud smoothly and easily with full understanding, this ability can also be restored to you. If you can not speak smoothly and easily, this ability can be restored. You should pay someone to help you find the word you went past that caused you to become unable to learn by listening, or by any other method. There is no reason for you to not have this ability as well as your ability to read written words. This can be done with a technique known as Method One Word Clearing. This is available in any country in the world. It is not true that you may only learn by seeing the written word and only by reading the text book. Yes, that is one ability one might have. After you have recovered any abilities you have lost while studying, you might want to learn how to use a dictionary to define words properly:  How to Use a Dictionary: Picture Book for Children: Ron Hubbard: 9788177691726: Amazon.com: Books Anyone from first grade upwards can use this book to learn how to use a dictionary. If you can not read, you might have to do this book with a parent, or older brother, or a teacher, or a tutor, or a study partner. After you have learned how to use a dictionary, you might want to learn about the subject of study so you can prevent this from happening to yourself and others. The course I took was The Student Hat Course. I have recommended to others The Basic Study Manual, and they have done well with that. You should have the ability to learn where you are flying along, feeling and looking bright, being enthusiastic, fully comprehending what you learning, and having the ability to apply what you are learning. You should remember what you have learned. You should be able to learn without stress or strain. You should be able to read the written word and instantly apply it. You should be able to listen to the spoken word and instantly apply it. If this is not the case,you should have the ability to return yourself to this level. You should have the ability to locate any word you went past, and then fully define it properly. When you do this, you will return to flying along as above. Best regards, Leon ",
            "date": "Answered October 12, 2018",
            "views": "16",
            "upvotes": " Answer requested by Miriam Assad",
            "upvoters": [
                {
                    "user_id": "Franzii Midema",
                    "user_href": "/profile/Franzii-Midema"
                },
                {
                    "user_id": "Karthikeyan S",
                    "user_href": "/profile/Karthikeyan-S-233"
                },
                {
                    "user_id": "Lindsay Wilson",
                    "user_href": "/profile/Lindsay-Wilson-173"
                },
                {
                    "user_id": "Miriam Assad",
                    "user_href": "/profile/Miriam-Assad-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michelle Clark",
                "href": "/profile/Michelle-Clark-56"
            },
            "answer_text": "Don’t worry - you are not alone in this! I discovered a similar quality within myself when I started college. I couldn’t understand why, after sitting through hours of lecture, I would still only retain what I had read in the text myself. This is when I decided to give online learning a try. It was probably the best decision I made in terms of educating myself further. While all of the work took much more time than it ever had in traditional classroom setting, I was able to read and retain a great deal more. I also began to enjoy learning more and found that my focus increased tremendously. Everyone learns differently so don’t beat yourself when you find yourself comparing your learning style to others! As Don suggested, dig a little deeper to find out more about the way you learn and maybe make some adjustments to your learning environment if possible. Good luck! ",
            "date": "Answered December 5, 2016",
            "views": "19",
            "upvotes": " View 4 Upvoters"
        }
    ]
}