{
    "title": "Why should a young person consider becoming a quantum physicist? - Quora",
    "tags": [
        "Quantum Physicists",
        "Quantum Field Theory",
        "Physicists",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Bush",
                "href": "/profile/Michael-Bush-50"
            },
            "answer_text": "I would say that quantum physics is a very important field in material sciences. On the contrary though Quantum Mechanics or QED is a dying field. It would be prudent to isolate these two fields by removing the quantum from the material sciences side. Lest the failure of one contaminate the other. Guilt by association. Honestly, it would not surprise me at all if everything with “Quantum” in the name finds scrutiny after the flaws of QED come to light. Including terms like “Quanta”. The nature of the beast. The flaws in QED are going to cost many physicists their lives work. They will be looking for things to blame. I would say until this milestone is passed, it is more practical to be a particle physicist, who knows everything about quantum physics. Then after the hammer drops, switch to whatever field is left in quantum physics place. It would be straight forward to merge it with material sciences directly, but since when do we do things that make sense? But currently, i can not advocate anyone to jump into either of these fields until this train wreck unfolds. Could be tomorrow or a decade down the line, but there is a huge mess coming our way that we made ourselves about a hundred years ago. QED leads to physical models that are tied in knots and are clearly unfactual depictions of natural mechanics. Instead QED is only useful as the study of observational bias. As is inline with our foundational scientific thought on realism by Plato, its later adaptations by Immanuel Kant, and the philosophy of free thought. One cannot base reality on something that has already been lorentz transformed. It would quite simply be an untruth. Topics that fail empirical experimental requirements to establish their existence include photon energy loss, spatial expansion, a variable distance scale, the quantum wave form and constancy. Meaning as far as science is concerned, they do not exist at all. All these topics are based on one singular topic instead, observation… The work of a scientist is to follow the evidence in a logical and unbiased manner to:   The “Problems” with QED are crystal clear. Discovery that quasars don't show time dilation mystifies astronomers Subaru High-z Exploration of Low-Luminosity Quasars (SHELLQs). II. Discovery of 32 Quasars and Luminous Galaxies at 5.7 < z < 6.8  You will never guess the type of model that validates this observation. =)        ",
            "date": "Answered February 8, 2019",
            "views": "174",
            "upvotes": " Answer requested by Wen Powers",
            "upvoters": [
                {
                    "user_id": "Jack Sullivan",
                    "user_href": "/profile/Jack-Sullivan-44"
                },
                {
                    "user_id": "Geoffrey Hui",
                    "user_href": "/profile/Geoffrey-Hui-2"
                },
                {
                    "user_id": "Nishchal Agarwal",
                    "user_href": "/profile/Nishchal-Agarwal-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carl W. Johnson",
                "href": "/profile/Carl-W-Johnson"
            },
            "answer_text": "I can only describe how and why “I” chose to pursue Physics (and math). In my life experience, I have always have “unbearable curiosity” about whatever situations that passed through my daily life. Whether it is why dogs have fleas, or the most efficient way to zoom around a corner in a car, (or MOST of the questions people ask in Quora), the broad and deep education in physics and math seem to nearly always enable me to do whatever math and logic is necessary to UNDERSTAND that subject. So my childhood astronomy or my teen aged years as a gear head, or my later career as a nuclear physicist and as an astrophysicist, and also my various inventions that have benefited mankind, and even figuring out how to start and run a business to manufacture and sell $11 million of my unique JUCA wood-burning furnaces, my deep and broad education in Physics and math enabled me to succeed in those many different fields. If I had studied some other field, I may have found myself limited in what I might want to do “tomorrow”. But as other answerers have pointed out, Physics is immensely tough. I have often said that the University of Chicago and their Physics Proffesors probably “bent my brain” in the process. One of my Professors was “Fujita” who later got his Nobel Prize regarding his analysis of tornadoes. He was such an impressive person that I nearly considered taking my Degree under him in GeoPhysics. But another Professor of mine was even more impressive, Richard Feynman, and I stayed in Theoretical Nuclear Physics. In any case, I have provided hundreds of advances for humanity and I am satisfied. ",
            "date": "Answered February 12, 2019",
            "views": "169",
            "upvotes": " View 3 Upvoters "
        }
    ]
}