{
    "title": "Why can children use computers so well? - Quora",
    "tags": [
        "Personal Computers",
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martino Ciresa",
                "href": "/profile/Martino-Ciresa"
            },
            "answer_text": "Kids learn really fast. Think how little they take to learn to walk, talk, and do tons of other stuff. In particular this works if they are introduced to computers early, as their mind is flexible and can learn and adapt to technology quickly.  Learning early how to use a computer means that it's going to become natural to them, as much as speaking their native language. On the other hand, adults trying to learn how to use a computer face the same difficulties as, say, learning a new language. When something doesn't come naturally to you, every new thing requires lots of work to understand and memorise. Instead, learning a new concept about something you're familiar with is usually straightforward.   One thing that I observed separates the people who use computers intuitively from  the ones that struggle to do it, is abstraction.  I often saw people struggling to understand how to move files because they couldn't figure out things like: Copying on an external storage is the same as copying in another directory on the computerCopying an mp3 file is the same as copying a documentThat copy, drag and drop and ctrl-c ctrl-v do exactly the same thingThe same applies for all other operations you can perform on a computer. People that can't abstract concepts (adults) often think of every single one separately, which gives them the impression that there are countless things to know. On the contrary, people that can use abstraction (kids) figure out immediately that lots of things can be categorized, making it much easier to learn and memorise new commands and tools. ",
            "date": "Answered February 6, 2016",
            "views": "252",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Naija Styles",
                    "user_href": "/profile/Naija-Styles"
                },
                {
                    "user_id": "Tim Elliot",
                    "user_href": "/profile/Tim-Elliot"
                },
                {
                    "user_id": "Michał Gawlas",
                    "user_href": "/profile/Michał-Gawlas"
                },
                {
                    "user_id": "Chris Miller",
                    "user_href": "/profile/Chris-Miller-235"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Elliot",
                "href": "/profile/Tim-Elliot"
            },
            "answer_text": "They notice the correlation between what they do and the computer's responses. The adults who have trouble with computers don't pay attention, don't notice, and then complain that \"the computer is acting weird, it must be broken\". No, buddy, YOU are the one that is broken. ",
            "date": "Answered February 6, 2016",
            "views": "47",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Linssen",
                    "user_href": "/profile/Thomas-Linssen-4"
                },
                {
                    "user_id": "Michał Gawlas",
                    "user_href": "/profile/Michał-Gawlas"
                },
                {
                    "user_id": "Martino Ciresa",
                    "user_href": "/profile/Martino-Ciresa"
                }
            ]
        }
    ]
}