{
    "title": "Why isn't finance mandatory in all schools? - Quora",
    "tags": [
        "Mandatory",
        "Financial Education",
        "Finance Education",
        "Public Education",
        "Schools",
        "Higher Education",
        "Personal Finance",
        "Finance",
        "Parenting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Gregg",
                "href": "/profile/Andrew-Gregg-14"
            },
            "answer_text": "Greetings, Solid question! S.T.E.M. and English/Language-Arts take up the majority of today’s high schooler’s schedule. History and Civics are disappearing in the present landscape. Finance would have to compete with Foreign Language, Fitness, Art, Band, Choir, Drama, Vocational Education, and Literature for the last class or two in a student’s day. As a class with limited demand, including Finance in a school’s course offerings faces other daunting hurdles. Once proposed, a committee of teachers and administrators takes on the arduous curriculum adoption process. Expensive and time-consuming to conduct, the aforementioned committee is tasked with vetting instructional materials, reviewing textbook options, investigating on-line licenses, and making every effort to promote inclusive representations and avoid cultural biases in the documents students will use. After the Adoption Committee’s work is completed, the district’s School Board is called upon to review the proposal. School Boards often approve a new course, but delay its implementation over financial concerns. A final obstacle to bringing a new class into a curriculum involves attracting a pool of highly-qualified candidates to teach the course. In the case of Finance, it seems that between the crowded existing schedule and the lack of demand among students, a potentially valuable course will remain absent from high schools. Sincerely, AJG. ",
            "date": "Answered May 2, 2020",
            "views": "62",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Joanne Vicente",
                    "user_href": "/profile/Joanne-Vicente-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Benjamin Black Perley",
                "href": "/profile/Benjamin-Black-Perley"
            },
            "answer_text": "It’s because over the years, parents have demanded schools optimize their curriculum in order to game college entrance. Finance isn’t part of that, so they’re not wasting limited resources teaching it. This is also true of home economics, wood shop, auto repair, and driving school. There is also an assumption that anything not taught in school is supposed to be taught at home, but many parents are unable or unwilling to do so. ",
            "date": "Answered July 24, 2020",
            "views": "32",
            "upvotes": "0"
        }
    ]
}