{
    "title": "Why is the Singapore education system so good? - Quora",
    "tags": [
        "Education in Singapore",
        "Educational Systems",
        "Singapore",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jamie Tan",
                "href": "/profile/Jamie-Tan-69"
            },
            "answer_text": "Ah, the Singapore education system. Considered to be good, right? Well, let’s take a look… (I’ll do this by going topic by topic)  (pic from pixabay) 1 / Costs The one thing about education here in Singapore is it’s really quite cheap. Roughly 13% of the annual budget is spent on education. As long as you don’t go to some super prestigious school where the school fees are up there (to say the least), you don’t need to pay that much. For example, if you are a primary school student who has a gross household income of less than SGD$2500 or a per capita income of SGD$625 , you get a full waiver of SGD$6.50 per month for the standard miscellaneous fees, the textbooks and school attire are free and you get transport credits (I copied these figures from some flyer I got about the Financial Assistance Scheme in 2018). This means that ultimately, you only need to pay for the second tier miscellaneous fees (decided by the school) and there are also programmes like Edusave where a primary school student gets S$300+ and the money can be used to pay for these second tier miscellaneous fees as well as other after school activities if necessary. If I’m not wrong, parents can also choose to withdraw money from our Edusave accounts if needed. Even though education is far from costly (in some schools), there are still many resources available to us. Here, there are nice, clean classrooms and even computer labs all over the place. There is an abundance of resources like worksheets and textbooks or even assessment books that we can refer to. 2 / Subjects Here are where things start to get a little tricky. You can look at the broad range of subjects Singapore schools offer from either point of view. It’s good because pupils are given a chance to figure out what interests they have and think about what courses they may want to pursue in the future. At least this decreases the chances of pupils choosing a subject they will come to despise I suppose. On the other hand, I know many people complain that majority of the subjects we learn will have absolutely no use in our life in the future. For instance, if you become a lawyer and say you really struggled with Science, all the efforts you put into trying to get decent grades in science classes would seem like a complete waste. 3 / Streaming So personally I support the streaming system (yep probably biased because after all I do happen to be in the Gifted Education Programme) but I know that many others do not. I know that this is probably very government propaganda-esque but I do feel that it is important to build an environment where people can develop at their own pace. It is fact that some people are more academically inclined that others and those less academically inclined pupils will feel stressed if they are put in the same class as, say, the top few pupils in the cohort. By allowing the streaming of classes based on academic ability, basically you’re not pushing some pupils too much while also not holding other people back. Another reason why I support streaming is that when you come to secondary school and junior college, vocational training starts (even though they don’t call it vocational training). While people will find telling a 13 year old he probably will only find a future as a factory worker harsh, this is one thing that makes the Singapore education system effective. Education is to develop the young generations into citizens who can fulfill the roles needed well. Somewhere along the line people are going to be hurt. But that’s what efficiency is most of the time nowadays. Putting aside some of that kindness in you just to get shit done. There are also the people who are strongly against streaming. Over here, academic streaming begins when you are 9. Usually in Primary 3, students start to be banded into classes based on how well they perform in their examinations. Then, at the end of the year, they take a series of tests to see if they can make it into the Gifted Education Programme (which I am in hehe any fellow GEPers here?). People say that it is not a great idea to start this sort of aggressive streaming while we are still so young. Yes, I agree that it is probably quite young to start separating these “smarter kids”, but ultimately the streaming has got to begin somewhere. 4 / Stress Stress. One of the biggest things we associate with school. I think the main thing that causes stress is being compared to your classmates 24/7. Teachers do not really help by giving out information like the average score, the highest score, the lowest score and your expected score. The whole time in school is you trying to prove that you got what it takes to do well. To prove to everyone you were meant to be wherever you are or even someplace “better”. We all know how difficult this is. Tuition is another huge factor. Personally, I have never attended tuition before but I know that pretty much everyone else in my class does. Even the top scorers who consistently get 90 and above for practically every subject attend tuition. Even the pupils who can get 100 on maths without studying for it go to tuition. The thing about tuition is that it too causes stress (which is ironic because the whole point is so you can score well so you can be less stressed). You are getting extra homework which may not necessarily end up helping you and in certain cases it could be hindering your progress in school. However, because everyone is doing it, parents think that tuition is some magical thing that can make you achieve that A* all the time. Is that true? In my opinion, far from it. 5 / Prestige Something no one wants to admit but secretly everyone knows is that most of the time, the prestige of something (like when choosing a school) counts. It does not matter that perhaps the quality of educators in say school A and school B is the same. School B just happens to have been around for longer, to have a higher cut off point, to have more resources, to be more widely known, so school B will likely end up as the more popular choice. Since school B is already more well known, it will likely get more support and in turn be able to get more resources, thus improving even more while school A is neglected, so in this sense you can see how it is kind of a vicious cycle. We all know about the “every school a good school” things. And while I do not think that any school is a bad school, that campaign (if you will) is not really doing anything as far as I can tell. 6 / Sleep This was my school routine when I was eleven: 0545 Wake up, shower, eat breakfast, dress0630 Set off for school0645 Reach school, do prefect duties0720 National anthem, pledge and announcements0730 Classes start 0930 RECESS YES1000 More classes…1330 School ends for pretty much 70% of the school but nope not me. I have lunch instead1430 Lunch over, time to head for CCAs (rotation of computer science, debate, a ball sport and some school programme)1700 time to get home.1730 actually gets home.1800 finishes a snack and usually watching youtube, time to do homework1930 okay time for dinner + a shower2030 more homework2245 done with homework fINALLY now time to sleep And take note I procrastinated a LOT so my usual bedttime would be 11.30p.m. Also, I was just 11 during this so you can imagine how sleep deprived everyone else would be. This is the one thing I honestly hate the most about schools in Singapore. They start so early and can end so late, there is no time to get any rest. TL;DR school is cheap, there are many subjects (which may be good or bad), there’s rather aggressive streaming (which may also be good or bad), it’s damn stressful, all about that prestige and everyone is basically a zombie. That’s just my personal experience with the Singapore education system so far. //see I suck at writing conclusions jeez ",
            "date": "Answered October 11, 2017",
            "views": "183",
            "upvotes": " View 58 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tressa Tok",
                    "user_href": "/profile/Tressa-Tok"
                },
                {
                    "user_id": "Gracie",
                    "user_href": "/profile/Gracie-277"
                },
                {
                    "user_id": "Sky Water",
                    "user_href": "/profile/Sky-Water"
                },
                {
                    "user_id": "Wei Dong",
                    "user_href": "/profile/Wei-Dong-53"
                },
                {
                    "user_id": "Jannala Yee",
                    "user_href": "/profile/Jannala-Yee"
                },
                {
                    "user_id": "Rob Jones",
                    "user_href": "/profile/Rob-Jones-115"
                },
                {
                    "user_id": "Sharon Lim",
                    "user_href": "/profile/Sharon-Lim-68"
                },
                {
                    "user_id": "Sophia Rosales",
                    "user_href": "/profile/Sophia-Rosales-3"
                },
                {
                    "user_id": "Abby Poh",
                    "user_href": "/profile/Abby-Poh-1"
                },
                {
                    "user_id": "Sagu Siva",
                    "user_href": "/profile/Sagu-Siva"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zhu An",
                "href": "/profile/Zhu-An-20"
            },
            "answer_text": "Because in the Singapore education system, no talent is wasted and no resources are wasted. As many other's have pointed out, Singapore is a very small country, with its only resources being its people. It literally imports like everything. However, it is extremely prosperous and the merits of the education system is a large part of it. In Singapore, the kids are streamed into different “classes” very early on. You may have heard of the Gifted Education Program, or GEP. Basically, at P3, the kids are screened and the around the top 1% will be offered a special program, that is conducted in selected schools. I was in the GEP when I was in Primary school, and it was really cool. The class size was unbelievably small. There were around 26 a class when a normal mainstream class had around 40. The classes were faster and the teachers were much more open to different opinions and students challenging them. Before the GEP, I had to undergo counselling back in my old school because I was a big troublemaker. It was not that I tried to be difficult, but the when the teacher told me to just do something and not ask questions in a rude condescending tone, I wasn't too eager to comply. The teachers try and encourage creativity and just thinking for yourself. Although I was still a bit of a troublemaker but I guess I got away with it more :) In the GEP, we also do many assignments that are completely not related to PSLE. Social Studies was a big deal to us. We had to write a really long (for a 11 yr old) expository commentary. I remember I did one on The Circumstancesand the Future of the South East Asian eSports scene and Remedies to the Problems, one of Counterfeiting, its Impacts and How to Stop it and one on the Effects of Social Media. And many more. We also had a full blown research project. It was really fun. All these thing are only taught later on in Secondary school. We were told that some of us would grow up to become leaders of the various disciplines, and I believed it. I really think that the GEP is a brilliant idea. If the funding and resources were spread out among everyone, everyone would just get an extra penny or so, which will not help at all, but instead Singapore picked out what was the cream of the crop and made them even better. And these are the people that very realistically will be ruling the country in the future. Then we have the notorious PSLE. Ah… good old PSLE. It is the exam that determines what secondary school you would be going to. I don't nessasarily feel that one exam should decide a large part of your future, but the PSLE is pretty good at what it does. It picks out the people that have the smarts, the ambition and willingness to work hard, and the ones with parents that really care. Usually a combination. I've only started on my journey through secondary school, so I can't say much here. I'll just quickly move on. Next the more achieved students, those that are more suitable, go to University, and the other's will go to a Polytechnic, usually. This is where I really just feel that the system down right works: a lot of people go to Polytechnic, and most of us won't really mind that. That means most of the people who are less likely to innovate, don't learn to. They instead learn an actually useful skill. I will compare this to China. According to what I know, Polytechnics in China are not very commonplace, and people are usually ashamed to go to them. Seriously, they rather go to a really downright shitty college. All they get in the end is an utterly useless piece of paper. Heck, they would have been better off just going straight to work. This led to a high rate of unemployment among fresh graduates. Singapore doesn't have the resources or the manpower to waste, and they don't. Some people find it bad, saying it's elitist, but really, the streaming is what make sure system beautiful. In a nutshell, Singapore gives a you a place early to fill, with many amendments along the way. Even if you messed up at one point, hard work will always push you towards the “elite” side. ",
            "date": "Answered June 20, 2017",
            "views": "63",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Lim",
                    "user_href": "/profile/Joseph-Lim-111"
                },
                {
                    "user_id": "Ayushree Agrawal",
                    "user_href": "/profile/Ayushree-Agrawal"
                },
                {
                    "user_id": "Red Bag",
                    "user_href": "/profile/Red-Bag-3"
                },
                {
                    "user_id": "Lim YL Hazel",
                    "user_href": "/profile/Lim-YL-Hazel"
                },
                {
                    "user_id": "Vladimir Khablov",
                    "user_href": "/profile/Vladimir-Khablov"
                },
                {
                    "user_id": "Jasmine Siew",
                    "user_href": "/profile/Jasmine-Siew-1"
                },
                {
                    "user_id": "Justine Tracy",
                    "user_href": "/profile/Justine-Tracy-1"
                },
                {
                    "user_id": "Elyse Chia",
                    "user_href": "/profile/Elyse-Chia"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shkdshks"
                },
                {
                    "user_id": "Ian Song",
                    "user_href": "/profile/Ian-Song-4"
                }
            ]
        }
    ]
}