{
    "title": "Why do people ask what grade you got? How can I avoid telling them? - Quora",
    "tags": [
        "Interpretations of Human Behavior",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charly Evans",
                "href": "/profile/Charly-Evans"
            },
            "answer_text": "They ask this to see if you are Dumb or intelligent. Then they will judge you on your answer. If your grades are bad they will begin to belittle you and try to encourage you to educate yourself. For example i was out with friends at a Coffee Shop. My friends buddy invited a male friend with him.This Man is on Welfare living in someones basement with no Assets no car not TV no Sofa just a flat mattress he sits on and uses as a bed. He directed his attention towards me and started to ask me questions on certain topics i’m not an authority of. He asked me about Muslims and i guess he was expectation me to know everything about the People and their Culture. Well i didn’t. He then asked me in front of my friends If my grades were Good in High School. Then through out the night he treated me differently .You get people like that asking you about your grades you tell them to mind their bloody business. Any how i found this guy to be a know it all arrogant little man an authority on every topic out there. He even told everyone at the table that he is highly intelligent. Not a very modest person at all. He was so full of himself that everyone at the table including me felt unimpressed by his presence. ",
            "date": "Answered July 12, 2017",
            "views": "32",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Catarina Stefirta",
                    "user_href": "/profile/Catarina-Stefirta"
                },
                {
                    "user_id": "Maia Hani",
                    "user_href": "/profile/Maia-Hani"
                },
                {
                    "user_id": "Saba Bajwa",
                    "user_href": "/profile/Saba-Bajwa-6"
                },
                {
                    "user_id": "Renee Huang",
                    "user_href": "/profile/Renee-Huang-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lesley Murphie",
                "href": "/profile/Lesley-Murphie"
            },
            "answer_text": "If you truly don't like it then distract them. Change the subject in a subtle way, talk about them - people love to tell you about themselves.  But if truth be known I think you are really focussing too much on comparing yourself to others and at the risk of repeating myself (since I only used this quote in the last question I answered) try to remember the words in the Desiderata relating to envy \"If you compare yourself with others, you may become vain and bitter;  for always there will be greater and lesser persons than yourself.\" Desiderata - Words for Life by Max EhrmannTruer words were never spoken.  It does your head in to get distracted by comparisons.  It truly doesn't matter who's doing better, or worse than yourself.  Just put your head down and run your own race.  Be true to yourself. ",
            "date": "Answered August 6, 2015",
            "views": "37",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nathalie Acosta",
                    "user_href": "/profile/Nathalie-Acosta-1"
                }
            ]
        }
    ]
}