{
    "title": "Why do teachers treat children with special needs different from other students, like they’re not human? - Quora",
    "tags": [
        "Special Needs Children",
        "Special Education",
        "Teachers",
        "Teaching",
        "Students"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jerry Myers",
                "href": "/profile/Jerry-Myers-64"
            },
            "answer_text": "I have waited a few weeks to answer this question because of the way it is worded. I am a general education teacher that has attended every training ever offered on teaching special needs students. Why? I teach biology, a class every student in my district needs to pass to graduate. That is all I am credentialed to teach so that is all I teach 5 periods a day and up to 25% of my students in a class are on an IEP or have some other special needs. Because I work well with all students, I have even had some students from the special day class who will mainstream in one or two general education classes a day. Why do I work hard to include all students? I deal with dyslexia and when I came through the school system I had a choice, the regular classroom or the special education school. There was no IEP and resource class. I was fortunate in that I lived 6 blocks from a University with a school of Education and they were doing research on dyslexia at the time I was in 1st grade. They helped me learn strategies to deal with it. I was in that program for 2 years so I did learn to read and became the top reader in my school. Math was harder. I always spent hours on math homework everyday through high school but I was able to make it through the honors advanced algebra by junior year and take calculus at the junior college in my senior year. I still spent hours every night on math homework. A reason I get so many special needs students in my classes is I follow their IEP plans and I take time to observe how they learn. I think differently than most thanks to my dyslexia and I know most of my special needs students are fully capable of learning, they just think and learn differently than many students. So I observe then and figure out how their brain works and teach to their strengths and at the same time help them improve their weaknesses. You can say they are treated different. They are provided the accommodations they require that allows them to learn and to best meet their needs. I treat each student slightly different to best meet their individual needs. I take the time to get to know each and every one of my students so I can do my very best to meet their needs. Now, I do work with some teachers that do treat all students the exact same, including students with special needs. This means they do not follow their IEPs because they think if they have a learning disability or some other special needs they are less than human and do not deserve the best education possible. So they tell all of their students to figure things out on their own or to read the book for the answers. I know one teacher who puts all the special needs students in the back so she can ignore them completely. In no way do all or most teachers treat special needs students as if they are subhuman though. Most of the teachers I work with are teachers because they care about students. Most could make a lot more money doing something else but chose teaching because they want to make a difference in the lives of students. I left a career as a research scientist because it was not as satisfying as working with teenagers and making a difference. It also allowed me to be at home when my son came home from school so I could be a dad to him. ",
            "date": "Answered October 20, 2020",
            "views": "20",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Croft",
                    "user_href": "/profile/David-Croft-6"
                },
                {
                    "user_id": "Human Being",
                    "user_href": "/profile/Human-Being-468"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicole Kos",
                "href": "/profile/Nicole-Kos"
            },
            "answer_text": "I have never in my life treated a child with special needs as if they weren’t human, and I have never witnessed any of my fellow teachers do that either. Sometimes teachers treat children with special needs differently than they treat other students because those students’ needs are different. The student might get special accommodations during testing, or they might get a fidget toy during class, or they might get sensory breaks. None of those things dehumanize the child. I suspect you’re just trolling with this question, because if your child were actually being treated like they aren’t human, you would be in a meeting with your school’s administrators right now, not goofing off on Quora. ",
            "date": "Answered October 14, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lauren Bebout",
                    "user_href": "/profile/Lauren-Bebout"
                }
            ]
        }
    ]
}