{
    "title": "Why do I keep getting bad grades? - Quora",
    "tags": [
        "Grades (education)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shubhangi Sen",
                "href": "/profile/Shubhangi-Sen-3"
            },
            "answer_text": "It's because schools and Coachings are closed. When they were open, learning was easy and fun. All of sudden they closed and grades have started to degrade.  Image source : google Let's see one by one on how to overcome these unwanted shortcomings. For maths, paying attention to what tutor is teaching is very essential. Practising new Questions is also essential. For science, reading and understanding is necessary. Memorisation follows once you understand the concept or definition. Suppose, if there is a topic you are reading from chemistry. Try to Google that topic, read the articles provided on it . It will widen your knowledge and increase your interest. For English learn writing skills such as essays, letters learn from YouTube videos based on it. Read the stories and passages. Collect new words. Read relevant answers on quora everyday. It will boost your vocabulary and polish your English that would be helpful in writing good answers. For physics, search simple definition on google as well as quora after reading ncert. For biology. Memorise the topics. Highlight points with pencils. If you are in college, good cgpa is not enough. You need to built your skills , according to the course you are pursuing in order to get 100% placement. If you are in school, study humbly. Don't fool yourself since school lessons are fun and easier than college. Don't miss it. This is globalised world with advanced technology. we have huge study material be it online or offline. There is wide scope for making favorite choices. If you are board student, be serious. Study by keeping in mind the thought of getting desired college. Understand your limits. At least work hard upto your limits. Buy rough notebooks and lots of 2 RS pens start solving or writing like anything !! One more useful thing, Create your own projects apart from assigned projects that everyone is doing. At last, There is no harm in studies or studying books . School lessons are anyway better than college. Complete class 12th happily. Then, do college. Thanks for reading ✍️ ",
            "date": "Answered October 9, 2020",
            "views": "35",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashwin Krishna",
                    "user_href": "/profile/Ashwin-Krishna-59"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anne Lalli Ferrari",
                "href": "/profile/Anne-Lalli-Ferrari"
            },
            "answer_text": "The first thing you have to figure out is whether you are studying enough, or at all. Many people think they “know” something, when they really don't. I recommend to my students that they study a little every day; read over their notes while eating, resting, whatever. Areas that they find confusing should be investigated further by rereading the text in that area Or consulting google. If you are still having difficulty understanding an area, you should reach out to the instructor and go meet with him or her prepared. have specific questions to ask in areas that you are confused. to study, you should test yourself. Give yourself problems, questions, etc (often these can be found in review sections of the text) and practice answering without consulting your notes or the text. Dont try to blindly memorize. Try to truely understand the topics you are learning. There may be some topics that lend themselves only to memory though, and these you should develop mnemonic devices for to assist in Retention. you can get tutoring for areas that you struggle in. Check if your school makes that available free of charge. You can also ask classmates to form a study group. lastly perhaps you should be assessed for anxiety or depression issues that might impact your ability to learn, study, and retain. good luck ",
            "date": "Answered February 21, 2017",
            "views": "339",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Uros Jandric",
                    "user_href": "/profile/Uros-Jandric"
                },
                {
                    "user_id": "Julia Steinhauer",
                    "user_href": "/profile/Julia-Steinhauer"
                }
            ]
        }
    ]
}