{
    "title": "Why should universities not be free? - Quora",
    "tags": [
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Derek Sathre",
                "href": "/profile/Derek-Sathre"
            },
            "answer_text": "I think it should be free for people who served: military, peace corps, Red cross, volunteer programs, senior citizens, etc. People who put in in someway to our system. But, just graduating high school isn’t convincing enough to make it free, to me. You have to either have the money or work a certain amount of years or something. I lost $6,000 one semester of hard earned money, and realized not to take it for granted. We have lectures online for everyone to see… MOOC. Yet people want the salary. If a majority had a BA/BS that salary will go down. It’s not distribution of wealth but debt. You end up paying for a college education anyway if we were all taxed over 40–60 years of work, why not just have the ones that want an education pay for it, in the money they would have spent in taxes? Even poor people will be taxed on it… and probably the most too dollar for dollar. It will make their situation worse which I am against. Also, working in manufacturing you can learn a CDL, welding, industrial mechanics, forklifting, and a lot of stuff. High school is all you need. Trades are another thing… ",
            "date": "Answered June 2, 2019",
            "views": "192",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Henry Kanemoto",
                "href": "/profile/Henry-Kanemoto-1"
            },
            "answer_text": "Because it would be another entitlement program that would create greater federal deficits. Nothing is “free”. Someone has to pay. Here is a similar question I answer. Henry Kanemoto's answer to How do people expect college to be free, and at the same time want lower taxes? Why not ask why food should not be free? Is food not more important that higher education. Or how about housing? Is homelessness not a greater need than higher education? Why not guarantee everyone a job? You get where I am going here? Education is way down the list of the what “could” or “should” be free. What makes you think that if society cannot provide free housing and free food for everyone, that it can provide free universities? ",
            "date": "Answered June 1, 2019",
            "views": "99",
            "upvotes": "0"
        }
    ]
}