{
    "title": "Why does my teacher acts diffently around me? - Quora",
    "tags": [
        "Interpretations of Human Behavior",
        "Teachers",
        "Interpersonal Interaction",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jocelyn Valdez",
                "href": "/profile/Jocelyn-Valdez-2"
            },
            "answer_text": "i had this teacher my sophomore year and to say I thought he was weird is an understatement. He is a coach and he was always talking about fitness. He’s a very athletic person and not gonna lie at first I did think he was cute I mean I was 15 and hormonal my bad. I never tried anything just because I knew it wouldn’t be right of me to do so I just did my work and kept to myself. When Christmas break was approaching I started noticing he was being more odd than usual. Some students asked and he told us that his wife had just had a miscarriage. I felt empathy for him because just a couple of months earlier my mom had a miscarriage and I was still sad about that. I don’t know if my facial expression gave it away or something but he wouldn’t stop starring at me though I had not said anything he was being weird. Some time had passed and he told us his wife was expecting and everyone congratulated him. Everyone was working on a project and I told my group I was gonna go get something from my backpack. All the aisles were empty nobody was at a desk everyone was at their lab table. My bag was on the ground and when I was bending down to get it I felt someone brush their hand against my butt. I looked around (I know how dumb of me) and when I look straight ahead my teacher was smiling at me. I felt guilty because his wife was pregnant, he has a daughter I felt like maybe it was my fault since I was attracted to him. I’m a senior now and whenever I see him it’s just plain awkward because whenever I look at him I remember what happened. After that time he never did anything like that again and I didn’t want to tell anyone because I didn’t think anyone would believe me. Here is this young teacher who is also a coach has a beautiful wife an adorable kid why would he risk that on some 15 year old girl? ",
            "date": "Answered January 29, 2019",
            "views": "943",
            "upvotes": "0"
        }
    ]
}