{
    "title": "Why do you like learning? - Quora",
    "tags": [
        "Learning New Things",
        "Learning",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Markeith Johnson",
                "href": "/profile/Markeith-Johnson"
            },
            "answer_text": "I like learning because I’m insatiable regarding it. Information translates to ability, newfound ability, which ultimately translates to power. A gaggle-wad of abilities can make one person extraordinarily powerful in comparison to others, (see Elon Musk). Think of the movie “Limitless” or “The Matrix.” The only thing that changed these men’s lives was new, potent, well-connected, well understood…information. While we can’t always get it instantly and completely in real life, we can still get it at some point if we keep adding to ourselves by continuous learning! The feeling of being educated on something you didn't know previously, or something you didn’t know how to do previously, is one of the most satisfying, self-gratifying feelings you can experience when it comes to learning. It's a feeling I know and personally love. I'll never forget the time I stepped into my first blackjack table as a dealer and how nervous and unsure of myself I felt. I, and the rest of my class, was a blackjack dealer with no previous real life experience other than training, all of us first time live for the grand opening of a large casino in my hometown. I thought, \"My god! I'm going to mess this up! I'm going to get in trouble! And I'm not going to be good at this! The experienced players are better than me at this!\" Well it didn't take long for us to gain mastery, even as complete noobs, and that was amazing to feel. Like \"ahh, I can do anything! I didn't even know who to do this before!\" That is the power of learning and the reason it can be not only liked, but at some points, intoxicating! ",
            "date": "Answered January 26, 2018",
            "views": "43",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shyaka Modeste",
                    "user_href": "/profile/Shyaka-Modeste"
                },
                {
                    "user_id": "David Eugene Wilson",
                    "user_href": "/profile/David-Eugene-Wilson-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hannah Yang",
                "href": "/profile/Hannah-Yang-4"
            },
            "answer_text": "Earlier this afternoon, I learned that eating carrots doesn't actually improve your eyesight. This is something I've believed ever since I was a kid. Today I found out it was actually a lie spread by the British in WWII, as an excuse for why their fighter pilots had such good vision. The real reason was because they'd secretly invented radar, and didn't want the Germans to find out. If you’d met me yesterday, you'd be talking to a person who thinks that carrots are good for your eyes, and who has no idea that this is nonsense. If you meet me tomorrow, you'll be talking to a person who avoids making unscientific assumptions about her vegetables, and who knows a fun fact about WWII. The question “Why do I love learning?” really boils down to, “Which of those people would I rather be?” ",
            "date": "Answered October 28, 2016",
            "views": "63",
            "upvotes": " View 96 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maliha Rahima",
                    "user_href": "/profile/Maliha-Rahima"
                },
                {
                    "user_id": "Ashok Raj",
                    "user_href": "/profile/Ashok-Raj-103"
                },
                {
                    "user_id": "Tony Mischa",
                    "user_href": "/profile/Tony-Mischa"
                },
                {
                    "user_id": "Andrew Nguyen",
                    "user_href": "/profile/Andrew-Nguyen-1029"
                },
                {
                    "user_id": "Nah",
                    "user_href": "/profile/Nah-69"
                },
                {
                    "user_id": "Pearl Kim",
                    "user_href": "/profile/Pearl-Kim-14"
                },
                {
                    "user_id": "Alex Richardson",
                    "user_href": "/profile/Alex-Richardson-20"
                },
                {
                    "user_id": "Serin Lee",
                    "user_href": "/profile/Serin-Lee-5"
                },
                {
                    "user_id": "Ayesha Pasha",
                    "user_href": "/profile/Ayesha-Pasha-6"
                },
                {
                    "user_id": "Tanveer Ahmed",
                    "user_href": "/profile/Tanveer-Ahmed-702"
                }
            ]
        }
    ]
}