{
    "title": "Why do teachers have their favorite students? - Quora",
    "tags": [
        "Teachers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Liz Shinohara",
                "href": "/profile/Liz-Shinohara"
            },
            "answer_text": "I have been teaching for 33 years. I've taught adults, and I have taught preschool, and every age in between. For the past 11 years, I've settled on the age groups I enjoy most, high school and young adults. In all those years, I've had two students that I honestly didn't like. I tried to figure out some redeeming point in those two but I never could. Hopefully they never realized this. Other than those two, I've liked all my students. For slightly different reasons, whether it be their personality, their perseverance, their wit, or any one of a thousand other traits. I think it's very possible to be a good teacher and not have favorites, but it's difficult to spread your attention and concern evenly. In that case, the needier students, or perhaps the less demanding students may appear as favorites, because they get the teacher’s attention. Inevitably, if a student is looking for reason to feel left out, they will find it. If a teacher can recognize this and cut it off at the pass, all the better. But that's not always easy. If your teacher is obviously playing favorites, I think the best that you can do is realize that they are human and humans make mistakes. Just as it's quite easy for a parent to look at all his or her children and find special things to love in each of them, whether they’re ‘easy’ or ‘difficult’, so teachers who care about their work will find it easy to recognize special qualities in each student. To be quite frank, I find teachers who cannot do this to be well-intentioned but lazy, OR good but burnt out, OR just plain narrow-minded. Hopefully, you will find some teachers that make your whole class, including you, feel like you're all on the verge of something exciting with everyone equally invested in the results. When you find that, enjoy it, revel in it, and make a promise to yourself to pass it on. ",
            "date": "Answered November 14, 2017",
            "views": "54",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cindy Vo",
                    "user_href": "/profile/Cindy-Vo-3"
                },
                {
                    "user_id": "Kathryn Sixx",
                    "user_href": "/profile/Kathryn-Sixx"
                },
                {
                    "user_id": "Lucid Pruitt",
                    "user_href": "/profile/Lucid-Pruitt"
                },
                {
                    "user_id": "Maureen Katherine Conklin",
                    "user_href": "/profile/Maureen-Katherine-Conklin"
                },
                {
                    "user_id": "Abinaya Ganesh",
                    "user_href": "/profile/Abinaya-Ganesh-10"
                },
                {
                    "user_id": "Sophia Alexandra Watson",
                    "user_href": "/profile/Sophia-Alexandra-Watson"
                },
                {
                    "user_id": "Karin Krueger",
                    "user_href": "/profile/Karin-Krueger"
                },
                {
                    "user_id": "Alondra Ramirez",
                    "user_href": "/profile/Alondra-Ramirez-79"
                },
                {
                    "user_id": "Mich M",
                    "user_href": "/profile/Mich-M"
                },
                {
                    "user_id": "Gabby Lozada",
                    "user_href": "/profile/Gabby-Lozada"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Armstrong",
                "href": "/profile/Alan-Armstrong-21"
            },
            "answer_text": "I’ve read most of the answers, and what they have in common is that most teachers choose the profession because they like working with young people. Some see their role as imparting useful skills and not much else. In my case I did that too but I saw myself as being there primarily to help them grow up. My teaching years were in a rural Maori community where I knew most of the kids’ parents and often met them and students at social gatherings or as a guest in their own homes, so we knew a lot more about each others’ lives than most teachers and students do. Both sides respected that and kept it out of the classroom - we all recognized the school had a code of behaviour everyone had to observe. (Yes I did sometimes bend the rules. I remember a drenching wet day and a student asking me if he could go into the village in bare feet to keep his sandals dry. I told him it was against the rules but it made sense so OK, but if anyone else caught him please don’t say I gave permission. He’d often seen me barefoot on his home marae so I couldn’t very well have done anything else, and none of the shopkeepers would have cared because the kids were often barefoot when not in school uniform.) We’re all human and of course I liked some students better than others, but did my best not to show it. I can’t remember ever teaching a student I disliked - some difficult ones yes, but still likeable. It worked the other way too, and one of my happy memories is three senior girls who were inseparable (and related) in another class whose parents I knew well that came into my classroom every morning before school to say good morning and chat for a couple of minutes. I wasn’t teaching their class that year and I really enjoyed those visits. They clearly liked me and that made for a great start to my day! ",
            "date": "Answered December 29, 2018",
            "views": "21",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alondra Ramirez",
                    "user_href": "/profile/Alondra-Ramirez-79"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                }
            ]
        }
    ]
}