{
    "title": "Why US education system is best in the world? - Quora",
    "tags": [
        "Education in the United States of America",
        "Education Reform"
    ],
    "response": [
        {
            "author_info": {
                "name": "Samual Roy",
                "href": "/profile/Samual-Roy"
            },
            "answer_text": "Because US education system is student centric. They focus on student’s personal as well as social growth which ultimately leads to overall development. In US, educators give preference to vocational learning and follow practical approach. Students get projects on regular basis. To complete those projects they need to engage with all stakeholders which help them to get a holistic view of the subject. I totally agree with Georgiana Miller that US education system is willing to change. With time educators has to adapt new learning techniques to provide better outcomes. Because that’s what can make any educational system great. ",
            "date": "Answered June 8, 2018",
            "views": "39",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akhil Padala",
                    "user_href": "/profile/Akhil-Padala-2"
                },
                {
                    "user_id": "David Yin",
                    "user_href": "/profile/David-Yin-2"
                },
                {
                    "user_id": "Eli",
                    "user_href": "/profile/Eli-1063"
                },
                {
                    "user_id": "Anish Adamane",
                    "user_href": "/profile/Anish-Adamane-2"
                },
                {
                    "user_id": "Og'abek Rashidov",
                    "user_href": "/profile/Ogabek-Rashidov-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Juan Dumpring",
                "href": "/profile/Juan-Dumpring"
            },
            "answer_text": "Lol! It's very much so NOT the best tho…. It pales in comparison to most western democratic nations educationally… don't listen to that dumb arse suggesting the system caters to individual students… that's just ridiculous… the USA ranks in WELL behind the likes of Germany, UK, Australia, Israel, France,South Korea, Hong Kong, Canada etc… I'm pretty sure the USA ranked 54th in 2018… Americans and their hubris… funnily enough, I doubt many Americans know what hubris means… This is a nation so far behind in basic social systems it's practically a corporate body rather than a country… NO system in the USA is “individually tailored\". It's a nation where money talks and those without walk… get a small loan of a million dollars off your wealthy dad who paid for a new building at Wharton to get you enrolled, kinda place… c'mon, do I REALLY need to cite sources here???… look at your President!! That guy you picked as the best of the 360 million of you…. HAHA! ",
            "date": "Answered June 4, 2020",
            "views": "440",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Katherine Mulholland",
                    "user_href": "/profile/Katherine-Mulholland-2"
                }
            ]
        }
    ]
}