{
    "title": "Why does the American school curriculum lack so much? - Quora",
    "tags": [
        "Public Education",
        "Course Curricula and Syllabi",
        "Graduate School Education",
        "Teaching",
        "Learning",
        "Teenagers and Teenage Years"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sara Matthews",
                "href": "/profile/Sara-Matthews-5"
            },
            "answer_text": "No, you're right on target. Let's understand that for most of history 'school' didn't exist. The government of ancient Rome did not provide free schools for the masses. Only recently in history were there opportunities for children to attend school - most children did whatever their parents had done and learned what they knew from their parents. Trying to keep it short - there arose some new interest in 'mass literacy' - in encouraging common people to become literate - to learn to read and write. The idea that children should learn to read and write spread but the schools were rarely free and most people did not/could not enroll their children. In the 1830s - in the U.S. - there was tremendous growth in our cities and children had little to occupy themselves. On farms children worked - it was thought to open 'free schools' so children could learn to read and write - and that was about it. Nothing more than basic literacy, basic math and a little geography. The basics. In the 1880s laws were passed that required families to send their children to school - up to 6th grade. In the 1930s with many adults out of work, laws were passed that required families to send their children on to high school to keep them out of the work force when there were not enough jobs to go around. Mandatory high school was not about learning - it was about economics. No one said - let's make school so viable, so enticing, so intriguing that they want to come here each day. They said, Let's pass a law that makes illegal not to go to school and that will keep them out of the work force during this horrific economic depression. The two reasons for establishing - and requiring - school in the U.S. were - basic literacy and keeping teenagers out of the work force. School in its design was never intended to prepare anyone for 'life'. It was intended to impact basic literacy, basic math and a little geography. High school curriculum was not intended to be practical - it was not 'life skills'. There were vocational high schools but academic high schools were just that - academic. School is a group process - it was not designed to foster individuality - it was not designed to meet individual needs - it was designed for ... efficiency. How do we get the most students into this building and move them orderly through the day? How do we create order with hundreds of healthy, young people chafing at the bit every day? How do we keep them sitting in chairs when Nature intended them to be up and moving around? The process of school is counter to Nature's intentions. Tired, older people are more content to sit in chairs - children and teenagers are often not. School focuses first on creating order, encouraging and rewarding compliance - not rewarding initiative and independent thought. If school encouraged independent thought - students might independently stand up and walk out the door. With laws in place however that give you little choice - curriculum doesn't have to work for individuals - you're not free to choose among schools, the law most often requires you to attend schools in your district. The intention of school and the emphasis of schools is on the process - not the outcome. There's little impetus to change - the law mandates school taxes, the law mandates those tax dollars be meted out to schools - whether school is fulfilling or not has no impact on the process. You might be intrigued by a book entitled Dumbing Us Down - written on the design of school and the people that participated in the early decision-making regarding mass education. ",
            "date": "Answered January 8, 2017",
            "views": "538",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Timothy Soo",
                    "user_href": "/profile/Timothy-Soo-2"
                },
                {
                    "user_id": "Rajan",
                    "user_href": "/profile/Rajan-20"
                },
                {
                    "user_id": "Ben Orr",
                    "user_href": "/profile/Ben-Orr-6"
                },
                {
                    "user_id": "Mason Clarkson",
                    "user_href": "/profile/Mason-Clarkson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cammeron Castro",
                "href": "/profile/Cammeron-Castro"
            },
            "answer_text": "You know I think Nathan has it right. His reply sums it up. I graduated high school in 1989 and back then the requirements for graduation were not as strict as they are today. The math requirements for graduation today is way beyond knowledge And what i needed to graduate. My 12 year old son is in 7th grade and doing the math I did to graduate. I homeschool my son and I struggle to help him with math work. I have to spend so much time online relearning this stuff so I can correctly teach him. Back then I also thought why in the heck do I need to know about ancient Greek and Rome. I dont plan on becoming a History teacher or a Historian or an Archeologist. So what is the point on studying this crap. Guess what You never know when you will need to know this stuff. Who would of thought I would be homeschooling one of my kids. I work in realestate and History is not part of my profession but your kids may rely on you some day to help with homework and to avoid doing what I find myself doing alot is going online to learn how to solve math problems and look up information on a certain subjects. There has to be a reason why certain subjects are added to the curriculum. Right now they make no sense. Later on they may. ",
            "date": "Answered January 9, 2017",
            "views": "182",
            "upvotes": " Answer requested by Ben Orr"
        }
    ]
}