{
    "title": "Why can't I study despite the fact that I really want to? Every time I start studying I waste my time doing anything else, please help. - Quora",
    "tags": [
        "Study Hacks",
        "Overcoming Procrastination",
        "Study Strategies",
        "Time Management and Productivity",
        "Procrastination",
        "Study Habits",
        "Studying Advice",
        "Time Management"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nela Canovic",
                "href": "/profile/Nela-Canovic"
            },
            "answer_text": " Here are 5 possible reasons why you can’t study with full focus (and some specific tips to make a positive change that can impact the way your brain works). Reason #1. Everything seems to distract you. It’s super tough to focus on what we’re currently doing because our attention moves onto random little things around us. Here’s an example—multitasking. You know what that’s like: you’re reading email and at the same time you’re keeping your eye on your Facebook updates and who’s been messaging you on WhatsApp. Here’s something you might not know, though—multitasking can lower your IQ by 10 points. If you disable your distractions, you have a better chance to actually do what’s important to you. Here’s how to make the change: Set your phone to Airplane mode when you need to focus. This small tip will make a big difference in the way you structure your study time.Set expectations with others people. Let everyone know you won't be available in the next few hours, so they don’t interrupt you with their questions or ideas on doing something else.Check your email and social media at designated times. For example, try checking 2–3 times a day, maybe around midday, later in the afternoon, and in the evening. And schedule this time in: do it during your lunch break, for example, or when you have a cup of coffee or a snack.Avoid randomly browsing the Internet or reading news. You can always leave these activities for later after you've completed what you need to do. Try closing all tabs on your computer that may be tempting you to browse for “only a few minutes.”Reason #2. There’s a lot of noise around you at all times. For most of us, our home and work environment is far from ideal for focusing, especially when it comes to mentally challenging tasks like reading new material and writing longer passages of text. It’s all a matter of getting creative with overcoming this challenge. Here’s how to make the change: Invest in a good pair of noise-cancelling headphones. They can be helpful whether you’re at home, in a busy coffee shop, at university, and on your commute. You can listen to music without interruptions which will help you relax, and can improve your focus when you need to do your work. Try a classical music playlist or softer chillout beats on YouTube.Get a pair of soft silicone ear plugs like these if you prefer to work in silence. They can easily double up as a safe option for taking a quick nap and also if you’re having trouble sleeping throughout the night due to heavy traffic, loud housemates or neighbors, or ambulance and police sirens in your part of town.Reason #3. You find yourself spending hours on toxic people and social media. Both of these external factors can significantly impact your focus by taking your attention away from what’s important in your life, and moving it to following stories that have nothing to do with what you’re trying to accomplish on that particular day. The good news is this—you can definitely do something about it. Here’s how to make the change: Be wary of toxic people. For example, some toxic people may claim they are your friends, but they are not. Why? Because they don’t support you, they don’t listen to you, and chances are they won’t change just because you ask them to. Be selective who you spend your free time with. And next time a toxic person wants to monopolize your time, just say no. Tell them you’re busy. Don’t engage in gossip or negative banter.Be vigilant about the time you spend on Facebook or Instagram. For starters, try to take everything you see with a grain of salt. Chances are the updates you’re seeing are not your friends’ reality; it’s the version of their reality they want you to see. Instead, focus on what you have going for you in your life. Practice gratitude for the little things, stay true to your goals, and don’t let others sway you from accomplishing your study tasks for the day.Reason #4. You’re not being as mindful as you’d like to be. By now you know that studying feels very much like having a full-time job. You need to work for weeks at a time to prep for exams, the assignments seem endless, and you often lose focus or get distracted with just about anything: a noisy street, a friend calling you to join them for drinks, all those videos you want to browse on YouTube. There’s one way to stay focused and declutter your mind from all those busy thoughts: a simple 10 minute meditation practice. Here’s how to make the change: Download the Headspace app. This is the best way to make meditation easy and fun, not to mention it’s an excellent tool for beginners. You’ll see there are several fun videos to show you how meditating can be helpful in your everyday life.Start with a 10-minute session and do it consistently for 10 days. Once you’ve incorporated it into your week, you can opt to increase the time to 15 and 20 minutes, or you can keep it to 10 if that’s all the time you have.You’ll start noticing the benefits within the first week. They may include decreased levels of overwhelm and stress, a sense of calm that you maintain throughout the day, and improved concentration on your studies.Reason #5. Despite your best intentions, your mind is just not in it. Sure, we say that of course we want to get on with our studies, pass courses, get the degree, and look for that dream job. But it’s one thing to just say what we want, and totally another to make the connection with the original why of our actions. If you get your mind on board with what you’re about to do at the beginning of your study day, you can boost your motivation to keep going until you start seeing tangible results. Here’s how to make the change: Instead of approaching your study time as a chore, turn it into a choice. Don’t tell yourself, “Now I have to work for hours but I don’t feel like it!” Instead say, “This is something I’m excited to learn more about!” The benefit is this—a greater sense of control over your day and the choices you make on how to spend your time.Instead of treating each day as a random schedule of to-do tasks, remind yourself often of the purpose of studying with this question: “Why am I doing this?” Make the connection between what’s happening right now (you’re rewriting notes from a lecture, for example) and the goals you have set for yourself (the answer to your why). This why can be to learn a new skill, or study for an exam so you can graduate on time next year, or get that certification you’ve been dreaming about for years that will add more financial stability to your life.Instead of letting the day happen haphazardly, visualize what you’re about to do. It’s not anything abstract—it’s actually a technique called building a mental model, where you imagine in detail what you expect to learn. As you do the exercise, be sure to cover all the steps you’ll be doing. For example, if you are researching something new, visualize covering a certain amount of material (3 chapters, for example), taking notes on important concepts (instead of rewriting a whole lecture) , or writing down questions to follow up on later so you get all the information you need. Visualizing is the brain’s favorite way to absorb new material. And by telling yourself a story, you train your brain to map out the learning process, making it easier to understand.",
            "date": "Updated February 13, 2018",
            "views": "643",
            "upvotes": " View 547 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pavna Sivaprakash",
                    "user_href": "/profile/Pavna-Sivaprakash"
                },
                {
                    "user_id": "Banu Ceferli",
                    "user_href": "/profile/Banu-Ceferli"
                },
                {
                    "user_id": "Malavika",
                    "user_href": "/profile/Malavika-97"
                },
                {
                    "user_id": "Areej Fatima",
                    "user_href": "/profile/Areej-Fatima-66"
                },
                {
                    "user_id": "Ramesh Advani",
                    "user_href": "/profile/Ramesh-Advani-13"
                },
                {
                    "user_id": "Jam Ham",
                    "user_href": "/profile/Jam-Ham-22"
                },
                {
                    "user_id": "Madras Chennai",
                    "user_href": "/profile/Madras-Chennai-1"
                },
                {
                    "user_id": "Priya S Gubber",
                    "user_href": "/profile/Priya-S-Gubber"
                },
                {
                    "user_id": "Rahaf Laieb",
                    "user_href": "/profile/Rahaf-Laieb"
                },
                {
                    "user_id": "Manav Modi",
                    "user_href": "/profile/Manav-Modi-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Earl",
                "href": "/profile/Sam-Earl-12"
            },
            "answer_text": "I struggled with this exact thing more times than I can count. Sitting in the library at 6 pm. Ready to write my lab report, knowing it’s due tomorrow. I have the energy and motivation to get started. But when that stupid blank word document stares back at me, all I can do is focus on the music I’m listening to, the wood grains in the table, the others in the library diligently working, anything except what I’m supposed to write about. My brain is turning against me, deciding to produce nothing but mush. I don’t like any of the first sentences I write — they’re all crap anyway. But I need to finish this paper tonight. I think about my usual strategy: change locations. But, I can’t go home because I know there are even more distractions there. All other buildings are closed. I go to the bathroom, walk around a little, and decide to start my paper in the middle. It’s the closest thing I can get to changing locations. A fresh start to a part I know I can complete. The words start flowing and I don’t hate them, but I’ll definitely edit them later. When I finally complete my paper, it’s not terrible. It’s actually pretty good. Another battle with distraction is won, but the war continues.  Whether it’s studying or writing papers, I was constantly procrastinating even when I knew I needed to get something done. I developed some techniques to help me get work done when I really needed to. Grab some friends. This only works if they actually want to study; don’t choose friends that will further distract you. My roommates and I would help each other study for tests all the time. We were able to hold each other accountable to get our work done. This was especially helpful if they were in the same class. If I didn’t want to study, but they did, I used them as motivation to get my ass in gear. Change your scenery. This works for so many things. Sometimes just changing rooms helps, but you may need to drastically change your environment if you still can’t focus. If you are unable to move to a new location, try shifting your focus to a different part of the task, or do something else for 5 minutes (keep it short and limited). Create a reward system. Create mini goals and then reward yourself for completing them. For example, a goal could be to review 3 concepts until you can effectively summarize them. The reward being something you enjoy like a piece of candy or 5 minutes on Instagram (again, keep it short and limited). Be sure to not reward yourself for crappy work and do not let these rewards distract you. Work through the bullshit. Sometimes you don’t have access to your friends and you can’t focus despite efforts to shake up your mind a bit. This is when pure persistence wins. It may feel stupid to write words that don’t make sense or study in a half-assed manor. But I’ve found if you just keep with it, eventually you’ll start to be productive and make real progress. ",
            "date": "Answered March 27, 2019",
            "views": "63",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jay Me",
                    "user_href": "/profile/Jay-Me-54"
                },
                {
                    "user_id": "Yazna Boskany",
                    "user_href": "/profile/Yazna-Boskany"
                },
                {
                    "user_id": "Apostolos Grigoriadis",
                    "user_href": "/profile/Apostolos-Grigoriadis-1"
                },
                {
                    "user_id": "Hasnaa Elshennawy",
                    "user_href": "/profile/Hasnaa-Elshennawy-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/R-R-997"
                },
                {
                    "user_id": "Emil Polivin",
                    "user_href": "/profile/Emil-Polivin"
                },
                {
                    "user_id": "Kirti Dalal",
                    "user_href": "/profile/Kirti-Dalal-1"
                }
            ]
        }
    ]
}