{
    "title": "Why did you go to the place you moved to? - Quora",
    "tags": [
        "Moving and Relocating",
        "Moving"
    ],
    "response": [
        {
            "author_info": {
                "name": "Greg Shafer",
                "href": "/profile/Greg-Shafer-6"
            },
            "answer_text": "I was bored in the states. My parents passed away, that I was taking care of. So had lots of time on my hands. I found America women my age weren't interested in relations, the had their decease spouses insurance money, no need to put up with another man. Younger woman were looking to hit the jackpot with a rich guy. The rest of them became lesbians and feminist. Here in Colombia woman know the value of a good man who can provide a good home. They like having a secure relationship, with an honest man. I found a woman here that we hit it off here. We married after being here one year, and now we have been married more then two years. She is not wanting to move to the US till after her parents pass, and maybe not then. Meanwhile I have learned to adapt here and we find a lot to laugh about. My pension is small but goes much further here, I have been able to save money here. Colombia has lot to see and learn about. ",
            "date": "Answered November 7, 2019",
            "views": "269",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lisa Dewey",
                    "user_href": "/profile/Lisa-Dewey-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jennifer Dougherty",
                "href": "/profile/Jennifer-Dougherty-2"
            },
            "answer_text": "I chose to move to Brooklyn because my now ex-husband asked if I would consider moving to NYC, so I said yes. I stayed because we were still married until 2 years ago and I have been unsuccessful in finding employment outside of New York. I would LOVE to leave, but this city tends to suck you in, chew you up and spit you out. I’m hoping to get out on my own before the city spits me out. ",
            "date": "Answered November 7, 2019",
            "views": "79",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lisa Dewey",
                    "user_href": "/profile/Lisa-Dewey-4"
                }
            ]
        }
    ]
}