{
    "title": "Why do you go to business seminars? - Quora",
    "tags": [
        "Seminars",
        "Business-to-Business",
        "Small Businesses",
        "Entrepreneurship"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nisaar Y. Nadiadwala",
                "href": "/profile/Nisaar-Y-Nadiadwala"
            },
            "answer_text": " I always thought business seminars are boring until I attended one which had a lot of activities and one of them was - Workshops. I decided to attend one after going through the list of all the workshops and trainers. I attended four workshops on that day sitting like an attentive schoolboy in the class. Trainers and speakers after speakers came and shared their knowledge of marketing and trends in business. Soon I felt like being grownup like a businessman. I took a stroll at the exhibition and saw things differently. I regretted not bringing my visit cards. I was not a businessman, but I started developing an interest in the business. The next day, I went back and studied at least ten different businesses at the venue. The business was not only in the venue but also in the passages, canteens, lounge, each inch was occupied with business. People were selling everything from ideas to advice, franchises and different services. A gentleman was selling introductions of VIPs. He offered me to take me to the VIP lounge and introduce me to the speakers, journalists and guests whom I can give my visit cards and talk. I started talking to people and got my first client in staff training - Ethics at Office. Then onwards I started looking forward to all sorts of seminars from Medicine, wellness, real estate, education to food seminars and started getting business (yes I do not say freelancing) I do not go to seminars to make friends, window shopping or look for a job but I look for clients. That is why I go to business seminars and that is why you should also go to seminars. ",
            "date": "Updated October 5, 2019",
            "views": "607",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pranav Kennedy",
                    "user_href": "/profile/Pranav-Kennedy"
                },
                {
                    "user_id": "Simran Gangaramani",
                    "user_href": "/profile/Simran-Gangaramani-2"
                },
                {
                    "user_id": "Sunit Jain",
                    "user_href": "/profile/Sunit-Jain-7"
                },
                {
                    "user_id": "Sabihah Zainuddin",
                    "user_href": "/profile/Sabihah-Zainuddin"
                },
                {
                    "user_id": "Hasan Abid",
                    "user_href": "/profile/Hasan-Abid-4"
                },
                {
                    "user_id": "Chief Debbarma",
                    "user_href": "/profile/Chief-Debbarma"
                },
                {
                    "user_id": "N.Hanji Yoshida",
                    "user_href": "/profile/吉田-憲人-N-Hanji-Yoshida"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dwayne Vera",
                "href": "/profile/Dwayne-Vera"
            },
            "answer_text": "Business seminars can be the greatest opportunity to excel your career, or the biggest waste of time and resources ever, just depends on you. As someone who has attended as a vendor/ patron/ and VIP to business seminars, I can tell you from all 3 layers that people typically attend for 1 of 5 reasons: Educational Opportunities.In-Person Networking.Learn About Competitors.Marketing to Potential Clients.Spark Creativity and Innovation.1: Educational Opportunities- Between speakers, workshops, and demos, there are nearly endless opportunities to learn how to increase your business. Speakers are designed to motivate you and teach you amazing soft skills to accelerate your ability to navigate the future of your business. Pay attention to the speakers and where they are from, as you will find a common thread of Emotional Intelligence that has allowed them to preserve. Workshops give you hands on experience to apply your knowledge in set up situations, allowing you to sample your thoughts, abilities, and skills in a “laboratory” environment with an expert looking over your shoulder. Demonstrations allowing you to see new products and services that may help you close the gap between the ideal process and your process. 2: In-Person Networking- Most people think of finding clients when they think of networking. This is a golden opportunity to find more than just clients. There are many peers you can use as accountability partners. There are people who can actually become your partners, as you use your complimentary skills to make something great. There are potential investors who are looking for someone to become their next 10-bagger. There are even vendors and future employees who can help make your vision a reality. 3: Learn About Competitors- This is an under rated reason to go to a seminar, but knowing your competition is a way to better understand your clients, because they know your competition. It also gives you a peak into their intelligence efforts and what they feel is a way to reach the hearts of both of your ideal clients. 4: Marketing to Potential Clients- Not much explanation needed. 5: Spark Creativity and Innovation- This is a given. You should walk into everyone of these seminars trying to spark something in your mind. Every idea, every $Billion company, every life changing business, started with a spark of innovation and creativity. Use this as a template next time you go to a business seminar. ",
            "date": "Answered September 19, 2019",
            "views": "96",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "N.Hanji Yoshida",
                    "user_href": "/profile/吉田-憲人-N-Hanji-Yoshida"
                }
            ]
        }
    ]
}