{
    "title": "Why don't many schools teach their students practical life skills such as personal finance and cooking? - Quora",
    "tags": [
        "Skills",
        "Teaching",
        "Schools",
        "Personal Finance"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nyssa Thomassen",
                "href": "/profile/Nyssa-Thomassen"
            },
            "answer_text": "In many cases, school boards, elected locally by the people in the community are discouraging districts from teaching these classes. This is at least partially because there is a focus on either subjects that will be tested, such as reading and math, or STEM, science, technology, engineering, and math. Any of these classes could fall under one of those two umbrellas, but members of a school board are often members of the community. They may be highly educated, the may have very little education, and they may even be against public education and ran with the intent of undermining the school system. They are almost never educators themselves. They often don’t even have children in the system. So, what’s their particular deal with practical classes? One, practical classes often need additional teachers, who may be more expensive if they are currently professionals. Business teachers who are capable of competently teaching investing, for example, probably already have lucrative careers actually investing, and walking away from that would be costly unless there was a major financial incentive. Culinary courses are still sometimes taught at middle or high schools, but they don’t necessarily teach useful skills. Home economics is meant to be a class for learning some basic cooking skills for preparing a meal and budgeting for a home, but I learned nearly all of that outside of that class, and I took two years of the class. And good luck getting a parenting class into the curriculum of a school district with a school board that believes in abstinence-only education. I have totally seen such classes, but not in schools where they might be useful. ",
            "date": "Answered August 14, 2018",
            "views": "466",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/John-B-882"
                },
                {
                    "user_id": "Max Sklar",
                    "user_href": "/profile/Max-Sklar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doug Hensley",
                "href": "/profile/Doug-Hensley-8"
            },
            "answer_text": "How is a school going to thread the needle on “parenting”? Now go to bed and say your prayers? Now brush your teeth and go to bed? Do your homework before you go to bed? The simplest things are going to infuriate a third of the parents, or maybe two thirds of them. As to cooking, Theodore Dalrymple (Dr Anthony Daniels) wrote that in all his time as a prison psychologist, when he’d make home visits in the course of his professional duties, and visit British British, not immigrants, he’d never once seen anybody cooking anything. They all just lived on ready-to-eat junk food. It seems improbable that a few lessons off and on in school would be any more likely to turn that around than they did with the bit about “if it’s not yours, don’t take it”. Now we come to investing. This is a game of wits, and a game of deep insights. You’d need to read Black Swan and some other works by Nasim Taleb, and understand what he was getting at, and you’d need to be a decent judge of risk and timing and the way the world was shaping up, to invest well. Most people do better to just chuck it in an index fund and ignore market fluctuations and stick with chucking it in. If they have the self discipline to watch a pile of money grow and not dip into it for some vacation or home addition or what have you. I blanch to think what would happen when people fresh out of high school with a whole B in “Investing” started playing the market. Lambs to the slaughter. ",
            "date": "Answered August 14, 2018",
            "views": "367",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Josh McNallyayres",
                    "user_href": "/profile/Josh-McNallyayres"
                }
            ]
        }
    ]
}