{
    "title": "Why don’t U.S schools teach more life skills? - Quora",
    "tags": [
        "Schools in the United States",
        "Teaching in Schools",
        "Education in the United States of America",
        "Skills",
        "Teaching",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Jainschigg",
                "href": "/profile/John-Jainschigg"
            },
            "answer_text": "As near as I can figure, it’s because schools have become subject to conflicting pressures because of socioeconomic evolution. In the early-to-mid 20th century, things like Home Economics, Shop, etc., were often part of the curriculum of general education (as distinct from vocational education). But they were rarely taught well, and schools were gradually pressured to abandon teaching in these areas and focus on academic subjects that seemed critical to employment. To this day, when schools deliberate bringing “life skills” back into curricula, they tend to get a lot of pushback from parents who insist that they can teach these things at home. I suspect that this connects to the idea that ‘life skills’ are bound up with culture: part of the package of cultural norms and values (some at least dictated by religion) that parents want to convey to children without interference by the state. Americans (and others) have always been touchy about this boundary, but not all are touchy in the same ways. Some parents jealously guard their unique right to convey certain domestic skills and values to their kids. Others seek to deny their children certain kinds of quasi-vocational knowledge in favor of more-privileged forms of learning — feeling anxiety that, for example, knowledge of cooking or typing will tend to turn a person into a home-maker or secretary (instead of a professional). Meanwhile, a larger and larger component of the population has become both literate and highly educated — in particular, women, who have historically run the household and have been key to mastering and then imparting the larger subset of critical life skills (many of which pivot on providing for children and family financial security, and on managing consumption). And this has gradually resulted in the “professionalization” of life skills — also driven by the fact that society has become much more marketing- and choice-driven; much more litigious (so lawyers, contracts, small print, and legal jeopardy are everywhere); and where technology has interpenetrated every aspect of daily life. The result: It’s a lot harder to do everything than it used to be. Shopping for a meal, comparing credit-card offers, filling out the paperwork to enable insurance reimbursement for medical bills, buying a phone … everything now seems to require much more agency, much more information, much more work, and generates much more anxiety.Expertise and time to deal with this stuff is not evenly-distributed. Ability to navigate and optimize access to complex systems of consumption (e.g., college admissions and financial aid systems) is now part of the apparatus by which elites maintain their status, and deny opportunity to those not ‘in the know.’For this reason, I’ve long believed it essential that schools get back into teaching “life skills” in a modern way, and that they become good at it. It’s not that math, history, or language arts are less important, but that these other things deserve real attention too. ",
            "date": "Answered March 9, 2020",
            "views": "51",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joshua Farber",
                    "user_href": "/profile/Joshua-Farber"
                },
                {
                    "user_id": "Cortland Richmond",
                    "user_href": "/profile/Cortland-Richmond"
                }
            ]
        },
        {
            "author_info": {
                "name": "Diana Dubrawsky",
                "href": "/profile/Diana-Dubrawsky"
            },
            "answer_text": "My opinion? When the US shifted its economic emphasis to consumption, rather than production, it became obvious to those in power that teaching such things as critical thinking, consumer math and personal finance (how credit works, how to file one's taxes), civics, history, and basic life skills, would be counterproductive to those who seek to gain and maintain economic privilege. The housing loan crisis that nearly crashed the world economy in 2008 wasn't an accident; it was the end result of fifty years of failure to teach consumer math, personal finance, critical thinking, and history. In case you didn't notice—the end result of that 'crisis' was that the rich got richer. ",
            "date": "Answered March 9, 2020",
            "views": "46",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Murphy",
                    "user_href": "/profile/Chris-Murphy-104"
                },
                {
                    "user_id": "David Hirst",
                    "user_href": "/profile/David-Hirst-4"
                },
                {
                    "user_id": "Tzivia Adler",
                    "user_href": "/profile/Tzivia-Adler"
                }
            ]
        }
    ]
}