{
    "title": "Why do Indian students troll their teachers? - Quora",
    "tags": [
        "International Students from India",
        "Education in India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anubhab Kundu",
                "href": "/profile/অনুভব-কুন্ডু-Anubhab-Kundu"
            },
            "answer_text": "Actually teaching standards have fallen in the Indian education system. I am myself a student and as far as i have read, we had a much better system of education which involved practical knowledge more than theory. Then after the Britishers came, they completely destroyed our education system by making it suitable for churning out clerks and officers without practical knowledge. So coming back to the question, there are many reasons why students nickname teachers and troll them like anything. Most teachers cannot teach properly most follow the bookish knowledgeTeachers have unsuitable teaching style that does not make sense at allTeachers behaviours are the biggest victims of nicknaming. I have a teacher in college whom i have never seen smile but heard her scold the students for silly reasons. She really deserves a codename.Teachers often look for respect like as if they are begging for it, even though they dont deserve respect as teacher. I tell you there are professors in schools who dont know what subject to teach and how to do it, yet they are teaching it. The result: his/her pupils get very poor marks in the subject taught by him/him. I had one chemistry teacher like that whose teaching never got into our heads.Disregard and disrespect for a pupils idea is something seen very often in schools. I was once an innovator myself and had designed a powered assisted HPV without knowing it already exists (that time internet packs were costly: 251 rupees for 1 GB 3G, which often used to be 2G). My physics teacher actually looked down upon this side of my curious mind and said to my mom in PTM: “those cars wont get him anywhere, tell him to concentrate on his studies” - mom knew what i made and told me later, that HPVs do exist in 4 wheel configuration. I also designed a hydro electric locomotive that used water head to turn generator shaft to run the traction motors, and water could be pumped back by battery operated pumps. That design was not very good because of height restriction and dad pointed it out. My school physics teacher laughed it off and ridiculed it instead of pointing that factor out.When pupils put forward their alternative approaches to solve math problems, the teacher instead of looking at it, says, “ you must follow my method else no marks” or “dont attend my class from tomorrow”. Sad truth as to why indians cannot innovate much.These are some reasons i ended up having to dislike that fellow. And why teachers get trolled back and forth. ",
            "date": "Answered December 1, 2018",
            "views": "139",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sudarshan Sethuram",
                    "user_href": "/profile/Sudarshan-Sethuram"
                },
                {
                    "user_id": "Aman Jha",
                    "user_href": "/profile/Aman-Jha-273"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicky Sayyed",
                "href": "/profile/Nicky-Sayyed"
            },
            "answer_text": "Teacher at any level,in any field shud be respected,irrespective of whatever differences lies between a teacher and a student. If students troll teacher in India or anywhere else in the world, there has to certain factors prompting these behaviour. Maybe the teacher has done something to offend a individual student or a class,maybe the teacher is not qualified enough,(It happens in many remote Indian villages)or other reasons. Sometimes the student/students doesn't have basic etiquettes of respecting them due to lack of proper upbringing (rich,famous, influential fmly background )they think they pay fees ,so that any behaviour on their part with teachers or others in school shud be accepted and not questioned by any authority. ",
            "date": "Answered December 12, 2018",
            "views": "43",
            "upvotes": " Answer requested by Aman Jha"
        }
    ]
}