{
    "title": "Why is scaffolding technique for teaching thought of as the best style of teaching in the West? How does this differ in the East? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "David Lascelles",
                "href": "/profile/David-Lascelles"
            },
            "answer_text": "No idea about the east, though I have found a lot of theories tend to cross that divide now. Scaffolding is based on solid academic theories about childhood development and has been shown to work far better than previous methods. Certainly in my experience I have seen it work very well. It works, if done right, by making the concepts being taught more accessible to everyone. It does this by providing just enough support so that the student is just out of reach of the answer - pushing them into that ‘zone of proximal development’ where they can push themselves and understand it. This is compared to the widely used previous system which basically did no support and just expected them to catch up regardless of their ability. This meant the clever students were bored, the medium level students were bored and the low level students were frustrated at being seen as ‘the stupid ones who never get it and slow things down for the rest’ by the rest of the class. This does not happen with scaffolding because each student is given exactly the help they need to achieve what is expected of them. So, if done right, every student feels like they have worked hard at something and achieved it - a hard won but doable battle. Say, for example, the students need to do a practical to demonstrate a concept in science. Your low level kids will be given exact instructions, a step by step protocol, and maybe some help in setting up the experiment. They will have some questions about the data collected appropriate to them - with some slightly harder ones at the end. Basic knowledge - what happened - questions. Maybe a short ‘explain’ at the end. Your mid level students will get the same protocol but will not need help. Their questions will be harder - that explain question will be included and maybe some harder ones. Maybe a question like ‘how could you do this better?’ Your high level students might get a list of available equipment and an instruction to work out an experiment to test the theory. They may need help with this (at the very least teacher should check the proposed protocol for sense, errors and safety stuff) but should be expected to come up with something that will work. Their questions will include stuff like ‘how reliable was your method?’ and ‘How could you improve it?’ and so on. In this case, everyone is challenged and no one is waiting for the slower students to ‘get it’. ",
            "date": "Answered September 24, 2018",
            "views": "69",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mickey Bell",
                    "user_href": "/profile/Mickey-Bell-2"
                }
            ]
        }
    ]
}