{
    "title": "Why do teachers need to move around the classroom during the lesson? - Quora",
    "tags": [
        "Teaching Methods",
        "Classrooms"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Kaplan",
                "href": "/profile/Daniel-Kaplan"
            },
            "answer_text": "Need? I recently injured my foot. I spent three days teaching from my lectern in front of the class. It wasn’t ideal, but it was what had to happen. “Need” isn’t the right word. What is ideal about moving around the classroom? Moving around the classroom allows me to see students from multiple angles, letting me see what they’re doing instead of listening to me or engaging in class. I can see if they’re hiding their phones under their desks, drawing, etc.It is a bit more dynamic than me just sitting there in front of them. That helps students pay a bit better attention.I can also adjust behavior using “proximity.” Only the most recalcitrant students can ignore me standing over them while they continue to misbehave. In fact, I don’t think I’ve ever had it happen.But the real reason I do it? There are nights when I don’t sleep enough, resulting in me feeling a bit like the walking dead. I have yet to fall asleep while walking around. ",
            "date": "Answered September 2, 2019",
            "views": "24",
            "upvotes": " View 70 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maxi France",
                    "user_href": "/profile/Maxi-France"
                },
                {
                    "user_id": "Diane Ferguson",
                    "user_href": "/profile/Diane-Ferguson-15"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Tiana-151"
                },
                {
                    "user_id": "Arran Kleyman",
                    "user_href": "/profile/Arran-Kleyman"
                },
                {
                    "user_id": "Carl Anderson",
                    "user_href": "/profile/Carl-Anderson-22"
                },
                {
                    "user_id": "Aaron Almaguer",
                    "user_href": "/profile/Aaron-Almaguer"
                },
                {
                    "user_id": "Nancy Brilliant",
                    "user_href": "/profile/Nancy-Brilliant"
                },
                {
                    "user_id": "Joseph Baptist",
                    "user_href": "/profile/Joseph-Baptist-1"
                },
                {
                    "user_id": "Alexandra Torres",
                    "user_href": "/profile/Alexandra-Torres-20"
                },
                {
                    "user_id": "Carol Harding",
                    "user_href": "/profile/Carol-Harding-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bella Freeman",
                "href": "/profile/Bella-Freeman-16"
            },
            "answer_text": "You need to ensure it’s not going to be difficult or embarrassing when you actually do need to go over to a specific student. For example, my class and I meet in a room where other students have been. If all teaching staff who use that room didn’t make an effort to circulate around the room, the students would set the furniture so there was no room for us to get around and talk to individual students. There’s barely enough now anyway, as I am a larger person. So you need to make sure you actually can pass — and for the sake of student dignity, you need to make sure all students are equally used to seeing it happening. (The other reason is that when your lesson is being inspected and you are a fat teacher, you will more likely be told you’re not circulating around the room — as if the person reviewing you needs to know you can complete a certain number of laps/steps. So I make an extra point of proving I do that if other eyes are on me.) ",
            "date": "Answered September 3, 2019",
            "views": "617",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Diane Ferguson",
                    "user_href": "/profile/Diane-Ferguson-15"
                }
            ]
        }
    ]
}