{
    "title": "Why do so many academics appear to be socialist, when history shows they're usually the first people to be put up against a wall during any socialist revolution? - Quora",
    "tags": [
        "Political Philosophy",
        "Revolution",
        "Left-Wing Politics",
        "Socialism",
        "Academia",
        "Political Science",
        "Countries of the World",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Lindstrom",
                "href": "/profile/Michael-Lindstrom-15"
            },
            "answer_text": "most academics are not socialists… unless you want to believe Fox, or the right-wing. They tend to lump everyone up as ‘enemies’… Try to listen to the difference between ‘leftists’ which the left and right wing don’t like, and democrats, which are more centrist than socialist. Academics tend to know that social programs are necessary in a capitalist society… those programs that keep capitalism from getting out of control… which would end up being an oligarchy… (the end-game of capitalism)…. There are only 2 ways to prevent this outcome: Responsible earners taking care of the employees, including programs to support their workers socially, medically, etc. There are some companies which offer this form of support, but not nearly as many as would be needed. These are self-containing companies and end up with happy, well-taken care of employees. If they all did this, capitalism could work on it’s own.all the social programs that could be set up to support the community and welfare of employees needs to be provided by an outside source as well as those accumulating the money need to be tapped for the support necessary to fund these supports.So, if corporations were more responsible, we would not need the government stepping in to help out… but since money is the driving force of capitalism… balance needs to be put in place to help support the rest of the population. ",
            "date": "Answered August 6, 2019",
            "views": "91",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sean Ahluwalia",
                    "user_href": "/profile/Sean-Ahluwalia"
                },
                {
                    "user_id": "Clifford Nelson",
                    "user_href": "/profile/Clifford-Nelson-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Grant Mackay",
                "href": "/profile/Grant-Mackay-11"
            },
            "answer_text": "Your correct observation that Socialist Thinkers ( also read communist or very close).. are liquidated as a matter of course during major Coups.. Either from the left or right. Not all of course.. As puppets and figureheads some are useful to calm the population.. many times in the past these Socialist Agitators and Spokesmen for Change would be directly involved in bringing down the Ruling Party of whatever country is being targeted for take over… Stalin said it best.. Useful Idiots… their naivete such that they are blind to the endless lessons of history… That very few of the leaders of Revolution survive the cut once the smoke clears. Its logic.. Brutal logic.. But eminently sensible… if these people who can organise and run secret cells.. Writers.. Army Officers…Poets etc.. Who can fire peoples ideals and patriotism.. enough to open the way for their country to be assimilated by an outside force.. Decide they are not happy with what they fought for.. decide to go against the New Order.. they would be most troublesome to eliminate if they had gone underground again. Thus its far easier to catch them in the first throes of their imagined victory… Invent some spurious charge against the targeted individual and put him up against a Wall.. Potential troublemaker out of the frame for evermore. The best case in point for this train of thought is the infamous Katyn Forest Action… originally the Russians blamed the Germans for the execution of thousands of Polish Army Officers.. Shot in the back of the head.. Hands tied behind their backs.. and buried in shallow graves. It did not take more than cursory investigation to lay the blame directly at the feet of Stalins NKVD. In a good example of the Dark Incompetent Stupidity of Russian Secret Services.. A theme that continues to this day… a great majority of the bullets dug out of the back of the corpses neck ( a bullet to the back of the neck an NKVD signiture).. Were from Makarov Pistols.. Standard issue side arm to Russian Forces.. if it had been the Nazis I suppose they could have got hold of lots of Makarovs for the pretty big task of killing thousands of Poles.. But doubt very much they would have bothered… Anyway.. The Russian accusation was laughable and fell as soon as the first grave site was investigated. But as atrocious as this obscene act was… It did have a logical point to it.. Russia already had designs on Poland.. Even during the War.. and took the chance to eliminate thousands of potential trouble makers in the future by wiping out a lot of the Polish Officer Class. For exactly the same reason the Russian Army halted outside Warsaw.. In that case they let the Germans do the job for them… Poles had risen against their hated Occupiers.. simple commonsense to let their enemy liquidate the potential troublemakers who might resist them when their own occupation of Poland took place in good time. Sadly… as Well described in John Steinbecks great description of lost illusion… IN DUBIOUS BATTLE.. the great majority of socialists are dreamers… So busy agitating and sabotaging their own countries.. The idea that their services have a shelf life seldom enters into their thinking… Until they are against the wall… too late then to realise you got it badly wrong. ",
            "date": "Answered August 6, 2019",
            "views": "71",
            "upvotes": "0"
        }
    ]
}