{
    "title": "Why is math an important subject? - Quora",
    "tags": [
        "Teaching Mathematics",
        "Mathematics Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Parikshit Gautam",
                "href": "/profile/Parikshit-Gautam-8"
            },
            "answer_text": "We learn mathematics in schools due to these 8 reasons - 1. Learning math is good for your brain Research conducted by Dr. Tanya Evans of Stanford University indicates that children who know math can recruit certain brain regions more reliably, and have higher gray matter volume in those regions, than those who perform more poorly in math. The brain regions involved in higher math skills in high-performing children were associated with various cognitive tasks involving visual attention and decision-making. While correlation may not imply causation, this study indicates that the same brain regions that help you do math are recruited in decision-making and attentional processes. 2. Math helps you tell time “I’m late, I’m late for a very important date.” – White Rabbit from the movie Alice in Wonderland. Don’t let your ignorance of math make you like the White Rabbit! A recent study indicated that 4 out of 5 children living in Oklahoma City can’t read the hands on an analog clock to tell time. Knowing math, and particularly fractions, can help you better tell time. While analog clocks may eventually become obsolete, don’t let your ability to tell time become outdated! Use your knowledge of fractions to help you tell time on analog clocks that have an hour, minute, and (sometimes) second hand. 3. Math helps you with your finances Math can be helpful for balancing your budget because you will have a good understanding of how to make sure that your costs are less than the money you have. Balancing one’s bank account, for example, is an important life skill that requires math in order to subtract balances. People who know math are therefore less likely to go into debt because they did not know how much money they had versus how much money they spent. 4. Math makes you a better cook (or baker) With knowledge of math, for example, you can quickly deduce that a half-cup of flour is the same thing as eight tablespoons of flour. This skill can prove handy if you find that your half-cup measure is missing. Likewise, if you are cooking from a recipe that serves four people, but you need to feed eight people, your math skills tell you that you can simply double all of the necessary ingredients. Without math, you may not have enough food (or have too much food) to feed your guest! 5. Math helps us have better problem-solving skills Math helps us think analytically and have better reasoning abilities. Analytical thinking refers to the ability to think critically about the world around us. Reasoning is our ability to think logically about a situation. Analytical and reasoning skills are essential because they help us solve problems and look for solutions. While it may seem far-fetched to believe that solving the train problem above can help you solve a problem in your life, the skills that you use in framing the problem, identifying the knowns and unknowns, and taking steps to solve the problem can be a very important strategy that is applicable to other issues in life. 6. Practically every career uses math in some way. Obviously, mathematicians and scientists rely on mathematical principles to do the most basic aspects of their work, such as test hypotheses. While scientific careers famously involve math, they are not the only careers to do so. Even operating a cash register requires that one understands basic arithmetic. People working in a factory must be able to do mental arithmetic to keep track of the parts on the assembly line and must, in some cases, manipulate fabrication software utilizing geometric properties (such as the dimensions of a part) in order to build their products. Really, any job requires math because you must know how to interpret your paycheck and balance your budget. 7. Math is all around us and helps us understand the world better To live in a mathematically-driven world and not know math is like walking through an art museum with your eyes closed. Learning and appreciating math can help you appreciate things that you would not otherwise notice about the world. In reality, math is everywhere! Don’t believe me? Read on for some examples of math in nature. Bees, masters of geometry, use hexagons to build their honeycombs. The Fibonnaci sequence, a famous sequence of numbers in mathematics, is found throughout nature: in pinecones, seashells, trees, flowers, and leaves. The number pi can also be observed all around us. Pi is a cool number with many unique properties. Pi is approximately 3.14, but in reality, it is greater than 3.14, with an infinite string of numbers after the decimal point. Because pi is, in reality, an infinitely long number, it is expressed as the Greek letter pi (π). It cannot be expressed as a fraction; numbers that cannot be expressed as fractions are said to be irrational. Pi is also transcendental, which means that it is non-algebraic; this means that pi cannot be the solution of single-variable polynomial equations whose coefficients are all integers. (By definition, all transcendental numbers are also irrational.) The number pi can be observed in the shapes of rivers. The ratio of a river’s length to the distance from the source to its mouth is called the “meandering ratio.” The average meandering ratio of rivers approaches the number pi. It makes sense that the average meandering ratio of rivers approaches pi, because rivers tend to bend into loops, which are circular in nature. The ratio of a circle’s circumference to its diameter is also equal to pi. Now that you know more about pi and about how math governs nature, don’t you feel that you have a greater command over the mathematical laws of the universe? It can be empowering to learn about mathematical principles because it can help make sense of a world that, oftentimes, does not make much sense. 8. Math can make you more popular Before you start to disagree with me, think about how great it is to go to dinner with a friend who can quickly divide a check in their mind to determine how much each person needs to pay to split the bill. Your knowledge of fractions can also help you divide a pizza among a few people. While math is popularly the realm of nerds, your ability to avoid awkward confusion and silence as you and your friends try to divide a pizza or a dinner bill is a truly valuable skill. Be known as the cool (yes, I said cool) person that knows how to do mental math quickly! ",
            "date": "Answered October 25, 2020",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ross Johnson",
                "href": "/profile/Ross-Johnson-81"
            },
            "answer_text": "My younger brother is a hands-on kinda guy. Very smart, likes to read and keep up on world events, but has always wanted a job where he could work with his hands and leave his work at the job site. When he left his last algebra class he was gleeful because he was sure that he was finished with that dread and useless subject. He went to a two year tech school and got good enough that his company bought new top of the line equipment after he accepted their job offer, for him. He is now foreman and also chief mechanic, inventory specialist, and wears about 3 other hats as well. And he shakes his head and laughs because as he tells it, he uses algebra every day. He uses math to mix various solvents they use in the most cost-effective way. He uses it to determine if their inventory is adequate, and when they need re-orders. He also uses math to plan and execute carpentry jobs around the house and for his in-laws. (For that matter, my only-went-to-college-one-year dad can do amazing things with fractions when building fences, porch rails, etc… all with a pencil on the back of a 2x4.) I use math to compare the unit prices of different products in the store, even when I need to convert to a common unit. Statistics are something everybody should understand. Covid-deniers would have a harder time selling their ignorance if people were better at thinking mathematically. My younger daughter, who started her own math tutoring business in high school, says that teaching “common core math” is just trying to teach everybody to think about math the way she does intuitively… but then she did math competitions for fun in middle school, and had double 5s on the AP calculus test. Useful stuff, maths. ",
            "date": "Answered September 9, 2020",
            "views": "343",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Isaac Pletcher",
                    "user_href": "/profile/Isaac-Pletcher-1"
                },
                {
                    "user_id": "Alisa Boyd",
                    "user_href": "/profile/Alisa-Boyd-3"
                }
            ]
        }
    ]
}