{
    "title": "Why is writing decreasing in schools? - Quora",
    "tags": [
        "Secondary School Education",
        "Education in India",
        "Writers and Authors",
        "Teaching",
        "The High School Experience",
        "Writing Advice",
        "Schools",
        "Writing",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shahzada Akbar",
                "href": "/profile/Shahzada-Akbar-1"
            },
            "answer_text": "Thanks, This is a very interesting question to explain. Before answering this question let me explain why writing is important and why it should be a crucial part of any educational organization. Be it would be college, school, coaching classes, It should be a mandatory part of all educational organization. You must be thinking that I am explaining another question, Well I am aware of the right question, but I would like to explain from the very beginning so that one can understand everything from basic and relate my answer. If you read the above question carefully then you will get to know that this question raised because of ignorance of writing in schools! Why are we taking care of this question, I mean we could have simply ignored this question, we could have left this question saying that it is not important if writing part is being ignored in today’s world. The main reason for this question is on quora today, is its importance. In short, we can say that this is very important and really a matter of concern. So here I am going to share first why writing is important for all of us. Why writing is an important part? Writing is an important part of a good, as well as a formal conversation: Although many people find it as a boring task to write, we should never forget the fact that writing plays a crucial role in a formal as well as in an informal conversation.Writing relieves the stress: This is the second important part of writing that it relieves the stress also. Today we are living in the twenty-first century, where stress is just a common thing to be found easily. Writing can relieve stress and make one feel happy.The best tool to express your feelings: This is the third point that shows why should we write. Writing is the best tool for expressing your feeling and that too without any cost or less cost, You just need a pen and a paper to write whatever you want to.Writing can improve your memory: This is also an amazing fact that writing can improve your memory. When we write, we try to remember the words, sentences, and incidents also, so this activity makes our mind practice to think faster. As a result, it improves our memory.You must be thinking about the main question because of which you are here. Let me explain that only now. So without wasting more time let us focus on the main question, as of now, you all are well aware of the importance of writing in one life. The question was why is writing decreasing in Schools? Well, there are many reasons behind it, Explaining all can make you feel a waste of time. Despite Knowing the fact that writing is an important part, People don’t want to write as it takes time to write and nowadays people do not have enough time to write anything. This is the first reason why writing is decreasing in schools as people do not have enough time to write. Nowadays we have a lot of gadgets that have made our life effortless. But we should never forget where we started from. Today’s generation of students finds it too boring to write anything with the help of paper and pen. This is the sad reality that we people can write a couple of paragraphs on Facebook, What's App, Twitter, and other social networking sites but saying a boring activity when it comes to pen and paper. Technology is also an important factor in this scenario about writing as students use laptops, phones, and other gadgets to note the important points. Some Students, They just want to click the picture of the board Instead of copying it manually. You must be thinking how can copying from the board is important in writing. Well, in the beginning, I have told that basic is important. So if students just copy the matter they can come to inhabit to write at least and once they get to know about the benefits of writing they can start writing. I hope that this would help you. Please upvote and comment if you like it ",
            "date": "Answered February 20, 2020",
            "views": "42",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Ilango Sivaraman",
                "href": "/profile/Ilango-Sivaraman"
            },
            "answer_text": "Yes. Writing exercises or the need for writing itself is becoming less - because of the introduction of technology -Digital methods of learning/assessment etc., It is possible that a few years from now, typing would be the way of writing - or just hovering a finger over the digital letters/screen would replace typing. Today, knowing the way to write on papers, I might say it is bad- We have preserved documents from the past, written on dried leaves - Present innovation of technology in digital writing is in my opinion further progress from writing on paper. ",
            "date": "Answered February 22, 2020",
            "views": "8",
            "upvotes": "0"
        }
    ]
}