{
    "title": "Why Diwali is celebrated 20 days after dussehra? - Quora",
    "tags": [
        "Diwali (Deepaavali festival)",
        "Festivals",
        "Celebrations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dhruv Dwivedi",
                "href": "/profile/Dhruv-Dwivedi-2"
            },
            "answer_text": "Let me narrate to my fellow quorans a story from the hindu ‘mythology' RAMAYANA. ALL THE CHARACTERS MAY BE FICTITIOUS. ANY RESEMBLANCE TO ACTUAL PERSON , TIME , EVENTS IS NOT COINCIDENTAL. DUSSEHRA marks the time when lord Rama killed the evil demon Ravana who had his kingdom in SRILANKA (modern day Sri lanka). After killing him, lord Rama along with his entire army made a celebratory parade back to their home town in AYODHYA ( a city in modern day UP). This journey took them just over 20 DAYS. When they reached back, there was a big festival and celebration which is even celebrated today as modern festival of DIWALI. Dussehra is infamously celebrated as killing of the demon Ravana even today. Diwali is celebrated 20 days after Dussehra to this day. This is a screenshot of my GOOGLE MAPS:  . The authors of this mythology went a little bit too far by actually walking this distance across and calculating the time just so that this little piece of information would be factually correct. I mean like WHY were they soo obsessed/insane/crazy!! This has to be the best and most intriguing piece of ‘mythology’ as it is claimed today. Or it could be HISTORY written by mere observation of events by HISTORIANS. Of course we have to ignore air travel by ‘Pushpak'! ",
            "date": "Updated November 3, 2019",
            "views": "178",
            "upvotes": " View 34 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vaibhav Soni",
                    "user_href": "/profile/Vaibhav-Soni-204"
                },
                {
                    "user_id": "Saji Kennedy",
                    "user_href": "/profile/Saji-Kennedy"
                },
                {
                    "user_id": "Kireeti Consultants",
                    "user_href": "/profile/Kireeti-Consultants-1"
                },
                {
                    "user_id": "Tushar Panchal",
                    "user_href": "/profile/Tushar-Panchal-21"
                },
                {
                    "user_id": "Durga Prasad",
                    "user_href": "/profile/Durga-Prasad-495"
                },
                {
                    "user_id": "Khushan Ahirrao (खुशन अहिरराव)",
                    "user_href": "/profile/Khushan-Ahirrao-खुशन-अहिरराव"
                },
                {
                    "user_id": "Neelesh Singh",
                    "user_href": "/profile/Neelesh-Singh-166"
                },
                {
                    "user_id": "Saayli R W",
                    "user_href": "/profile/Saayli-R-W"
                },
                {
                    "user_id": "Harshitha Yerra",
                    "user_href": "/profile/Harshitha-Yerra"
                },
                {
                    "user_id": "Abhilash Singh",
                    "user_href": "/profile/Abhilash-Singh-175"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ratnakar Sadasyula-రత్నాకర్ సదస్యుల",
                "href": "/profile/Ratnakar-Sadasyula-రత్నాకర్-సదస్యుల"
            },
            "answer_text": "Traditionally Dussehra marks the ending of the Nava Ratri festivities. What we celebrate as Nava Ratri is the Sharad Navaratri, which is one of the 5 Navaratris, we have. The others are the Vasant Navaratri(during March-April), Ashad Navaratri(June-July), Pausha Navaratri( December-January) and Magha Navaratri( Jan- February). Of these the Sharad Navaratri, is the most popular of all, observed all over India. It is primarily meant to celebrate the arrival of the Fall( Sharad) , after the rainy season and before the Winter sets in. Traditionally this time, is when the skies are clear, the rains stop, and the early chill sets in. The 9 days, are during the Shukla Paksha, when the moon is in the waxing phase, reaching it’s full majestic glory on Sharad Purnima. The Sharad Purnima is the year’s brightest full moon night. Diwali falls on the last day of Ashwin month, which is the Amavasya, the darkest new moon night of the year. And this transition from Vijayadasami or Dussehra to Sharad Purnima to Diwali, usually takes around 20 days, when the moon begins it’s waning phase. Traditionally, being a festival of lights, Diwali is celebrated at that time, in a sense symbolizing the victory of darkness over light, good over evil, knowledge over ignorance. One more aspect is that Diwali also marks the end of Ashwin month and transition to Karthika. Also, in a way it marks the onset of the winter season, ending of fall season. ",
            "date": "Answered October 18, 2016",
            "views": "224",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Swati Baindur",
                    "user_href": "/profile/Swati-Baindur"
                },
                {
                    "user_id": "Durga Prasad",
                    "user_href": "/profile/Durga-Prasad-495"
                },
                {
                    "user_id": "Prajakta Mishra ( प्राजक्ता मिश्रा)",
                    "user_href": "/profile/Prajakta-Mishra-प्राजक्ता-मिश्रा"
                },
                {
                    "user_id": "Ankita Acharya",
                    "user_href": "/profile/Ankita-Acharya-9"
                },
                {
                    "user_id": "Suman Maji",
                    "user_href": "/profile/Suman-Maji-4"
                },
                {
                    "user_id": "Logan Pranad",
                    "user_href": "/profile/Logan-Pranad"
                },
                {
                    "user_id": "Aayushi Modh",
                    "user_href": "/profile/Aayushi-Modh"
                },
                {
                    "user_id": "Fabiana Maria",
                    "user_href": "/profile/Fabiana-Maria-3"
                },
                {
                    "user_id": "Rani Iyer",
                    "user_href": "/profile/Rani-Iyer-6"
                },
                {
                    "user_id": "Hari Ramasubramanian",
                    "user_href": "/profile/Hari-Ramasubramanian-2"
                }
            ]
        }
    ]
}