{
    "title": "Why do so many students continue to study liberal arts majors when there is only demand for a fraction of them? - Quora",
    "tags": [
        "Liberal Arts Colleges",
        "Liberal Arts",
        "Liberalism (politics)",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kip Wheeler",
                "href": "/profile/Kip-Wheeler-1"
            },
            "answer_text": "Perhaps students study liberal arts because their major is not the same thing as their career? The major isn’t designed (nor should it be) as training for one specific job. We already have learning institutes that do job-specific training in the form of vo-techs and professional schools. These are fine options for most students, and I’d encourage interested students to pursue them. However, it’s probably not a good idea for colleges to turn themselves into even more vo-techs and neglect their own educational niche: producing citizens and workers who can think broadly and deeply on a wide range of topics. Perhaps because a significant chunk of popular majors, including business, law, biology, pre-med, teaching, firefighting, and law enforcement degrees, are also having trouble finding employment. Even one of the most employable majors—engineering—currently has one-fifth of its graduates unable to find a full-time job in their chosen field. Seriously! Here a chart of the percentages of various categories of major or field of focus that end up “under-employed”—which the Federal Reserve Bank of New York is defining in this chart as being employed either part-time or else working in an area outside your major three years after graduation with their highest degree:  Hmm. If you look at the list of who’s most likely to be employed, you see the following are about equally or even less employable than Art majors, dancers, and English majors right now. I.e., nearly a third or over a third of these majors do not end up working full time or do not end up working in their field of study after three years post graduation: law degrees,business management,biology/pre-med,teaching,firefighting,law enforcementIf you think the liberal arts are a poor choice for students, why aren’t you complaining more vociferously about students who want to become cops and firefighters or business managers or lawyers? Pre-med students and undergraduate students who focus on pre-law are particularly interesting. If they do wind up working in their chosen field, they will likely earn three times as much as a liberal arts major in annual salary. However, the odds of them actually finishing the degree and being admitted into graduate school for that career? Their odds are actually smaller than the odds for liberal arts majors to be working in something related to their field! Yet parents don’t freak out about their children wanting to pursue a field with smaller chance of employment. Why is that? Is it because they are blinded by the fact that the ones which do get employed earn handsome wages? Or is it because those degrees look practical on a more obvious level, so parents and students simply assume such degrees are more employable? Or is it because they read about liberal arts majors flipping hamburgers in media when that media has a financial incentive to produce clickable articles that play into parental fears about their children’s futures? According to a report by CBS News, the skills taught by liberal arts majors actually are seeing in an uptick in employee job listings—i.e., degrees that emphasize the ability to read closely, write well, speak well, research accurately, and communicate ideas clearly after thinking through a knotty problem. writing skills, communication skills, the ability to speak well, research accurately, and communicate clear ideas through a knotty problem. Source: English majors, rejoice: Employers want you more than business majors That’s what degrees in liberal arts topics are, and there’s a reason we keep going back to them over thousands of years. They are probably never going to go out of style. Surely, you didn’t think it was all about analyzing baroque architecture, quoting Yeats and doing scansion of Renaissance iambic pentameter, did you? Finally, in times of great technological change and the potential for accelerated social upheaval, over-specializing can be a dead-end. Trained radiologists looked like a good profession four years ago, but now that A.I. algorithms can analyze dozens of X-rays or body scans in a second with a higher percentage of accuracy than trained human professionals, the need for radiologists may drop 90% over the next two decades. Similar obsolescence is likely in many technical fields, so the common aphorism is that most of the jobs this generation of graduates will hold will be doing work that didn’t exist when they went to college. Blogging as a career didn’t exist ten years ago, nor did Uber logistics programming. Accordingly, a degree that provides a broad, general grasp of knowledge and teaches generally applicable skills in critical thinking, basic math, aesthetic design, comparative analysis, and communication skills may be a better strategy for long-term employment rather than short-term employment. So, many students chose that liberal arts generalization instead of over-specialization. It also appears to be the case that, no matter what your major, the current odds if you graduate college today, you may —on average—end up switching jobs eleven jobs times during the course of your forty-year career, and changing entire career focus three times as well. The odds of individual students working exclusively in their chosen major—whether it is business or architecture or nursing—is statistically quite small. They are likely to get bumped into administrative positions or affiliated research, or working in some area that tangentially related to their major rather than what they imagined. If you are likely to be in such a job market, you want transferable skills that are broadly applicable to ensure the greatest occupational mobility. Some of those broadly applicable skills might be mathematics, historical background of a particular industry, economics, effective writing, interpersonal skills, and so forth. A significant chunk of them are offered in liberal arts majors. ",
            "date": "Answered January 25, 2020",
            "views": "17",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daljit Singh",
                    "user_href": "/profile/Daljit-Singh-209"
                },
                {
                    "user_id": "Donald Propp",
                    "user_href": "/profile/Donald-Propp"
                },
                {
                    "user_id": "AnMei Lutwin",
                    "user_href": "/profile/AnMei-Lutwin"
                },
                {
                    "user_id": "Scott Hughes",
                    "user_href": "/profile/Scott-Hughes-18"
                },
                {
                    "user_id": "Chaundra L. Whitehead",
                    "user_href": "/profile/Chaundra-L-Whitehead"
                },
                {
                    "user_id": "Anubha Aggarwal",
                    "user_href": "/profile/Anubha-Aggarwal-6"
                },
                {
                    "user_id": "Benjamin Murphy",
                    "user_href": "/profile/Benjamin-Murphy-7"
                },
                {
                    "user_id": "Susan Campbell",
                    "user_href": "/profile/Susan-Campbell-173"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shawna Barnes",
                "href": "/profile/Shawna-Barnes-8"
            },
            "answer_text": "One of my primary reasons is that majors in the liberal arts area add quality to life. They add flair and color and challenge and reasoning and un-coiffed brilliance, which really can be the impetus behind some of the most valuable, incredible innovation our world has ever seen! (Consider Steve Jobs study of, I believe, calligraphy, leading to a blend of stylish fonts with technology.) A role of liberal arts majors is to dissect, glean, parse, and share with the world the connection (and mis-connection) of the many parts. I see it rather like the tasks of the visionary. Plus, true study of Liberal arts allows one to be well-versed in multiple disciplines, and thus able witness and experience the world from a variety of perspectives, aptly facilitating wanted and, at times, unwanted change. Besides, as we experience our world becoming more complex and with faster change, we need those with the ability to adapt, and pivot efficiently and effectively as they will be invaluable for all of us, all of humanity. ",
            "date": "Answered September 20, 2018",
            "views": "614",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chrisclemmens .",
                    "user_href": "/profile/Chrisclemmens"
                },
                {
                    "user_id": "Ma. Endo",
                    "user_href": "/profile/まりあ-Ma-Endo"
                }
            ]
        }
    ]
}