{
    "title": "Why is chemistry named chemistry? - Quora",
    "tags": [
        "History of Chemistry",
        "Etymology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emad Noujeim",
                "href": "/profile/Emad-Noujeim"
            },
            "answer_text": "The word chemistry is related to an older word used during medieval times, i.e. alchemy. So let’s start with the origin and etymology of the word alchemy: \"medieval chemistry; the supposed science of transmutation of base metals into silver or gold\" (involving also the quest for the universal solvent, quintessence, etc.), mid-14c., from Old French alchimie (14c.), alquemie (13c.), from Medieval Latin alkimia, from Arabic al-kimiya, from Greek khemeioa (found c.300 C.E. in a decree of Diocletian against \"the old writings of the Egyptians\"), all meaning \"alchemy,\" and of uncertain origin. Perhaps from an old name for Egypt (Khemia, literally \"land of black earth,\" found in Plutarch), or from Greek khymatos \"that which is poured out,\" from khein \"to pour,\" from Proto-Indo-European root *gheu- \"to pour\" [Watkins, but Klein, citing W. Muss-Arnolt, calls this folk etymology]. The word seems to have elements of both origins. […] The al- is the Arabic definite article, \"the.\" The art and the name were adopted by the Arabs from Alexandrians and entered Europe via Arabic Spain. Alchemy was the \"chemistry\" of the Middle Ages and early modern times, involving both occult and natural philosophy and practical chemistry and metallurgy. After c. 1600 the strictly scientific sense went with chemistry, and alchemy was left with the sense \"pursuit of the transmutation of baser metals into gold, search for the universal solvent and the panacea.\" (Source) Then the derived word chemistry became more and more used: c. 1600, \"alchemy,\" from chemist + -ry; also see chemical (adj.). The meaning \"natural physical process\" is from 1640s; the sense of \"scientific study of the composition of material things and the changes they undergo\" is by 1788. The figurative sense of \"instinctual attraction or affinity\" is attested slightly earlier, from the alchemical sense. (Source) As additional details concerning the etymology of chemistry, the mineralogist and humanist Georg Agricola (died 1555) was the first to drop the Arabic definite article al-. In his Latin works from 1530 on he exclusively wrote chymia and chymista in describing activity that we today would characterize as chemical or alchemical. In the 16th and 17th centuries in Europe the forms alchimia and chimia (and chymia) were synonymous and interchangeable. The semantic distinction between a rational and practical science of chimia and an occult alchimia arose only in the early eighteenth century. In 16th, 17th and early 18th century English the spellings — both with and without the \"al\" — were usually with an i or y as in chimic / chymic / alchimic / alchymic. During the later 18th century the spelling was re-fashioned to use a letter e, as in chemic in English. In English after the spelling shifted from chimical to chemical, there was corresponding shift from alchimical to alchemical, which occurred in the early 19th century. In French, Italian, Spanish and Russian today it continues to be spelled with an i as in for example Italian chimica \"chemistry\". ",
            "date": "Answered August 28, 2018",
            "views": "440",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raul Souza",
                    "user_href": "/profile/Raul-Souza-5"
                },
                {
                    "user_id": "Iffat Khan",
                    "user_href": "/profile/Iffat-Khan-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Debashis Panda",
                "href": "/profile/Debashis-Panda-14"
            },
            "answer_text": "Chemistry is derived from the word alchemy that means to make an object pure, perfect and best in use. However, the etimology of chemistry is debatable. Alchemy come from the Arabic word khm or kham that means black art. As reactions are shown as magic to the world, a kind of black magic. While some say, it is derived from the word khymia that means to cast together. Regards, The Monotonous Panda ",
            "date": "Answered July 13, 2017",
            "views": "606",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Raul Souza",
                    "user_href": "/profile/Raul-Souza-5"
                },
                {
                    "user_id": "Sayed Seemab Zehra",
                    "user_href": "/profile/Sayed-Seemab-Zehra"
                },
                {
                    "user_id": "Kaushiky",
                    "user_href": "/profile/Kaushiky"
                },
                {
                    "user_id": "Gopal Kaul",
                    "user_href": "/profile/Gopal-Kaul"
                },
                {
                    "user_id": "Barnalee Mishra",
                    "user_href": "/profile/Barnalee-Mishra"
                },
                {
                    "user_id": "Muizz Sayyad",
                    "user_href": "/profile/Muizz-Sayyad"
                },
                {
                    "user_id": "Ashish Singh",
                    "user_href": "/profile/Ashish-Singh-554"
                },
                {
                    "user_id": "Pratik Sinha",
                    "user_href": "/profile/Pratik-Sinha-112"
                },
                {
                    "user_id": "Charan Ekkurthi",
                    "user_href": "/profile/Charan-Ekkurthi"
                },
                {
                    "user_id": "Deepankar Singh",
                    "user_href": "/profile/Deepankar-Singh-40"
                }
            ]
        }
    ]
}