{
    "title": "Why do students find school boring? - Quora",
    "tags": [
        "Boredom",
        "Students",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mili Gupta",
                "href": "/profile/Mili-Gupta"
            },
            "answer_text": "    Ok, I am currently a student in high school so I am one of the most validated people to give an answer like college and high school students. Students find school boring because first of all it starts too early. It starts at around 8:00. Meaning you have to wake up at 7:00 or something. Which means you have to sleep at 9:00 or 1:00 to get a proper sleep. America is one of the leading countries with homework behind China, India, and some other countries. But on top of them saying that we have to get a goodnight's sleep, we have to be in an extracurricular activity, a sport, and get community service hours as well?! Forget India and China. At least they put pressure on one thing, but America tells us to be good at everything, even if it is not what you are majoring in. So we lose sleep over the math homework we have when we aspire to be a writer. Or we lose sleep over the History homework as person with a dream to be a chemist. Colleges also want \"well rounded\" people. We try to be well rounded, but then they reject students saying that they don't have a dream and that they are the jack of all trades. I personally do not like this. I think that if someone has a dream, then they should only go with that and put pressure on that. I am working to be a software engineer, so WHY AM I LOSING SLEEP OVER MY BIO HOMEWORK?!!     Secondly, the teacher may not be up to our own pace. I get that the teacher has to teach in order for everybody to learn, but they don't single out people to give them challenging problems, or basic ones. I am a fast learner and when the teacher teaches something I already know or it is easy, then I do not learn anything, and then the people who do not get it, they are bored because they did not get it from the beginning, so they think what is the point of going further. They basically give up because the teacher goes too far ahead of them.    Thirdly, teachers mostly teach the test and nothing else. They don't teach us why something works, or how something came to be. It is just \"this is the way it works, now follow it.\" Most teachers also take a point off if a student does something different than what was taught, even though their reasoning and answer was correct. My teacher does not do this, but I used to have another teacher way back in elementary, in which if you do not do it the way she teaches, then you get the entire question wrong. She was never open to new ideas. And English teachers especially grade harshly, just because you don't agree with them. This is called being biased, which is another reason us kids do not like school. It is too biased.     Also, there are people who do not care about school when they grow up. This is probably mainly because because they do not get picked on by the teacher when they were little, and just assume that they don't matter, so they stop participating because they know they don't matter to the teacher, and later, school just becomes a place for them to fool around. This is discrimination. Not necessarily racial, but it is just singling out some people just because the teacher may not like them or their parents, or maybe it is racial. I don't know. But I have seen it happen. This was back in third grade and this one of my good friends was never picked on in class, and later, we drifted away, but now she is that one kid that causes trouble. Before, she was a nice and quiet girl, but then in fourth grade, she was crying. I asked why, and she said that it was because she didn't think the teacher cared about her. It was literally 3 months into school, and she had only been called on twice out of around 30 students. People should be given an equal opportunity to answer and participate in class. This country is going down because of unnecessary discrimination (again, not necessarily racial).     Lastly, this is the important one: HOW DO YOU FEEL WHEN YOU ARE TRAPPED INSIDE A ROOM ON A SEAT, DOING NOTHING AND JUST SITTING AND LISTENING TO ONE PERSON JUST SPEAKING UP ON A SUBJECT, WHILE YOU ARE TIRED AS HELL AND DID NOT GET SLEEP AT ALL?! WE KNOW TEACHERS ARE TIRED FROM WORKING TOO, BUT WE HAVE TO GO EVERYWHERE TOO AND ADULTS NEED LESS SLEEP THAN US. So yea...... reply and I shall write back ASAP if you want to know anything more. ",
            "date": "Updated February 25, 2016",
            "views": "168",
            "upvotes": " View 106 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anya Brown",
                    "user_href": "/profile/Anya-Brown-26"
                },
                {
                    "user_id": "SherDil18",
                    "user_href": "/profile/SherDil18"
                },
                {
                    "user_id": "Joshua Parris",
                    "user_href": "/profile/Joshua-Parris-10"
                },
                {
                    "user_id": "Brenda Biagomba",
                    "user_href": "/profile/Brenda-Biagomba-1"
                },
                {
                    "user_id": "Sad Babs",
                    "user_href": "/profile/Sad-Babs"
                },
                {
                    "user_id": "Andrew Tiono",
                    "user_href": "/profile/Andrew-Tiono"
                },
                {
                    "user_id": "Mason Johnson",
                    "user_href": "/profile/Mason-Johnson-195"
                },
                {
                    "user_id": "Vedhas Rajeev",
                    "user_href": "/profile/Vedhas-Rajeev"
                },
                {
                    "user_id": "Jeremy Diaz",
                    "user_href": "/profile/Jeremy-Diaz-6"
                },
                {
                    "user_id": "Yuna",
                    "user_href": "/profile/Yuna-182"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicholas Otten",
                "href": "/profile/Nicholas-Otten"
            },
            "answer_text": "The question is extremely significant, and the answer is extremely complex, unfortunately. I looked at the six answers previously given here on Quora and found they individually made good points that were often quite different. The least useful answer, in my opinion, is that schools and teachers are the whole problem. 'Fix the schools and all will be well' is like saying 'Fix the government and all will be well' —  both statements are wrong and oversimplified.  Some factors covered in earlier answers are that schools teach to groups of individuals who are in the same room together but at different levels of ability and interest; so, in most cases, teachers must concentrate on some at the expense of others. Another factor is that most students in school must learn multiple lessons more or less simultaneously, and some of those lessons feel irrelevant to many individuals in the room. Another factor is that the payoff from school only becomes clear later, when school is finished. All those differing claims are reasonable, so the complexity should be clear enough. But I believe some more fundamental issues seldom get seriously considered. First, people who are tutored at home and not 'in a school' can be bored, too, so 'school' is not the only factor.  Second, school is not exactly the same as learning, which people do not always acknowledge. The key distinction between school (including home-school) and not-school is studying. Many, many people hate to study for the same reason that they hate exercise programs or dieting regimens: Any concentrated, systematic effort over time can be utterly BORING, even when completely necessary. (Do you think diabetics wouldn't get bored with daily insulin shots?) To repeat, schooling means studying, and many hate studying, which is not merely natural learning. Learning happens all the time, often unnoticed. Studying is learning on purpose, which usually means a system and usually also means some learning in the abstract.  For example, 'how to avoid pain' is a good lesson and well worth the attention of everyone. You can learn to avoid one kind of pain, without school, by learning on your own to cross busy intersections that are heavy with traffic. That kind of learning can get exciting, even dangerous, because it's physical. Or you could be taught to study some rules (Look both ways every time. Learn the meaning of the traffic signals. Don't step out from between parked cars. Wear visible clothing in the dark. Use crosswalks. Be extra careful in bad weather. Do not presume that vehicles can stop.) The point of studying a pre-selected set of rules all at once — which, remember, is more boring than exciting — is to increase your efficiency in learning, even at the expense of effectiveness. Abstract rules are often boring. Getting hit by a moving car is visceral and likely to be a very effective lesson in looking both ways.  Now, here's the point of school: Do you really want to learn everything that hard way? Really? Getting hit by a car: exciting and effective. Learning a set of rules about crossing the street: efficient but boring. (By the way, what if you never come remotely close to being hit by a car, at night, in bad weather? That stupid school lesson wasted your time?) So, abstractions can be boring, but they can also save you enormous amounts of time and pain. Next, learning means change of some kind. That sentence may sound simple or obvious, but stop and just ponder the point. If 'it' didn't change you, 'it' didn't teach you, and you haven't learned 'it' at all. And now, an important connecting point: Some people hate to change. Everybody knows people who fight against change. If somebody is willing to fight against change or being changed — even for profound reasons, good or bad — that person will not be a good learner and not a good student. Now, for all the people who believe that the key to good schools is some formula for teacher accountability, how can any teacher in any kind of school consistently teach 15-30 people at once without some of them privately resisting. Sometimes students can't learn — they have headaches, need glasses, don't understand the vocabulary, need further practice. Sometimes students pretend to learn — for good and bad reasons, too. Sometimes students utterly, openly refuse to learn, also for good and bad reasons. The point about people who will not or cannot change is that learning-and-teaching is an interchange that requires a willing and able learner. Teaching is not the presentation of a coupon called information. Teaching is an interchange, a new in-forming of the learner. No in-forming change, no learning. Another mostly subtle point: You can learn without a teacher, but you cannot teach without a learner. I know that sounds odd, but I stand by the claim. You can learn to stay alive in heavy traffic without training, but I cannot teach you to be careful in traffic, if you refuse to listen to me. To use a slightly different example, someone can write a book that could easily, profoundly change you — but you can refuse to read the book. So, are students bored by schools? Quite often.  Why? The answers are extremely complex, and the points I have tried to make are only a fundamental few, maybe six or seven of the many reasons. I haven't even tried here to explain that some people want to be bored, that some people want to be boring, and that sometimes being bored can actually be good, too. I leave those claims for you to consider on your own — if you choose. ",
            "date": "Answered February 22, 2016",
            "views": "124",
            "upvotes": " View 28 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Alan-C-146"
                },
                {
                    "user_id": "Megan Lewandowski",
                    "user_href": "/profile/Megan-Lewandowski-5"
                },
                {
                    "user_id": "Marissa Saito",
                    "user_href": "/profile/Marissa-Saito"
                },
                {
                    "user_id": "PG Callejo",
                    "user_href": "/profile/PG-Callejo"
                },
                {
                    "user_id": "Aline Hanshchuk",
                    "user_href": "/profile/Aline-Hanshchuk"
                },
                {
                    "user_id": "Ajay Mg",
                    "user_href": "/profile/Ajay-Mg-2"
                },
                {
                    "user_id": "Prakhar Saini",
                    "user_href": "/profile/Prakhar-Saini-7"
                },
                {
                    "user_id": "Cathy Braun",
                    "user_href": "/profile/Cathy-Braun-8"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/JWS-7"
                },
                {
                    "user_id": "Sam Smith",
                    "user_href": "/profile/Sam-Smith-1138"
                }
            ]
        }
    ]
}