{
    "title": "Why should we study science? - Quora",
    "tags": [
        "Studying in Higher Education",
        "Studying",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roberto de La Canal",
                "href": "/profile/Roberto-de-La-Canal"
            },
            "answer_text": "Putting aside the arguments that studying all the major fields (science, mathematics, history, art, etc.) contribute to enriching your understanding of the world you live in, I think there is one aspect in particular that is important: knowing how knowledge is generated. Why is this important? Today, citizens are bombarded with false facts, pseudo-knowledge, and fake news all around. “Science shows coffee can cure cancer.” “Science shows drinking coffee can cause cancer.” “Eating chocolate can help you lose weight.” Etc. etc. What are you to believe? Well, understanding the basics of science (e.g., the way cells and, therefore, you, operate; energy; environmental science) can help you both sift out what is likely nonsense and better appreciate what is likely not nonsense. This filtering is made possible by the fact that, by having learned about science, you have learned how knowledge is produced in science. We design and run experiments which produce results; those results must then be interpreted using intellectual frameworks (theories) that allow us to understand whether the results are either in line with what we expect from previous experience (and knowledge) or whether the results break entirely from what we thought. In the latter case — and this is what the news media miss — we don’t simply proclaim the new result to be the ultimate truth and require every article and book in science to be rewritten to fit the finding. Instead, if the finding is contrary to theory, we repeat the experiment in the same and different ways, check to see that we’re not making a mistake, and determine whether different experiments along the same line don’t reveal that, in fact, our prior knowledge was in error. THEN we can proclaim “actually, eating chocolate cures everything.” Until and unless all of those steps are taken, all we can say is “this one study done somewhere once indicated a statistical association between eating chocolate and longevity, but it didn’t control for other factors very much, which means we can’t really conclude much.” Understanding the scientific method, which is best done by learning science and how we have come about that knowledge, inoculates you to what otherwise is a constant stream of noise. ",
            "date": "Answered June 10, 2018",
            "views": "75",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thanh Tâm",
                    "user_href": "/profile/Thanh-Tâm-39"
                },
                {
                    "user_id": "YAYING ZHANG",
                    "user_href": "/profile/YAYING-ZHANG"
                },
                {
                    "user_id": "Aman Williamson",
                    "user_href": "/profile/Aman-Williamson"
                },
                {
                    "user_id": "Irma Ayala",
                    "user_href": "/profile/Irma-Ayala-8"
                },
                {
                    "user_id": "Leon Shi",
                    "user_href": "/profile/Leon-Shi-16"
                },
                {
                    "user_id": " Dey",
                    "user_href": "/profile/Dey-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Deitrick Price",
                "href": "/profile/Bruce-Deitrick-Price"
            },
            "answer_text": "In general, our disingenuous professors of education prefer to teach as little as possible. Reading, writing, arithmetic, geography, history, and especially science—-all of these are curtailed or canceled. Science is fun, entertaining, and explains lots of things. This question is gratuitously negative. Of course we should study science. The question before us must be how do we teach the most science in the shortest amount of time. Our public schools have too often abandoned that question altogether. And the thing that makes it really sick, if I may presume to say so,, is the constant chatter about STEM subjects even as those very subjects are allowed to wither and die. There seems to me a lot of blatant dishonesty. I remember seeing a fundraising drive for a STEM initiative in high school . But why was this needed? Where was any mention of science in the third grade, the sixth grade, or the eighth grade? You can't suddenly introduce serious science in high school if the kids don't have preparation for this. You have to start in pre-K and K, teaching science, elementary science of course, but that's fine. I invite everyone to contemplate the overall pattern. Anything academic shrinks year-by-year. Whatever it is, there's less of it as we go through the 20th century and up to the present. Everything the children should learn-– reading, writing, arithmetic, geography, history, general science, and literature—seems to evaporate like puddles after a storm. Finally you can't find a drop. Do you want better schools? Do you want better educated Americans? Simple. Return to the emphasis and proportions of traditional education. First of all, bring back phonics so kids learn to read. Bring back systematic instruction in arithmetic so kids can can quickly answer simple problems. Bring back an emphasis on facts and knowledge, so kids learn a lot. My big dream is that the American education system returns to education. Oh happy days. ",
            "date": "Answered October 13, 2020",
            "views": "201",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Judy Weaver, RN",
                    "user_href": "/profile/Judy-Weaver-RN"
                }
            ]
        }
    ]
}