{
    "title": "Why did you choose the teaching profession? - Quora",
    "tags": [
        "Teachers",
        "Teaching",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeffrey Hastings",
                "href": "/profile/Jeffrey-Hastings-2"
            },
            "answer_text": "Personally, I didn’t choose the teaching profession, but eventually, the profession found me… My undergraduate degree was in communications and, though I attended a college where many of my friends were training to become educators, not once did I ever consider teaching as a future career. Instead, I worked a string of low-end and freelance video production jobs after graduation until I eventually took a full time job with a school district as their “media technician,” wherein I purchased and maintained their media equipment, ran their high school theater, produced school related videos—stuff like that. In that job, I met a few certified school library media specialists, sometimes called “School Librarians.” I envied their jobs because, unlike my position, colleagues didn’t view them as being mere technicians, they were actual teachers. Plus they dealt with everything I loved: Working with young people, literature and learning—and technology, too. One day, this rather prickly school library media specialist apparently felt that I was doing things in her building that encroached on her job’s territory. And she let me know it in no uncertain terms, snapping “if you want to do a school librarian’s job, I suggest you march back to university and get your Master’s Degree in Library Science!” Hmnnn… So, I did! It actually wasn’t that simple, since I had to not only get that Masters Degree, but I also had to take enough education courses to qualify for a New York State teaching certificate as well. Then there were the months of student-teaching… A few years later, though, I was hired in Michigan and worked happily as a school librarian for a couple decades. During that time, I was always happiest when working with students, teaching them information and research skills. Then, about ten years ago, I began to sense that change was coming once again. Certified school librarians were being eliminated from schools all over Michigan, most being replaced with unskilled, part-time “clerks.” I could sense that I needed to prepare to make either a geographical or a career adjustment. Since I had built a television studio in my library and sponsored a live daily school news telecast, I’d been lucky enough to get to work with talented kids every morning, some for as long as three years in a row. I taught them how to write in a way that was cogent, entertaining and efficient by teaching them a tight newswriting formula I had learned during an internship writing for tv news. One day I was surprised in my school library when one of my long-time students, Sarah, visited me while on break from university. I’ll never forget what she tearfully told me… Sara told me what a difficult time she had had during the three years she had worked with me on the school news program. She had been way too bright to fit in easily in middle school where, unfortunately, it’s not cool to be ‘smart,’ and the most popular kids are the ones who are both dumb and loud. She had hated it, she confessed. Plus, she said, her parents had split up during that time. Working on our show, she told me, working with me, she said, had literally saved her life. “Promise me something,” she said. “Promise me you’ll become an English teacher. You NEED to be an English teacher…you would be such a great one. You need to reach more kids!” Her timing was perfect; it had been in the back of my mind anyway. ‘I will,’ I promised her, ‘I’ll become an English teacher.’ And so, it was back to grad school after work and on weekends for a couple more years to earn another teaching certificate in secondary English Language Arts. About two years after I earned that endorsement, my school district announced it was eliminating the positions of its last two remaining professional librarians—my job was officially on the chopping block. I decided that, rather than taking a probable pay cut and making a move to another district to remain a school librarian, I’d try and land a job in my school system teaching English. I’m now in my fourth year teaching eighth grade English Language Arts. I love teaching, but it is incredibly difficult work, particularly in middle school. As Sarah had hinted, middle school can be miserable. And, so often, the brightest kids have the toughest time. So many of them just keep their heads down, try to ignore the stupidity, and just get through it. I hope that, in some little way, I’m now serving as a bridge for miserable middle school students like Sarah to use to cross over into better times when their education and intelligence finally bear the fruit of happiness and fulfillment. And, if they pick up a few writing skills along the way, or maybe discover the joys of reading a compelling novel, well…that certainly doesn’t hurt. ",
            "date": "Answered October 1, 2016",
            "views": "9",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cherise Denise",
                    "user_href": "/profile/Cherise-Denise"
                },
                {
                    "user_id": "Myra Antoinette Oao Cabaña",
                    "user_href": "/profile/Myra-Antoinette-Oao-Cabaña"
                },
                {
                    "user_id": "Maria Holub",
                    "user_href": "/profile/Maria-Holub"
                },
                {
                    "user_id": "Gunjan Verma",
                    "user_href": "/profile/Gunjan-Verma-65"
                },
                {
                    "user_id": "Jumpei Kawano",
                    "user_href": "/profile/Jumpei-Kawano"
                },
                {
                    "user_id": "Rana Aglan",
                    "user_href": "/profile/Rana-Aglan"
                },
                {
                    "user_id": "Ruyu Tao",
                    "user_href": "/profile/Ruyu-Tao"
                },
                {
                    "user_id": "Michael Brown",
                    "user_href": "/profile/Michael-Brown-363"
                },
                {
                    "user_id": "Kathy Thompson",
                    "user_href": "/profile/Kathy-Thompson-27"
                },
                {
                    "user_id": "Jordan Yates",
                    "user_href": "/profile/Jordan-Yates-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abeeha Farooqi (ابیھا فاروقی)",
                "href": "/profile/अबीहा-फ़ारूक़ी-Abeeha-Farooqi-ابیھا-فاروقی"
            },
            "answer_text": "I didn't. This Noble profession chose me itself. I never wanted to be a teacher. I used to jokingly say, “I can be anything but never a teacher.” But right after I stepped into my university life, my neighbors started coming to me for asking me to tutor their children which I did for years. It was the end of my university life, when bankruptcy hit my family. Our lives lost their balance. I started looking for jobs and the job that I easily got was teaching. The salary was very small but it helped me in getting through my final year and running my brother's college life smoothly. Then the advertisement of this job came in newspapers and I applied. The application fee was 2000 and I had exact amount of 2000/_PKR. I went to the bank, not knowing that there was an amount required for courier and other things. I called my mother if she has some money. She told me that she didn't and asked me to come back as my father was also not in town. But it was the last date. A beautiful old woman was standing beside me. She came and asked what happened. I told her that nothing, everything was fine. But she insisted on it. I told her and she took me to the counter and paid all the excessive amount. I asked for her address so that I might pay her back and she gave me her phone number and said, “I don't think there is anyone who deserves this job more than you. You’ll get it. I can completely sense it.” She also said that I should pay her back with my first salary which I did. The day I got my first salary, I went to her home with a box of my favorite confectioneries. I can't tell how much happy she became as she got the news of my job. She hugged and blessed me with lots of prayers. I am very grateful for her as whatever I am today is because of that amazing woman. But there is one more thing, the day I went to my school and looked at the amazing children there and saw the love they gave me, I realized that this is what I was made for and I decided to stay in this profession no matter what. Thanks for asking. Abhi ",
            "date": "Answered April 1, 2019",
            "views": "95",
            "upvotes": " View 100 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lovely Reyes",
                    "user_href": "/profile/Lovely-Reyes-39"
                },
                {
                    "user_id": "Sneha Singh",
                    "user_href": "/profile/Sneha-Singh-2521"
                },
                {
                    "user_id": "Mahalakshmi",
                    "user_href": "/profile/Mahalakshmi-110"
                },
                {
                    "user_id": "Maria Holub",
                    "user_href": "/profile/Maria-Holub"
                },
                {
                    "user_id": "Mahabir Agarwal",
                    "user_href": "/profile/Mahabir-Agarwal-6"
                },
                {
                    "user_id": "Sanjana Rawat",
                    "user_href": "/profile/Sanjana-Rawat-36"
                },
                {
                    "user_id": "Gladys Cabiscuelas Dinaya",
                    "user_href": "/profile/Gladys-Cabiscuelas-Dinaya"
                },
                {
                    "user_id": "Shiela Ranola",
                    "user_href": "/profile/Shiela-Ranola"
                },
                {
                    "user_id": "Scott Reeves",
                    "user_href": "/profile/Scott-Reeves-7"
                },
                {
                    "user_id": "Muhammad Musa",
                    "user_href": "/profile/Muhammad-Musa-138"
                }
            ]
        }
    ]
}