{
    "title": "Why are some teachers so strict and intimidating? - Quora",
    "tags": [
        "Intimidation",
        "Teachers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sara Matthews",
                "href": "/profile/Sara-Matthews-5"
            },
            "answer_text": "It's a very good question and I'd disagree in part with the other answers you've received. I have also observed and worked with teachers such as you describe. They fall into three groups - those teachers who have burned-out - I'm not sure it's a survival mechanism - they have no energy left to muster patience. It's a lack of self-control because their self-control is burned out as well. You said it very well - they get overly agitated at the smallest thing. That's not a choice they're making, it's not a survival mechanism, they're working on raw angry bitter impulse. They have not always been that way but they became that way. The other group are those who fall into that when under some personal stress. That's not their teaching style but it's a temporary state. The third group are the teachers who have always been that way. They are pretty much that way on their first day and on their last day. This group does not get overly agitated over the least little thing - that behavior is a sign of stress. This group is comprised of people who share certain philosophical beliefs - order is better than disorder, disorder is very risky and can lead quickly to chaos. They are not flexible people - flexible admits of change and change is unorderly. They don't see value in flexibility- they see threat. They're very rule-based - rules create order. Showing patience for disorder isn't wise they believe and in truth - I don't think they can. I think they're wired with a great need for order and with few wires for patience. In the better world, each school would decide what kind of a school it wanted to be. There are different models of schools - there are military schools where rigid order prevails and there are open schools (not many) which don't have structured classes in the day but students are free to choose how to spend their day at school. (not kidding about that) And there's everything in between. In the better world a school would consciously choose what kind of a school it wanted to be and hire teachers accordingly - and your family would be free to choose among the different schools. Would your parents want a school that's committed to patience and flexibility? Not all parents do - by any means - but in the better world schools would be allowed to define themselves as a certain kind of community and your family would get to choose which one you'd attend. Till then you'll meet with teachers such as you describe. The fact that she gets agitated over the least little thing though - that's not a teaching style coming through - that's pure stress. In the better world your school administrator would recognize that your teacher is showing signs of great stress and step and do something. No one's parents want a teacher who gets agitated over the least little thing. ",
            "date": "Answered September 23, 2016",
            "views": "24",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Dinkelman",
                    "user_href": "/profile/Michael-Dinkelman"
                },
                {
                    "user_id": "Ankit Kumar",
                    "user_href": "/profile/Ankit-Kumar-7538"
                },
                {
                    "user_id": "Stefanus Angga",
                    "user_href": "/profile/Stefanus-Angga"
                },
                {
                    "user_id": "Alicia Perez",
                    "user_href": "/profile/Alicia-Perez-60"
                },
                {
                    "user_id": "Deets J",
                    "user_href": "/profile/Deets-J"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ty Conner",
                "href": "/profile/Ty-Conner"
            },
            "answer_text": "First and foremost, most people who become teachers don’t last more than five years. The reason for this is that teaching is stressful, demanding, and unappreciated. There are set course guidelines that must be met, and these look daunting to a new teacher, so they get uneasy from the first day of classes. The tension builds up as the weeks fly by, and their students become more and more comfortable with the teacher, and as such the class loses focus. Many teachers try to be the “friend”, and play games with the students, but have a hard time balancing games and course material, and have no set layout for how a class should go, so it is very chaotic for both the students and the teacher. Take this for example: I have a class for 40 minutes. The first 10 minutes, we review what was learned yesterday, the second 10 minutes we learn something new, the third 10 minutes we use what we’ve learned, and the final 10 minutes we play an educational game. My students know what’s coming, and when it’s coming, and they also know that if they waste time during parts A, B, and C, then we won’t have time for part D. In another class, I just teach on the fly. These kids have absolutely no idea when we’re going to do what, and as a result, their minds are off in space, thinking about lunch, talking to their partner, or dilly-dallying. This particular class will frequently ask me “When’s class gonna be over?” or “When can we play a game?”. They are absolutely not focused. To alieviate stress, a teacher must have a set plan for every class and stick to that plan most of the time, straying from it only for special events. The students and your mind will thank you later. Remember: You became a teacher for a reason. Hold on to that reason, and keep the kids in mind. ",
            "date": "Answered October 25, 2016",
            "views": "48",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Dinkelman",
                    "user_href": "/profile/Michael-Dinkelman"
                },
                {
                    "user_id": "Ahmed Hadi",
                    "user_href": "/profile/Ahmed-Hadi-34"
                },
                {
                    "user_id": "Ankit Kumar",
                    "user_href": "/profile/Ankit-Kumar-7538"
                },
                {
                    "user_id": "Nguyễn Tuấn Anh",
                    "user_href": "/profile/Nguyễn-Tuấn-Anh-18"
                },
                {
                    "user_id": "Ricardo Nascimento",
                    "user_href": "/profile/Ricardo-Nascimento-21"
                },
                {
                    "user_id": "Angelique Lynette Wright",
                    "user_href": "/profile/Angelique-Lynette-Wright"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/VINOD-KUMAR-SINGH-178"
                },
                {
                    "user_id": "Rolf Ahrensbach",
                    "user_href": "/profile/Rolf-Ahrensbach"
                },
                {
                    "user_id": "Alicia Perez",
                    "user_href": "/profile/Alicia-Perez-60"
                },
                {
                    "user_id": "Lauryn Ess",
                    "user_href": "/profile/Lauryn-Ess"
                }
            ]
        }
    ]
}