{
    "title": "Why is destruction a form of creation? - Quora",
    "tags": [
        "Creation (creativity)",
        "Destruction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dennis J Frailey",
                "href": "/profile/Dennis-J-Frailey"
            },
            "answer_text": "It isn’t always, but it can be. The issue is whether there is a superior way to do things that can replace an old, obsolete, inefficient way. For example, consider a house that was damaged by a weather event and would cost a lot to repair. It might be a lot smarter to tear it down and rebuild from scratch, using building techniques that make the house better able to withstand the next weather event. This same reasoning might apply to a really old house that was falling apart and needed extensive and very costly repairs. For example, I once considered buying a really old house in a nice neighborhood that had grossly out of date heating and cooling systems that could not be easily replaced with newer systems because it lacked the appropriate electrical, plumbing and duct work. I didn’t buy it, but someone else did, tore it down, and built a modern house on the same lot. Or consider this example. In World War II, the countries that suffered the most extensive damage were Germany, Japan, and several of the “behind the iron curtain” countries. The allies bombed their factories and pretty well wiped out their ability to manufacture things. So what did Germany and Japan do? They rebuilt from scratch, but this time replacing old, obsolete factories with new, modern, highly efficient factories. As a result, both Japan and Germany are among the strongest economies in the world and they have competed very successfully with, for example, US companies in such industries as automobiles, televisions, and so forth. The US might have been more competitive in these industries had the Japanese or Germans bombed our oldest and most obsolete factories. By the way, this did not happen behind the iron curtain because the communist economic system is much less conducive to developing a healthy economy. ",
            "date": "Answered October 8, 2017",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Leo Li",
                    "user_href": "/profile/Leo-Li-323"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Smit",
                "href": "/profile/Mark-Smit-21"
            },
            "answer_text": "Because destruction is a creation in itself. Imagine completely destroying an old building in town. At the same time what is created is a place to construct a new building. Or, if a parking lot is created, one has to destroy a field. You can't create something without destroying something, and the reverse. Cheers ",
            "date": "Answered October 8, 2017",
            "views": "723",
            "upvotes": "0"
        }
    ]
}