{
    "title": "Why should sex ed not be taught in public schools? - Quora",
    "tags": [
        "Sex Education",
        "Public Education",
        "Schools",
        "Adult Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Kaplan",
                "href": "/profile/Daniel-Kaplan"
            },
            "answer_text": "You need a reason not to teach sex ed? Man. That’s a tough one. I’m a big fan of sex ed. See… my parents never had “the talk” with me. Ever. If it hadn’t been for sex ed, I’m sure I’d have figured out how sex worked, but I wouldn’t have known some of the particulars about safety. I likely would have made some… mistakes and wound up with a lot of… responsibilities. After all, sex is like using a sword, right? The pointy end goes into the other person. Wow… that wasn’t my best analogy. Moving right along. There are a lot of people in the same boat as me. Their parents aren’t necessarily squeamish, they just never get around to “the talk.” Not because they assume schools will cover it. But hey, that isn’t a big deal, right? My buddies will tell me everything I need to know. Except… one of the guys I knew swore that you couldn’t get a girl pregnant if she was still wearing her clothes (If you’re curious, that isn’t true). But I feel like I’m trying to sell you on why we should still have sex ed. Of course, it doesn’t have to be taught. After all, I think parents can always get a waiver. They can opt out. Oh… that’s right. You need a reason to not have sex ed in taught in school, even though teen pregnancy— sorry. I almost did it again. Okay. I’m ready. We shouldn’t teach sex ed because… Teens who get their education railroaded by an unplanned pregnancy are a vital component of our manual labor workforce!Doctors need patients. Pregnant teens need doctors. By terminating sex ed, you’re becoming a job creator! You’ll also grow jobs in the pharmaceutical industry—especially manufacturers of STD medication.You’ll be saving schools a tiny bit of money in materials (of course that savings will be used up by having alternative education programs for pregnant teens).Um… that’s all I have for now. ",
            "date": "Answered September 25, 2020",
            "views": "83",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sumedh Khanolkar",
                    "user_href": "/profile/Sumedh-Khanolkar"
                },
                {
                    "user_id": "Zoe-Anne Barcellos",
                    "user_href": "/profile/Zoe-Anne-Barcellos"
                },
                {
                    "user_id": "Rashaal",
                    "user_href": "/profile/Rashaal"
                },
                {
                    "user_id": "Tyler Glisson",
                    "user_href": "/profile/Tyler-Glisson-1"
                },
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Watson",
                "href": "/profile/Alex-Watson-51"
            },
            "answer_text": "Because it's important to maximise the number of sexually transmitted diseases, pregnancies and abortions in teenagers, because these are valuable disincentives to sexual experimentation, which is a much more serious problem. Countries where sex ed is mandatory from Junior School onwards have shockingly low rates of these phenomena, so sexual experimentation is rife, and they learn to practice safe sex, which is just another word for promiscuity. They also grow up thinking that being gay is normal for some people, rather than the truth, which is that it is an abomination, and as everyone knows, just leads to boys becoming sissies, and eventually paedophiles. Is also very important to keep children ignorant of the real world they will grow up into, because the more they learn, the more they start asking impertinent questions about things which are none of their concern. Also, children are innocent, and teaching them about sex isn't appropriate, because it's filthy and disgusting, and when they get married it's important that they should be fearful and inexperienced, or they might start deciding for themselves what they enjoy, and end up doing all sorts of sinful perversions. And it's not just sex ed, it's very important to steer them away from the evils of masturbation, as is well known that this can lead to blindness and insanity. It is much better to teach them not to even wash those parts, because touching them at all is completely unnecessary, an invitation to sin, and not something any parent wants to talk about. Another real danger is vaccinating girls against the human papilloma virus. Knowing that they won't catch papilloma just encourages girls to be more promiscuous, and it's completely unnecessary, because girls who save themselves for marriage will never catch it. In short, teaching sex ed represents a real and present threat to the God-given moral values that all decent people believe in. ",
            "date": "Updated October 5, 2020",
            "views": "183",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rhys Thomas",
                    "user_href": "/profile/Rhys-Thomas-127"
                },
                {
                    "user_id": "Aman Pandey",
                    "user_href": "/profile/Aman-Pandey-437"
                },
                {
                    "user_id": "John Holder",
                    "user_href": "/profile/John-Holder-66"
                },
                {
                    "user_id": "Alan Segal",
                    "user_href": "/profile/Alan-Segal-7"
                },
                {
                    "user_id": "John VanValkenburg",
                    "user_href": "/profile/John-VanValkenburg"
                },
                {
                    "user_id": "Ryan James",
                    "user_href": "/profile/Ryan-James-225"
                },
                {
                    "user_id": "Eoghan Saunders",
                    "user_href": "/profile/Eoghan-Saunders"
                },
                {
                    "user_id": "Chris Hirst",
                    "user_href": "/profile/Chris-Hirst-21"
                },
                {
                    "user_id": "Gary Ow",
                    "user_href": "/profile/Gary-Ow-1"
                },
                {
                    "user_id": "Sabina Soultanova",
                    "user_href": "/profile/Sabina-Soultanova"
                }
            ]
        }
    ]
}