{
    "title": "Why is the grade school year in the USA just about 180 days whereas the grade school year in other countries have longer school days? - Quora",
    "tags": [
        "Grades (education)",
        "The High School Experience",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sandy Whitney",
                "href": "/profile/Sandy-Whitney-1"
            },
            "answer_text": "Why are USA schools about 180 days long per year,,,? I think it has to do with being a hold over from years ago when USA was more involved with a rural/farming lifestyle than the city/industrial that we have today. Although schooling was important, it was not as important as getting the crops planted, harvested and etc that has to do with farming. The people made their livings on what they produced and sold on their small farms. They had large families so as the kids grew up they participated more and more in the family business of farming. Anyway, that’s what my grandfather told me. Mother came from a family of 6 kids and they all worked the farm of 320 acres and took care of the animals, etc. Kids went to school during the winter months and when spring/summer/early fall came around they were in the fields planting or harvesting. Time passed and small farmers sold the land and farming became a “big industry”. The kids moved to cities for jobs and the family small farm basically disappeared. What DIDN’T change is the short school/instruction year or daylight saving time (changing the clocks twice a year—back an hour in the fall, forward an hour in the spring) to have more daylight time to work in the fields.) Now it’s so “ingrained” that parents/kids/teachers are so used to having the summers off that you’d play HELL trying to get it to change. One thing my school district did try was have “year round” school. Each school had 4 tracks. They still were only in class 180 days, but different tracks were in or out at different times so the school was open all year long rather than being closed for 2 1/2 mo. during summer. However, some parents didn’t like it. The schedule their kid was on didn’t correspond with when they wanted to take the vacations! So, another “good thing” went by the wayside because GOD FORBID an education should get in the way of a vacation to the beach! ",
            "date": "Answered May 15, 2018",
            "views": "289",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Harold Bridges",
                    "user_href": "/profile/Harold-Bridges-2"
                },
                {
                    "user_id": "Tegh Singh",
                    "user_href": "/profile/Tegh-Singh-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Misha Oberly",
                "href": "/profile/Misha-Oberly"
            },
            "answer_text": "I know that in Germany the students are in school for more days, BUT school is only 4 hours a day, where in the US school runs for 180 days at around 7–8 hours per day. I forget where I read it, but even taking the amount of days that are half days, per year children in the US actually have more education hours per school year than other countries. So while this other countries have longer school years, the US instead has a shorter year, but more hours per day. The only country or countries that has more days per year and more hours per day is China and Japan. ",
            "date": "Answered July 28, 2019",
            "views": "33",
            "upvotes": "0"
        }
    ]
}