{
    "title": "Why is there such a stigma attached to conservatism when around half the country is conservative? - Quora",
    "tags": [
        "Stigma"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marian Hubbard",
                "href": "/profile/Marian-Hubbard-1"
            },
            "answer_text": "I had no idea that there was a stigma attached to conservatism — I thought being called a conservative was a compliment! I’ve always used it like that. Clearly, part of the reason that conservatism has a bad name among those to whom it does, is that the media has for years been relentlessly Progressive (or Leftist, or Democratic). Conservatives may easily be portrayed as old-fashioned, reactionary, or backward-looking, which are especially insulting for young people. But given how badly the U.S. has performed on so many levels for most of 30 years, being old-fashioned makes much more sense than trying to justify the performance of the Obama/Biden act. As my favorite adage about conservatism goes: “Progressives are born in herds; conservatives are created one mind at a time.” ",
            "date": "Answered October 15, 2020",
            "views": "38",
            "upvotes": " View 542 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Evans",
                    "user_href": "/profile/Chris-Evans-199"
                },
                {
                    "user_id": "Doug Wolford",
                    "user_href": "/profile/Doug-Wolford-1"
                },
                {
                    "user_id": "Joseph Vijay",
                    "user_href": "/profile/Joseph-Vijay"
                },
                {
                    "user_id": "Frank Branham",
                    "user_href": "/profile/Frank-Branham-3"
                },
                {
                    "user_id": "Tony Ebersole",
                    "user_href": "/profile/Tony-Ebersole-4"
                },
                {
                    "user_id": "R. Rich",
                    "user_href": "/profile/R-Rich-10"
                },
                {
                    "user_id": "Ralph Pollio",
                    "user_href": "/profile/Ralph-Pollio-1"
                },
                {
                    "user_id": "Philip Peterson",
                    "user_href": "/profile/Philip-Peterson-8"
                },
                {
                    "user_id": "Christa Bengtsson",
                    "user_href": "/profile/Christa-Bengtsson"
                },
                {
                    "user_id": "Michele Ciomperlik",
                    "user_href": "/profile/Michele-Ciomperlik"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eugene Patten",
                "href": "/profile/Eugene-Patten"
            },
            "answer_text": "This is true for a lot of wrong reasons. Classical conservatism focuses on a belief in personal freedom and limited government. Programs and policies that have proven to work are subject to tweaking to improve them, not radical changes. That said, the definition of conservatism has been mangled by the Tea Party and Trumpism to become unrecognizable. Large, radical changes are made to laws and policies that have had a positive impact on our lives. Additional laws and policies have been implemented, such as the Patriot Act, that severely interfere with our freedom. True conservatives would consider policies such as Social Security, Medicare or even the ACA as sound law that needs strengthening or possibly expanding. Under no circumstances would they propose eliminating or weakening them. They may have opposed them originally, but once they were proven to “Provide for the general welfare\", they fell under the must protect and support policies. When, so called, conservatives want to gut those programs that provide a positive result and implement policies that severely restrict our Constitutional freedoms, it is not surprising that conservatism gets a bad rap. If you suppress peoples’ right to vote, gerrymander to improperly remove a citizen's representation, refuse to act on a nomination for political purposes or any of the many other undemocratic or unpatriotic or unconstitutional actions, you are not acting as conservative, you are being unamerican.un-American. I look forward to the day when, once again, a Barry Goldstein can be true to his principles and still work with a Ted Kennedy to create needed legislation for the good of our country. ",
            "date": "Answered October 15, 2020",
            "views": "65",
            "upvotes": "0"
        }
    ]
}