{
    "title": "Why am I not able to score good marks in chemistry even though I am studying it most at home? I am scoring good in physics and maths. - Quora",
    "tags": [
        "Studying Advice",
        "Academic and Educational Advice",
        "Studying",
        "Physics",
        "Education",
        "Exams and Tests"
    ],
    "response": [
        {
            "author_info": {
                "name": "Snehanshu Barapatre",
                "href": "/profile/Snehanshu-Barapatre"
            },
            "answer_text": "Unlike Physics and Maths, Chemistry tend to have various concepts and ideas which you cannot feel/visualize easily unlike in physics and mathematics. In Physics and mathematics usually the toughest part would be to memorize list of predefined results and formulas and techniques to solve. Since chemistry consists of three major branches I will break my answer into three. Chemistry, however is primarily based on results observed and logic to explain the results. One may argue the same exists in case of physics too. But we can constantly see physics in action around us making it easier to visualize. Chemistry required memorization of lots to things such as in organic chemistry one need to memorize compound structure for various common name which are not based on IUPAC nomenclature, special kinds of reaction such aldol condensation etc. and one need to achieve certain level of insight to find final product of a reaction which is achieved after certain level of practice. It's equally wrong to say that entire organize chemistry is difficult there are certain chapter which are completely based on logics such isomerism. Organic chemistry is something you need to practise regularly to get a hang of it and never let go the rhythm. After certain level of solving question you get insights on how to solve problem. My suggestion try organic chemistry problems of himanshu pandey however I believe you need a teacher or faculty to disscuss the answers as clear explainations are not given. Inorganic chemistry one can say it's difficult but it could be a game changer for you. Well you see. Inorganic chemistry is something which you either know or you don't know. So you can solve this section very quickly. If you invest time in it, it can provide immemse benefit in time based examination situation. Inorganic chemistry usually asks color of compounds, final product based on behaviour of element and questions periodicty of elements. Each part requires rote memorization and is thus one of the least favourable subjects. Physical chemistry is something no one usually finds difficulty in as it's purely based on mathematical calculation and physical concepts. To conclude this answer I would say nothing happens overnight. Every little thing adds up. So more you practise better you become. Goodluck to you. ",
            "date": "Answered January 9, 2018",
            "views": "672",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Giridhar S Shenoy",
                    "user_href": "/profile/Giridhar-S-Shenoy"
                },
                {
                    "user_id": "Himani Kapoor",
                    "user_href": "/profile/Himani-Kapoor-24"
                },
                {
                    "user_id": "Rahul Sethi",
                    "user_href": "/profile/Rahul-Sethi-127"
                },
                {
                    "user_id": "Shantina Raj",
                    "user_href": "/profile/Shantina-Raj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anupam Thakur",
                "href": "/profile/Anupam-Thakur-16"
            },
            "answer_text": "Hi Well chemisty is quite tough comparing to maths and physics because it contains large as well as the tough chapters. May be you are just focusing on the portions which is not that much imporatnt which have the maximum chances to come for exam in chemistry. If you are studying then try to give the revision as well not just by studying once again but write it in paper and it increases the chances to remember anything becuase you may forget many things after reading many chapters. In chemistry there are many elements and each have their own molecular weight and atomic weight and then you need to find valency of many elements so this all evaluations requires lots of revision after studying it. Dont lose hope just study hard and revise more so that you will never forget it. Best of Luck ",
            "date": "Answered January 9, 2018",
            "views": "369",
            "upvotes": "0"
        }
    ]
}