{
    "title": "Why is it hard to lookout for your own self? - Quora",
    "tags": [
        "Lookout",
        "Oneself",
        "Self-Awareness",
        "Self-Esteem",
        "Self-Confidence",
        "Understanding Self-Improvement",
        "Self-Improvement",
        "Psychology of Everyday Life",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dean Robertson",
                "href": "/profile/Dean-Robertson-24"
            },
            "answer_text": "Because no one has a map for his/her life. Depending on what age you are, you may or may not even have a very good idea of who you are; what you truly like or dislike, what kind of life you want, how to go about getting that life and dealing with your present circumstances all at the same time. And then, if/when you are able to come to a decision, there are no guarantees you can get there. Life is change and uncertainty and if you are a discerning and even somewhat ambitious person and have a fairly crystallized notion of where you want your personal journey to go, you still have to navigate and negotiate through the myriad obstacles merely living in the world will present to you. Experience as much as you can, within reason of course; determine what you treasure, and what you have no use for. Don't waste your time with foolish people and useless pursuits once you identify those. Be prepared for setbacks, but don't allow them to discourage you, stay true to yourself. If you find yourself treading a path you instinctively feel is wrong for you, find another. Dont waste your life doing what others think is best for you, and don't let others use you against your own welfare. Don't be chronically fearful. Fear has it's place and its uses, but awareness will serve you much better. Wherever you are, wherever you go, know how to safely exit as best you can. Again, listen to your instincts. Life is a one-way ticket, a singular experience, as I see it. Get as much out of it as you can while doing no harm to others. Realize your place in the natural order of the world; climb mountains, cross seas, learn how people in other parts of the world live. Respect others, unless or until they give you a reason not to. Be grateful everyday for the life you are. ",
            "date": "Answered June 8, 2020",
            "views": "43",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tijani Olawale",
                    "user_href": "/profile/Tijani-Olawale-8"
                },
                {
                    "user_id": "E-Man Well",
                    "user_href": "/profile/E-Man-Well"
                }
            ]
        }
    ]
}