{
    "title": "Why is no one looking into why students hate school? - Quora",
    "tags": [
        "Hate",
        "The High School Experience",
        "Students",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joyce Fetteroll",
                "href": "/profile/Joyce-Fetteroll"
            },
            "answer_text": "They are looking and they do know many of the reasons why kids hate school. The problem is that what educators believe is essential for learning is what kids dislike most. First, the system is heavily invested in memorization and testing. Most are convinced that pushing in knowledge is the best approach to education. It’s easy for teachers to do and test. But it’s hard for students. We don’t learn well through memorization. We learn best through play. We’re built to explore, to ask questions, to try out our ideas and learn from what happens. Second, — assuming you’re speaking of America — is that the US doesn’t have a public education system. We have at least 50. In many cases decisions are made at the district level. In other countries education decisions are made on a national level. In Sweden, there are only 2 colleges (I believe) granting education degrees. Which means all teachers can be learning the same approach and implement it across the country. In the US, there are thousands with no universal approach. Teaching is barely treated as a profession. Teachers are often treated like the voice of the curriculum. They aren’t trusted to make their own decisions. In the US, change depends on convincing superintendents and communities that change needs to happen. It happens one school at a time. But when the administration changes, if parents don’t trust or understand the changes, schools can go right back to the familiar drill and kill. Change is happening in private schools and homeschooling. Both are smaller and independent so can try out new ideas more easily. Democratic education, Magnet schools, Unschooling, Learning through play have been used successfully for decades. But those changes aren’t trickling into the public schools. Parents are resistant to changes that haven’t been tested on a large scale that affect their children’s futures. Parents trust that if they push their kids the right way, they can get the current public school system to “work,” that is, get their kids into college. Whether their kids enjoy it or not is irrelevant. The parents, in many cases, suffered through and got into college, so they feel that’s just how it needs to be. ",
            "date": "Updated May 27, 2017",
            "views": "45",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gisselle Mendez",
                    "user_href": "/profile/Gisselle-Mendez-9"
                },
                {
                    "user_id": "DatsGamer The Great",
                    "user_href": "/profile/DatsGamer-The-Great"
                },
                {
                    "user_id": "Tehgan Porter",
                    "user_href": "/profile/Tehgan-Porter"
                },
                {
                    "user_id": "Ashely Walters",
                    "user_href": "/profile/Ashely-Walters"
                },
                {
                    "user_id": "Rosario Villegas",
                    "user_href": "/profile/Rosario-Villegas-1"
                },
                {
                    "user_id": "Bhakti Parekh",
                    "user_href": "/profile/Bhakti-Parekh-2"
                },
                {
                    "user_id": "Sarah Hernandez",
                    "user_href": "/profile/Sarah-Hernandez-40"
                },
                {
                    "user_id": "Kathryn J Baptista",
                    "user_href": "/profile/Kathryn-J-Baptista"
                },
                {
                    "user_id": "Adam Gerow",
                    "user_href": "/profile/Adam-Gerow"
                },
                {
                    "user_id": "Lori Lee",
                    "user_href": "/profile/Lori-Lee-42"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christian Baune",
                "href": "/profile/Christian-Baune"
            },
            "answer_text": "I have been in a specialized school in my childhood and I can tell you that it requires more involvement from the teacher. It’s also a greater cost in organization. In an ordinary school, student level up (or grade up) in each subject at the same time. In specialized school, you have a personalized track. When I was around 8 years old, I was able to solve simple systems which included ratios. I had understanding of relation in the broad sense and counting was the kind of problems I found recreational. On the other side, I couldn’t write one sentence without making any kind of mistake. Even when I had only to copy it from the board! So, my math “examination” was like : “The product of two number is 323, their sum is 36. What is the smallest ?”. Other people were doing stuff like “Which is the smallest : 32 or 23” ? And some other people did simply toy with their genitals. That’s how it looked like in a school where the program was adapted to each individuals. When I was “schoolable”, I went back to normal school. I was behind other in writings and far above people in mathematics. I did enjoy everything, but subjects in which the teacher was trying to show me stuff I didn’t care about because…I knew them. And for French, I hated it because it was all about grammar and spelling and I could not have a grasp of that. The reason we still not do specialized school for everyone is that we need a minimum proficiency across subjects. Should I have been there for more years, my French would not have improved much and I would have been highly specialized in pure mathematics. I wouldn’t have “honed” my social skills too. By having to follow the same programs as everyone else, I grew in diversity. I got challenged. I got to see other struggles where I didn’t and vice-versa. But more importantly, there is a huge cost factor. One teacher for 30 people vs 1 teacher for 5 people! Same for classrooms. We were in very small classrooms. Up to 5 people. So, if you have only 100 students, you need 20 rooms and as much teachers.Also, each teacher must create and follow a program for each student. It’s extra work! It’s just not feasible ! ",
            "date": "Answered May 25, 2017",
            "views": "703",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brian Fredell",
                    "user_href": "/profile/Brian-Fredell"
                }
            ]
        }
    ]
}