{
    "title": "Why does most of the world want socialism to fail? - Quora",
    "tags": [
        "Socialism",
        "Economics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dexter Dudley",
                "href": "/profile/Dexter-Dudley-1"
            },
            "answer_text": "Socialism is already a failed form of governance. The core fundamental flaw of Socialism is the fact that it requires FORCE - without exception. Socialism tries to use individuals money (their personal labor) to do what’s best for everyone. This can only be accomplished through FORCE (at the tip of a gun). Whenever force is used…The bad moral value of force triumphs over good intentions and the result is always tyranny. In order to achieve equal outcomes among human beings which are uniquely different by nature…the government must treat people differently. Equal treatment fails to achieve equal outcome. Can’t confiscate most powerful kind of wealth - ideas. What’s inside people’s head. The rich will return to rich. The poor most likely will return to poverty. Can’t confiscate an idea. It’s an unavoidable quality of human beings. People set out with good intentions are soon corrupted. If they’re not, they’re soon replaced by people with bad intentions who are more efficient with the use of force.While a benevolent dictatorship is the best form of government, but it’s not something human beings can achieve on a scale larger than a handful of people living in a homogeneous environment (like a family group). The greatest harm is done when power is in the hands of people absolutely convinced of the purity of their intentions.A study of Mussolini reveals he was less of a threat than other Fascists of his time because he was a hypocrite. He was willing to be bribed and paid off. Hitler was far more of a threat because he believed fanatically he was right. Can a moral case be made for taking the rightful property of one person and giving it to another to whom it does not belong? Of course not. This’s why socialism is evil. It uses evil means (coercion and force) to achieve what are seen as good ends (helping people). Any act that is inherently evil does not simply become moral simply because there’s a majority consensus (Bernie Sanders - \"We must take and take over every portion of the energy companies and the healthcare providers. Including private practices.\".If done in a group an act can be lawful; if done by an individual, it is suddenly a crime. In the end, this amounts to nothing more than “tyranny of the majority” and compulsory servitude.",
            "date": "Answered March 22, 2020",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Staunton",
                "href": "/profile/Peter-Staunton-5"
            },
            "answer_text": "It has already failed. See the EU. In case u haven’t noticed, it is dying. How so? Well the native population is imploding with a birthrate far below replacement only to be replaced with largely low skilled, non assimilating immigrants. Most have weak economies. Even the Brit’s can’t afford to equip their 2 new small aircraft carriers. The selfish Germans, who seem to be productive by nature, are too selfish to contribute their fair share to NATO. Merkel has also let in a huge number of refugees” that have caused chaos and crime. Yep Socialism has worked so well in the EU. The reason it has failed is because big government and a nanny state provide no incentive for excellence or innovation. This does not mean unbridled capitalism is perfect. It needs to be regulated as to protect the workers and consumers. In the USA we already have several “socialist” things; Medicare, Medicaid, SS, State sponsored schools, corporate welfare for certain industries…..most of these programs are good but some are not. ",
            "date": "Answered March 21, 2020",
            "views": "39",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "James MacAvoy",
                    "user_href": "/profile/James-MacAvoy-1"
                },
                {
                    "user_id": "Susan Nicolai",
                    "user_href": "/profile/Susan-Nicolai-2"
                },
                {
                    "user_id": "Balu G",
                    "user_href": "/profile/Balu-G-45"
                }
            ]
        }
    ]
}