{
    "title": "Why should we not make special schools for kids with disabilities instead of tossing them into public school? - Quora",
    "tags": [
        "Public School",
        "Learning Disabilities",
        "Public Education",
        "Disability and Disabilities",
        "Schools",
        "Children"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chelsea Meissner",
                "href": "/profile/Chelsea-Meissner"
            },
            "answer_text": "We do. Those schools do still exist. Given the option between “tossing them” in public school and sending them to a school equipped to address their needs with the staffing and funding to provide an appropriate education, you’re right: the latter sounds like a much better option. However, that’s not the choice. The choice is between putting a child who has disabilities in a less restrictive mainstream classroom where they can be supported versus putting them in the most restrictive environment where they can be supported. There certainly are some children for whom a mainstream classroom isn’t appropriate. That’s why the “special schools” do still exist. However, for many children, there’s really no reason to keep them out of a typical classroom. While I hate the cliche of “differently abled,” it is a fair term in this case. We see no issue with having students deemed to be gifted and talented in a mainstream classroom and we make sure that there are opportunities for these students to have their lessons adapted to their capabilities, even if that is different than most others in their class. They’re given opportunities for pull out classes with others who have similar advanced skills so they can learn other skills/information, but for most of their classes, they’re around their peers. That’s exactly what inclusion looks like for kids who have disabilities. Their work is adapted to their learning level. They get extra help if needed. They’re provided opportunities for pull out classes to work with other students who also have disabilities or to receive things like PT/OT/speech therapy. Most of the time, they get to learn with their peers. With the appropriate support for both the student and their education team, there’s no reason they can’t be successful. There’s certainly no reason to lock up people with disabilities and hide them away from society. There’s also more to school than just the curriculum. There are social skills too. For example, my sister was included through most of her education and there was a year or two where we did try putting her in a special school. It was awful. She was nonverbal due to her cerebral palsy and was thrown in a class with others who were nonverbal and had severe disabilities. They didn’t encourage interaction between the students. They barely talked to the students themselves. The only social interaction she had was between her and the adults who acted as her aides. What value is there in sitting in silence staring at walls all day? I mean, despite her disabilities, in elementary school she was able to do multiplication just like her peers, she could identify colors just like her peers. She knew people expected little from her because of her disabilities and she’d even give the wrong answer sometimes and laugh about it before giving the correct answer, just to mess with them and reinforce that they shouldn’t underestimate her. Putting her in a “special school” didn’t meet her needs. At least in a mainstream classroom, people actually interacted with her. ",
            "date": "Answered January 10, 2020",
            "views": "257",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Allison McGill",
                    "user_href": "/profile/Allison-McGill"
                },
                {
                    "user_id": "Keilee Clarke",
                    "user_href": "/profile/Keilee-Clarke"
                },
                {
                    "user_id": "Lyn Hardy",
                    "user_href": "/profile/Lyn-Hardy-1"
                },
                {
                    "user_id": "Tyler Zimmerman",
                    "user_href": "/profile/Tyler-Zimmerman-12"
                },
                {
                    "user_id": "Elle Hayes",
                    "user_href": "/profile/Elle-Hayes-2"
                },
                {
                    "user_id": "Marlin Woosley",
                    "user_href": "/profile/Marlin-Woosley"
                },
                {
                    "user_id": "Shelli King",
                    "user_href": "/profile/Shelli-King"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laurie Sampson",
                "href": "/profile/Laurie-Sampson-2"
            },
            "answer_text": "What sort of people are “kids with disabilities”? They have challenges, but all have something to offer the other kids in their classes. We need kids with challenges to educate the “typical” kids. All kids need to learn that our communities are made of many kinds of people, including people with disabilities. All our kids need to learn that everyone participates, everyone can be a friend, and everyone can make the world better. If we don’t teach children how valuable all people are, they might grow up to think that people with disabilities should be hidden away somewhere. ",
            "date": "Answered January 9, 2020",
            "views": "47",
            "upvotes": "0"
        }
    ]
}