{
    "title": "Why is HIV AIDS so rampant in South India compared to North India? - Quora",
    "tags": [
        "North India",
        "South India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Deepa Harishankar",
                "href": "/profile/Deepa-Harishankar"
            },
            "answer_text": "Please read this: The woman who discovered India's first HIV cases In 1986, the first case(s) of HIV were unearthed in India. And during that time, states like Bihar reported ZERO cases of HIV. Now, do you think the ratios are because of real non-existence of HIV or lack of reportage? According to the World Bank, “All the high prevalence states show a clear declining trend in adult HIV prevalence. HIV has declined notably in Tamil Nadu to reach 0.33% in 2009 down from 0.58% in 2007. However, low prevalence states of Chandigarh, Orissa, Kerala, Jharkhand, Uttarakhand, Jammu & Kashmir, Arunachal Pradesh and Meghalaya show rising trends in adult HIV prevalence in the last four years. Most encouraging, the decline is also evident in HIV prevalence among the young population (15-24 yrs) at national level, both among men and women. Stable to declining trends in HIV prevalence among the young population (15-24 yrs) are also noted in most of the states. However, rising trends are noted in some states including Orissa, Assam, Chandigarh, Kerala, Jharkhand and Meghalaya.” Reportage is catching up with the northern states while the southern states are past the identification stage now. So, while the south is working on bringing down the incidence of HIV, the north seems to show increasing numbers over the years. The day the northern states show a decreasing trend in number of cases, one can clearly say that those states are also past just the identification stage and further onto eradication mode. In a country like India, thanks to bad (or absence of) sex education, people seem to not know much about safe sex. I doubt there is a skew in numbers across states. So, it comes down to reportage. I hope there is emphasis on sex education in schools and colleges. And that could be an effective way out. ",
            "date": "Answered March 4, 2019",
            "views": "28",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Devashrut Bharadwaj",
                    "user_href": "/profile/Devashrut-Bharadwaj"
                },
                {
                    "user_id": "Kanchana Muralidhar",
                    "user_href": "/profile/Queen-Kanchana-From-India-HEH-Muralidhar"
                },
                {
                    "user_id": "Bala Vishvanath",
                    "user_href": "/profile/Bala-Vishvanath"
                },
                {
                    "user_id": "Hirru Minati",
                    "user_href": "/profile/Hirru-Minati"
                },
                {
                    "user_id": "Ankur Mangla",
                    "user_href": "/profile/Ankur-Mangla"
                },
                {
                    "user_id": "Kanchan",
                    "user_href": "/profile/Kanchan-178"
                },
                {
                    "user_id": "Veena Gayathri",
                    "user_href": "/profile/Veena-Gayathri-5"
                },
                {
                    "user_id": "Prudhvi Ramineni",
                    "user_href": "/profile/Prudhvi-Ramineni"
                },
                {
                    "user_id": "Jeyakumar Vel",
                    "user_href": "/profile/Jeyakumar-Vel"
                },
                {
                    "user_id": "Balakrishnan Ramanan",
                    "user_href": "/profile/Balakrishnan-Ramanan"
                }
            ]
        }
    ]
}