{
    "title": "Why do some students show disrespect to their teachers? - Quora",
    "tags": [
        "Disrespect",
        "Teachers",
        "Teaching",
        "Students"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bobbie R. Byrd",
                "href": "/profile/Bobbie-R-Byrd"
            },
            "answer_text": "This is my personal opinion, so please don’t start whining for sources or anything like that. This is simply my opinion based on my life experience, 13 years of which was spent in front of a 7th grade classroom. I don’t consider student behavior these days so much a show of disrespect as a reflection of a cultural breakdown. To be honest, many of the kids today don’t realize they’re being disrespectful because they have no concept of respect. Therefore, they don’t understand when they are acting in a manner that is contrary to accepted displays of respect. A bit of background is in order, so bear with me: I was born in 1957. I grew up through the wild hippy days of the 1960s. I remember the day JFK was assassinated. I remember when the Beatles took the country by storm. I remember when Marilyn Monroe died. I remember when Martin Luther King, Jr., was assassinated and the aftermath of that event. I remember the Vietnam war, the day Nixon resigned. I watched it live when Neil Armstrong stepped off that ladder onto the moon, and I sat in my 5th grade classroom when desegregation first began. I’ve seen a hell of a lot of change in my lifetime. I first became aware of the shift in culture in the mid-1970s. I graduated from high school in May of 1975. As I moved into the college scene, I noticed there were others in my classes who obviously had not been raised in the same environment I was. For clarification, let me say this: I was the third child in a family of 6 children. There was a 20-year spread between my oldest sister and our baby sister (No. 6.) We were dirt-ass poor. My parents provided the best they could but we were poor. We were on food stamps for a while after I graduated high school because my father lost his job as the assistant manager of a local hardware store. He got a job with the state’s highway department, which paid him all of $457 a month to start. That said, we were clean, we never went to bed hungry and we had a roof over our heads. We had parents who did not take any shit off of us, either. I graduated from high school as valedictorian of a class of 22. We were in rural Mississippi. That was actually a rather large class for the area. When I got to college, I saw people who were not raised the way I was. People who did not say, “sir” or “ma’am” when talking to someone older than they were. There were boys who did not hold doors open for women, open car doors for them or refrain from making lewd remarks about women in public. Among those who grew up with me, including my brothers, a young man saying things like that to or about a woman in public could easily have ended in an ass whipping. During my career as a Registered Nurse, I worked frequently in the ER. It was easy to spot those who grew up in a more rural setting, where more traditional cultural norms were maintained. Those who grew up in the city or thought of themselves as “sophisticated” or “up-town folks” were easy to spot, as well. They were the ones who liked to refer to nurses in the ER as “bitch,” “whore,” and “motherfucker.” Important safety tip: don’t piss off the person who is trying to save your life. Bad choice. During my teaching career, it became even more obvious that the problem with the behavior of subsequent generations to mine was that children were not being taught the importance of getting along with others, especially others who are different than they or who were older than they are. They don’t see value in others as human beings, therefore don’t understand why others deserve any degree of respect from them. They are ignorant of traditional cultural norms because they haven’t been taught them. They grew up learning how to interact with other over online video game servers, where talking to each other in foul language is a sign of status, and running down hookers and blowing up buildings in the game to kill the most people as possible at one time is what gains you points and props from the other people. Bad behavior is what gets you peer acceptance and social status in your peer group. This has become the norm of the current generation, as it was for their parents. Are there exceptions to this characterization? Of course. So, don’t jump my shit, whining, “I didn’t do any of those things. How dare you say that about me!” I’m not talking about any one individual so take it down a notch, cupcake. Anyway… In working with junior high kids, it was painfully obvious that many simply did not know how to behave in what was once considered a socially acceptable manner. With the breakdown of the family unit, the decline of religious influence on behavioral norms, and the devastating impact of drugs on families and communities, it’s no wonder our society has gone to hell in a handbasket. What will make it better? People must re-learn the concept of personal responsibility. People have to learn that no man is an island; we all need each other in order to survive. And we can all get along a whole lot better when we get the chips off our shoulders, stop being so damn angry all the time, accept that no one is responsible for us or our offspring but the ones who birthed them (male and female.) If everyone took responsibility for themselves, then when someone needed help, it would be there. Kindness and respect would come naturally, as I believe it is the natural nature of the human soul. End of rant….let the piling on begin. Lady Silver: Warlock Chronicles, Book One ",
            "date": "Answered April 14, 2019",
            "views": "59",
            "upvotes": " View 40 Upvoters",
            "upvoters": [
                {
                    "user_id": "Soma Chakraborty",
                    "user_href": "/profile/Soma-Chakraborty-171"
                },
                {
                    "user_id": "Bria Kim",
                    "user_href": "/profile/Bria-Kim"
                },
                {
                    "user_id": "Fresh Life",
                    "user_href": "/profile/Fresh-Life-4"
                },
                {
                    "user_id": "Gabriel Kennedy",
                    "user_href": "/profile/Gabriel-Kennedy-25"
                },
                {
                    "user_id": "John Giarla",
                    "user_href": "/profile/John-Giarla"
                },
                {
                    "user_id": "Liset Torres",
                    "user_href": "/profile/Liset-Torres"
                },
                {
                    "user_id": "Prakhar Saini",
                    "user_href": "/profile/Prakhar-Saini-7"
                },
                {
                    "user_id": "Anosh Orahim",
                    "user_href": "/profile/Anosh-Orahim-1"
                },
                {
                    "user_id": "Mehr Tanvir - 65198/TCHR/HSPR",
                    "user_href": "/profile/Mehr-Tanvir-65198-TCHR-HSPR"
                },
                {
                    "user_id": "Anne Of Green Gables",
                    "user_href": "/profile/Anne-Of-Green-Gables-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Carroll",
                "href": "/profile/Tim-Carroll-30"
            },
            "answer_text": "I think there are two main reasons.... First, they have not been taught to be respectful at home. As a good friend of mine has pointed out, no parent has ever had to teach their child to be bad. Everyone is born without a knowledge of the rules for proper conduct. Thus one cannot expect a child to respect their teacher when they have never been taught that teachers are to be respected. Second, corporal punishment has been removed from most schools. When I was a young boy, I behaved very well around my momma (because there were consequences I did not want to pay for not doing so). But when I got to school it was a different matter. I was never disrespectful because I had been taught clearly that disrespect was not going to be accepted, but I was very bad for breaking rules about talking, playing, etc. Long story short, the principal at my elementary school was a 6 foot 5 inch 260 pound black man by the name of John Blanton who had no qualms whatsoever with paddling a child's rear end if they did not behave. And paddle me he did! After my first paddling, my momma went into the school with me the next morning. With me sitting beside her in his office, she thanked him for what he did. Furthermore, she told him that if I acted up again that he should feel free to do the same thing as many times as necessary. It took about 6 months of paddlings before I made the decision that talking and playing in class wasn't worth it. That principal is now the senior member of the school board in my county. At the elementary school open house for my kids two years ago I saw him. I approached him and said \"Mr. Blanton, you most likely do not remember me (it was 1980-81 after all) but you have given me more whippings than any person on this planet. And I want to thank you for every single one of them. You were one of the people who helped make sure that I learned how to behave appropriately. And those lessons you helped teach me have served me very well in my lifetime\". Surprisingly, he said to me \"isn't your last name Carroll?\" I said \"yes sir\". He remembered me after all those years! My wife said I must have been bad if he remembered me after this many years. The purpose of that story is to illustrate that without consequences that hurt, you cannot change the behavior of some kids. I know this for a fact because I am living proof of that. You could tell me all day long for a month that the burner on the stove was hot.....but until I touched it and got burnt all the talking in the world was a waste. I know all of the \"experts\" of this day and age say that corporal punishment hurts a child's self esteem and all that......it did not harm mine. And there are scores of folks who can vouch for the same. ",
            "date": "Answered November 20, 2015",
            "views": "123",
            "upvotes": " View 32 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Soma Chakraborty",
                    "user_href": "/profile/Soma-Chakraborty-171"
                },
                {
                    "user_id": "Michael Downey",
                    "user_href": "/profile/Michael-Downey-41"
                },
                {
                    "user_id": "Gabriel Kennedy",
                    "user_href": "/profile/Gabriel-Kennedy-25"
                },
                {
                    "user_id": "Donald Molleker",
                    "user_href": "/profile/Donald-Molleker"
                },
                {
                    "user_id": "Lacey Steen",
                    "user_href": "/profile/Lacey-Steen-1"
                },
                {
                    "user_id": "Christian Maldonado",
                    "user_href": "/profile/Christian-Maldonado-35"
                },
                {
                    "user_id": "Joel Joseph",
                    "user_href": "/profile/Joel-Joseph-100"
                },
                {
                    "user_id": "Leo Barker",
                    "user_href": "/profile/Leo-Barker-6"
                },
                {
                    "user_id": "Wesley Nathanael",
                    "user_href": "/profile/Wesley-Nathanael"
                },
                {
                    "user_id": "Christina Watson",
                    "user_href": "/profile/Christina-Watson-58"
                }
            ]
        }
    ]
}