{
    "title": "Why did socialism not succeed in many countries? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Al Carroll",
                "href": "/profile/Al-Carroll"
            },
            "answer_text": "In most countries where it was tried, socialism has largely succeeded. Socialist and labor movements, combined in the US with the early progressive movement, made life far better for most people. Their biggest success is in extending life spans. The life expectancy in 1900 was closer to 40. Most of the added years have been due to public health reforms more than technology. Scandinavian countries are the obvious examples of the greatest successes of socialism. There, inequality is dramatically less than in the US. Most of western Europe has some socialist elements, but they are all mixed systems. The UK is one example where a socialist system was partly ended, with disastrous results, a greater gap between elites and everyone else. But even there, reforms like public healthcare continue. There are two example of socialism being ended by force, outside invasion, repression, and terrorism. Nicaragua in the 1980s was a socialist experiment by the Sandinista coalition. They made dramatic progress, ending the Somoza family dictatorship, instituting democracy and broad social movements, lowering illiteracy and disease rates. Then Reagan created the Contra terrorists, former allies of the old dictatorship plus mercenaries, and also Miskito Indians with genuine grievances. 70,000 deaths later, Nicaraguans narrowly voted out the Sandinistas in the face of the threat of continued US sponsored terrorism.Chile in the early 70s made the first steps towards socialism and its leader Salvador Allende was quickly overthrown in a bloody coup by the military, sponsored and funded by the US gov't and AT&T. The dictatorship lasted almost two decades. In addition to thousands dead and more imprisoned, Milton Friedman's Chicago School of libertarian economics tried to impose their system by force. Its biggest disaster was in gutting public education, where only those with money receive a good one. The old Soviet Union and its domination of Eastern Europe were not socialist. Neither was China before its turn towards capitalism. Socialism is democratic by definition. One way to look at communism is that it is state capitalism, the economy run for the benefit of an undemocratic gov't. Leaders such as Mao and Brezhnev lived very elite lives in mansions. Mao had an outright harem, and Brezhnev a private fleet of luxury cars. The Bolivarian Movement in Latin America also calls itself the Movement Towards Socialism. It has dramatically reduced poverty and aided public health in Venezuela, Bolivia, and in Nicaragua, now under the Sandinistas again. This is in spite of a declared US policy of trying to undermine the Venezuelan gov't, including a failed coup by the military. Bolivia also faced a racist separatist movement allied to the US gov't. Even those Latin American nations that are not Bolivarian are mostly trying for mixed economies. The results are mixed, but far more successful than the previous tries at neo liberal capitalism, which were mostly imposed by force, often from the outside. ",
            "date": "Answered October 31, 2014",
            "views": "221",
            "upvotes": " View 29 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eurtash",
                    "user_href": "/profile/Eurtash"
                },
                {
                    "user_id": "Sinduja Ragunathan",
                    "user_href": "/profile/Sinduja-Ragunathan-1"
                },
                {
                    "user_id": "Ugnius Kerulis",
                    "user_href": "/profile/Ugnius-Kerulis"
                },
                {
                    "user_id": "Sebastian Bergman",
                    "user_href": "/profile/Sebastian-Bergman"
                },
                {
                    "user_id": "Carol Frick",
                    "user_href": "/profile/Carol-Frick"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Madawa-D-A-Wilson"
                },
                {
                    "user_id": "Geir Bækholt",
                    "user_href": "/profile/Geir-Bækholt"
                },
                {
                    "user_id": "Pratap Chatterjee",
                    "user_href": "/profile/Pratap-Chatterjee-1"
                },
                {
                    "user_id": "László Arany",
                    "user_href": "/profile/László-Arany"
                },
                {
                    "user_id": "Drew McCormick",
                    "user_href": "/profile/Drew-McCormick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arkadyuti Bera",
                "href": "/profile/Arkadyuti-Bera"
            },
            "answer_text": "Because socialism lives in a denial mode of a basic human nature called “greed” and falsely assumes that every individual works for the collective good. In reality an individual works for his/her own selfish goods, as immoral as people might call it, it is engraved in our genes. My own country India went down the path of socialism and was almost on the brink of famine in 1991 when markets were opened. India managed its socialist agenda only with the help of Russia who would provide much help, and once USSR went down the drain there was no option but to open the markets. Now when anyone asks a socialist why a socialist nation such a Venezuela failed, their prompt reply would be they weren’t socialists to begin with or they would draw some ridiculous conspiracy theories that how some non existent Illuminati bankers took it down. In reality socialist states are mostly oil or mineral rich or exporting something of very high value which covers the difference between the taxes and welfare expenses. The problem is that free lunch doesn’t last forever and once export dwindles the country gets into huge budget deficit. There is a reason behind the term “socialist drug” because it feels great to live off the benefits from others hard work at first, but after sometime there is no hard worker due to the lack of incentive, and the system goes down the drain. And “workers owning the means of production” is the biggest bullshit sold till date, it might be possible in an agrarian economy but its outright impossible in an industrial economy because inefficiency is inevitable in such cases. Capitalism is a far better channel which accepts the fact that humans are greedy and selfish or in mild terms “Its the part of fallen human nature”. I ain’t saying capitalism is free from defects but the system is much less prone to failure as it goes along the human nature and accepts reality. ",
            "date": "Answered April 22, 2018",
            "views": "778",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Murphy",
                    "user_href": "/profile/David-Murphy-686"
                },
                {
                    "user_id": "Luis Moya",
                    "user_href": "/profile/Luis-Moya-3"
                },
                {
                    "user_id": "Ragini Singh",
                    "user_href": "/profile/Ragini-Singh-58"
                },
                {
                    "user_id": "Aditya Gupta",
                    "user_href": "/profile/Aditya-Gupta-83"
                },
                {
                    "user_id": "Subin Roy",
                    "user_href": "/profile/Subin-Roy"
                },
                {
                    "user_id": "Shubhang Prasad",
                    "user_href": "/profile/Shubhang-Prasad-2"
                },
                {
                    "user_id": "Satinath Ghosh",
                    "user_href": "/profile/Satinath-Ghosh"
                }
            ]
        }
    ]
}