{
    "title": "Why is it important to study social studies? - Quora",
    "tags": [
        "Social Studies",
        "Studying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sara Matthews",
                "href": "/profile/Sara-Matthews-5"
            },
            "answer_text": "Social Studies is a made-up term - in its origin it was intended to be a high school class that taught the 'new disciplines' - anthropology, sociology and some psychology but that didn't work and the term Social Dtudies ended up in Middle and elemnarty school - where it's not entirely clear what it is - it's rather a hodge- podge of subjects and topics but it's got a great deal of history in it. The usual answer for why should a subject be studied is - you'll need this - and particularly so if the subject touches on history - there's an old and painfully true adage that whoever forgets history is doomed to repeat it. Children can be told that if they protest Social Studies - but in the ideal world and the better school children should come saying how much they love Social Studies. It's the rich drama of the human experience and if taught that way students enjoy it. ",
            "date": "Answered September 25, 2019",
            "views": "22",
            "upvotes": " Answer requested by Houston McClung"
        },
        {
            "author_info": {
                "name": "Arlene Holt",
                "href": "/profile/Arlene-Holt-1"
            },
            "answer_text": "Social Studies is the past. It would seemingly be obsolete, but it is not at all. Most early wars were over religion. World Wars were fought for social, political, and economic gain. This country had a Civil War over the abomination of slavery fueled by economic gain. The US, particularly in the south, had Jim Crow laws restricting education and the civil rights of Black Americans. Would you like more wars? More disgusting Jim Crowe? What about a World War with nuclear weapons? This is why we study social studies. It is an effort not to repeat the mistakes and treachery of the past. Our world depends on it. ",
            "date": "Answered October 4, 2019",
            "views": "12",
            "upvotes": " Answer requested by Brandon C. Njichop"
        }
    ]
}