{
    "title": "Why are so many people in the USA against higher education? - Quora",
    "tags": [
        "Education in the United States of America",
        "Higher Education in the United States of America",
        "Colleges and Universities in the United States of America",
        "American Ethnicity and People",
        "Higher Education",
        "Colleges and Universities",
        "Understanding Human Behavior",
        "Education",
        "The United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Ogburn",
                "href": "/profile/Dan-Ogburn"
            },
            "answer_text": "Because it’s often a waste of money. The value is in the degree itself not the “education” it provides. A large percentage of students don’t graduate and many of them are stuck with debt. Many of those students that do graduate are underemployed and stuck with debt. 90% of anything you learn in school is useless and/or forgotten. There’s no evidence that higher education provides any of its purported lofty, intrinsic goals like “critical thinking” “well roundedness” Many academic fields are heavily ideologically biased and teach absolute non-sense which is possible because of the following reason. It’s heavily government subsidized directly or through student loans. This destroys the incentives (profit/loss) for schools to provide the best services they can for as low a price as possible by removing the loss disincentive. Profits and losses regulate behavior and encourage productive and efficient use of limited resources. Loss avoidance forces organizations (and individuals) to use their limited resources wisely. When the government is there to shield schools from losses they don’t care as much about student needs or wasting money since they can just claim they’re underfunded and ask the government for more money. When schools and students then waste government money, it’s the tax payers that pay the price for their risky behavior. In other words, losses act as a check against poor decisions or investments. Without them you get the bloated and expensive educational system the US has today. On the other hand, without government subsidies, a school must be responsive to student needs and provide value to their customers or else they would take losses and eventually go out of business. ",
            "date": "Answered March 4, 2020",
            "views": "53",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ronald Kimmons",
                "href": "/profile/Ronald-Kimmons"
            },
            "answer_text": "I am not “against\" it, but I do marginally agree with certain arguments and attitudes that are gaining traction against it. It costs way too much. It has just gotten way too expensive. The cost-to-benefit ratio just is not there for a lot of majors. There are numerous reasons for this. The two main ones I see are that the student loan structure divorces the buyer from the cost, thus making the buyer less responsive to cost hikes, and that we have poor career/financial counseling options for high school graduates.It doesn't help much. I got an education - or rather, degrees - because the Boomers told me that was what I needed. Basically any degree was worth it because you can't get a decent job without one. Well, when I graduated with BAs in English and Chinese, guess what! No job. I did spotty freelance work for a few years and went back for an MBA. “Oh, you speak Mandarin and you have an MBA, you'll have so many opportunities!” said the Boomers. Nope. But after several months of post-MBA searching, I finally got a job that my BAs qualified me for. I enjoyed the job, but it was dead-end, with no hope for growth. I am now an entrepreneur and far better off. Do you think my current employer cares about my degrees? Let me ask him…hmm…no, he doesn’t.Indoctrination. Politically speaking, the academic world is a cesspool of groupthink. People try to deny it and say things like “facts have a liberal bias\" and whatever. Then they say things that are totally contrary to demonstrable evidence.Alternatives. If you want to get an education that will guarantee you a decent job, there are many associate's degree and certificate programs that are a much better choice than most four-year programs.",
            "date": "Answered March 6, 2020",
            "views": "76",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dan Ogburn",
                    "user_href": "/profile/Dan-Ogburn"
                },
                {
                    "user_id": "Justin Brader",
                    "user_href": "/profile/Justin-Brader"
                },
                {
                    "user_id": "Maribel Matochik",
                    "user_href": "/profile/Maribel-Matochik"
                }
            ]
        }
    ]
}