{
    "title": "Why does our concentration was losing in teen age? - Quora",
    "tags": [
        "Focusing and Concentrating"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashish Shukla",
                "href": "/profile/Ashish-Shukla-142"
            },
            "answer_text": "Life has phases, we live within as kids, then we go out as grown ups and then come back within when we are old. Now in childhood we have very few things, people in life so less distractions but as we enter teenage we come out from within and have million things to worry about, clothes, shoes, movies, being hip, cell phone and the list goes on and on and on so when there are million things to worry naturally concentration would falter. This modern society, millions of choices are not good, NOT GOOD AT ALL. Life should be simple, keep it simple and you'll be OK… ",
            "date": "Answered July 19, 2017",
            "views": "36",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jaya Mishra Mohini Mishra",
                    "user_href": "/profile/Jaya-Mishra-Mohini-Mishra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiran Kumari Chiruvella",
                "href": "/profile/Kiran-Kumari-Chiruvella"
            },
            "answer_text": "Concentration in what is decreasing is the answer for why is it decreasing. Concentration is an energy. In a given phase of life, our concentration gets diverted to many areas based on one’s own interest. Likewise in teenage if it seems like one's concentration is decreasing in a particular object or activity, it means that some other thing is getting more priority of interest. Varrying of concentration is not limited to age groups factor but on one's choice of interest. ",
            "date": "Answered July 22, 2017",
            "views": "105",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abhinayreddy Peddireddy",
                    "user_href": "/profile/Abhinayreddy-Peddireddy"
                }
            ]
        }
    ]
}