{
    "title": "Why is that socialism has always failed? - Quora",
    "tags": [
        "Capitalism",
        "Socialism",
        "Communism",
        "Failure",
        "Economics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joshua Taylor Coe",
                "href": "/profile/Joshua-Taylor-Coe"
            },
            "answer_text": "Short Answer: Because it redistributes the wealth, moving money to places that are less productive in the economy. Long Answer: The three economic systems are capitalism, socialism, and communism. Communism is when the government takes all of everyone’s money and redistributes it. Socialism is when the government takes some of everyone’s money and redistributes it. Capitalism is the voluntary exchange of goods and services. What we have in America, is socialism. The government taxes everyone at 25–30% which means they are taking some of everyone’s money. It’s the capitalism part that keeps America going. Here is why: In the capitalistic system everyone has a motivation for creating value: money. In a way, capitalism turns the selfish nature of man around on itself for the benefit of others. In the communistic system, no one has motivation to create value. If Rob mows 10 lawns and Zach mows 1000 (because he invented the LawnMower5000) but then the government takes all $100 from Rob and $10,000 from Zach, giving an equal amount to each… eventually Zach is gonna be like, “Why would I work so hard to mow more lawns if we are just going to split the money?” This is why communism doesn’t work. When the government redistributes all the money, there is then no motivation to work. Since socialism is a mix between capitalism and communism, why wouldn’t you just eliminate the crappy communism part fully? I don’t know, ask all these people who think the redistribution of wealth is a good thing. To reiterate: If the government takes everyone’s money, what’s the point of working hard? Why would you work harder than others and strive to create if you were ultimately going to make the same amount of money as the lazy guy who doesn’t work hard? This is the fundamental reason why communism and socialism are flawed and why capitalism is beautiful. Some will say, “Capitalism isn’t beautiful! All these rich people get to have all the wealth while the poor are poor! How is that beautiful?” My response would be, “How much value are these poor people providing? Did the rich get rich by using force? Or by providing value to others who voluntarily bought it? Capitalism requires work for success, and that means you might have to be uncomfortable at times. But to think that you can have success and cars and money with no work… that’s just foolish. And what is your alternative for these poor people? To steal from the rich (who earned it) and give it to the poor who didn’t? And what will that do? I would say that it would take the money out of the hands of those trying to be productive (the rich), hurting the economy overall.” Let me be clear, we should help the poor who need it. We should be a generous society, but using force to take money from one man (who obtained it justly) and give it to another man because he has less is immoral. This is my response to those who believe capitalism is bad and that we should take the rich’s money and give it to the poor. ",
            "date": "Updated July 20, 2019",
            "views": "919",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lisa Spees",
                    "user_href": "/profile/Lisa-Spees-1"
                },
                {
                    "user_id": "Jezz Pan",
                    "user_href": "/profile/Jezz-Pan-1"
                },
                {
                    "user_id": "Derek Parsey",
                    "user_href": "/profile/Derek-Parsey"
                },
                {
                    "user_id": "Thomas Ellis",
                    "user_href": "/profile/Thomas-Ellis-88"
                },
                {
                    "user_id": "Lucas Vezzuli",
                    "user_href": "/profile/Lucas-Vezzuli"
                },
                {
                    "user_id": "Nirlamb Ghumman",
                    "user_href": "/profile/Nirlamb-Ghumman"
                },
                {
                    "user_id": "Gage Karet",
                    "user_href": "/profile/Gage-Karet"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/J-J-Lane-1"
                },
                {
                    "user_id": "Philip Colston",
                    "user_href": "/profile/Philip-Colston"
                },
                {
                    "user_id": "Mike Kenworthy",
                    "user_href": "/profile/Mike-Kenworthy-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Finnegan",
                "href": "/profile/Alexander-Finnegan"
            },
            "answer_text": "To make this claim you have to back it up with actual evidence. The only major socialist power that failed was the USSR, and this was not due to the inherent nature of socialism, but to mismanagement and later, a coup. Socialism means the workers own the means of production. Capitalists have a very strange definition for what is capitalism and what is socialism. It if is successful, like China, then it must be capitalism. If it fails, like Venezuela, then it must be socialist. In reality China is far more socialist than Venezuela. Most of the major industries are still state owned in China. 86% of businesses have Communist Party cells in them. The direction of the economy is controlled and planned by the Chinese government. Land is still owned by the state and leased to individuals. But this is not socialist? Venezuela is a petrostate. That means it relies on oil sales to get most of its income. 80% of the economy is still privately owned by 200 wealthy oligarch families. The oil reserves are nationalized. The economy is a mess because of low oil prices and crippling sanctions imposed by the U.S. But somehow Venezuela is socialist while China is not? Please. Venezuela is a social democracy. It has some sectors nationalized, provides healthcare and education, but is still capitalist. This is non controversial. Those who claim China is capitalist must also consider Lenin’s USSR capitalist too, because his NEP program permitted some private business and market activity. I don’t know anyone that would consider the USSR capitalist at any time. I wonder why capitalists never say that “capitalism always fails” without taking seriously the states of Somalia, many African nations, and Haiti. More capitalist nations have failed but somehow these get a free pass, apparently because capitalism is so wonderful. ",
            "date": "Answered April 22, 2019",
            "views": "74",
            "upvotes": " View 158 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maer Joan Paul",
                    "user_href": "/profile/Maer-Joan-Paul"
                },
                {
                    "user_id": "Swastik Patnaik (स्वस्तिक पटनायक)",
                    "user_href": "/profile/Swastik-Patnaik-स्वस्तिक-पटनायक"
                },
                {
                    "user_id": "Daniel Walker",
                    "user_href": "/profile/Daniel-Walker-19"
                },
                {
                    "user_id": "Richard Chandler",
                    "user_href": "/profile/Richard-Chandler"
                },
                {
                    "user_id": "Armin Bauman",
                    "user_href": "/profile/Armin-Bauman"
                },
                {
                    "user_id": "Isaac Molina",
                    "user_href": "/profile/Isaac-Molina-3"
                },
                {
                    "user_id": "Ryan Park",
                    "user_href": "/profile/Ryan-Park-63"
                },
                {
                    "user_id": "HINOR CHEN",
                    "user_href": "/profile/HINOR-CHEN-1"
                },
                {
                    "user_id": "Randeep Samra",
                    "user_href": "/profile/Randeep-Samra-2"
                },
                {
                    "user_id": "Oleg Volkov",
                    "user_href": "/profile/Oleg-Volkov-29"
                }
            ]
        }
    ]
}