{
    "title": "Will COVID-19 change education permanently? - Quora",
    "tags": [
        "Education Reform",
        "Educational Systems",
        "COVID-19 (2019-2020)",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vern Larson",
                "href": "/profile/Vern-Larson-2"
            },
            "answer_text": "For many it will be the first time that they have tried education outside of the traditional brick and mortar. It will be the first time parents have to pay attention to if their children are doing their assignments and help them. It will be the first time students since kindergarten do not have set times they must do certain things. It may be a good or bad experience depending on how well the student learns and gets their assignments done. How well teachers who never did remote learning do changing their classes over. And how well parents do as facilitators. Some students are so used to the standard regiment of getting up in the morning. Going to school. Going to classroom one, being told what to do. Then when time is up told to go to class room two. Being told what to do there. Then to the next one, etc. Then coming home and having a routine of chores and homework that they are kept to. That staying home, getting up when they want, and to some degree doing what they want makes them incapable to learn or study. Parents who felt their high school student is old enough to do it on their own, will ignore the fact that their child is spending their time playing games and watching videos. These parents may not consider that they should at least monitor their child’s progress - they didn’t when their children went to school - so why should they now? Parents who have stayed involved with their children’s lives, will change how they are monitoring their work and progress. May even help to set boundaries. May even contact their teachers. Some who may have been wondering how remote learning or virtual schooling would work, will learn how. And more may transition over to one of the virtual schools in the area, if their experience is good. If it is a bad one - their child fails their classes - hopefully they will not leave the traditional school systems. Blaming their child’s failure on a “failing school system.” ",
            "date": "Answered April 4, 2020",
            "views": "204",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Tracee Newday",
                    "user_href": "/profile/Tracee-Newday-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wei Shen",
                "href": "/profile/Wei-Shen-5"
            },
            "answer_text": "No. Most schools especially high schools were already using technology in sending homework to students and whenever a supply teacher would be in the classroom. There was always a student who was responsible for making sure that the homework got to other students and the supply teacher had the hard copy of the assignment. Though lately I’ve noticed that there is just a website that is given to the teacher. Work is sent straight to the teacher so there is no paperwork for the supply teacher. Most schools were posting lessons and homework and major projects on line. Also contact with parents was being done through email rather than in person via phone. There is a push from the Ministry of Education to push more on line courses for schools. But there is resistance to that since there is already wide range of cheating for courses in schools. There would be a concern about who is doing the work? Is it another student, the parents or the actual real student? So there would have to have a video of the student actually doing the work that would be logged in to the teacher. There is also the issue of focus and making students complete the course. The special education students need lots of help doing work and staying focused. On line courses are not good for them especially since work is done on a timeline. Personally I think that online courses would have been slowly introduced into regular school esp in high school and junior highs. But there still needs to be a teacher to explain the thought parts of a lesson or as supervisors so that kids who are less focused can get work and course done. Not too much different than what happens in a computer lab. Government mandatory courses like civics and careers could very easily be done online. Basically I don’t think the education system will change for the high school as much as expected because they were already on the verge of making technology more useable in the class room and part of the delivery in the curriculum. Where the changes will occur will be in the Gr. 7&8 and gr 4–7. ",
            "date": "Answered March 27, 2020",
            "views": "540",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Claudia Wild",
                    "user_href": "/profile/Claudia-Wild-2"
                }
            ]
        }
    ]
}