{
    "title": "Will I be able to score 95% in class 12th, if I am an average student in class 11th? - Quora",
    "tags": [
        "Class 11th in India",
        "Studying Advice",
        "Academic and Educational Advice",
        "Studying",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Astha Shukla",
                "href": "/profile/Astha-Shukla-23"
            },
            "answer_text": "Yes ! Of course . But only if you strongly will to . Me too was a average student in class 11 . Even failed in my unit tests thrice. But left all those behind and started afresh . And I scored 93 % in my class 12 cbse boards. Well to do it is not tough. You may leave your entertainment articles for a while or limit them very much. U may study for the whole year. But remember try to revise the whole syllabus in the month of January including all the literature subjects. And in February attempt sample papers issued by the board or the previous years question papers. Sit alone for 3 hours nd try to create the scene of a invigilation room . Concentrate full . And then check your own answer sheet . Catch your own mistakes and try not to repeat it. Practise to see how much time u take for a question . Time management is very important factor in 12 class exam . I think you will get an idea how to present your answers . And remember the most important line Quality content + Good presentation = desired percentage. All the best. ",
            "date": "Answered March 18, 2017",
            "views": "856",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rajeev Ranjan",
                    "user_href": "/profile/Rajeev-Ranjan-3100"
                },
                {
                    "user_id": "Ankit Singh",
                    "user_href": "/profile/Ankit-Singh-2389"
                },
                {
                    "user_id": "Rajnath Mishra",
                    "user_href": "/profile/Rajnath-Mishra-4"
                },
                {
                    "user_id": "AKASH KUMAR",
                    "user_href": "/profile/AKASH-KUMAR-2754"
                },
                {
                    "user_id": "Aditya Mishra",
                    "user_href": "/profile/Aditya-Mishra-528"
                }
            ]
        },
        {
            "author_info": {
                "name": "Awanish Kumar Tripathi",
                "href": "/profile/Awanish-Kumar-Tripathi"
            },
            "answer_text": "Let me tell you about myself I was also an average student till 12th standard. I scored only 75% in my class 10th (ICSE) and 70% in my 12th (CBSE) Then I decided to study according to my own will I have decided to go through BCA as my graduation. I enjoyed my classes as was interested to it. In my first internal exam I scored some less marks. Then I decided to work hard and on 16 March 2017 my 1st sem result was declared I scored good marks and stood 2nd in my class So believe in yourself and work hard.. ",
            "date": "Answered March 20, 2017",
            "views": "589",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Isha Kaur",
                    "user_href": "/profile/Isha-Kaur-18"
                }
            ]
        }
    ]
}