{
    "title": "Will I fail for getting 6 F's in the 6th grade? - Quora",
    "tags": [
        "6th Grade",
        "Grades (education)",
        "Failure",
        "Schools",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan Cole",
                "href": "/profile/Jonathan-Cole-9"
            },
            "answer_text": "Six Fs equal six zeroes. You will surely fail by sitting up in class doing nothing to help yourself. The average is zero. Your options including but not limited to the following Tell your family why you fail by getting 0% on each assignment presented to you at school and being too lazy to ask for helpAsk your family to have you screened for a learning disabilityOwn up to your mistakes while your calculator, TV, sports playing privileges are being taken away so can only study math and other school subjects, sleep, and eat every day.Ask family to enroll you in military school for the purpose of discipline training, it is the right time to learn to become a productive young man or woman at age 11–12. Getting up early (04:00), and exercise at (05:00) trains your mind to shake off laziness and indifference to academics.",
            "date": "Answered October 29, 2020",
            "views": "565",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Gregg",
                "href": "/profile/Andrew-Gregg-14"
            },
            "answer_text": "Greetings, “Failure” is relative. In the United States, public school students are subject to social promotion. This controversial policy elevates students through middle school to the next higher grade regardless of academic achievement. Once students get to high school, students must at least pass required courses and earn enough other elective credits in order to graduate. Public school students who regularly attend classes, complete most of the assignments, pass some of the tests, and not make trouble for staff will be rewarded with high grades. Students must work very hard in order to fail elementary and middle school classes. Best wishes for every success. Sincerely, AJG. ",
            "date": "Answered August 30, 2020",
            "views": "778",
            "upvotes": "0"
        }
    ]
}