{
    "title": "Will schools and other educational institutions reopen in September? - Quora",
    "tags": [
        "Educational Institutions",
        "September (month)",
        "Institutions",
        "Attendance",
        "Nonprofit Organizations",
        "Education in India",
        "Schools",
        "Higher Education",
        "Colleges and Universities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kiranmayee Ganji",
                "href": "/profile/Kiranmayee-Ganji"
            },
            "answer_text": "Good morning Reader, As per recent communication from social media as “ from September 1st onwards everything will continue their former life”. And, as a responsible citizen should needs to take care of your FAMILY. Coming to your question - reopening of Schools, Colleges & Universities or other educational institutions are planning to implement while It’s not an easy task to reopen the education sector now. Why ?? Parents view is - Their children LIFE is important than allIf schools reopen - while students won't come…reason behind…almost all left their metro cities and staying in their home town’s..As a human simply I will say - i’m not ready to take risk now.I agreed pupil are getting bored off specifically children - Parents are not allowing them to outside for playing with other children's.If you will receive notification from your school about reopening - kindly enquire all factors and take Right Decesion. Thank you ! Stay home and Stay safe. ",
            "date": "Answered August 26, 2020",
            "views": "46",
            "upvotes": " Answer requested by Roshani Gupta"
        },
        {
            "author_info": {
                "name": "Charan Kumar",
                "href": "/profile/Charan-Kumar-75"
            },
            "answer_text": "Government will not take risk in case of schools as it's difficult to handle them when compare to collages .May be collages and other institutions will open probably in mid of September . ",
            "date": "Answered August 26, 2020",
            "views": "22",
            "upvotes": "0"
        }
    ]
}