{
    "title": "Would you suggest becoming a nurse or diagnostic medical sonographer? What are the pros and cons of both? - Quora",
    "tags": [
        "Medical Sonography",
        "Nurse Practitioners",
        "Nurses",
        "Nursing",
        "Medicine and Healthcare",
        "Survey Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aislynn Beck",
                "href": "/profile/Aislynn-Beck"
            },
            "answer_text": "I was a teacher before I became a diagnostic medical sonographer. I briefly contemplated becoming a nurse while contemplating sonography, but I heard a random statement at that time, “the two most stressful careers are teaching and nursing.” This thought, whether factual or not, was all I needed to strike nursing off my short list: Benefits and challenges of nursing would be best addressed by an actual nurse, but I have observed a few things when comparing nursing and sonography. Pros: In nursing there are more opportunities for advancement to lucrative, prestigious positions such as CNO, Nurse Practitioner, Nurse anesthestist, etcHighly flexible schedule options. (though sonographers sometimes have this advantage as well)If I’m not mistaken, nurses make more money than sonographers on average.Job availability and job security. Nurses are in high demand all of the time. They often enjoy hiring bonuses for this reason. Sonographers have great job security but the number of jobs available are fewer than nurses per facility.Cons: Nurses work hard ALL DAY LONG, with few breaks. (Depending on the job, sonographers can be this crazy busy as well, it’s a given with almost all nursing positions.)Nurses are tend to the same patients for extended periods of time. Sonographers have patients only for the exam time and then they are returned to the nurses care. I’ve often said that the nurses are the moms/dads and we are the grandparents. We get the patients for a short time and give them back!Nurses deal with more bodily fluids and functions. We may have the occasional patient with poor hygiene or one needing immediate cleaning while doing our exam, but generally we avoid a great deal that nurses deal with.Nurses place IVs. We as sonographers do not. I’m very happy about this.My respect for nurses continually grows. They are heroes. They literally save lives and physicians’ careers every single day. As a sonographer, I can *help* “save a life” every now and then by finding potentially life-threatening causes such as an ectopic pregnancy or a blood clot. I like being involved in getting answers for patients. Nurses often are the answer in saving someone’s life. They deserve every penny they make and more. ",
            "date": "Answered March 24, 2018",
            "views": "98",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Katherine Dantonio",
                    "user_href": "/profile/Katherine-Dantonio"
                },
                {
                    "user_id": "Liz Lew",
                    "user_href": "/profile/Liz-Lew"
                },
                {
                    "user_id": "Kristen Turner",
                    "user_href": "/profile/Kristen-Turner-8"
                },
                {
                    "user_id": "Raja Elayare",
                    "user_href": "/profile/Raja-Elayare"
                },
                {
                    "user_id": "Khairunnisa Najwa",
                    "user_href": "/profile/Khairunnisa-Najwa-2"
                },
                {
                    "user_id": "Devin Tomas'",
                    "user_href": "/profile/Devin-Tomas-1"
                },
                {
                    "user_id": "Hira Khursheed",
                    "user_href": "/profile/Hira-Khursheed"
                },
                {
                    "user_id": "Brendan Jackson",
                    "user_href": "/profile/Brendan-Jackson-15"
                },
                {
                    "user_id": "Tatiana-Ruth Leibman",
                    "user_href": "/profile/Tatiana-Ruth-Leibman"
                },
                {
                    "user_id": "Mai Taniyama",
                    "user_href": "/profile/Mai-Taniyama-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vivian Bryant",
                "href": "/profile/Vivian-Bryant-4"
            },
            "answer_text": "More Job Opportunities Nursing is a much larger occupation than sonographer. ... About 15,600 new jobs will open up for sonographers, while 438,100 new jobs will arise for RNs. Nurses also work in a broader variety of work settings. Difficult but Worth the Effort It takes two years to complete, but the degree from a CAAHEP accredited program qualifies the sonography student to take the ARDMS exams. ... In fact, many programs have a requirement that the student not work while attending because the training requires a student's full attention. Go to my Profile and you can find all about Nurse material there... ",
            "date": "Answered October 8, 2020",
            "views": "451",
            "upvotes": "0"
        }
    ]
}