{
    "title": "Would Esperanto benefit from a city or region where almost everyone speaks Esperanto in everyday life? - Quora",
    "tags": [
        "Esperanto Culture"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jens Stengaard Larsen",
                "href": "/profile/Jens-Stengaard-Larsen"
            },
            "answer_text": "Esperanto is a fictitious concept, just as English is. On the one hand and in the abstract we have the human species, all of whose members have language — one and the same language, Human. On the other hand we have each specific human person, who uses Human in whichever ways they have met it in childhood (or learnt actively later, with much more difficulty). At a global level, some varieties of Human are more readily widely understood than others, English being a prime example. But would you say that that fact “benefits English”? Or rather that it benefits the English-speakers? You cannot benefit or hurt an abstract concept like “human language”, and even less a fictitious one like “English” or “Esperanto”. But living people can be benefited or hurt by other living people’s actions, including what they say and which forms of Human they use to say it. What really hurts and hampers the great idea behind the creation of a global speech community like Esperanto’s is not the lack of speakers or that too few people have even heard of it, but the way people believe in the fiction of disparate languages. Language is often seen as a burden we have to shoulder in order to be able to communicate. But language is part of our physical body. It’s no more a burden than any other organ, and we need to be able to express our thoughts in words in order not to go crazy — not necessarily with anyone listening, though that helps too. Advertising for Esperanto is often focused on how easy it is to learn as a second language. But at the end of the day, the idea that language is a burden we only accept for the sake of communication becomes propaganda for English as everybody’s first and only language, at least as long as English-speaking nations enjoy a superior role in international affairs. In later decades it’s become more fashionable to emphasize that there is such a thing like Esperanto culture that can sustain a transnational identity, but a more critical and mature outlook on our inherited linguistic preconceptions is still in its infancy. ",
            "date": "Answered July 18, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alex Hornsey",
                    "user_href": "/profile/Alex-Hornsey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Diccon Masterman",
                "href": "/profile/Diccon-Masterman"
            },
            "answer_text": "In a sense there are cities, regions, villages, locations and of course cyberspace in which hundreds of thousands of people gather together and speak Esperanto, every day of the year, even if the numbers in any one place are a microcosm of the population of an average city. The biggest physical gathering historically has been the annual World Esperanto Congress which has been held every year in a different part of the world since 1905 except for the interruptions caused by two world wars. This year, because of COVID-19, the annual event was due to be staged in Montreal; since this is not possible because of the need for social distancing, it is going to be held in cyberspace as a Virtual Congress using modern technology. Because it is so much cheaper to attend a Virtual Congress, it may be that we shall see record numbers in the future which might one day be comparable to that of the population of a city. And there is no doubt that the more Esperanto is used the more it benefits from being used. ",
            "date": "Answered July 17, 2020",
            "views": "29",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rohan Dahiya",
                    "user_href": "/profile/Rohan-Dahiya-22"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Read-Is-Good"
                },
                {
                    "user_id": "Paul Hopkins",
                    "user_href": "/profile/Paul-Hopkins-48"
                }
            ]
        }
    ]
}